{"@context": "http://schema.org", "@type": "Recipe", "name": "Budae Jjigae", "description": "Though it stems from the Korean War, budae jjigae — or “army base stew,” named after the leftover United States Army rations that make it up — is a symbol of resourcefulness and survival during a time of great poverty. The fiery broth is fortified with <a href=\"https://cooking.nytimes.com/recipes/1023243-tong-baechu-kimchi\">kimchi</a>, gochujang and an assortment of flavorful sausages. Hot dogs are common, but kielbasa, breakfast sausage and Italian sausage all lend their own special character to the final broth, so use what you like. Arrange the ingredients in the pot in sections, and don’t stir too much while cooking: The joy of eating a big, burbling budae jjigae is reaching for your favorite part of the stew. For many, it’s the Spam, both salty and sweet; for others, it’s the American-cheese-laden noodles, bouncy with chew. Serve this soul-warming stew family style, with white rice to balance its punchy flavors. (Watch the video of <a href=\"https://youtu.be/e91277OoF1I\">Eric Kim making budae jjigae here</a>.)", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/06/15/dining/15ESSENTIALSrex2/15ESSENTIALSrex2-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, lunch, weeknight, noodles, soups and stews, main course", "keywords": "kimchi, ramen noodles, spam", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 209}, "recipeIngredient": ["1 medium yellow onion, halved and thinly sliced", "5 ounces Korean radish or daikon, peeled, quartered, then thinly sliced crosswise", "1 (12-ounce) can Spam, quartered lengthwise and thickly sliced crosswise", "1 pound link sausages (a mix of sliced kielbasa, hot dogs, breakfast sausages and sweet or spicy Italian sausages), cut into bite-size pieces", "1 cup coarsely chopped <a href=\"https://cooking.nytimes.com/recipes/1023243-tong-baechu-kimchi\">napa cabbage kimchi</a>", "2 tablespoons gochugaru", "1/4 cup gochujang", "2 tablespoons soy sauce", "1 tablespoon fish sauce", "4 garlic cloves, crushed and coarsely chopped", "Salt", "1 (3- to 4-ounce) package instant ramyun or ramen", "1 slice American cheese", "2 scallions, thinly sliced on the diagonal", "Steamed white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, wide pot or Dutch oven, arrange the onion, radish, Spam, sausages and kimchi in 5 individual piles. Over these piles, add the gochugaru, gochujang, soy sauce, fish sauce, garlic and 6 cups cold tap water. (Don’t worry about stirring at this stage.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and bring to a rolling boil over high heat, then reduce the heat to a gentle boil. Partly cover the pot and stir the liquid gently and occasionally while leaving the piles intact, until the sausage is warmed through and the broth is deeply seasoned with meaty flavor, 15 to 20 minutes. Taste and add salt as needed; this stew has many salty ingredients, but a little salt brings out the nuances of each component, resulting in a wonderful broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle in the noodles and cook according to package instructions, without stirring, until loose and chewy but not soggy and distended. Remove the pot from the heat. Top the noodles with the American cheese and cover until melted, just a few seconds. Scatter the scallions over the stew and serve immediately in the center of the table, family-style, with a ladle, tongs and bowls of fresh white rice."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Budae Jjigae", "description": "Though it stems from the Korean War, budae jjigae — or “army base stew,” named after the leftover United States Army rations that make it up — is a symbol of resourcefulness and survival during a time of great poverty. The fiery broth is fortified with kimchi, gochujang and an assortment of flavorful sausages. Hot dogs are common, but kielbasa, breakfast sausage and Italian sausage all lend their own special character to the final broth, so use what you like. Arrange the ingredients in the pot in sections, and don’t stir too much while cooking: The joy of eating a big, burbling budae jjigae is reaching for your favorite part of the stew. For many, it’s the Spam, both salty and sweet; for others, it’s the American-cheese-laden noodles, bouncy with chew. Serve this soul-warming stew family style, with white rice to balance its punchy flavors.", "thumbnailUrl": "https://static01.nyt.com/images/2022/06/15/dining/15ESSENTIALSrex2/15ESSENTIALSrex2-mediumThreeByTwo440.jpg", "uploadDate": "2023-01-17T19:43:35.000Z", "duration": "PT7M35S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2023/01/12/105500_1_EK-budae-jjigae-CV_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023236-budae-jjigae"}