{"@context": "http://schema.org", "@type": "Recipe", "name": "Escovitch Fish", "description": "In Jamaica, escovitch is fish rubbed with garlic and allspice, shallow-fried until the skin crisps, then doused with hot vinegar, carrots, onions and wicked Scotch bonnets, all swirled together and bubbling. Leave the dish out at room temperature, the better for the vinegar to work its alchemy, creating not so much a sauce as sheer lushness. <a href=\"https://www.instagram.com/taking_thyme/\">Francine Turone</a>’s mother would make escovitch in the morning and let it sit all day on the counter, the flavors intensifying with each hour. Come dinnertime, little effort was required beyond putting out plates — which makes it ideal, Ms. Turone says, when cooking for friends: “You can make it and then go away.” Her version allows for boneless fillets instead of the traditional whole fish, and includes an unexpected ingredient, raisins, inspired by travels with her Italian husband and transposed from a Venetian snack of deep-fried sardines in vinegar.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/04/24/magazine/24mag-eat-site/24mag-eat-site-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "caribbean", "recipeCategory": "seafood, main course", "keywords": "fish, Scotch bonnet chiles, vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "recipeIngredient": ["2 pounds skin-on fish fillets from any light, sweet white-fleshed fish, such as black bass (see Tip), 1/2 to 1-inch thick", "1/2 lime or lemon", "1 1/4 teaspoons kosher salt, plus more to taste", "1 teaspoon ground black pepper, plus more to taste", "1 teaspoon garlic powder", "1 teaspoon onion powder", "1 teaspoon ground allspice or 5 whole allspice berries (see Tip) ", "1 cup all-purpose flour", "Canola or other neutral oil, for frying ", "2 to 3 garlic cloves, crushed", "1 to 2 whole Scotch bonnet chiles or habaneros, depending on desired heat", "1 medium sweet onion, thinly sliced", "1 large carrot, cut into thin 2-inch-long matchsticks", "1 small chayote, peeled, halved, seeded and thinly sliced lengthwise", "1 to 2 Scotch bonnet chiles or habaneros, seeded (depending on desired heat) and sliced ", "2 teaspoons whole allspice berries (optional; see Tip)", "1/2 cup distilled white vinegar", "1 tablespoon golden raisins, chopped (optional)", "Good, crusty bread, such as sourdough or ciabatta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the fish: Set the fish on a paper towel-lined baking sheet. Rub the cut lime all over the fish. Let the fish drain on the paper towels, then pat thoroughly dry. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the salt, black pepper, garlic powder, onion powder and ground allspice, if using. Take two-thirds of this seasoning and rub it all over the fish. If using thicker fillets, cut small slits on both sides and rub the seasoning into the slits. In a shallow dish, mix the remaining seasoning with the flour for dusting the fish later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium-high. Add 1/2 inch of oil, just enough to fry one side of the fish at a time. (The fish should not be submerged in oil.) Add the garlic to the skillet, along with the chiles and whole allspice berries, if using. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly coat the fish on both sides with the seasoned flour, shaking off any excess. When the oil is hot, carefully lay the fish in the pan skin side down, making sure to leave space between the fillets and working in batches if needed. Let cook for 2 to 3 minutes, then turn the fish over and cook for another 2 to 3 minutes, until the skin is crispy. The fish should be cooked only about 80 percent of the way through, as the residual heat will continue to cook it after it’s removed from the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the cooked fish skin side up in a large rimmed dish that can fit all the fish without any overlap. Keep the dish close to the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: Pour all the oil and solids in the skillet into a bowl or measuring cup. Add 1 tablespoon of that oil to the skillet (discard the rest) and heat over medium-low. Add the onion, carrot, chayote, Scotch bonnets and allspice berries, if using. Cook, stirring often, for 2 to 3 minutes. Don’t let the vegetables get too soft; they should still have a little bite to them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat to high, and add the vinegar and chopped raisins, if using. Working quickly before the vinegar reduces completely, swirl the pan to tumble together the ingredients and then carefully pour the hot bubbling mixture evenly over the fish. It should not swamp the fish, but reach only about a quarter of the way up the sides. Immediately and tightly cover the dish with foil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leave the dish on the counter out of direct sunlight for at least an hour or up to 12 hours, so the fish has time to absorb all the flavors. (It gets better the longer it sits.) Do not refrigerate before serving: The fish is meant to be eaten at room temperature. Serve with the bread for mopping up the sauce. Leftovers may be refrigerated overnight and gently reheated in a pan over low heat to loosen the sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023141-escovitch-fish"}