{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Cucumbers With Tomato-Cardamom Dressing and Mozzarella", "description": "Grilling cucumbers gives them a nice charred flavor while retaining their bite. Try to buy Persian cucumbers that are thicker as the thin ones can often be too flimsy to cook. Torn mozzarella adds richness to the cucumbers doused with a garlicky, spiced tomato dressing. (Feel free to cook the cucumbers on an outdoor grill, treating them in the same way.) If you’re into creamy cheeses, then burrata works very well here, too — or, you could keep this dish vegan by leaving out the mozzarella completely. It will still have a wonderful umami flavor without it. Make this a complete meal by serving alongside your protein of choice. ", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2022/07/17/magazine/17mag-eat-site/17mag-eat-site-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 side-dish servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, vegetables, side dish", "keywords": "cardamom, cucumber, mozzarella, tomatoes, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 368}, "recipeIngredient": ["8 ounces/225 grams datterini or cherry tomatoes", "7 tablespoons olive oil ", "4 garlic cloves, peeled and thinly sliced", "1 teaspoon white miso", "3 fresh bay leaves", "9 cardamom pods, shells reserved and seeds roughly crushed in a mortar and pestle", "1/4 teaspoon sweet paprika or Kashmiri chile powder", "Fine sea salt and black pepper", "1 tablespoon lime juice", "1 1/4 pounds/565 grams large Persian cucumbers", "1 tablespoon olive oil", "Fine sea salt and black pepper", "1/4 cup fresh cilantro leaves and soft stems", "1 small ball buffalo mozzarella (about 4 1/2 ounces/125 grams), roughly torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start with the dressing: Add the tomatoes, oil, garlic, miso, bay leaves, cardamom shells and seeds, paprika and a heaping ¼ teaspoon salt to a large (lidded) sauté pan. Place over medium-high heat, give everything a good stir and leave it, uncovered, until it starts to bubble gently. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once bubbling, turn the heat down to medium-low, cover with the lid and cook gently for 15 minutes, stirring once, until the tomatoes have burst and start to release their juices. Turn down the heat if necessary; you want the garlic to soften without taking on color, and you want the tomatoes to not completely disintegrate. Stir in the lime juice and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill pan over high, and ventilate your kitchen well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the cucumbers lengthwise then use a small spoon to scrape out and discard the seeds. Slice each halved cucumber lengthwise into 2 equal pieces, then transfer the cucumber quarters to a bowl and toss with the oil, ½ teaspoon salt and a good grind of pepper. When the grill pan is very hot, grill them in batches, cut sides down, for 2 to 3 minutes, then flip them over and grill for 1 to 2 minutes more. You want nice grill marks and for the cucumbers to soften but still retain a bite. (You don’t want any floppy cucumbers.) As they’re ready, immediately transfer to the tomato pan, stirring to coat in the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once they’re all grilled, stir the cilantro into the pan and transfer the mixture to a large serving platter with a lip. Sprinkle on the torn mozzarella, along with a good pinch of salt, and tuck the cheese under the cucumbers in places. You can serve this dish hot or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023339-grilled-cucumbers-with-tomato-cardamom-dressing-and-mozzarella"}