{"@context": "http://schema.org", "@type": "Recipe", "name": "Kale and Squash Salad With Almond-Butter Vinaigrette", "description": "For a creamy, rich and dairy-free salad dressing, use almond butter instead of olive oil. It provides rich savoriness and body, like mild tahini or peanut butter. In this recipe, mix it with lemon and mustard to dress a combination of sturdy greens, roasted squash and crisp apples. Embellish as you wish by adding salty cheese, like blue, Gruyère or pecorino; freshness with fennel, parsley, mint or pomegranate seeds; or heft with whole grains or beans. This hearty salad is easy to tote to work for lunch and exciting enough for dinner.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2023/01/03/multimedia/as-kale-and-squash-salad-1-e8b7/as-kale-and-squash-salad-1-e8b7-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, main course, side dish", "keywords": "almond butter, apple, collard greens, kale, lemon juice, make-ahead, salad, squash, dairy-free, vegan, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 608}, "recipeIngredient": ["1 1/2 pounds winter squash, such as butternut or delicata, halved lengthwise, seeded and sliced crosswise ½ inch thick (no need to peel)", "2 tablespoons extra-virgin olive oil", "Kosher salt", "2 crisp eating apples such as Honeycrisp or Pink Lady", "1 shallot, thinly sliced", "1 teaspoon lemon zest plus ¼ cup fresh lemon juice (from about 2 lemons)", "1 large bunch Tuscan kale or collard greens (about 1 pound), ribs removed and leaves sliced about ¼ inch thick ", "¼ cup almond butter", "1 teaspoon Dijon mustard", "½ teaspoon black pepper or red-pepper flakes, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack in the bottom third of the oven and heat the oven to 425 degrees. On a sheet pan, toss the squash with the olive oil and a generous sprinkling of salt. Spread into an even layer and roast on the bottom rack until tender and browned underneath, 15 to 25 minutes. Remove from the oven and cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, core the apples and slice them ¼ inch thick. In a large bowl, toss together the apples, shallot and 2 tablespoons lemon juice. Add the kale leaves, season generously with salt, then toss. (There is no need to squeeze, as the leaves will soften with time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the lemon zest and remaining 2 tablespoons lemon juice with the almond butter, Dijon mustard and black pepper. Stir in enough water until it’s pourable (about ¼ cup, depending on the almond butter; the mixture will thicken at first, but when enough water is added, it will loosen). Season the dressing to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the squash is cool enough to handle, add it to the kale mixture. Drizzle with most of the dressing. Toss until coated, adding more dressing as needed. Taste and adjust seasonings with more salt and pepper. (To make ahead, refrigerate the dressing and salad separately for up to 3 days. Adjust thickness and flavor of dressing with salt, pepper and lemon juice, then toss.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023787-kale-and-squash-salad-with-almond-butter-vinaigrette"}