{"@context": "http://schema.org", "@type": "Recipe", "name": "Norinj Pilau (Rice With Candied Orange Peel, Saffron and Lamb)", "description": "The sour orange, unlike the sweet orange, is too tart to eat straight. But the peels, when cooked, lend a bright tang and profound fragrance. To make norinj pilau, a celebratory Afghan dish of lamb and rice, Shazia Saif Naimi recruits her husband, Asadullah Naimi, to harvest sour oranges from their backyard. He cuts the peels into skinny strips using a razor blade and brings them to a boil three times, to make sure that most (but, crucially, not all) of the peels’ bitterness is leached out. Then he stirs in sugar, saffron and cardamom, and the scent of honey and white flowers expands through the house. Ms. Naimi braises the lamb and soaks the rice, massaging the grains to release the starch. At the end, lamb and rice are mounded together in a platter of abundance, with one cup of rice — simmered separately with the orange-peel syrup — spread over the top like spilled sun.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2023/01/08/magazine/08mag-Eat/08mag-Eat-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat, project, main course", "keywords": "afghan, basmati rice, cardamom, lamb shank, orange, pistachio, saffron, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "recipeIngredient": ["4 cups long-grain basmati rice, preferably aged", "1 tablespoon olive oil ", "3 pounds bone-in lamb shanks, cut into 1 1/2-inch pieces (see Tip)", "Salt", "1 large onion, diced", "3 large or 5 small Seville or other sour oranges ", "3/4 cup granulated sugar", "1/4 gram saffron, ground (1/8 teaspoon)", "1 1/2 teaspoons ground cardamom", "1/2 cup shelled pistachios, toasted and chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the rice: In a large bowl, wash the rice, massaging gently to release the starch without breaking the grains. Drain and repeat 2 times, then soak the rice in enough water to cover (to allow for the grains to expand) for around 2 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the lamb: Heat the oil in a large, deep skillet over medium-high. Season the lamb generously with salt and add to the hot oil. Cook, turning occasionally, until browned, about 10 minutes. Move the lamb to one side of the pan and add the onion to the other side. Season with salt and cook, stirring occasionally, until lightly browned, about 5 minutes. Stir to incorporate the lamb, scraping up any browned bits. Add enough water to come halfway up the lamb pieces (about 1 cup), bring to a boil, then cover. Simmer over low heat until tender, 1 to 1 1/2 hours, turning the pieces once or twice and adding 1 to 2 tablespoons water if the pot threatens to dry out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lamb simmers, prepare the orange peels: Thoroughly wash and dry the oranges, then peel them with a vegetable peeler, taking as little of the white pith as possible. Finely slice the peels into very thin strips. You should have 1 cup. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the strips in a pot with enough water to cover and bring to a boil over high heat. Let boil for 15 minutes. Drain the water, retaining the peels, then refill with water. Repeat the boiling process two more times. After being boiled three times, the peels will have lost most of their bitterness. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the third boil, drain the water and add the sugar, saffron, 1/2 teaspoon cardamom and 1/4 cup water to the pot. Cook over medium heat until the sugar has formed a syrup but before it begins to caramelize, about 10 minutes. Transfer the orange peels to a small plate or bowl, reserving the syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring an 8-quart, heavy-bottomed pot or Dutch oven of water to a boil. Add the soaked rice to the boiling water and cook, uncovered (the way you would cook pasta), until the grains have slightly softened, 7 to 10 minutes. Drain the rice in a colander, then reserve 1 cup rice and add the remaining back to the original pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 teaspoons salt and the remaining 1 teaspoon cardamom to the pot with the rice and gently stir to combine. Add the lamb mixture (including any liquid) and stir to combine. Mound the rice mixture in the middle of the pot away from the edges and poke holes in the rice with the handle of a wooden spoon for steam to escape. Lay a clean cloth or paper towel over the top of the pot, then put the lid on to hold the cloth in place. Cook on the lowest heat setting for 20 to 30 minutes. When the rice is done, the grains will be tender with a little chewiness at the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice and lamb are cooking, take the reserved cup of cooked rice and add to the smaller pot with 1/4 cup of the orange syrup. Gently combine, then cover with a lid and bring to a simmer over medium heat. Once simmering, turn the heat to low and cook until the liquid is fully absorbed and the rice is cooked through, 15 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop the rice-and-lamb mixture onto a large platter and shape it into a low mound. Take the rice cooked in orange syrup and spread it generously over the top of the mound and down the sides. Spread the candied orange peel over the rice and adorn with the toasted pistachios."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023772-norinj-pilau-rice-with-candied-orange-peel-saffron-and-lamb"}