{"@context": "http://schema.org", "@type": "Recipe", "name": "Velvety Scrambled Eggs", "description": "This recipe adapts a technique from making Chinese egg drop soup — gently poaching a thin stream of beaten eggs in simmering liquid — to a Western-style breakfast of scrambled eggs. The results are special and one of a kind. Drizzling the eggs into hot cream gets them to set into tender, velvety curds that end up bound with a rich custardy sauce, perfect for spooning onto buttered toast. The eggs are delicious without the herbs, but, given how rich they are, think of them as a special occasion dish, worthy of the added effort.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2023/01/04/multimedia/28kenjirex-eggs-1-9366/30kenjirex-eggs-1-9366-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "2 to 3 servings", "recipeCuisine": "", "recipeCategory": "breakfast, for two, quick, main course", "keywords": "crème fraîche, heavy cream, scrambled egg, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1132}, "recipeIngredient": ["4 eggs (from the refrigerator or at room temperature; either is fine)", "1/2 teaspoon table salt", "Freshly ground black or white pepper", "2 tablespoons minced fresh herbs, such as chives, tarragon, parsley and chervil (optional)", "1/4 cup heavy cream or crème fraîche", "Buttered toast, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into a bowl. Add the salt and a few grinds of pepper. Add most of the herbs (if using), reserving a big pinch to garnish the finished eggs. Using a fork, beat the eggs very thoroughly, at least 30 seconds, until no streaks of white remain. You can proceed to Step 2 right away, but for even more tender results, allow the eggs to rest 10 to 15 minutes after salting and beating them. Have a silicone spatula and a serving plate at hand before you begin cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons of the cream in a small (8-inch) nonstick, well-seasoned cast-iron or carbon-steel skillet over medium-high heat until it bubbles vigorously, about 30 to 45 seconds. Reduce heat to medium-low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the eggs from the bowl into the cream in a thin, steady stream, moving the bowl so that the eggs are drizzled all along the surface of the pan. Let the eggs rest for about 15 seconds, then begin stirring and folding slowly and steadily with the spatula until the eggs are as done as you like them. Remove the pan from heat and immediately drizzle in the remaining cream and stir vigorously to incorporate. Immediately transfer to the serving plate, sprinkle with remaining herbs and a few grinds of black pepper. Serve right away with toast."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023773-velvety-scrambled-eggs"}