{"@context": "http://schema.org", "@type": "Recipe", "name": "Honey Butter Grilled Corn", "description": "This technique for grilling corn uses a side pan of honey butter to thoroughly drench the corn in flavor while keeping it hot and juicy until you’re ready to eat. If you are feeling creative, change the ingredients of the liquid bath: Add a couple of tablespoons of Korean gochujang and a few minced garlic cloves to the base mixture, then finish the corn with toasted sesame seeds for a sweet-hot version. Add a half-cup of sake, two tablespoons of light miso paste and two tablespoons of soy sauce for a sake-miso glaze. Blend a couple of canned chipotle chiles with a few tablespoons of lime juice, add it to the bath and finish the corn with freshly minced cilantro or mint. To complete this recipe, you’ll need a disposable aluminum 9-by-13-inch baking pan, or a similarly sized stovetop-safe vessel that you don’t mind getting a bit dirty.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2022/07/06/dining/01kenjirex/merlin_209008578_5f27eaaf-47ef-47a3-ba75-c4fc9c6bc791-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "vegetables, appetizer, side dish", "keywords": "corn, honey, red pepper flakes, fourth of july, labor day, memorial day, tailgate, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 459}, "recipeIngredient": ["3 tablespoons honey", "6 tablespoons unsalted butter", "2 teaspoons mild chile flakes, such as gochugaru (see Tip)", "Salt", "6 ears corn, shucked", "Small handful of minced fresh parsley leaves or chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the honey, butter, chile flakes, 1 cup water and 1 teaspoon of salt in a deep disposable 9-by-13-inch aluminum tray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust the burners on a gas grill or arrange the hot coals on a charcoal grill to build a fire that is hot on one side and medium-low on the other side. Place the aluminum tray on the cooler side. Cover and let heat for a few minutes, swirling the butter occasionally until it is all melted and the liquid simmers gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the corn to the hot side of the grill and cook, turning occasionally, until the kernels are lightly blackened in spots all over, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the corn to the aluminum tray and turn to coat in the liquid. Keep turning as the liquid reduces to a shiny glaze, 10 to 12 minutes. (You can also cook other foods over the hot side while the corn stays hot in the tray. Once glazed, you can continue to hold the corn in the pan for up to another 30 to 45 minutes, turning it occasionally and topping up with ¼ cup water as necessary to prevent the honey and butter from burning.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, coat a final time, sprinkle the corn with the minced parsley or chives and transfer to a serving platter."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023295-honey-butter-grilled-corn"}