{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom-Butternut Squash Strata", "description": "This golden-topped strata has a savory mushroom and butternut squash filling, which gives it a complex, earthy flavor. Mozzarella adds mild richness, while the Parmesan gives everything a hit of salt and depth. You’ll need to let the strata sit in the fridge for at least eight hours (and preferably overnight) before baking. This allows the bread to soak up all the custard. Then, run it under the broiler after baking so the edges become crunchy and pleasingly singed. It’s a lovely main dish for a celebratory brunch or meatless supper, or a hearty side dish with roast chicken or fish for dinner.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/12/28/multimedia/21apperex-1-8f9c/23apperex-1-8f9c-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, casseroles, main course, side dish", "keywords": "baguette, butternut squash, mozzarella, mushroom, party, plan-ahead, sage, shallot, new year’s day, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 681}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "2 tablespoons unsalted butter, plus more for greasing the pan", "1 pound mixed mushrooms, such as cremini, white, shiitake and oyster, cut into 1-inch chunks", "Fine salt and freshly ground black pepper", "1 cup chopped shallots (from 3 to 4 large shallots)", "1 1/4 pounds butternut squash, peeled, seeded and grated (about 2 ½ cups)", "1 1/2 tablespoons chopped fresh sage", "1/8 teaspoon red-pepper flakes, plus more as needed", "8 large eggs", "1 1/2 cups whole milk", "3/4 cup heavy cream (or use 2 1/4 cups half-and-half instead of the milk and cream)", "3/4 cup grated Parmesan", "2 cups shredded mozzarella", "12 ounces baguette, cut into 1-inch cubes (about 10 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large (12-inch) skillet (or in a Dutch oven), working in batches so as not to crowd the pan, heat 1 tablespoon oil and 1 tablespoon butter over high. Add mushrooms and cook, stirring occasionally, until well browned, 7 to 10 minutes. Transfer to a large mixing bowl and season lightly with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet (no need to clean), heat remaining 2 tablespoons oil and 1 tablespoon butter over medium-high. Add shallots and shredded squash, and cook, stirring, until shallots are golden brown and the squash is soft and cooked through, 15 to 20 minutes. (If the squash starts to stick to the pan, splash in a little water.) Stir in 1/2 teaspoon salt, sage and a pinch of red-pepper flakes. Transfer to the bowl with the mushrooms, tossing gently to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease the bottom and sides of a broiler-safe 9-by-13-inch baking dish with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another large bowl, whisk eggs until uniform in color. Whisk in milk, cream, 1/4 cup of the Parmesan (save the rest for the top), 2 teaspoons salt, red-pepper flakes and a large pinch of black pepper. Whisk thoroughly to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the mozzarella, about 2/3 of the squash-mushroom mixture and the bread cubes until well coated. Pour bread mixture into the prepared baking dish in an even layer. Strew the remaining squash-mushroom mixture over top. Refrigerate, covered, until the bread absorbs all the liquid, at least 8 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat the oven to 350 degrees. Top the strata evenly with the remaining 1/2 cup Parmesan. Bake for 40 to 50 minutes, until set in the center. (It may puff a bit.) Run it under the broiler for 1 to 3 minutes to brown the top, watching carefully. Let sit for 10 minutes, then serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023759-mushroom-butternut-squash-strata"}