{"@context": "http://schema.org", "@type": "Recipe", "name": "Liang Ban Qie Zi (Eggplant With Garlic, Ginger and Scallions)", "description": "The Shanghainese dish of seasoned and steamed eggplant is typically served cold, but this version can also be eaten warm or at room temperature. Steaming eggplant is a revelation — it brings out the vegetable’s gentle, earthy flavor and creates an astonishingly silky, light texture that soaks up sauces efficiently. Here, the eggplant is topped with an aromatic mix of garlic, ginger and scallions, which release their intoxicating fragrance when hot oil is poured over. Regular globe eggplant is fine, and long Japanese or Chinese eggplant works just as well (use the same weight). A steamer insert, bamboo steamer or stainless steel trivet is a smart investment that makes steaming in a wide, deep skillet simple, but you can also use stainless steel cookie cutters or balls of aluminum foil. Use tamari in place of soy sauce for an easy gluten-free substitution.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2022/08/09/dining/hm-garlicky-steamed-eggplant/merlin_210788820_6b60ab11-7549-47ba-b7b3-03d7c30a0865-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, weeknight, vegetables, main course, side dish", "keywords": "eggplant, garlic, ginger, scallion, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 846}, "recipeIngredient": ["1 1/4 pounds eggplant (1 large), base and stem trimmed", "3 tablespoons soy sauce", "1 tablespoon black vinegar (such as Chinkiang vinegar)", "1 tablespoon chile crisp or chile oil (preferably one that contains Sichuan peppercorns)", "1 teaspoon granulated sugar", "2 garlic cloves, peeled and finely chopped", "2 scallions, trimmed, white and green parts finely sliced", "1 (1-inch) piece ginger, peeled and finely chopped (about 1 tablespoon)", "3 tablespoons neutral oil such as canola or grapeseed", "Rice, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a wide, deep skillet or wok with a steamer insert, bamboo steamer or stainless steel trivet (see Tip). Find a heatproof plate that fits into your cooking vessel. Add about 1 to 2 inches of water (making sure it won’t touch the bottom of the plate), cover with a lid (or sheet pan or aluminum foil) that fully encloses the steamer, and bring to a boil over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, slice the eggplant into ½-inch-thick circles, then slice each disk into ½-inch strips. Arrange the eggplant pieces on the heatproof plate, stacking them but leaving some gaps to allow the steam to reach all sides of the eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place the plate of eggplant into the steamer insert or bamboo steamer, or on top of the trivet. Cover and steam for 9 to12 minutes, until the flesh is easily pierced with a fork, but still firm enough to hold its shape. Carefully transfer the eggplant to a colander set in the sink to cool and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the soy sauce, black vinegar, chile crisp and granulated sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the eggplant is cool to the touch, transfer it to a shallow serving bowl or a rimmed plate. Pile the garlic, scallions and ginger in the center of the eggplant; don’t scatter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan, heat the oil on medium-high for 2 to 3 minutes; the oil is hot enough if it bubbles when a wooden chopstick or spoon is inserted. Very carefully pour the hot oil over the ginger, garlic and scallions; it will sizzle and become very fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the soy sauce mixture over the eggplant. Serve warm, at room temperature or cold, with rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023395-liang-ban-qie-zi-eggplant-with-garlic-ginger-and-scallions"}