{"@context": "http://schema.org", "@type": "Recipe", "name": "Citrusy Couscous Salad With Broccoli and Feta", "description": "Sweet, spicy and citrusy, this pasta salad is a make-ahead dish that works hot, cold or at room temperature, and can be served as is or with chicken, salmon or shrimp. Fresno (or jalapeño) chiles soak in a tangy honey-and-citrus dressing to soften their bite and infuse the dressing with heat, giving the overall dish a slightly sweet and spicy flavor. Juicy pieces of orange impart a sunny, vacation feel to the look and taste of the dish, while the cumin gives the dressing a warm earthiness.", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "image": "https://static01.nyt.com/images/2022/09/29/dining/yf-citrusy-couscous-salad/merlin_213671220_206af25a-65e3-4e9b-8746-c2fac2e89d1a-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weeknight, main course, side dish", "keywords": "broccoli, couscous, feta, ground cumin, lime juice, make-ahead, orange, orange juice, pasta salad, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 161}, "recipeIngredient": ["1 small navel orange, half juiced (about 3 tablespoons), half peeled and cut into bite-size pieces (see Tip)", "1 lime, juiced (about 1 tablespoon)", "2 teaspoons honey", "1/2 teaspoon ground cumin", "Kosher salt", "2 tablespoons olive oil", "2 scallions, thinly sliced", "1 red Fresno chile or jalapeño, sliced into thin rounds (deseeded, if desired, for less heat)", "1 1/2 cups pearl couscous", "1 medium head broccoli (about 12 ounces), florets and tender stems cut into bite-size pieces, or 10 to 12 ounces frozen florets (4 to 5 cups total)", "1/2 cup crumbled feta", "1/4 cup unsalted, dry roasted pistachios, roughly chopped", "1/4 packed cup fresh mint, basil or parsley, finely chopped", "Freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To the bottom of a large serving bowl, add the orange juice, lime juice, honey, cumin and 1/2 teaspoon salt. Whisk in the olive oil until the honey is dissolved. Mix in the scallions and half the chile; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large lidded pot over medium-high heat, toast the couscous, stirring occasionally, until lightly browned and fragrant, 3 to 4 minutes. Add 3 cups of water, season with 1 tablespoon salt, cover and bring to a boil. Adjust the heat to maintain an active simmer and cook according to the lower end of the time frame on package’s instructions, usually about 8 minutes. During the last 3 or 4 minutes of cooking (depending on the size of your florets), stir in the broccoli and cook until bright and tender, and the thickest parts are easily pierced with a fork. Drain, shake off excess water, then transfer to the serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix until the couscous has absorbed most of the dressing. Mix in the feta, pistachios, herbs, orange pieces and the remaining chile, then season to taste with salt and pepper. Eat immediately or let cool and serve at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023515-citrusy-couscous-salad-with-broccoli-and-feta"}