{"@context": "http://schema.org", "@type": "Recipe", "name": "Fruit Sandwich", "description": "The origins of the fruit sandwich are believed to go back to Japan’s luxury fruit stores and the fruit parlors attached to them. This version comes from Yudai Kanayama, a native of Hokkaido who runs the restaurants the Izakaya NYC and Dr Clark in New York. Fresh fruit — fat strawberries, golden mango, kiwi with black ellipses of seeds, or whatever you like — is engulfed in whipped cream mixed with mascarpone, which makes it implausibly airy yet dense. (In Japanese, the texture is called fuwa-fuwa: fluffy like a cloud.) Pressed on either side are crustless slices of <a href=\"https://cooking.nytimes.com/recipes/1016275-japanese-milk-bread\">shokupan</a>, milk bread that agreeably springs back. The sandwich looks like dessert but isn’t, or not exactly; it makes for a lovely little meal that feels slightly illicit, as if for a moment there are no rules.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/08/28/dining/28EAT-fruit-sandwich-1/merlin_211778193_69049d61-7b33-4b2f-96a1-abe2bd6a1064-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "2 sandwiches (2 to 4 servings)", "recipeCuisine": "japanese", "recipeCategory": "breakfast, brunch, for two, lunch, snack, sandwiches, dessert, main course", "keywords": "fruit, heavy cream, mascarpone", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 264}, "recipeIngredient": ["3/4 cup plus 3 tablespoons/200 grams mascarpone ", "1 tablespoon honey", "3/4 cup plus 2 tablespoons/200 grams heavy cream, chilled", "4 slices <a href=\"https://cooking.nytimes.com/recipes/1016275-japanese-milk-bread\">shokupan (milk bread)</a> or any fluffy white sandwich bread", "8 to 10 pieces cut fruit (1-inch chunks), such as strawberries, banana, mango and kiwi  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill a mixing bowl and the beater attachments of a hand mixer in the refrigerator for 15 minutes. (A metal bowl will chill more quickly than glass.) Meanwhile, in a separate large bowl, mix the mascarpone with the honey until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chilled mixing bowl in another, larger bowl filled with ice water, to keep it cold. Pour the chilled heavy cream in the mixing bowl. (The colder everything is, the less time it will take to whip the cream and the lighter and fluffier it will be.) Using a hand mixer with the chilled beater attachments, beat the cream until stiff enough to hold peaks, 5 to 8 minutes on medium. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the whipped cream to the mascarpone and gently combine. The mixture should be fairly firm, so it won’t squeeze out the sides of the sandwich when slicing. (If the mixture is too soft, chill briefly until firmer but still spreadable, about 5 minutes.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the 4 slices of bread and cut off the crusts on all 4 sides. Using a spatula, spread about 1/3 cup of cream filling on each slice of bread. (It will be thick.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the fruit dry with paper towels to absorb any excess moisture. Arrange the fruit on top of the cream on 2 slices of bread, keeping in mind that you will be cutting along the diagonal and showing off cut sections of fruit. Make a mental note of which diagonal you will be using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the fruit with the remaining cream. Then put the other slice of bread, cream side down, on top of the fruit to make the sandwich."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the sandwich with plastic wrap, very tightly, making sure there’s no air inside. Mark your chosen diagonal on the plastic wrap, so you will know where to cut. Chill in the refrigerator for at least 1 hour or overnight. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold a serrated bread knife under hot running water for 15 seconds, then wipe dry. (A warm knife cuts more cleanly than a cold one.) Unwrap the sandwich and cut along your chosen diagonal line. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023434-fruit-sandwich"}