{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Fish With Citrus Pesto", "description": "<a href=\"https://cooking.nytimes.com/recipes/1019719-basil-pesto?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\"><span>Genovese pesto</span></a><span> isn’t the only pesto around: </span><span>There are many regional variations, including an incredibly vibrant and light Sicilian version that stars citrus. This naturally vegan version doesn’t need cheese, because the citrus provides acidity and the capers and toasted nuts lend umami. Pistachios and almonds grow abundantly in Sicily, but walnuts or pine nuts would also work. You’ll find citrus pestos made with anchovies, garlic, dried oregano, fennel fronds, dried chile and, yes, cheese, so feel free to adapt this base recipe as you wish. Italians historically don’t mix seafood and cheese, but since this pesto eschews cheese, it’s as good with pasta as it is with simply seared or grilled fish.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2023/01/05/multimedia/as-seared-fish-with-citrus-pesto-1-4a46/as-seared-fish-with-citrus-pesto-1-4a46-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, sauces and gravies, seafood, main course", "keywords": "almond, basil, caper, citrus, extra virgin olive oil, fish fillets, food processor, mint, pistachio, dairy-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 328}, "recipeIngredient": ["1/2 cup toasted pistachios or slivered almonds", "2 teaspoons drained and rinsed capers", "Kosher salt (such as Diamond Crystal)", "2 cups mint or basil leaves (or a combination)", "1 tablespoon lemon, tangerine or grapefruit zest plus 3 tablespoons juice", "1/3 cup extra-virgin olive oil, plus more as needed", "4 (6-ounce) fish fillets, such as arctic char, striped bass or salmon, skin on or off", "Salt", "Extra-virgin olive oil, for greasing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pesto, add the pistachios, capers and 1 teaspoon salt to a food processor and process until coarsely chopped. Add the herbs, citrus juice and a pinch of salt and pulse until the herbs are finely chopped and the nuts are about the size of sesame seeds. Add the olive oil and pulse just until combined. Stir in 1 teaspoon of citrus zest. Taste, then continue to add more zest and salt until the pesto is citrusy and punchy. Thin with 2 to 3 more tablespoons of olive oil until it’s the consistency of a loose paste. Taste, and adjust seasonings as needed. (To use the pesto on pasta, see Tip.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fish, season it all over with salt and oil. Working in batches if necessary, add the fish (skin-side down, if your fillets are skin-on) to a large (12-inch) nonstick skillet, then heat over medium. Cook until the flesh is opaque ¾ of the way up the sides, 6 to 12 minutes, depending on the thickness of the fish. If the fish is buckling, press it down with a spatula so it makes contact with the skillet. Flip and cook until cooked through, 1 to 2 minutes. Transfer to plates, skin-side up if serving skin-on fish, and eat with a spoonful of pesto."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023788-pan-seared-fish-with-citrus-pesto"}