{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Toast", "description": "Shrimp toast, also known as prawn toast, is a widely popular Cantonese dim sum staple that embodies both Chinese and western influences. Originating in China’s Guangdong Province, the dish spread to other Asian countries and eventually across the globe. A shrimp toast resurgence has led to playful versions appearing on restaurant menus, taking it beyond a simple snack. Traditionally, shrimp toast starts with a shrimp paste that’s infused with aromatic garlic, scallions and cilantro, which is then slathered on white bread that is fried until crisp on the outside and light inside. A food processor makes quick work of chopping the shrimp mixture, but the task can also be done by hand. In this recipe, the shrimp toast is coated in sesame seeds before frying, giving it an extra layer of nutty flavor and crunchy texture. The shrimp paste can be made one day ahead and chilled until ready to use.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2022/09/28/dining/kc-shrimp-toast/kc-shrimp-toast-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "snack, finger foods, appetizer", "keywords": "cilantro, sesame seeds, shrimp, small plate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 139}, "recipeIngredient": ["2 scallions, cut into 1-inch pieces", "2 garlic cloves", "1/4 cup cilantro leaves and tender stems", "1/2 pound peeled and deveined large shrimp", "1 large egg white", "1 tablespoon low-sodium soy sauce", "1/2 teaspoon toasted sesame oil", "Salt and pepper", "1/3 cup white sesame seeds", "4 slices white sandwich bread", "1 1/2 to 2 cups neutral oil (such as canola or vegetable), for shallow frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, combine scallions, garlic and cilantro; pulse until finely chopped, scraping down sides of bowl. Add two-thirds of the shrimp, along with the egg white, soy sauce and sesame oil; pulse until a coarse paste forms, scraping down sides and bottom of the bowl as needed. Transfer the shrimp paste to a medium bowl. Chop the remaining shrimp into ¼-inch pieces and add to the bowl; season with salt and pepper, and mix well. (The mixture will be quite moist and spreadable.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the sesame seeds on a large plate. Spread one-quarter of the shrimp mixture in an even layer on one slice of bread; repeat with the remaining shrimp mixture and bread. Working with one slice of bread at a time, invert it into the sesame seeds, shrimp side down, and gently press so seeds adhere. Transfer to a cutting board, setting each piece sesame side up. Cut each slice of bread diagonally into 4 triangles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron or other heavy skillet, heat ¼ inch of oil over medium until shimmering. (A small piece of bread dropped into the oil should sizzle when the oil is properly preheated.) Working in 2 batches, add the triangles, shrimp side down, in a single layer and fry until golden and crispy underneath, 2 to 3 minutes. Flip toasts and fry until shrimp is cooked through and bread is golden brown and crispy underneath, 1½ to 2 minutes longer. Transfer to a paper towel-lined plate to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook remaining shrimp toasts, and serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023362-shrimp-toast"}