{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Cider", "description": "To understand the difference between apple cider and juice, think of it like this: Unfiltered cider is a complex dark brown multigrain, whereas filtered apple juice is a plain sweet white bread. There’s a place for both, but to fully savor the fruit, make raw, fresh cider. Benford Lepley, the co-founder of <a href=\"https://www.nytimes.com/2022/11/10/nyregion/cider-long-island-floral-terranes.html\">Floral Terranes</a>, a small-batch cidery and winery on Long Island, suggests using a mix of apples, ideally fresh ones grown in your general area, but Pink Lady is a supermarket favorite. Adjust the variety based on your preference of sweet to tart, then crush and press. (This recipe calls for a blender or food processor and a cloth-lined colander.) Drink and repeat all season long.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/11/22/dining/as-apple-cider/as-apple-cider-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 1 1/2 quarts", "recipeCuisine": "", "recipeCategory": "snack, non-alcoholic drinks", "keywords": "apple, fall, halloween, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "recipeIngredient": ["2 1/2 pounds sweet apples, such as Honeycrisp, Fuji, Gala or Golden Delicious", "2 1/2 pounds tart apples, such as Pink Lady, Granny Smith, Gravenstein, Jonagold, Jonathan or Braeburn "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a colander or sieve with muslin or two layers of cheesecloth (allow for some overhang) and set over a large bowl or pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When making your own apple cider, follow the same guidance you’d follow when eating raw fruit: Wash and dry apples thoroughly and remove moldy parts. If picking your own apples, do not use windfall or drop apples (i.e. apples from the ground). Core and coarsely chop the apples, leaving the peels on. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a blender or food processor halfway with apples, then add about ¼ cup water. Blend until the apples are coarsely mashed and juicy. (You can blend further, but your cider will be cloudier.) Add a little more water if the blender gets stuck. Transfer the puréed apples to the lined colander, gather the muslin around the puréed apples and twist. Squeeze and press to extract the apple cider. Open the muslin so it hangs over the colander and leave the puréed apple in the muslin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat Step 3 with the remaining apples, and add to the apples already in the lined colander. Give it a good squeeze, then press it with a wooden spoon, meat mallet or heavy pot to extract as much juice as possible. If your apples aren’t giving up their juice, let them sit a few minutes before trying again. (If you would like to pasteurize your cider, heat it to 160 degrees for 1 minute, skim off any foam, then refrigerate. The flavor will be muted but the cider will still be delicious.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drink warm, cold or at room temperature, and consider spiking or mulling it. Refrigerate for up to 5 days. Use the pomace (leftover pulp) to make apple butter, or add it to oatmeal, muesli, smoothies or quick breads."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023663-apple-cider"}