{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Salmon and Asparagus With Herbs", "description": "Many people fear the broiler because they don’t know how to use it, or they’re worried they’ll overdo it and end up with a scorched dinner. But when used properly, it’s a useful tool ideal for crisping chicken skin, charring vegetables and melting cheese. Broiling is also a great method for perfectly cooking salmon: It yields a deeply browned crust and a tender center that isn’t overcooked. All broilers are different, and knowing the strength of yours and being aware of any uneven “hot spots” help maximize the efficiency of it. (As your dish cooks, look to see if it’s cooking evenly across the surface, which will tell you if you need to move things around.) In this recipe, soy-and-mustard-coated salmon and asparagus cook under the broiler, and are topped with an herb salad for a hit of brightness, freshness and acidity.", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "image": "https://static01.nyt.com/images/2022/04/18/dining/yf-broiled-salmon-and-asparagus/merlin_205522569_97e09b1c-8af7-4a62-b775-6bfe805c6a0e-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, seafood, main course", "keywords": "asparagus, herbs, salmon, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 690}, "recipeIngredient": ["1 bunch cilantro, leaves and tender stems, roughly chopped", "1 bunch parsley, leaves and tender stems, roughly chopped", "1 small bunch mint or dill, leaves picked, roughly chopped", "4 scallions, light green and white parts, sliced", "1/4 to ½ teaspoon red-pepper flakes, according to taste ", "3 tablespoons lemon juice, plus more as needed", "3 tablespoons olive oil, plus more as needed", "Salt and black pepper", "2 tablespoons soy sauce", "1 tablespoon Dijon mustard", "1 large bunch asparagus, woody ends trimmed", "4 (4- to 6-ounce) salmon fillets, at least ¾-inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium serving bowl, toss together the herbs, scallions, red-pepper flakes, lemon juice and 2 tablespoons of olive oil, and season to taste with salt and pepper. Season with more lemon or oil as needed until the leaves look glossy. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler with a rack 6 inches from the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix the soy sauce and mustard until smooth. Add the asparagus to a large sheet pan, toss with the remaining 1 tablespoon of oil, then season well with salt and pepper. Move the asparagus to the sides, and place the salmon skin side down in the center. Season the salmon with salt and pepper, brush the tops and sides with the soy mixture, then toss the asparagus in the rest of the soy mixture. (Use a paper towel to wipe off excess soy on the sheet pan, as it will smoke.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil until the salmon is opaque with a deep brown crust, about 6 to 8 minutes for medium rare, and 8 to 10 minutes for medium, depending on the strength of your broiler and the thickness of the salmon. (Reduce cooking time by 1 to 2 minutes for thinner fillets.) If it looks like it’s browning too quickly or smoking excessively, move to a lower rack to finish cooking. Top the salmon and asparagus with the herb salad or serve on the side with a final round of pepper."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023134-broiled-salmon-and-asparagus-with-herbs"}