{"@context": "http://schema.org", "@type": "Recipe", "name": "Chebureki", "description": "Chebureki are the southern Ukrainian branch of the global family of empanadas, potstickers, pasties and salteñas — dough pockets filled with meat and deep-fried until golden and juicy. A blistered, chewy crust is the sign of a really good cheburek according to Olga Koutseridi, who grew up in Mariupol, Ukraine, and adapted this recipe for her home kitchen in Austin, Texas. The dough for this recipe is relatively stiff, which means it will take a bit of time to mix it by hand. You could also use a stand mixer, but your mixer may struggle. After the first few, these pies become much easier to assemble, and you can roll and fill the next one while one is frying. It is best to fry one or two at a time, which helps control the oil temperature and ensures the freshest chebureki. They should be eaten within just a few minutes of their emergence from the fryer. ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2022/05/16/dining/16UKRAINIAN-RECIPESREX1-update/16UKRAINIAN-RECIPESREX1-update-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "12 chebureki", "recipeCuisine": "eastern european", "recipeCategory": "dinner, snack, pastries, appetizer, main course", "keywords": "ground beef, ground pork, kefir", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 147}, "recipeIngredient": ["1 medium onion, any kind (except sweet), coarsely chopped ", "4 ounces ground beef", "4 ounces ground pork", "2 teaspoons coarsely ground black pepper", "1 1/2 teaspoons salt ", "8 ounces plain kefir, plus more as needed", "4 cups/510 grams all-purpose flour, plus more for dusting (if needed)", "1 teaspoon fine salt", "1 cup/240 milliliters plus 1 tablespoon cold water", "Peanut oil or refined sunflower oil, for frying (about 8 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meat filling: Place the chopped onion in a food processor and process until it is very fine and has started to release moisture. Transfer the onion to a large bowl. Add the beef, pork, black pepper and salt, and mix very well. Gradually add kefir to the mixture and mix it into the meat using a spoon. The consistency should be pourable and almost soupy, not stiff. If necessary, add more kefir, 1 tablespoon at a time, to achieve the desired consistency. Cover mixture and place it in the refrigerator to chill for 1 hour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Place 3 cups of the flour in a large bowl. Add the fine salt and mix with a fork. Add the water and mix until combined. Sprinkle a work surface with some of the remaining flour and knead in the rest of the flour little by little (you may not need all of it), until the dough is pliable and not sticky, about 15 minutes. (The dough should spring back when you make a slight indent with your finger.) Shape the dough into a ball, place in a bowl, cover tightly with plastic wrap and let rest for at least 1 hour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up your frying station: Pour 2 inches of oil into a wok or a Dutch oven. Line a sheet pan with a wire rack and some paper towels to absorb any excess oil from the finished chebureki. Heat the oil over medium-high until the temperature reaches between 350 and 375 degrees.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the rested dough into 12 pieces and roll them into balls. (The dough should be pliable and shouldn’t need much flour.) Flatten the pieces into disks and cover with plastic wrap so they don’t dry out. Working with one piece at a time, lightly dust the counter with flour and roll out the dough into a very thin round about 8 inches in diameter. (You should be able to read text through the dough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 3 level tablespoons of filling on one side of the round and spread it into a thin half-moon, leaving a 1-inch border around the filling. Make sure not to add too much filling! Overfilling increases the risk of leakage during frying. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small bowl with water, and using your finger, dampen the edges of the whole round to help seal the cheburek. Fold the dough over the side with the filling, trying to make sure there are no air bubbles between the filling and the dough to help decrease the chance of bursting. Press the edges to seal tightly, then seal them completely with a fork. Use a pasta wheel or paring knife to trim off any uneven edges, if you like. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the oil is at 350 degrees, carefully lower the shaped cheburek into the oil and fry until the dough is golden brown and bubbly, about 2 minutes per side. Using tongs or a large slotted spatula, transfer the fried cheburek to the rack. Repeat shaping, filling and frying with the remaining dough and filling. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cheburek cool slightly, then dig in! These are best eaten hot. Enjoy with a glass of <a href=\"https://cooking.nytimes.com/recipes/1023161-ryazhanka-fermented-caramelized-milk\">ryazhanka</a> or kefir."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023162-chebureki"}