{"@context": "http://schema.org", "@type": "Recipe", "name": "Borani-yeh Esfenaj (Spinach Yogurt Dip)", "description": "There are many types of Iranian borani, or yogurt-based dishes, and spinach borani is a classic. What sets borani-yeh esfenaj apart from a simple mix of wilted spinach and yogurt is that the spinach is first cooked down with flavorful golden onions, garlic and turmeric. The preparation of the onion is the backbone of the dish and not to be overlooked. Rather than cooking the onion low and slow, as is done when caramelizing, it’s cooked quickly over a higher heat to draw out its sweet and sharp flavors. Creamy Greek yogurt is mixed with thinner regular yogurt for a balanced consistency. Use more or less of either depending on your preference: You can serve the borani thicker as a dip with pita crackers or flat breads, or thinner as a light lunch or snack alongside rice.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/05/26/dining/nd-Borani-yeh-Esfenaj/merlin_206153493_0b010147-160c-45f4-82bd-d3622d27f4c5-articleLarge.jpg", "totalTime": "PT2H35M", "recipeYield": "6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "snack, dips and spreads, vegetables, appetizer, side dish", "keywords": "baby spinach, greek yogurt, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 407}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil, plus more for serving", "1 medium yellow onion, finely chopped", "2 large garlic cloves, finely grated", "Salt and black pepper", "1/4 teaspoon ground turmeric", "12 ounces fresh baby spinach, or thawed frozen spinach (no need to squeeze)", "1 cup plain Greek yogurt", "1 tablespoon regular plain yogurt (or water; see Tip), plus more as needed", "1/2 teaspoon lemon zest and 1 tablespoon lemon juice, plus more juice to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large (12-inch) pan, heat the oil over medium-high. Add the onion and cook, stirring occasionally, until golden brown, 6 to 8 minutes. Reduce the heat to medium-low, add the garlic, sprinkle with a little salt, stir and cook until fragrant, about 2 minutes. Add the turmeric, stir and cook until fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add about half the spinach and increase the heat to medium. Using tongs, quickly and continuously toss the spinach with the onion mixture until slightly wilted and reduced in volume. Add the rest of the spinach, ½ teaspoon salt and ¼ teaspoon black pepper. Toss and cook until the spinach is wilted and any liquid has evaporated, 3 to 5 minutes. Increase the heat slightly if the spinach releases too much water. Transfer the spinach mixture to a bowl and cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the cooled spinach, add the Greek yogurt, regular plain yogurt, lemon zest and lemon juice. Stir well to combine, and add salt to taste. If the mixture is too thick, thin out with more regular yogurt, 1 tablespoon at a time. Taste and add more salt and lemon juice as needed. Cover and refrigerate for at least 2 hours and up to 24 hours. Stir to combine, then drizzle with olive oil and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023209-borani-yeh-esfenaj-spinach-yogurt-dip"}