{"@context": "http://schema.org", "@type": "Recipe", "name": "Locro de Gallina (Chicken Soup With Squash, Green Plantains and Yuca)", "description": "Derived from a Quechua term for a hearty soup-stew hybrid, locro originated in the Andes mountain range but today encompasses a glut of South American soups that vary from country to country, and household to household. Originally made with varying combinations of squash, corn, beans and potatoes, locro has transformed regionally to include ingredients like poached eggs and thinly shaved brisket. This Bolivian recipe starts with chicken broth seasoned with turmeric, paprika and annatto seeds, and uses squash, plantains and yuca, but feel free to use whatever vegetables you have in your fridge. Make sure to keep the pieces large so they don’t disintegrate into the soup as it simmers; cutting them with your spoon as you eat is part of the experience.", "author": {"@type": "Person", "name": "Ham El-Waylly"}, "image": "https://static01.nyt.com/images/2023/01/09/multimedia/hew-locro-de-gallina-1-27e6/hew-locro-de-gallina-1-27e6-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "south american", "recipeCategory": "dinner, main course", "keywords": "butternut squash, chicken soup, garlic, ground turmeric, hot paprika, plantain, rice, whole chicken, yuca", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "recipeIngredient": ["1 whole (4-pound) chicken (back and neck reserved, if available)", "2 tablespoons neutral oil", "1 teaspoon ground turmeric", "1 teaspoon ground hot paprika", "1/2 teaspoon annatto seeds (optional)", "1 medium yellow onion, finely diced", "8 garlic cloves, peeled", "1 fresh or dried bay leaf", "Kosher salt and freshly cracked black pepper", "1/3 cup white rice, rinsed", "1 medium yuca (about 1 ½ pounds)", "1 medium butternut squash (1 ½ to 2 ½ pounds)", "2 green (unripe) plantains (about 6 ounces each)", "1 tablespoon dried oregano", "6 eggs (optional)", "1/3 cup roughly chopped parsley leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the chicken into 10 parts: Place the chicken on a cutting board, breast side up. With a sharp knife, remove the wings and legs at the joint. Split each leg at the joint into the thigh and drumstick; set aside. Hold the whole chicken with the largest cavity pointing up and locate the ribcage running along the side. Firmly cut down the opening to separate the breast from the back. Lay the breast skin side down and cut the breast in half down the middle lengthwise, then again in half crosswise to yield 4 bone-in pieces of breast; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot (at least 6 quarts) over medium-low heat, add the neutral oil, turmeric, paprika and annatto seeds (if using). Cook until oil is stained red and spices are fragrant, about 2 minutes. Add the onion, garlic and bay leaf, and cook, stirring occasionally, until softened, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken pieces, including the back and neck, toss to coat, and season with 4 teaspoons kosher salt. Add the rice and 12 cups of water. Turn the heat up to medium-high and bring to a gentle simmer. Once simmering, turn the heat down to medium and gently simmer for 1 hour, skimming the foam from the top as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broth simmers, prepare the yuca: Fill a medium pot with water. Peel yuca, then cut crosswise into 3-inch segments. Position the yuca upright on one flat side, then cut in half. Place the yuca in the medium pot. Season with salt and bring to a simmer over medium-high heat. Cook until yuca is tender, about 45 minutes. Drain the yuca, pull off any tough strings running down the middle, and set aside until soup is ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, trim the top and bottom of the squash, then remove the skin using a peeler. Place the squash cut side down for stability, then cut in half lengthwise. Using a spoon, scoop all of the seeds out and store in the fridge for another use. Cut the squash crosswise into 1- to 1 ½-inch wedges. (There is no need to be overly precise here, the squash will break down into smaller pieces as it cooks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the yuca has cooked, trim the tops and bottoms of the green plantains; cut each in half crosswise, then quarter each piece lengthwise. Pry the skins off; set plantains aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the broth is ready, remove and discard the chicken back and neck. Add the squash and green plantains and simmer until tender, 25 to 30 minutes. Add cooked yuca to the pot. If it seems like soup is too dry, add water as needed and bring back to a simmer. Stir in the oregano, then season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using eggs, crack the eggs directly into the soup, making sure the eggs don’t overlap, and cover with a lid. Cook until egg whites are fully set, about 3 minutes. Finish soup with parsley and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023816-locro-de-gallina-chicken-soup-with-squash-green-plantains-and-yuca"}