{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Hash Browns", "description": "Grated Parmesan and whipped crème fraîche enrich the flavor profile of these rich, golden hash browns. Packing the patties tightly and allowing the starch and cheese to bind the shredded potatoes achieves a crisp outer layer. Although the patties may seem somewhat loose before cooking, they’ll fuse together in the hot oil, forming a formidable crust. Make sure not to disturb the patties: Let them fry until perfectly golden before flipping. Prepare these hash browns for a weekend brunch, or as a perfect side to accompany meat, poultry or salad.", "author": {"@type": "Person", "name": "Rōze Traore"}, "image": "https://static01.nyt.com/images/2022/05/07/dining/rt-crispy-hash-browns-light/rt-crispy-hash-browns-light-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, vegetables, side dish", "keywords": "crème fraîche, potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 310}, "recipeIngredient": ["2 large russet potatoes", "2/3 cup grated Parmesan", "Heaping 1/2 teaspoon garlic powder", "Heaping 1/2 teaspoon onion powder", "Kosher salt", "5 tablespoons canola oil, plus more if needed", "3 tablespoons unsalted butter", "4 fresh thyme sprigs", "1 tablespoon thinly sliced chives", "1/3 cup crème fraîche", "1 teaspoon chopped fresh dill", "1/2 teaspoon finely grated fresh lemon zest (from ½ lemon)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the hash browns: Peel the potatoes, then use a box grater to shred them lengthwise into long strands, then place them immediately into a large bowl of cold water to prevent them from oxidizing. Pour out the water, add a second round of cold water until the shredded potatoes are immersed, and let them sit for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes soak, prepare the crème fraîche: Add crème fraîche, dill and lemon zest to a medium bowl and whisk until aerated, about 1 minute. Season to taste with salt; refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the potatoes, then use a cheesecloth or towel to squeeze out any excess water (or tightly grip them by the fistful, squeezing any liquid into the sink), transferring potatoes to a large bowl. Season shredded potatoes with the Parmesan, garlic powder, onion powder and a generous amount of kosher salt. (If you notice a little excess water in your bowl, feel free to pour it out.) Mix until everything is incorporated and then shape the mixture into 8 patties, patting them firmly until compact."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once you have your hash browns shaped and ready, divide 3 tablespoons canola oil between 2 large nonstick or cast-iron pans and heat over medium. Gently add 4 hash browns to each pan, using a spatula to sculpt the edges of each hash brown so they’re rounded like hockey pucks. Cook, undisturbed, until golden-brown and crisp underneath, about 5 minutes, reducing the heat to medium-low if browning too quickly. Carefully flip the hash browns, adding about 1 tablespoon of oil to each pan (or more, if needed), and cook over medium until the second side is golden-brown, another 3 to 5 minutes, reducing the heat to medium-low if browning too quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the hash browns are golden on both sides, working with 1 pan at a time, add 1 1/2 tablespoons butter and 2 thyme sprigs to the pan and cook over medium, tilting the pan slightly and using a spoon to baste the thyme-scented butter over the hash browns, about 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat off and transfer butter-basted hash browns to a paper towel-lined baking sheet to absorb any excess oil. Repeat basting step with the remaining hash browns, butter and thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with chives and serve with crème fraîche."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023166-crispy-hash-browns"}