{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Korokke", "description": "Korokke, or Japanese croquettes, are comforting oval-shaped staples. The dish was introduced to Japan in the late 1800s and is said to have descended from French croquettes. Now, you’re as likely to find these crunchy-creamy cakes in a neighbor’s kitchen as at a butcher’s shop, street vendor or convenience store counter. Potato korokke consists of mashed potatoes folded into a mixture of onion and ground beef, but that formula is a platform for endless variation. Kabocha korokke substitutes potatoes with Japanese squash; kani cream korokke is filled with crabmeat and bound by bechamel; kare rice korokke eats like a distant cousin of arancini; kon kurimu korokke uses corn and cream. Leftover korokke can be reheated and eaten with toasted <a href=\"https://cooking.nytimes.com/recipes/1016275-japanese-milk-bread\">milk bread</a> for a miracle sandwich.", "author": {"@type": "Person", "name": "Bryan Washington"}, "image": "https://static01.nyt.com/images/2022/06/12/dining/12Korokke/merlin_208197630_39a1b4ee-998e-4706-9f2f-8d5696f5e6ac-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "japanese", "recipeCategory": "appetizer, side dish", "keywords": "ground beef, panko, russet potatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "recipeIngredient": ["4 medium russet potatoes (2 1/2 pounds)", "2 tablespoons unsalted butter", "1 tablespoon neutral oil, such as canola, plus more for frying", "1/2 white onion, minced", "1/2 pound ground beef", "1 tablespoon soy sauce", "1 tablespoon granulated sugar", "1/2 teaspoon ground black pepper, plus more to taste", "Salt", "1/2 cup all-purpose flour", "2 large eggs", "2 cups panko bread crumbs", "Tonkatsu sauce, store-bought or homemade (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a medium pot of water to boil. As the water heats, wash, peel and quarter potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set potatoes in boiling water and cook until they’ve softened enough to pierce easily with a fork, 20 to 25 minutes. Drain potatoes in a colander. While potatoes are still warm, return them to the pot. Mash them until you’re left with a fluffy mixture, fold in butter until melted and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes simmer, prepare the meat: Heat a skillet over medium, and add 1 tablespoon oil. Add onion and cook, stirring often, until softened, 3 to 4 minutes, then add beef. Cook, breaking the meat into bits, and add soy sauce, sugar and pepper. Continue cooking and stirring until the meat is cooked through, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beef mixture to mashed potatoes in pot, and stir until thoroughly mixed. Season with salt and pepper to taste. Let mixture cool until it’s warm (but not cold)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With your palms, form the warm mixture into 1-inch-thick oval-shaped patties no longer than 3 inches in length. Set the patties on a baking sheet as you form them. You should end up with 10 to 12 patties."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the patties loosely with plastic wrap, and refrigerate to cool for 30 minutes. Meanwhile, organize your breading station: Place flour in a shallow plate, beat eggs in a shallow bowl and spread panko on another plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove patties from fridge, and begin the breading process: Dip 1 patty into flour, covering completely. Then transfer to the beaten egg, covering completely. Then transfer to the panko, being sure to cover each patty completely. As you complete each patty, set back on the baking sheet before continuing with the next patty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium saucepan with oil to a depth of 1 1/2 inches and heat to 340 degrees. Deep-fry korokke in batches of 2 at a time. (If you add too many, the oil’s temperature will drop too drastically.) Fry, turning once, until golden brown, about 3 minutes. They’re already cooked inside, so use their color as your guide. Transfer to a cooling rack or a plate lined with paper towels, and repeat with the remaining korokke. Continually regulate the oil’s temperature throughout — if the heat is too high, the korokke will burn, and if it’s too cold, then your korokke will be soggy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, with tonkatsu sauce, if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023265-potato-korokke"}