{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Cauliflower Soup With Harissa Tomatoes", "description": "Cauliflower is cooked twice for this plush vegan soup, which is both cozy and complex in flavor. First, it’s roasted so its flavor deepens, simmered in broth until thoroughly and completely soft. When puréed, it gives the soup a rich, velvety texture and a savory, caramelized character that’s zipped up with harissa-glazed roasted tomatoes. A note on harissa pastes: They vary a lot in their heat level. If yours is milder, use the full amount listed, but if you’re working with a more fiery harissa, use less. And if you don’t have harissa on hand, any other chile paste will work well.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/05Apperex/merlin_214343217_f0db99a2-ecfc-45ab-add6-a647b1e9c355-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, main course", "keywords": "cauliflower, harissa, plum tomato, soup, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 649}, "recipeIngredient": ["1 large head cauliflower (about 3 pounds), trimmed and cut into 1-inch florets (about 12 cups)", "Kosher salt (such as Diamond Crystal) and freshly ground black pepper", "1 1/4 teaspoons ground coriander", "7 tablespoons extra-virgin olive oil, plus more for serving", "1 small bunch thyme (about 10 sprigs)", "1 pound plum tomatoes, halved, seeds scooped out", "2 to 4 tablespoons harissa paste", "3 large bunches scallions, whites and greens thinly sliced (about 2 1/2 cups)", "1 jalapeño, seeded (if desired) and coarsely chopped", "4 large garlic cloves, finely chopped", "1 1/2 teaspoons ground cumin", "1 tablespoon tomato paste", "6 cups vegetable stock", "3/4 cup chopped cilantro leaves and tender stems, plus more for optional garnish", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees and line 2 sheet pans with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine cauliflower, 1 teaspoon salt, a large pinch of black pepper, ¾ teaspoon ground coriander, 3 tablespoons oil and half the thyme sprigs, tossing everything until well coated. Spread the cauliflower evenly across one of the prepared pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the same bowl (no need to wash it first), combine halved tomatoes, 1 to 2 tablespoons of harissa (depending on how spicy your harissa is; taste it first), 2 tablespoons olive oil, a large pinch of salt and the remaining thyme sprigs, and toss gently until the tomatoes are well coated. Spread tomatoes on the other baking sheet, cut-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place both sheet pans in the oven and roast for 20 minutes, then stir the cauliflower but not the tomatoes. Continue to roast until cauliflower is golden brown and tender, 15 to 20 minutes longer (35 to 40 minutes total roasting time). Transfer cauliflower pan to a rack, and discard thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, gently flip tomatoes over so their cut sides are down. Using the tongs, pinch off the tomato skins – they should slip right off – and discard. Brush 1 to 2 more tablespoons of harissa onto tomatoes and continue to roast until shriveled and condensed, about 15 to 25 minutes (35 to 45 minutes total roasting time)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While tomatoes are roasting, make the soup: In a large pot, heat the remaining 2 tablespoons oil over medium. Add scallions (saving ¼ cup scallions for serving) and jalapeño, and cook, stirring occasionally, until soft and lightly colored, 5 to 7 minutes. Stir in garlic and cook for 1 minute. Add another 1 ½ teaspoons salt, black pepper to taste, cumin and tomato paste, and cook until tomato paste darkens and caramelizes, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in roasted cauliflower and stock, and bring to a simmer. Cook, partly covered, over medium-low heat until all vegetables are very tender, 15 to 20 minutes. Turn off the heat. Using an immersion blender, purée the soup until smooth. (Alternatively, you can purée it in batches in a food processor or blender.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the roasted tomatoes into a mixing bowl and add cilantro. Using a Microplane or other fine grater, grate zest from about half the lemon into the bowl, then stir in ½ teaspoon coriander and reserved scallions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fork or spoon, break up some of the tomatoes as you combine everything. Cut the lemon in half and squeeze a little into the tomatoes, then taste and add more salt and lemon juice as needed. It should taste well seasoned and a little tangy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, squeeze in the juice from half the lemon. Taste and add salt, pepper and lemon if needed. Ladle soup into individual bowls and dollop harissa tomatoes on top; top with olive oil and more cilantro, if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023537-creamy-cauliflower-soup-with-harissa-tomatoes"}