{"@context": "http://schema.org", "@type": "Recipe", "name": "Pescado Zarandeado (Grilled Fish With Chile-Citrus Sauce)", "description": "This pre-Hispanic dish comes from Mexcalitlán, a small island in the state of Nayarit on the mid-Pacific Coast. Originally, the fish was seasoned with a chile-lime salsa and grilled over a zaranda, a pit made of mangrove wood from which the dish gets its name. But there are many regional variations, using either freshwater and saltwater fish, found along the Pacific Coast as well as inland, in the northern central states. ", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/12ESSENTIALSREX1/merlin_214158417_9d7a86f0-def4-4445-9a78-b832e0165686-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 servings ", "recipeCuisine": "mexican", "recipeCategory": "dinner, seafood, main course", "keywords": "achiote, chiles de árbol, lime juice, orange juice, red snapper", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["2 tablespoons achiote paste", "2 to 3 chiles chiltepines or chiles de árbol, lightly crushed (2 for medium, 3 for spicy)", "5 teaspoons fresh lime juice", "5 teaspoons fresh orange juice", "1 garlic clove, finely grated", "3 tablespoons extra-virgin olive oil", "1 tablespoon soy sauce, preferably dark", "1 green bell pepper, stemmed and seeded, cut into 1/4-inch slices", "1/2 large red onion, cut into 1/4-inch slices", "Kosher salt and freshly ground black pepper", "1 whole red snapper (about 3 pounds), scaled, cleaned (head removed) and butterflied (see Tip)", "Warm tortillas de maíz, your favorite salsa, lime and orange wedges, sliced cucumber, sliced tomatoes, sliced avocado, sliced iceberg lettuce and sliced red onion, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the achiote in a medium bowl and, using a whisk, break the paste into small pieces. To the same bowl, add chiles, lime juice, orange juice and garlic and whisk until smooth, then whisk in 2 tablespoons of oil and the soy sauce until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a grill for medium heat. Scrub the grates clean and, using tongs and an old, clean kitchen towel, brush the grates with oil. Toss bell pepper and onion slices in the remaining 1 tablespoon oil, and season with salt and pepper. Grill until lightly charred on both sides, about 3 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the skin side of the fish dry with paper towels (this will help keep the fish from sticking). Using a sharp knife, score the flesh side of the fish on a diagonal at 1-inch intervals and  about 1/4-inch deep. Season with salt and pepper. Generously brush the achiote mixture onto the flesh side of the fish, making sure to coat the entire surface and pushing it into the score marks. If you have a fish grilling basket, use it! (Alternatively, you can roast it in the oven. Place prepared fish on a rack set inside a rimmed sheet tray and roast at 475 degrees until lightly browned and cooked through, 15 to 20 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the fish, skin-side down, until the skin is charred, 7 to 10 minutes. Carefully turn the fish over with a wide spatula; continue to cook for 3 to 4 minutes, until the flesh side has char marks and easily releases from the grate and the flesh flakes easily. Generously brush any remaining achiote mixture onto the flesh side of the fish and turn over again to grill the flesh side for about 1 minute to cook the achiote. Remove from the grill and place the fish flesh-side up on a platter. Arrange grilled vegetables on top of fish. Serve with tortillas, salsa, limes, oranges, cucumbers, tomatoes, avocado, lettuce and sliced red onion."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023500-pescado-zarandeado-grilled-fish-with-chile-citrus-sauce"}