{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Lettuce With Crispy Garlic and Fried Eggs", "description": "In Chinese culture, cooked lettuce is a symbol of good luck and is often eaten during <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/864096-lunar-and-chinese-new-year\">Lunar New Year</a> feasts. In Cantonese, the word for lettuce is sang choy, and in Mandarin, it’s sheng cai, which sounds like the words for “growing wealth” in each language. Stir-fried lettuce is commonly served as a bed for braised mushrooms or simply as a green side dish. Here, stir-fried lettuce, fried eggs and crispy garlic chips perch on a bed of rice, a simple meal with comforting flavors and textures. The joy of this preparation is that the lettuce retains a fresh crunch even after cooking; iceberg is preferred, but romaine will give you similar results. Vegetarian stir-fry sauce is a product sold in Asian grocery stores, but you can also use oyster sauce. For a shortcut, skip the fried garlic and top with store-bought crispy fried onions or shallots.", "author": {"@type": "Person", "name": "Hetty McKinnon"}, "image": "https://static01.nyt.com/images/2022/03/22/dining/hm-stir-fried-lettuce/hm-stir-fried-lettuce-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, weeknight, vegetables, main course", "keywords": "egg, garlic, iceberg lettuce, lunar new year, soy sauce, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 381}, "recipeIngredient": ["1 head of iceberg lettuce (about 1½ pounds)", "1 tablespoon soy sauce", "1 tablespoon sesame oil", "2 teaspoons vegetarian stir-fry sauce, or oyster sauce", "1/4 teaspoon granulated sugar", "Kosher salt (Diamond Crystal)", "Black or white pepper", "2 tablespoons plus ¼ cup extra-virgin olive oil", "1 (1-inch) piece of ginger, peeled and finely chopped", "6 garlic cloves, peeled and thinly sliced", "4 eggs", "Steamed rice, for serving", "1 tablespoon toasted sesame seeds", "2 scallions, green and white parts, finely sliced", "Maggi seasoning sauce, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp paring knife, run it around the core of the lettuce, then gently pull it out. Remove any discolored outer layers of the lettuce and discard. Tear the lettuce into large chunks. Wash the leaves and allow them to drain after gently shaking in a colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the soy sauce, sesame oil, vegetarian stir-fry or oyster sauce, sugar and ¼ teaspoon salt. Season with pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large (12-inch) deep skillet on medium-high. Add 1 to 2 tablespoons of olive oil to lightly coat the pan, then add the ginger and cook for 15 to 30 seconds, until fragrant. Add the lettuce and stir-fry for 2 minutes, until it starts to wilt. Pour the sauce over the lettuce and stir-fry for another 1 to 2 minutes. (Take care not to overcook, as you want your lettuce to retain some crunch.) Taste and season with salt, if needed. Place the lettuce (and all the pan juices) in a bowl and set aside. Once your skillet is cool enough to handle, rinse it out and dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the same skillet over medium-high heat, add the ¼ cup olive oil and sliced garlic. Stir constantly for 3 to 4 minutes until the garlic turns a pale golden brown. (Watch carefully! It burns quickly.) Remove the garlic from the oil with a slotted spoon and place on a paper towel to drain; it will continue to brown and crisp as it cools."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the remaining oil in the skillet over medium-high heat, add the eggs and cook untouched until whites are set, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a mound of rice in a bowl, top with lettuce, some pan juices, a fried egg, crispy garlic and a scatter of sesame seeds and scallions. Finish with a tiny drizzle of Maggi seasoning sauce, if using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023052-stir-fried-lettuce-with-crispy-garlic-and-fried-eggs"}