{"@context": "http://schema.org", "@type": "Recipe", "name": "Honey Ham", "description": "A little honey soaks into the slices and crackles on the brown sugar crust of this celebration ham, which ends up with a just-right salty-sweetness. Gently simmering presliced ham on the stovetop before blasting it quickly in a hot oven to caramelize its honey-mustard coating keeps the meat moist and makes it intensely flavorful all the way through. Warming a sliced ham with only an oven bake invariably dries it out and takes a long time. This faster method will give you a juicy ham with the surprising piney perfume of juniper berries and the warmth of cloves. You can double the ingredients below for a spiral-sliced half-ham and use a bigger pot.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/04/13/dining/08korex-ham/08korex-ham-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, meat, main course", "keywords": "dijon mustard, ham, white wine, easter, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 354}, "recipeIngredient": ["2 cups Riesling or other semi-dry white wine", "1 tablespoon juniper berries", "1 teaspoon whole black or green peppercorns", "5 whole cloves", "3 tablespoons honey", "1 large onion, thickly sliced", "1 presliced quarter-ham (4 to 6 pounds), drained if needed", "1/2 packed cup brown sugar", "3 tablespoons whole-grain Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Choose a pot that fits the ham with enough space on top to close its lid and with space between the ham and the sides. Combine the wine, juniper berries, peppercorns, cloves and 2 tablespoons honey in the pot, and mix well. Arrange the onion in the center to form a rack for the ham and place the ham on top, flat side down. It should sit just above the wine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil over medium-high heat, then reduce the heat to low, cover and simmer, basting after 15 minutes, until the ham is heated through, 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oven to 450 degrees. Line a sheet pan with foil. Combine the brown sugar, mustard and remaining tablespoon honey in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer the ham to the foil-lined pan using 2 sturdy metal spatulas. The slices should have fanned open. If they haven’t, separate the slices, nudging them into a pretty arrangement. Add 1 tablespoon cooking liquid from the pot to the brown sugar mixture and stir until smooth. (Save the remaining cooking liquid for stews or braises.) Pour over the ham, spreading evenly all over the top and not letting too much spill onto the foil. Fold up the sides of the foil to form a little boat to hold any ham juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake just until the topping is crackling and caramelized, 10 to 15 minutes. Carefully transfer to a serving platter with the spatulas, then pour the juices from the foil all over the ham. Serve immediately, with the onions from the pot, if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023093-honey-ham"}