{"@context": "http://schema.org", "@type": "Recipe", "name": "Ryazhanka (Fermented Caramelized Milk)", "description": "Ryazhanka, a classic Ukrainian drink, is cool, tangy and lightly sweet, like yogurt with a touch of dulce de leche. This recipe comes from Olga Koutseridi, who spent her childhood summers in Mariupol, Ukraine, where vendors sold chilled ryazhanka that she’d guzzle after a day at the beach. The slight caramel flavor comes from slowly baking whole milk, which can be done in the oven or a slow cooker, before mixing it with a fermented starter like sour cream or kefir. ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2022/05/18/dining/16UKRAINIAN-RECIPESREX2/merlin_206153238_d1dff62e-14ab-4920-a476-3e4c1f276a3d-articleLarge.jpg", "totalTime": "P3D", "recipeYield": "About 7 cups", "recipeCuisine": "eastern european", "recipeCategory": "non-alcoholic drinks", "keywords": "dutch oven, kefir, milk, slow cooker", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 77}, "recipeIngredient": ["8 cups whole milk", "3 to 4 tablespoons plain whole-milk kefir (see Tip) or sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using an oven, heat to 225 degrees. Place the milk in a Dutch oven (if baking the mixture) or large, heavy saucepan (if using a slow cooker) and bring to a simmer over medium heat, stirring from time to time so the milk doesn’t scorch. It will take about 15 minutes to get to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the oven, if using, and bake, uncovered, until the top is a deep caramel brown, about 6 hours. If using a slow cooker, transfer the milk to the slow cooker, cover and cook on low for 8 to 10 hours or on high for 4 to 6 hours, until the top is caramel brown. You can discard or save the skin that develops on top of the milk, refrigerating it in an airtight container. Traditionally, the skin is served on top of a glass of ryazhanka. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooked milk directly to jars or first to liquid measuring cups to cool the milk and determine how much you have. Let cool at room temperature, uncovered, to 115 degrees. You do not want to add kefir to hot milk, as the heat will kill the bacteria. Add 1 tablespoon kefir for every 2 cups cooked milk. (You’d use 1 tablespoon kefir per pint jar, 2 tablespoons per quart jar, or 3½ tablespoons kefir total for 7 cups cooked milk.) Stir or whisk the kefir until fully incorporated. If the mixture isn’t already in jars, divide among jars. Cover the jars with coffee filters and secure around the tops with rubber bands or string. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leave the jars in a warm place until the ryazhanka develops a consistency that’s thicker than kefir but thinner than yogurt, 24 to 48 hours, depending on the temperature of your kitchen. You might see some separation between liquid and solids. The flavor will be both sweet and sour from the fermentation. Cover the jars with their lids and refrigerate until chilled. The ryazhanka can be refrigerated for up to 7 days."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023161-ryazhanka-fermented-caramelized-milk"}