{"@context": "http://schema.org", "@type": "Recipe", "name": "Celery Victor Salad", "description": "At <a href=\"https://www.nytimes.com/2022/05/24/dining/ingas-bar-review-pete-wells.html\">Inga’s Bar</a> in Brooklyn, this special salad is prepared in a professional kitchen with the resources to create its many components on a rolling basis. But the chef Tirzah Stashko’s exacting recipe can produce restaurant-worthy results at home if you set aside time to tackle its parts in advance. Inspired by the classic dish created by Victor Hirtzler, the chef at San Francisco’s Hotel St. Francis from 1904 to 1926, Ms. Stashko’s dish is more audacious: While Mr. Hirtzler braised celery until sweet, subtle and succulent, Ms. Stashko bolsters the softened stalks with bitter greens and piquant mustard seeds, then slicks them with mashed anchovies, capers and garlic. There is nothing subtle about it, but the complexity of each bite will validate your efforts.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2022/07/27/dining/aw-celery-victor/aw-celery-victor-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "project, salads and dressings, appetizer, side dish", "keywords": "anchovy fillets, celery, mustard seed, scallion, spigarello", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 324}, "recipeIngredient": ["2 tablespoons olive oil", "2 large carrots, peeled, roughly chopped, then pulsed in a food processor until minced", "1 1/2 quarts/48 ounces vegetable stock", "1 lemon, quartered", "12 large fresh thyme sprigs", "2 garlic cloves, smashed ", "1 tablespoon whole black peppercorns", "2 dried bay leaves", "4 teaspoons kosher salt", "1 head of celery, fresh green leaves reserved; stalks separated, trimmed and halved crosswise", "12 scallions, trimmed and halved crosswise, whites and greens separated", "1/2 cup white wine vinegar", "2 1/2 tablespoons yellow mustard seeds", "2 tablespoons granulated sugar", "1 1/2 tablespoons finely minced shallot", "1 tablespoon kosher salt (such as Diamond Crystal) ", "6 medium jarred anchovies in oil", "1 tablespoon brined capers", "1 large garlic clove, finely grated", "1 teaspoon red-pepper flakes", "4 teaspoons extra-virgin olive oil", "6 cups spigarello (or baby kale, or trimmed Tuscan kale), torn into bite-size pieces", "1 cup shaved Parmesan (about 4 ounces), plus more to taste", "1 cup flat-leaf parsley leaves", "4 teaspoon sherry vinegar mixed with 2 teaspoons extra-virgin olive oil, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the stock for the braised celery and scallions: In a large pot, heat 2 tablespoons olive oil over medium-low. Add the carrots and cook, stirring occasionally, until softened, about 5 minutes. Add the stock and bring to a boil over high. Once it comes to a boil, reduce the heat to medium-low and simmer until the carrots are soft and impart their sweetness, about 30 minutes. Strain liquid, discarding solids, and return to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the stock simmers, make the pickled mustard seeds: In a small pot, combine the vinegar, mustard seeds, sugar, shallot and salt. Stir to combine, then cook over low heat, bubbling very gently, until mustard seeds are plump, about 15 minutes. Let cool until room temperature, then refrigerate until chilled. (Makes 1/2 cup; see Tip.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the stock continues to simmer, make the anchovy-garlic paste: Finely chop the anchovies and capers, occasionally smashing and spreading them using the flat side of your knife, until they start to form a paste. In a small bowl, stir together the anchovies and capers with the garlic, red-pepper flakes and olive oil until combined. (Makes 1/4 cup.) Refrigerate until serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue preparing the braised celery and scallions: Once the carrot stock has been cooked and strained, squeeze the lemon quarters over the carrot stock, then plop the squeezed pieces into the stock. Add the thyme, garlic, black peppercorns, bay leaves and salt. Bring to a simmer over medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once it simmers, cook the celery: Add the celery in two batches, one layer at time, simmering until tender, about 10 minutes per batch. (Cooked celery should bend a little, when lifted with tongs, without going totally limp.) Using tongs, transfer celery to a wide, shallow dish that can hold the celery, scallions and braising liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the scallions in the stock: Add the firmer scallion whites and cook 2 minutes, then add the more tender scallion greens, and cook another 2 minutes, until all scallion pieces are tender. Add scallions to the cooked celery. Strain the stock over the scallions and celery, discarding the solids, and let the mixture cool at room temperature, about 30 minutes. Cover and refrigerate until chilled, at least 1 hour or, ideally, overnight. (The braised vegetables will continue to absorb flavor but retain texture; they’ll keep, refrigerated, up to one week.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, strain the braised vegetables. (Reserve the liquid to use as a stock; poach fish in it, add to soups, stews or pasta, or dip bread in it.) Slice the celery and scallions on a sharp angle into 1 1/2-inch-long segments, then add them to a very large bowl. Add the spigarello, Parmesan, parsley and reserved celery leaves, plus the anchovy paste and the sherry vinegar mixed with olive oil; toss to coat. The salad should have the right balance of salt, acid and heat, with no ingredient overshadowing the other. Season with extra vinegar or olive oil, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Plate the salad, mounding in the center of the plate. Dot with 2 to 3 very small spoonfuls of mustard seeds, to taste, and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023368-celery-victor-salad"}