{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry-Orange Scones", "description": "Cranberries and orange are a classic sweet-tart pairing in these scones, which are quick-to-make but super satisfying. Folding the dough a few times, and using a combination of buttermilk and cream creates a flaky and tender texture that is irresistible. The glaze adds another punch of orange flavor, but it is totally optional, if you prefer a simpler scone. The scones freeze well after baking, but for the best texture, make sure to defrost them at room temperature and warm gently before serving. Feel free to swap in another citrus fruit for the orange, and just about any other dried fruit for the cranberries. Tart cherries and lime also make a great combination.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2022/10/06/dining/ya-cranberry-orange-scones-rex/merlin_213671157_70514fad-8f42-4371-9a8f-4a2410342166-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "9 scones", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, easy, quick, snack, dessert", "keywords": "buttermilk, dried cranberry, freezer friendly, orange, scone, fall, winter, thanksgiving", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 624}, "recipeIngredient": ["1 medium orange", "1/4 cup/50 grams granulated sugar, plus more for sprinkling", "2 1/4 cups/288 grams all-purpose flour, plus more for dusting", "1 tablespoon baking powder", "1/2 teaspoon fine salt", "1/2 cup/113 grams unsalted butter, cold and cut into cubes", "1 cup/130 grams dried cranberries, roughly chopped", "1/2 cup/115 grams buttermilk, cold", "1/2 cup/115 grams heavy cream, cold, plus more to brush over the scones", "1 cup/100 grams confectioners’ sugar", "4 to 6 teaspoons orange juice", "Pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees and line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Zest the orange into a large bowl. (You should have about 2 teaspoons of zest.) Reserve the remaining orange for the glaze. Add the 1/4 cup granulated sugar to the zest and use your fingers to rub the zest into the sugar. The mixture will be very moist and fragrant. Add the flour, baking powder and salt and whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter to the bowl and toss to coat in flour. Use your fingers or a pastry blender to work the butter into the flour until it is the size of small peas. Add the cranberries and stir to combine. Make a well in the center of the mixture and add the buttermilk and cream. Use a fork to gently stir the mixture into a shaggy dough. (It’s OK if there are a few loose, floury pieces of dough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump the dough onto a lightly floured surface and pat it into a 1-inch-thick rectangle. Fold the dough in half then pat it into a rectangle again and fold it one more time. Pat the dough into a square that is about 7 inches wide and 1 inch thick, then cut it into 9 pieces. Transfer the dough to the prepared baking sheet, brush the tops of the scones with a bit of cream and sprinkle with more granulated sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake scones until golden brown and cooked through, 18 to 22 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the scones are baking, make the glaze, if desired: Juice the orange. Add the confectioners’ sugar, 4 teaspoons of orange juice and a pinch of salt to a bowl. Whisk until smooth, adding more juice as needed to make a thick, but pourable glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the scones cool for about 15 minutes, then drizzle or brush the glaze over the scones. These are best the first day, but you can store any leftover scones in an airtight container for a day or two. They also keep well in the freezer for up to 2 weeks."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023483-cranberry-orange-scones"}