{"@context": "http://schema.org", "@type": "Recipe", "name": "Khoresh Rivas (Savory Rhubarb and Bean Stew)", "description": "In Iranian cuisine, rhubarb is often used in savory dishes rather than in sweet ones. The hearty pinkish-red stalks, which cook down quickly and tenderize, provide just the right amount of tang to herb-based stews like khoresh rivas. Typically, this bright and flavorful dish is prepared with red meat, but hearty butter beans star in this vegetarian version. Fresh herbs are used in impressively large amounts in this cuisine, often holding their own as main ingredients. Mint and parsley are a common combination for the base of many stews. Gently frying the herbs separately before adding them to the stew concentrates their flavors, adding layers of depth. This stew tastes even better the next day. Serve khoresh rivas with rice and a side of plain yogurt.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/04/25/dining/nd-rhubarb-and-bean-stew/merlin_205954446_a6157d94-86a6-4841-a901-ba3d6b1a2311-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, lunch, beans, soups and stews, main course", "keywords": "mint, rhubarb, spring, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 444}, "recipeIngredient": ["1 tablespoon plus a pinch of granulated sugar, plus more to taste", "A pinch of saffron threads (about ¾ teaspoon)", "1/2 cup plus 1 tablespoon extra-virgin olive oil, plus more as needed", "3 large bunches parsley (about 12 ounces), tough stems trimmed, leaves and tender stems finely chopped (about 3 cups; see Tip)", "2 large bunches mint (about 5 ounces), stems trimmed, leaves finely chopped (about 2 cups; see Tip)", "1 large yellow onion, finely chopped", "Kosher salt and black pepper", "1/2 teaspoon ground turmeric", "3 (15-ounce) cans butter beans or cannellini beans, rinsed and drained", "3 tablespoons lemon juice, plus more to taste", "2 to 3 large red rhubarb stalks (about 8 ounces), cut diagonally into 1-inch pieces", "Cooked rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a few tablespoons of water to a boil in a small pot. Let the boiling water stand for 2 minutes to allow the temperature to drop slightly while you grind the saffron. Using a mortar and pestle (or a small bowl and the handle of a wooden spoon), grind a pinch of sugar with the saffron to a fine powder (you should have about ¼ teaspoon total). Add 2 tablespoons of the hot water, gently stir, cover and let steep until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pan, heat ¼ cup of olive oil over medium. Add the parsley and cook, stirring frequently, until fragrant and slightly darkened, about 8 minutes. Drizzle in more oil if the pan seems too dry. Add the mint and cook, stirring frequently, until fragrant, about 5 minutes. Keep in mind that mint burns very quickly. Remove from the heat and set aside until ready to use. (You’ll reuse this pan.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep sauté pan with a lid, or a Dutch oven, heat ¼ cup of the olive oil over medium-high. Add the onion and cook, stirring frequently, until golden brown, about 10 minutes. Sprinkle with a little salt, and reduce the heat to medium. Add the turmeric, stir and cook until fragrant, about 30 seconds. Add the beans, season well with salt and pepper, and cook, gently stirring without breaking the beans, until the flavors have mingled, about 5 minutes. Taste a bean and make sure it’s salted to your liking. The turmeric might feel overpowering at this point, but it will mellow as the stew simmers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the beans, add the parsley and mint mixture (keeping the pan handy), 2 cups water and half of the saffron water, and season with salt. Gently stir and bring to a rapid simmer. Partly cover, reduce the heat to low and simmer, occasionally stirring, for 30 minutes, until the flavors have mingled and the oil rises."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rest of the saffron water, the lemon juice and 1 tablespoon sugar. Stir and simmer, partly covered, for 15 minutes. Taste as the stew simmers and season as needed. Add more water to the stew if necessary to make it juicier, or remove the lid to reduce the liquid. There should be plenty of liquid to spoon over rice, but it shouldn’t be soupy. The stew can be made 1 day in advance up to this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, wipe clean the reserved pan from the herbs. Add the remaining 1 tablespoon of olive oil to the pan and heat over medium. Add the rhubarb and cook until the color deepens on each side, about 2 minutes per side. You’re not fully cooking the rhubarb here; it should maintain its shape and still have a slight bite to it, as it will finish cooking in the stew."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently place the rhubarb pieces in the stew, increase the heat to medium-low and cook, partly covered, until the rhubarb is tender and releases its tangy flavor, about 10 minutes. Don’t stir the rhubarb; you want it to maintain its shape and not turn mushy. Taste the stew as it simmers; add more lemon juice for extra acidity, if needed, and more sugar for balance, if you like. Serve over rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023153-khoresh-rivas-savory-rhubarb-and-bean-stew"}