{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta With Asparagus, Peas and Mint", "description": "Buttery polenta serves as a soft, savory bed for asparagus and peas in this verdant, vegetable-rich main course. Sautéed shallots add sweetness, while fresh mint lends brightness to a satisfying yet light meal. You can substitute any soft herbs for the mint or use a combination for the most complex flavor. And, if you’re short on time, instant polenta will work in place of regular, too. Just follow the directions on the package to cook it.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/05/11/dining/06Apperex-polenta/merlin_204759390_6b518d19-ce2c-462e-bad4-d17d5d63d404-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "pastas, main course", "keywords": "asparagus, parmesan, polenta, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 640}, "recipeIngredient": ["1 1/2 cups polenta, coarse-grind cornmeal or corn grits (see Tip)", "1 teaspoon fine sea or table salt, plus more as needed", "4 to 6 tablespoons unsalted butter", "1/4 cup grated Parmesan, or more to taste, plus shaved Parmesan for serving", "2 tablespoons extra-virgin olive oil, plus more as needed", "2 large or 4 small shallots (or 1 small red onion), thinly sliced", "3 thinly sliced garlic cloves", "2 tablespoons dry vermouth or white wine", "2 pounds asparagus, trimmed and cut into 1-inch pieces", "1 1/2 cups frozen or fresh peas (no need to thaw frozen peas first)", "1/3 cup vegetable or chicken stock", "1/2 cup torn mint leaves, or use parsley, cilantro or a combination of any soft herbs", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If cooking polenta on stovetop: In a medium pot over high heat, combine 4 1/2 cups water, polenta and 1 teaspoon salt. Bring to a simmer, stirring frequently, until thickened, 30 to 40 minutes, depending on how finely the polenta is ground (coarse-ground polenta takes longer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Alternatively, cook polenta in oven: Heat oven to 350 degrees. In a medium Dutch oven or other oven-safe pot over high heat, bring 4 1/2 cups water, polenta and 1 teaspoon salt to a boil. Reduce heat to medium, stirring constantly until the mixture starts to thicken slightly, 3 to 5 minutes. Cover pot and transfer to the oven. Bake for 20 minutes, then give the mixture a stir. If it looks dry, add another 1/2 cup water. Cover the pot once more, and continue to bake for another 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When polenta is thick and creamy, stir in 2 to 4 of the tablespoons butter (depending on how buttery you like it) and the Parmesan. Taste and add more Parmesan and salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the polenta cooks, prepare the vegetables: In a large skillet, heat oil over medium. Add shallots and sauté until tender and golden, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in garlic and cook for another minute or two, until fragrant and very lightly golden in spots. Add vermouth and cook until alcohol evaporates, about 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in asparagus and peas, and cook until vegetables are glossy, 2 to 3 minutes. Add stock, remaining 2 tablespoons butter and a large pinch of salt, and bring to a simmer. Cook until vegetables are tender and sauce thickens slightly, 2 to 8 minutes. (Thicker asparagus will take longer to soften.) Stir in the mint. Taste and add more salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon polenta into bowls, top with vegetables and their sauce, and grind on lots of fresh pepper. Finish with shaved Parmesan."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023177-polenta-with-asparagus-peas-and-mint"}