{"@context": "http://schema.org", "@type": "Recipe", "name": "Samgyeopsal", "description": "This pork belly dish is less a recipe and more a road map to dinner. A chill way to have Korean barbecue at home, samgyeopsal, or “three-layer meat,” refers to pork belly’s fat cap and the two leaner layers of meat below it, one light and one dark. Crisp slivers of pork are wrapped in various lettuces and dabbed with doenjang honey and punchy slivers of raw garlic. The lightly peppered, vinegared freshness of pa muchim, an all-occasion scallion salad often served with the grilled meats at Korean barbecue restaurants, is a welcome accompaniment to rich foods like fried or rotisserie-style chickens, pan-seared pork chops, and grilled bulgogi, galbi and samgyeopsal. Don’t skip the sesame oil dipping sauce; its nuttiness lets the pork belly shine.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/06/15/dining/15ESSENTIALSrex7/15ESSENTIALSrex7-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, meat, main course", "keywords": "doenjang, pork belly, rice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "recipeIngredient": ["4 scallions, trimmed, cut into 3-inch segments, then very thinly sliced lengthwise into matchsticks", "1 tablespoon rice vinegar", "2 teaspoons gochugaru", "1 teaspoon toasted sesame oil", "Pinch of granulated sugar", "Coarse kosher salt and freshly ground black pepper", "1 pound assorted lettuces, such as Little Gem, endive and perilla, leaves separated", "4 garlic cloves", "2 tablespoons doenjang", "1 tablespoon honey", "Coarse kosher salt and freshly ground black pepper", "4 tablespoons toasted sesame oil", "2 pounds thinly sliced pork belly, cut into 2-inch strips (see Tip)", "Steamed white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pa muchim: In a medium bowl, toss to combine the scallions, vinegar, gochugaru, sesame oil and sugar. Season to taste with salt and pepper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the samgyeopsal spread: Wash and dry the lettuces and arrange on a large platter. Thinly slice the garlic cloves and place on a small plate, scooching the slices to one side. Make the doenjang honey by dabbing the doenjang onto the other side of the plate and drizzling the honey over the doenjang. Make the dipping sauce by adding 1 teaspoon salt and a generous grind of black pepper to 4 small dishes (or however many are dining); drizzle each dish with 1 tablespoon sesame oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pork belly: Heat a large skillet over medium-high. Add half of the pork belly and cook, stirring occasionally, until the edges are crispy and lightly browned but the centers are still plump and meaty, 5 to 7 minutes. Transfer to a towel-lined platter. Drain the fat from the pan and discard. Repeat with the remaining pork belly. Serve immediately with bowls of fresh white rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To eat, dip the fried pork belly into the dipping sauce, then place on a lettuce leaf. Smear some of the doenjang honey onto the pork belly, top with a slice of raw garlic and a small chopstickful of pa muchim. Fold the lettuce wrap into a bundle and eat. Chase with the white rice. Another lovely thing to do: Dip the lettuces into the doenjang honey or dipping sauce, and eat them like crudités between bites of crispy pork belly."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023240-samgyeopsal"}