{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Smashed Chicken Breasts With Gin and Sage", "description": "This stellar chicken dinner, adapted from Amy Thielen’s forthcoming cookbook “Company” (W. W. Norton, 2023), is full of delights and surprises. Boneless, skin-on breasts, cooked almost entirely on their skin sides, gain a savory, juniper-pierced jus and taste fabulous in between bites of crispy sage leaves. “If someone were to stand over a pan of sautéing chicken holding an ice-cold martini and happen to slosh it into the pan, you would have this sauce,” she writes.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2023/01/29/multimedia/29EAT-crispy-smashed-chicken-breasts-with-gin-and-sage-wmtk/29EAT-crispy-smashed-chicken-breasts-with-gin-and-sage-wmtk-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "chicken breast, gin, sage", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 839}, "recipeIngredient": ["24 sage leaves", "3 large skin-on chicken breasts", "6 garlic cloves, smashed and peeled", "Fine sea salt and freshly ground black pepper", "3 tablespoons olive oil", "3 tablespoons cold butter", "1/4 cup gin", "3/4 cup chicken stock, preferably <a href=\"https://cooking.nytimes.com/recipes/1018527-chicken-stock\">homemade</a>", "1 to 2 tablespoons fresh lemon juice, plus wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the sage leaves and dry thoroughly with a towel. If the chicken breasts have the rib cage attached, remove it — and any other bones — with a sharp knife (or ask your butcher to do it for you). Don’t trim off any skin or fat. Set each chicken breast skin side down on a cutting board and pound with a large meat mallet to even out the hump, flattening the chicken to an even thickness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken in a large bowl or baking dish and add the garlic cloves, 12 sage leaves, 1/2 teaspoon salt and 1/2 teaspoon pepper. Turn the chicken to coat evenly in the seasonings, then arrange the chicken skin side up on top of the garlic and sage in a single layer. Cover and refrigerate for at least 1 hour and up to 6 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil and 1 tablespoon butter in a very large stainless steel sauté pan over medium-low. When the butter melts, add remaining 12 sage leaves and fry, turning and flipping them gently with a fork, until crisp, about 3 minutes. Remove the crispy sage to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to medium and add the chicken, skin side down, along with its garlic and sage. Cook the chicken slowly but steadily, lowering the heat if the oil starts to smoke, until the skin crisps and turns a deep caramel color and the white sign of doneness creeps two-thirds of the way up the sides of the breasts, 25 to 30 minutes. Be prepared to stay stoveside, pressing on the chicken with a spatula to force contact with the pan and moving the chicken when it releases naturally from the pan for even cooking. Remove any garlic cloves or sage leaves that threaten to burn and save them for the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken skin has turned dark amber, flip the chicken, lower the heat to medium-low and cook gently until browned, 5 to 10 minutes. Turn off the heat. The residual heat will continue to cook the chicken while you finish the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a serving platter and add the gin to the pan. Turn the heat to medium-low and simmer for 30 seconds to burn off the sharpness, then add the chicken stock and cook, scraping at the browned residue on the bottom of the pan to loosen it, until the liquid has reduced by half, 2 to 3 minutes. (You should have about 1/2 cup of sauce.) Add the lemon juice, any reserved garlic cloves and the remaining 2 tablespoons cold butter. Remove from the heat and swirl the pan to emulsify the sauce; taste and adjust salt and pepper as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the chicken breasts to a cutting board and slice crosswise, taking care to cut neatly through the skin, then return to the platter. Pour the sauce around the perimeter of the platter — not over the chicken, which would dampen and soften the crispy skin — and top with the crispy sage leaves. Garnish with lemon wedges and serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023884-crispy-smashed-chicken-breasts-with-gin-and-sage"}