{"@context": "http://schema.org", "@type": "Recipe", "name": "Sopa Tlaxcalteca (Creamy Chicken Vegetable Soup)", "description": "Sopa Tlaxcalteca, from the central state of Tlaxcala, is a seasonal chicken soup simmered with ripe local produce like corn, carrots, mushrooms, squash and squash blossoms. What makes it special is the whole milk that is added to the simmering broth. It lends a very slight creaminess that accentuates the sweetness of the vegetables and amps up the richness of the chicken stock. There are many soups in Mexico, but this is easily one of the most comforting.", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/06ESSENTIALSREX4-sopa-tlaxcalteca/merlin_214158522_6b575a58-c69b-4201-9b8c-6fff7058c915-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, main course", "keywords": "chicken soup, chicken thigh, chiles de árbol, corn, corn tortilla, milk, mushroom, squash, zucchini, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 182}, "recipeIngredient": ["1 tablespoon extra-virgin olive oil", "3 pounds bone-in, skin-on chicken thighs", "8 ounces mixed wild mushrooms, cleaned and cut or torn into bite-size pieces", "2 ears corn, shucked and kernels removed from cobs", "1 medium white onion, chopped", "1 large carrot, peeled and cut into 1/2-inch rounds", "2 garlic cloves, finely grated", "Kosher salt (such as Diamond Crystal)", "1 pound seasonal squash, such as zucchini, crook neck, pattypan, butternut, acorn or kabocha, cut into 2-inch pieces (peel winter squash if you like)", "3 cups whole milk", "16 squash blossoms (about 4 ounces), stems, stamen and pistils removed, blossoms torn", "4 cups vegetable oil, for frying", "8 chiles de árbol, stem on, seeds in", "8 corn tortillas, cut into thin strips", "Crema, queso fresco, chopped onion, chopped cilantro and lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the soup: Heat olive oil in a large heavy pot over medium-high and cook chicken, skin side down, until deep golden brown, 4 to 8 minutes. Flip chicken and cook until light golden brown, 4 to 5 minutes. Transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add mushrooms to the same pot, arrange in an even layer and cook, undisturbed, for 3 minutes until browned. Toss and cook on the second side, undisturbed, for 2 minutes, until browned. Transfer to the bowl with the chicken. Add corn, onion, carrot and garlic to the pot. Season with 5 teaspoons salt and cook, stirring vegetables occasionally, until onion is beginning to brown, 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add squash, chicken, mushrooms and any accumulated juices, milk and 5 cups water. Bring to a boil, reduce heat to maintain a simmer and cook, occasionally stirring and skimming, until the chicken is tender and is almost falling off the bone, 45 to 55 minutes. (Soup should be cooked at a gentle simmer to prevent the milk from foaming on the surface.) Stir in squash blossoms and remove from heat. Season with salt, if necessary. Let sit 15 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fry the tortilla strips: Heat vegetable oil in a Dutch oven or other heavy deep pot over high until very hot, about 375 degrees. Carefully add the chiles to the pan and fry, turning frequently, until they turn a deep brick-red color, about 15 seconds. Transfer to a paper towel-lined sheet pan, reserving the oil, which will now be seasoned with the flavor of the chiles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjusting the heat as necessary to maintain the temperature and working in batches, fry the tortilla strips, stirring frequently, until deep golden brown and crispy, 2 to 3 minutes. Transfer to the paper-towel lined sheet tray and sprinkle with salt. Continue with remaining tortilla strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle soup into bowls and top with tortilla strips, crumbled fried chiles, a drizzle of crema, a sprinkle of queso fresco, chopped onion, chopped cilantro and a squeeze of lime."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023503-sopa-tlaxcalteca-creamy-chicken-vegetable-soup"}