{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic Chicken With Giardiniera Sauce", "description": "Traditional <a href=\"https://cooking.nytimes.com/recipes/1020355-skirt-steak-with-salsa-verde-salad\">Italian green sauces</a> typically include a long list of ingredients: chopped herbs, vinegar or citrus juice, garlic, shallots, capers and anchovies to name a few. But this recipe streamlines the process by mixing fresh green herbs with giardiniera, a condiment of pickled mixed vegetables that contributes the oil, vinegar and punchy flavors. Giardiniera, which is Italian for “gardener,” is a colorful and crunchy mixture typically made with cauliflower, peppers, celery and carrots. It’s commonly found on supermarket shelves with the pickled peppers, and is used on Italian beef and muffuletta sandwiches as well as antipasto plates. While spices, the balance of vinegar to oil, and vegetables vary, any will work here. Eat this combination on its own, with orzo or salad greens, or in a sandwich. ", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2023/01/10/multimedia/as-garlic-chicken-gfhv/as-garlic-chicken-gfhv-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weeknight, poultry, main course", "keywords": "chicken breast, chicken thigh, fresh herb, garlic", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "recipeIngredient": ["1 cup soft herb leaves, coarsely chopped (see Tip)", "3/4 cup mild or hot giardiniera, coarsely chopped if necessary", "3 tablespoons giardiniera brine", "1/4 cup extra-virgin olive oil, plus more as needed", "2 garlic cloves, finely grated", "Kosher salt (such as Diamond Crystal)", "Black pepper", "11/2 to 2 pounds boneless, skinless chicken breasts or thighs, patted dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together the herbs, giardiniera and giardiniera brine. (It might look dry but it gets saucier as it sits.) In a large bowl, stir together the olive oil, garlic, 1 teaspoon salt and a few grinds of black pepper. If you’re using chicken breasts, pound to an even ½-inch thickness with a heavy skillet or meat pounder. Add the chicken to the garlic oil and toss until well coated. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large (12-inch) skillet over medium-high. Working in batches to avoid crowding, add the chicken to the skillet and cook until golden brown underneath, 4 to 5 minutes. Flip and cook until cooked through, 2 to 5 minutes. (Clean the skillet between batches if burnt bits collect in the skillet.) Transfer to a plate browned-side up, spoon some of the sauce over the chicken, then let rest for 5 to 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the sauce. If it’s too assertive, add a teaspoon or two of olive oil. If it’s too mild, add salt. Serve the chicken with more sauce passed at the table."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023818-garlic-chicken-with-giardiniera-sauce"}