{"@context": "http://schema.org", "@type": "Recipe", "name": "Tea Eggs", "description": "In the 18th century, the Qing dynasty scholar Yuan Mei wrote about cooking eggs in a solution of tea leaves and salt in “The Way of Eating.” Now, tea eggs are prepared throughout China, Hong Kong, Taiwan, Southeast Asia and in diaspora communities the world over. Known for their marbled design and savory soy flavor, the eggs are boiled, then cracked and soaked in tea blended with spices. The liquid seeps beneath the cracks to form fine lines all over the eggs while seasoning them. You can also simply marinate them without their shells and end up with a more robust taste. Adjust the seasonings below to your taste, if you like, and then enjoy the eggs on their own with a cup of tea or any way you would enjoy boiled eggs — in rice bowls, noodles, salads and other vegetable dishes.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/04/13/dining/08korex2-eggs/08korex2-eggs-articleLarge.jpg", "totalTime": "P1DT30M", "recipeYield": "12 eggs", "recipeCuisine": "chinese", "recipeCategory": "dinner, lunch, snack, poultry, appetizer, side dish", "keywords": "egg, soy sauce, tea", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 211}, "recipeIngredient": ["12 large eggs", "1/2 cup soy sauce", "2 tablespoons shaoxing wine or dry sherry", "2 teaspoons granulated sugar", "4 slices peeled fresh ginger", "1 whole star anise", "1 teaspoon whole Sichuan or black peppercorns", "1 teaspoon coarse salt", "3 Chinese tea bags or ⅓ cup loose tea, such as oolong or jasmine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the eggs out of the refrigerator to let them warm up a bit. (Very cold eggs can crack when they hit boiling water.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the soy sauce, shaoxing wine, sugar, ginger, star anise, peppercorns and salt in a medium saucepan. Add 3 cups water and the tea bags, and bring to a boil over medium-high heat. Reduce the heat to maintain a bare simmer while the eggs cook and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a few inches of water in a large saucepan to a boil over high heat. Using a spoon, carefully and quickly add the eggs one at a time. Cook for 6 minutes for jammy yolks, 7 minutes for just-set yolks and 8 to 10 minutes for hard-boiled yolks. Pour the boiling water out of the saucepan, keeping the eggs back with a lid or spatula, then fill the saucepan with cold water from the tap. Let stand until the eggs are cool enough to handle, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To create a marbled look, tap the eggs with the back of a spoon to create hairline fractures all over with some bigger cracks but without breaking off the shells. For solid-colored eggs, peel the eggs completely. Transfer the eggs to the soy sauce mixture. Remove from the heat. Cover the saucepan or transfer everything to an airtight container and refrigerate for at least 12 hours and up to 7 days before peeling the eggs and eating. For the clearest design, be sure to peel the eggs without removing the fine membrane between the shells and eggs."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023094-tea-eggs"}