{"@context": "http://schema.org", "@type": "Recipe", "name": "Ricotta Polpette in Tomato Sauce", "description": "This recipe is quintessential cucina povera, which roughly translates as ‘frugal cuisine of the poor’ in Italian, and it originated in Calabria. Its simple deliciousness comes from a handful of ingredients. In mountainous Calabria, where cows cannot roam free, goat’s-milk ricotta would typically be used, but recipes evolve over time and space, and cow’s-milk ricotta is commonly used in North America. Most translate the Italian word ‘polpetta’ as meatball, but in Italy, it is any mixture of ingredients rolled into a ball and cooked. This meatless variation’s base of ricotta is mixed with egg and bread crumbs, then rolled, poached in tomato sauce until fork-tender, and finally sprinkled with cheese. They make a perfect side to a first course of pasta or can be served on their own, with crusty bread, for sopping up the sauce.", "author": {"@type": "Person", "name": "Anna Francese Gass"}, "image": "https://static01.nyt.com/images/2022/09/29/dining/afg-ricotta-polpette/merlin_213671208_2553d655-4170-4155-acdf-5fca2ce34a06-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings (about 35 ricotta balls and about 7 cups of sauce)", "recipeCuisine": "italian", "recipeCategory": "dinner, dumplings, main course, side dish", "keywords": "basil, bread crumbs, crushed canned tomato, extra virgin olive oil, pecorino romano, ricotta, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 995}, "recipeIngredient": ["10 fresh basil leaves", "1/2 cup extra-virgin olive oil", "2 garlic cloves, peeled and lightly smashed", "1 teaspoon red-pepper flakes (optional)", "2 (28-ounce) cans/about 8 cups crushed tomatoes", "2 tablespoons tomato paste", "1 tablespoon kosher salt (such as Diamond Crystal)", "1 teaspoon freshly ground black pepper", "1 (32-ounce) container/about 4 cups whole-milk ricotta cheese (see Tip)", "2 ½ cups seasoned Italian bread crumbs", "3 large eggs", "1/4 cup finely grated Pecorino Romano cheese, plus more for serving", "1 tablespoon chopped fresh parsley, plus more for serving", "1 tablespoon kosher salt (such as Diamond Kosher)", "1 teaspoon freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: Tear 5 basil leaves in half; reserve the rest. Combine the torn basil, olive oil, garlic and red-pepper flakes (if using) in a small saucepan and cook over very low heat for 10 minutes, allowing the basil and garlic to steep in the oil. (Do not let the garlic get beyond medium brown in color.) Remove from the heat, strain the oil, discard the solids and set the infused oil aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or Dutch oven, combine the crushed tomatoes, tomato paste, salt and pepper with 2 cups water and the infused oil. Bring to a boil over medium-high heat, then immediately reduce to a simmer.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partially cover the pot and simmer the sauce over medium-low heat, undisturbed, while you prepare the ricotta polpette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, use a spatula to mix all the polpette ingredients until combined. (The mixture will be quite soft.) Wet your hands and pinch off approximately 2-tablespoon portions and roll them into balls between your palms. (They should each be about 2 inches wide and weigh about 40 grams.) Place each polpette on a baking sheet and repeat with the remaining mixture, making about 35 small balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all the polpette have been rolled, bring the sauce to a boil and carefully drop them into the sauce. Shimmy the pot back and forth gently, after each addition, to make room and to prevent the polpette from sticking to the bottom of the pot or to each other. Do not stir, as the balls will break apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pot with a lid and leave the polpette in the sauce, undisturbed, for 4 minutes. Remove the lid and shimmy the pot again. They will have begun to firm up. Cover the pot again and cook for another 10 minutes, until they are firm, plump and cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the polpette to a plate, topping them with spoonfuls of sauce, or transfer the polpette and sauce to a shallow serving bowl. Chop the remaining basil and sprinkle on top, and garnish with more grated cheese. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023488-ricotta-polpette-in-tomato-sauce"}