{"@context": "http://schema.org", "@type": "Recipe", "name": "Denver Omelet", "description": "The Denver omelet — a diner classic of eggs, bell peppers, onions, ham and often cheese — actually began as a sandwich made with those ingredients in the American West in the late 19th century. Its exact origins are fuzzy, but some historians think it was a modification of egg foo yong made by Chinese laborers working the transcontinental railroad, or a scramble made by pioneers masking spoiled eggs with onions. (Bell peppers were likely a later addition.) When the sandwich became popular in Utah, it was named the Denver sandwich after Denver City, Utah. By the 1950s, the Denver was one of the most popular sandwiches around, and at some point in the mid-20th century, diners swapped the sandwich bun for a knife and fork.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/08/01/dining/AS-Denver-Omelet/merlin_209008464_6c6c847f-3291-4224-bbfc-0acf61928b01-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, easy, for two, lunch, quick, one pot, main course", "keywords": "bell pepper, ham", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 316}, "recipeIngredient": ["6 large eggs", "Kosher salt (such as Diamond Crystal) ", "2 tablespoons unsalted butter", "1 small green bell pepper, seeds and stem removed, finely chopped (about 3/4 cup)", "1 small yellow onion, finely chopped (about 3/4 cup)", "Black pepper", "4 ounces ham steak or Canadian bacon, coarsely chopped", "1 1/2 ounces coarsely grated Monterey Jack or pepper Jack (heaping 1/3 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the eggs and 1/2 teaspoon salt; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium (10-inch) nonstick skillet, heat 1 tablespoon butter over medium-high. When foaming, add the bell pepper and onion, season lightly with salt and pepper and stir to coat in the butter. Shake into an even layer and cook, undisturbed, until browned underneath, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ham and cook, stirring occasionally, until the vegetables are tender, 2 to 3 minutes. Transfer the mixture to another medium bowl, add the cheese, and stir to combine. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat under the skillet to medium-low. Add 1/2 tablespoon butter and swirl to coat the pan. Whisk the egg mixture and pour half into the skillet. Cook without touching until the eggs around the edges of the pan are set, 30 seconds to 1 minute. Using a spatula, slightly pull the edge of the omelet in toward the center and, while holding the spatula in place, tilt the pan so that the egg runs to the empty skillet. Repeat this around the edge of the whole circle until the surface is nearly set but still shiny. (No runny egg will travel when you tilt the pan.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon half the vegetable mixture onto half the egg, cover the skillet with a lid or baking sheet, and cook until the egg is set and the cheese is melted, 1 to 3 minutes. Run the spatula around the edges, then fold the naked half over the filling. Slide the omelet onto a plate, then repeat with the remaining butter, egg and filling."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023378-denver-omelet"}