{"@context": "http://schema.org", "@type": "Recipe", "name": "Stew Peas and Spinners", "description": "Jamaican stew peas are ubiquitous to the island nation, and each version is as individual as the person cooking them. Red peas (kidney beans) are mellowed out with coconut milk and stewed alongside beef, pork, chicken or even vegetarian options. Allowing ample time to soak the peas before cooking makes for a streamlined process. And, as ever, your most crucial ingredient will be time. But the more you make this dish, the more it’ll gel alongside your personal preferences: more garlic, less meat, larger peppers or varied herbs. The choices are entirely yours. Spinners, flour dumplings that you roll into ropes between your hands, are essential to making this a full-fledged meal, adding texture and body to the stew.", "author": {"@type": "Person", "name": "Bryan Washington"}, "image": "https://static01.nyt.com/images/2022/10/09/dining/09EAT-stew-peas-and-spinners/merlin_213915771_9fa45770-c972-4acb-8ec7-1b6913d1c5db-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews, main course", "keywords": "all-purpose flour, beef stew meat, coconut milk, garlic, jamaican, kidney bean, plan ahead, pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 219}, "recipeIngredient": ["2 cups dried red peas (kidney beans)", "2 pounds salted pig’s tail, chopped, or 1 pound beef stew meat (such as chuck), cut into large chunks", "Salt and pepper", "5 garlic cloves, chopped", "3 scallions, chopped", "1 (13- to 14-ounce) can coconut milk (about 1 3/4 cups)", "1 Scotch bonnet or habanero chile", "3 thyme sprigs", "1 cup all-purpose flour", "Cooked rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse your peas, then soak them in a large pot of cold water in the refrigerator overnight or for at least 8 hours. Rinse the chopped pig's tail, if using, and soak in a bowl of cold water in the refrigerator overnight or for at least 8 hours. (If using beef, salt your chunks right before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour out water from the soaked peas, leaving the peas in the pot, then add garlic, scallions and drained pig’s tail or salted beef. Refill with water until everything is just covered. Bring to a simmer, then stir in coconut milk. Continue simmering for at least 2 1/2 hours, until meat is fork tender and peas are cooked through, skimming any foam that rises and replenishing with water as needed to keep solids covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chile and thyme. Continue simmering for 30 minutes, adjusting the seasoning to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While peas are stewing, form your spinners: In a medium bowl, stir flour and a pinch of salt. Then add 1/4 cup water, stirring with a wooden spoon until a dough forms. If the dough seems too dry and doesn’t come together, stir in more water, a teaspoon at a time. Pinch off a tablespoon’s worth of dough, and roll it in the palms of your hands to form a thin dumpling (about 5 inches long and scant 1/2 inch in diameter). Set aside, then repeat, spacing the spinners apart and continuing until you’ve used all of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fifteen minutes before serving, add spinners to the pot of stew peas, stirring them into the dish. Simmer until cooked through, about 15 minutes. Remove the pot from heat. Serve stew peas hot with white rice."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023536-stew-peas-and-spinners"}