{"@context": "http://schema.org", "@type": "Recipe", "name": "Biscuit Breakfast Sandwiches", "description": "This is the pleasure of brunch at home: a cozy sandwich that you eat as soon as you finish stacking it. Nice and hot, it’s pure joy with a cup of coffee. Crunchy brown tops give way to tender, buttery bread in these biscuits, which cradle fluffy scrambled eggs draped with melted cheese. Whether you slip in some bacon, sausage or ham is up to you, but you definitely want to slather <a href=\"https://cooking.nytimes.com/recipes/1023180-quick-raspberry-jam\">jam</a> all over the biscuits. It’s a salty-sweet combination inspired by the chef Jonathan Whitener and the pastry director Thessa Diadem of All Day Baby, a restaurant in Los Angeles, where they make thousands of biscuit sandwiches each week.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/05/18/dining/13Korex-sandwich/13Korex-sandwich-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 sandwiches", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, sandwiches, main course", "keywords": "egg, flour, jam", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 265}, "recipeIngredient": ["6 tablespoons/84 grams cold unsalted butter, cut into cubes, plus more for greasing the pan", "1 1/2 cups/208 grams all-purpose flour", "2 teaspoons granulated sugar", "2 teaspoons baking powder", "1 teaspoon fine salt", "2/3 cup/167 grams cold whole milk", "6 large eggs", "Salt and pepper", "2 tablespoons unsalted butter", "4 slices American cheese", "<a href=\"https://cooking.nytimes.com/recipes/1023180-quick-raspberry-jam\">Quick Raspberry Jam</a> or store-bought raspberry or strawberry jam, for spreading", "Cooked bacon, breakfast sausage patties or ham (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the biscuits: Position a rack in the center of the oven and heat the oven to 425 degrees. Butter a small baking sheet. (Keep the cubed butter cold.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the flour, sugar, baking powder and salt in a large bowl. Add the cold butter and toss to coat, then cut the butter into the flour using a pastry cutter or rub and pinch it in with your fingers until the mixture resembles coarse sand with no bits larger than the size of gravel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the milk all at once and quickly stir with a fork until the dough comes together in a shaggy mass. Use the fork to scoop and drop 4 even mounds of dough onto the prepared sheet, spacing apart. Gently pat the tops and sides to form round pucks; it’s OK if the tops are a little craggy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown, 20 to 23 minutes. Let cool on the pan on a rack while preparing the fillings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the fillings: Beat the eggs in a medium bowl until well mixed but not frothy. Season very generously with salt and pepper and beat again. Heat a medium nonstick or well-seasoned cast-iron skillet over medium until hot, 2 to 3 minutes. Add the butter, turn the heat to low and swirl the butter to evenly coat the bottom of the pan. When the butter has melted about halfway, add the eggs all at once. Cook, stirring gently, until mostly set but still a little wet, 1 to 2 minutes, then spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the bottom and edges are fully set, turn off the heat and cut the egg pancake in quarters using the spatula. Set a slice of cheese over each quarter. Slice each of the biscuits in half and spread jam on both halves. If you want bacon, sausage or ham, place them over the bottom halves. Slide the cheesy egg quarters over the bottom halves (or meat) and fold over any corners that stick out. Sandwich with the top halves and serve warm."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023179-biscuit-breakfast-sandwiches"}