{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Butternut Squash, Kale and Brown Butter", "description": "This pantry pasta turns cold-weather basics — pasta, squash, kale and butter — into something luxurious and deeply flavored thanks to </span><a href=\"https://cooking.nytimes.com/recipes/1021923-garam-masala\"><span> </span><span>garam masala</span></a><span>, the warming spice mix used in many South Asian dishes like <a href=\"https://cooking.nytimes.com/recipes/1020472-seekh-kebab-with-mint-chutney?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=24\">kebabs</a> and </span><a href=\"https://cooking.nytimes.com/recipes/1021415-vegetarian-kofta-curry?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=49\"><span> </span><span>curries</span></a><span>. But since this is a pantry pasta, you can substitute freely: Consider another nutty spice or two, like</span><a href=\"https://cooking.nytimes.com/recipes/1021925-five-spice\"><span> </span><span>five spice</span></a><span>, turmeric with chile powder, or cinnamon with crushed fennel seeds. Whole-wheat pasta stands up to the squash and spiced browned butter, but regular pasta will work as well. In place of squash, use chickpeas or carrot, and instead of kale, try something else green, like brussels sprouts, broccolini or mature spinach.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/09/13/dining/as-Pasta-With-Butternut-Squash-Kale-and-Brown-Butter/merlin_212616150_ff3fcbc7-ff4a-4866-bbce-c3d9c4e1c0fd-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, pastas, main course", "keywords": "brown butter, butter, butternut squash, garam masala, kale, spaghetti", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1268}, "recipeIngredient": ["Kosher salt (such as Diamond Crystal)", "1 tablespoon neutral oil, such as canola or grapeseed oil", "1 to 1 1/2 pounds butternut, honeynut, acorn or delicata squash, peeled if desired, halved, seeded and sliced 1/4-inch-thick crosswise", "1 pound whole-wheat spaghetti or linguine", "1 bunch Tuscan kale, ribs removed, leaves torn or coarsely chopped", "6 tablespoons unsalted butter, sliced", "1 1/4 teaspoons garam masala", "1/2 teaspoon red-pepper flakes, plus more as needed", "1 teaspoon finely grated lemon zest plus 2 tablespoons juice (from 1 lemon), plus more juice as needed", "Grated Parmesan, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Meanwhile, in a large Dutch oven or skillet, heat half the oil over medium-high. Add half the squash in a single layer, season with salt and cook, undisturbed, until browned underneath, 3 to 5 minutes. Scoot the squash to the side of the pot, piling it up as needed to make room, then add the remaining oil. Arrange the remaining squash in a single layer, season with salt and cook until browned, 3 to 5 minutes. (If there’s not enough room for the second batch, remove the browned squash to a plate while you cook the rest.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, add the pasta and cook according to package directions until al dente. During the last 3 minutes of the cooking, add the kale. Reserve 1 cup of the pasta water, then drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the squash is browned, return all the squash to the pot, if you set any aside while cooking the second batch. Reduce the heat to medium-low, add the butter and stir with the squash until the butter is golden, nutty smelling and foaming, 1 to 4 minutes. (If you’re using a dark pot, it can be hard to tell if the butter’s browned, so spoon some of the butter on the squash to see if the butter’s speckled brown.) Turn off the heat, add the garam masala and red-pepper flakes, and stir until fragrant, about 1 minute. Add 1 tablespoon of cold water (or an ice cube) and toss gently to stop the cooking, then set aside until the pasta is ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta and 1/2 cup pasta water to the squash mixture. Set over low heat and toss gently until the pasta is glossed with sauce. (Some squash pieces might break apart, which can be a good thing: better disbursement through the pasta.) If the pasta looks dry, add more pasta water as needed. Remove from heat and stir in the lemon zest and juice. Season to taste with more lemon juice, red-pepper flakes and salt. Top servings with grated Parmesan."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023461-pasta-with-butternut-squash-kale-and-brown-butter"}