{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken M’Hammer", "description": "M'hammer is a classic way of preparing tagine in Morocco in which roasted chicken legs are doused in a savory and lightly sweet sauce made of onions, paprika, cumin and turmeric. M’hammer, which means both reddish and grilled in Moroccan, refers to the ingredients as well as the way the dish is cooked. A generous amount of paprika is used in the marinade, giving it a brownish red color, and the chicken legs are cooked in the sauce, then charred under the broiler. Keep in mind that the color of your sauce will vary depending on the provenance and freshness of your spices. Serve this tagine with your side of choice: Bread would be the most traditional way to enjoy this deeply comforting dish, but couscous, rice or steamed greens would also work beautifully.", "author": {"@type": "Person", "name": "Nargisse Benkabbou"}, "image": "https://static01.nyt.com/images/2022/11/15/dining/nb-chicken-tagine-mhammer/nb-chicken-tagine-mhammer-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, poultry, main course", "keywords": "chicken leg, ground cumin, ground turmeric, sweet paprika, yellow onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "recipeIngredient": ["3 tablespoons olive oil ", "3 garlic cloves, grated", "2 teaspoons sweet paprika", "1 teaspoon ground cumin", "1/2 teaspoon ground turmeric ", "3/4 teaspoon fine sea salt, plus more to taste", "1/4 teaspoon black pepper", "4 chicken leg quarters (about 2 1/2 pounds total)", "2 tablespoons unsalted butter", "2 large yellow onions, cut into ¼-inch pieces", "1/2 cup vegetable or chicken stock ", "1 tablespoon toasted sliced almonds, optional "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: To a large mixing bowl, add the olive oil, garlic, paprika, cumin, turmeric, salt and black pepper and stir until well combined. Add in the chicken legs and use your hands to thoroughly coat both sides of the chicken legs with the marinade. Cover and leave in the fridge until ready to cook or for up to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, melt the butter in a large pot over medium-low. Add the onions, cover the pan and cook, stirring occasionally, for 10 to 15 minutes, until the onions are soft and translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken and stock along with any leftover marinade in the bowl and bring to a boil over high. Cover the pan, reduce the heat to medium-low and let simmer gently for 40 to 45 minutes, until the chicken is fully cooked. If it looks like there isn’t enough liquid in the pan at any point during the cooking process, add a few tablespoons of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use tongs to remove the chicken from the pan and transfer, skin-side up, to a foil-lined sheet pan. Continue cooking the sauce over medium, uncovered, until it has reduced by half and becomes thick and a bit jamlike, stirring occasionally, 25 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position an oven rack 4- to 6-inches from the broiler heat source and heat the broiler to high. When the sauce is nearly ready, broil the chicken, keeping a watchful eye, for 3 to 5 minutes until the chicken skin is lightly charred and crispy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spread half of the onion sauce at the center of a large serving plate, top with the chicken legs and drizzle the remaining sauce over the chicken legs. Garnish with toasted sliced almonds, if desired."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023661-chicken-mhammer"}