{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlicky Mashed Potato Cake", "description": "If you like the creaminess of mashed potatoes but not the uniform texture, try this potato cake, which is like a cross between hash browns and a classic mash. Made with fluffy baked russet potatoes and flavored with garlic, browned butter and tangy sour cream, the cake is cooked on the stovetop, then transferred to the oven, where it takes on a crispy, golden brown crust. Make sure your nonstick skillet is oven-safe, or use a very well-seasoned cast-iron skillet.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2022/11/16/dining/10potatoesrex3-cake/merlin_214833936_4fc3699a-c308-49a3-ba03-fe9f63b120ed-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "vegetables, side dish", "keywords": "brown butter, garlic, russet potatoes, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 971}, "recipeIngredient": ["3 pounds russet potatoes (about 6 medium-large), scrubbed", "6 tablespoons unsalted butter", "6 garlic cloves, smashed and peeled", "Kosher salt and freshly ground black pepper", "Pinch of ground nutmeg", "1/2 cup crème fraîche or sour cream, at room temperature", "1 tablespoon finely chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an oven rack in the center position and heat the oven to 425 degrees. Bake the potatoes directly on the oven rack until the flesh is soft and tender and the skins are crispy, 1 hour to 1 hour 15 minutes. Remove the potatoes from the oven and let them sit at room temperature just until they’re cool enough to handle (they should still be hot). Lower the oven temperature to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a 10-inch nonstick, oven-safe skillet over medium. Add the butter and swirl the skillet until the butter is melted and foamy, then add the garlic and cook, stirring occasionally, until both the garlic and butter are golden brown, about 3 minutes. Remove the skillet from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the still-hot potatoes in half and scoop the flesh out onto a cutting board (save the skins for snacking or discard). Use a knife or bench scraper to chop up the flesh so you have pieces of various sizes but none larger than a walnut half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potato flesh to the skillet, season generously with salt and pepper and add a pinch of nutmeg. Add the crème fraîche or sour cream, and fold the mixture gently until the potatoes are evenly coated, then flatten it gently into a single layer. Place the skillet over medium-high heat and cook undisturbed until all of the moisture has evaporated and the potatoes are starting to turn golden on the bottom, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently shake the skillet to loosen the potato cake, then transfer it to the oven and bake until the potatoes are lightly browned across the surface, 30 to 35 minutes. Remove the skillet and let sit for 10 minutes, then carefully invert the potato cake onto a serving platter (if making ahead, see note below). Top with chives and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023638-garlicky-mashed-potato-cake"}