{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Shallot Caesar Salad", "description": "The dressing here is great on this salad, but it can find a second (and third, and fourth) life in so many other simple meals. Use it as a dip for grilled asparagus and broccolini; slather it on burgers and BLTs; or combine it 50-50 with Greek yogurt and add chopped dill and black pepper to make a fried shallot Ranch dressing for dipping crudités (or chicken wings). Add it to a roast beef sandwich (or just serve it with the roast beef). It’s a great party dip for chips (or anything you’d serve French onion dip with). This recipe calls for making the mayo from scratch, but you can use store-bought mayo as the base to make it even easier.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2022/05/25/dining/23Kenji3/merlin_206815728_398f0d41-e07d-4919-8b1d-7a013bd1e041-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, salads and dressings, appetizer, main course, side dish", "keywords": "fried shallot, parmesan, romaine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "recipeIngredient": ["1/2 cup <a href=\"https://cooking.nytimes.com/recipes/1023193-fried-shallots\">homemade</a> or store-bought fried shallots", "1 whole egg", "1 tablespoon freshly squeezed lemon juice", "1 tablespoon Dijon mustard", "1 tablespoon fish sauce", "1 teaspoon Worcestershire sauce", "2 medium garlic cloves", "1/2 cup neutral oil, such as canola or rice bran", "1/4 cup extra-virgin olive oil", "Salt and black pepper", "1/2 cup <a href=\"https://cooking.nytimes.com/recipes/1023193-fried-shallots\">homemade</a> or store-bought fried shallots", "2 heads romaine, crisp inner leaves only, washed and carefully dried, torn or chopped into large pieces", "1 ounce finely grated Parmesan (about ½ cup), plus more for serving", "Anchovies, left whole or torn into pieces (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the shallot aioli: Combine shallots, egg, lemon juice, mustard, fish sauce, Worcestershire sauce and garlic in the bottom of a jar just wide enough to fit the head of an immersion blender (see Tip). Add the neutral oil, pouring it in slowly so that it forms a distinct layer on top of the other ingredients. Place the head of an immersion blender all the way at the bottom of the jar. Turn on the blender and slowly pull it up through the jar so that the oil is slowly incorporated and forms a creamy emulsion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a medium bowl. Whisk in the extra-virgin olive oil, then whisk in water as needed until the dressing forms a light, creamy consistency. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salad: If using homemade shallots, skip to Step 4. If using store-bought shallots, toast the shallots in a large skillet over medium heat until deep caramel brown and aromatic, about 3 minutes. (Alternatively, you can toast the shallots on a sheet tray in an oven or toaster oven at 375 degrees until deep caramel brown, about 6 minutes.) Season generously with salt and transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the lettuce with a few tablespoons of the dressing, half of the fried shallots and the Parmesan until lightly coated. Taste some of it, then add more dressing and season to taste with salt and pepper as desired. Transfer to a serving bowl, sprinkle with remaining fried shallots, grate some more Parmesan on top, garnish with anchovies (if using) and serve. Leftover dressing can be stored in a sealed container in the fridge for up to 2 weeks."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023231-fried-shallot-caesar-salad"}