{"@context": "http://schema.org", "@type": "Recipe", "name": "Toum Grilled Cheese ", "description": "Cheese manousheh, a topped flatbread found throughout the Levant, is often served with wild cucumber pickles and a side of fluffy toum, a sauce made by combining garlic, lemon juice, salt and oil, for dipping. This grilled cheese hits those notes, skipping a trip to a Lebanese bakery. Slathering the bread with toum instead of butter instantly gives it garlic bread vibes. Though you can purchase toum at many supermarkets and Middle Eastern specialty stores, making it at home gives it a more vibrant punch. It lasts for months and can be used anywhere a tangy, garlicky wallop is needed. Use in salad dressings, as a rub on roasted meats, as a sandwich condiment, or even as a dip for crudités. ", "author": {"@type": "Person", "name": "Ham El-Waylly"}, "image": "https://static01.nyt.com/images/2023/01/27/multimedia/he-toum-grilled-cheese-mghb/he-toum-grilled-cheese-mghb-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "1 sandwich, plus 1 ¾ cups toum", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, weeknight, sandwiches, main course", "keywords": "bread, garlic, grapeseed oil, lemon juice, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "recipeIngredient": ["1 medium head of garlic, peeled (about 12 cloves)", "2 tablespoons lemon juice (from 1 lemon), plus more to taste", "2 teaspoons kosher salt, plus more to taste", "1 1/2 cups neutral oil, like grapeseed oil", "2 slices bread, preferably from a rustic loaf, no more than 1/2-inch thick", "3 slices Muenster cheese", "4 cornichons, thinly sliced lengthwise", "2 tablespoons toum (prepared or homemade), plus more for dipping ", "Kosher salt "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the toum (or proceed to Step 4, if using store-bought toum): Place garlic, lemon juice, kosher salt and 1 tablespoon water in a tall, narrow container; blend with an immersion blender until smooth. Let sit for at least 10 minutes to mellow out some of the raw garlic’s bite. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump the neutral oil on top, then lower the immersion blender to the bottom of the container. Turn the blender on, but don’t yet move it. Once the mixture starts emulsifying and thickening, slowly tilt the blender to introduce more oil to the mixture and very slowly pull the blender to the top of the mix. Plunge the blender up and down until the toum is fully emulsified and thick. (This streamlined toum recipe sacrifices fluffiness for ease by using a stick blender. If you want to make perfectly fluffy toum, prepare <a href=\"https://cooking.nytimes.com/recipes/1021075-toum-garlic-whip\">this recipe</a> using a food processor.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir well and adjust the toum with more salt and lemon juice as needed. (The toum recipe makes about 1 3/4 cups.) Transfer to a container with a tight-fitting lid and refrigerate, if not using immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sandwich: Divide the cheese evenly between the two slices of bread, tearing one piece in half to split it. Shingle the cornichons in one even layer on one side. Carefully close the sandwich. Evenly spread 1 tablespoon of toum on one side of the sandwich. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium nonstick skillet, place the sandwich, toum-side down. Press the sandwich firmly with a spatula to compress. Cook over medium-low until lightly golden underneath, 5 to 6 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread 1 tablespoon of toum on the top side of the bread, then flip the sandwich over and press firmly. Cook until bread is lightly golden brown, 3 to 4 minutes, then flip back over. Since toum is made of mostly garlic, it burns easily. Take your time, reducing the heat to low, flipping and pressing the sandwich often to ensure that the cheese melts evenly and the bread doesn’t burn, about 3 more minutes. Lightly season both sides with salt and serve immediately, with a side of toum for dipping. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023874-toum-grilled-cheese"}