{"@context": "http://schema.org", "@type": "Recipe", "name": "Herby Rice Salad With Peas and Prosciutto", "description": "This bright, lemony salad laced with fresh herbs is a passport to spring. Simmering the rice in plenty of salted water just until it’s al dente and then cooling it well is key. Blanched fresh peas are terrific if you can find them, but frozen work just fine. The trick is marinating them in lemony olive oil, a technique borrowed from the Michigan chef Abra Berens, who uses it in her comprehensive book “Ruffage: A Practical Guide to Vegetables” (Chronicle Books, 2019). The prosciutto adds a nice salty hit, but you could sub in a dollop of creamy ricotta or leave both out for your vegan friends. Either way, the recipe delivers a bright salad that can stand in for a light meal.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2022/03/23/dining/23Nunn-Herby-Rice-Salad-a/merlin_203820966_b740bcc5-6d55-474f-b34d-71074c7622bf-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, lunch, grains and rice, salads and dressings, appetizer, main course, side dish", "keywords": "peas, prosciutto, rice, ricotta, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 190}, "recipeIngredient": ["Flaky sea salt", "2 cups long-grain white rice", "3 cups shelled peas, briefly blanched (if fresh) or raw (if frozen)", "1/2 cup extra-virgin olive oil", "A few thick slices of red onion (these will be removed, so you want them big enough to locate for removal; they are like the booster rockets you leave behind on your way into rice-salad outer space)", "2 lemons, zested and juiced, plus additional lemon wedges", "1/4 teaspoon red-pepper flakes", "1/2 cup slivered basil, plus more to taste", "1/2 cup slivered mint, plus more to taste", "1/4 cup chopped parsley, plus more to taste", "2 or 3 tablespoons sliced chives (or 1 to 2 tablespoons of finely chopped red onion), plus more to taste", "12 to 16 slices of prosciutto (optional)", "Fresh ricotta (preferably a local or all-natural brand), for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice: Bring a large pot of water to a rolling boil and salt it. Stir in the rice. When the water returns to a boil, reduce the heat to low, cover and cook the rice at a gentle simmer for about 15 minutes, or until tender but still a bit firm and not at all mushy. Drain the rice in a colander set in the sink, then transfer it to a large bowl. You can refrigerate it after this step or use it once it has cooled completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl, combine the peas, olive oil, sliced onion, lemon zest and juice, red-pepper flakes and ½ teaspoon salt. Allow to marinate, refrigerated, for 20 minutes or up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the sliced onion from the pea mixture and discard. Add 5 cups of the cooled or refrigerated rice to the pea mixture, along with the basil, mint, parsley and chives; toss gently to combine. Taste for salt and lemon juice. This is important — get it the way you want it. If the ratio needs a bit more rice, add it from whatever is left. (You should have another cup or so.) You may also wish to add more herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in shallow bowls, draping a couple of slices of prosciutto alongside for each person. Alternatively, a spoonful of really good ricotta on top is also delicious. Or, serve with both prosciutto and ricotta — although vegetarians and vegans will enjoy this dish without the meat or dairy. Set out lemon wedges to squeeze to taste."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023014-herby-rice-salad-with-peas-and-prosciutto"}