{"@context": "http://schema.org", "@type": "Recipe", "name": "Kale and Butternut Squash Bowl With Jammy Eggs", "description": "Steaming vegetables is a quick way to enjoy their inherent sweetness, and </span><a href=\"https://cooking.nytimes.com/recipes/1020468-perfect-boiled-eggs\"><span>steaming eggs</span></a><span> is the secret to perfect-as-possible jammy eggs. In this recipe, you don’t need a steamer basket for either. Cook the eggs in a covered skillet or pot of shallow boiling water, then layer winter squash, broccoli or cauliflower and dark leafy greens. The small amount of water will produce ample steam to cook the vegetables. Eat with plenty of sesame seeds for crunch and a yogurt sauce that is nutty from sesame oil and bright with lemon and ginger. The sauce is endlessly adaptable; add fresh or dried herbs or chile, ground or toasted spices, toasted coconut and more.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2023/01/18/multimedia/as-butternut-squash-and-kale-bowl-bmvh/as-butternut-squash-and-kale-bowl-bmvh-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for two, lunch, weeknight, one pot, vegetables, main course", "keywords": "broccoli, butternut squash, cauliflower, egg, kale, make-ahead, sesame oil, sesame seeds, yogurt, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["3 large eggs", "3/4 cup plain, full-fat yogurt", "1 teaspoon lemon zest plus 2 tablespoons juice (from 1 lemon)", "2 teaspoons finely chopped fresh ginger", "1 teaspoon toasted sesame oil", "Salt", "12 ounces butternut, honeynut or kabocha squash, seeds removed and sliced 1/2-inch thick", "8 ounces broccoli, cauliflower or a combination, cut into 1-inch florets and stems, thinly sliced", "4 ounces (about 4 packed cups) torn kale leaves, or another hearty green like chard or mustard", "Toasted sesame seeds (any color), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large (12-inch) skillet with a lid or a large Dutch oven, bring 1 inch of water to a boil over high. Carefully add the eggs. (They may not be fully submerged and that’s OK.) Cover and boil for 6 minutes. Transfer the eggs to a bowl to cool. Pour off all but 1/4 inch of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the eggs steam, in a liquid measuring cup or small bowl, stir together the yogurt, lemon zest and juice, ginger and sesame oil; season with salt. It might taste too puckery at this point, but it will balance out when on the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the squash in a single layer in the shallow water; season with salt. Cover, bring to a boil over high, and cook for 5 minutes. Scatter the broccoli on top of the squash, season with salt, then pile the kale on top of the broccoli and season with salt. If the water has evaporated, add another ¼ inch of water. Cover and cook until the squash is tender and the broccoli is bright green and crisp-tender, 2 to 4 minutes. Turn off the heat but keep the skillet covered while you peel the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and halve the eggs, then season with salt. Divide the vegetables and eggs between plates, then drizzle with plenty of sauce and scatter sesame seeds on top. The vegetables, eggs and sauce will keep for up to 4 days in the fridge and are good warm, room temperature or cold from the fridge."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023835-kale-and-butternut-squash-bowl-with-jammy-eggs"}