{"@context": "http://schema.org", "@type": "Recipe", "name": "Whiskey-Glazed Salmon With Salt-Crusted Potatoes", "description": "The savory snap of baby potatoes crusted in salt is just what you want with the subtle sweetness of this fish’s glaze. The fish and the potatoes cook and come together at the same time in this fast meal. To achieve silky salmon without turning on the oven, gently cook it in a shallow pool of sauce that thickens to a syrup as it simmers. The potatoes, prepared using a technique from the Canary Islands, simply boil in generously salted water, then finish cooking with a splash of the liquid. When it evaporates, the salt that remains crusts onto the spuds. Shaking the pan vigorously helps the salt coat the potatoes evenly and sheds excess crystals. Serve with a salad or, after the glaze is scraped onto the fish, throw baby spinach into the still-hot skillet and stir to just wilt.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/03/16/dining/11Korex/merlin_201183663_f2ebb9d7-e82b-4a0f-90e1-484ea8688c4b-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weeknight, seafood, main course", "keywords": "potato, salmon fillet, salt, whiskey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1056}, "recipeIngredient": ["1 1/2 pounds baby gold potatoes, scrubbed", "2 tablespoons coarse sea salt or kosher salt", "2 tablespoons granulated sugar", "6 tablespoons whiskey", "2 tablespoons Worcestershire sauce", "4 (5-ounce) salmon fillets", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the potatoes: The potatoes should all be the same small size, about 1 inch in diameter, so cut any larger ones in halves or quarters. Place in a large saucepan with 4 cups water and add the salt. Bring to boil over high heat, then continue boiling until a paring knife slides through a potato easily, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 5 minutes before the potatoes are tender, start the salmon: Combine the sugar, whiskey and Worcestershire sauce in a large skillet, and bring to a boil over medium-high heat, stirring to dissolve the sugar. Season the salmon with salt and pepper, then add to the skillet skin side down (or the flat side if the fillets are skinless). Reduce the heat to medium-low and simmer until the salmon becomes opaque about halfway up the sides, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, carefully tip the saucepan into the sink to pour out all but about 1/4 cup cooking water, keeping the potatoes in the pan. Return the saucepan to the stove with the potatoes and a thin layer of cooking water at the bottom, and set over high heat. Cook, shaking the pan often, until the liquid evaporates and the potatoes are crusted in a fine film of salt, about 5 minutes. The pan should be extremely dry and coated in salt and the potatoes will sound crackly when shaken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip the salmon and continue cooking until just opaque from top to bottom and a paring knife slides through with almost no resistance, about 5 minutes longer. If you started with a 1-inch-thick fillet, this will be medium-rare. The timing will vary depending on the thickness of your fish and your preferred doneness. If you’d like, use tongs to peel off and discard the skin if there is any. The glaze should have thickened and be syrupy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the potatoes and salmon among serving plates and drizzle any glaze from the pan over the fish."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023027-whiskey-glazed-salmon-with-salt-crusted-potatoes"}