{"@context": "http://schema.org", "@type": "Recipe", "name": "Grapefruit-Herb Salad With Coconut and Crispy Shallots", "description": "This grapefruit and herb salad puts citrus front and center. It’s based on yum som-o, a pomelo salad from Thailand, where the fruit is abundant. Grapefruits are used here, but if you happen on pomelos, grab a few: They are much easier to peel and loosen from the protective piths. Fragrant toasted coconut, salty peanuts and crunchy shallots all create layers of texture. The dried shrimp adds a saltiness that greets your tongue in little bursts, and the fresh chile a lingering spice. This is a refreshing, vibrant side to accompany any rich meal.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2022/11/16/dining/09komolaferex2-grapefruit/09komolaferex2-grapefruit-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, appetizer, side dish", "keywords": "basil, chile, cilantro, grapefruit, peanut, salad, unsweetened coconut, thanksgiving, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 126}, "recipeIngredient": ["1/2 cup large unsweetened coconut flakes", "1 tablespoon neutral oil, such as grapeseed or canola", "1/2 cup raw, skin-on whole peanuts", "Salt", "1 tablespoon granulated sugar", "1/4 cup fresh lime juice (from 2 limes)", "3 tablespoons fish sauce", "1 to 2 bird’s-eye chiles, minced, or 1 teaspoon red-pepper flakes", "1 garlic clove, minced", "4 red grapefruit", "1/2 cup roughly chopped cilantro leaves and tender stems", "1/4 cup Thai or sweet basil leaves, torn", "2 tablespoons tiny dried shrimp (optional)", "1/4 cup store-bought crispy shallots"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan over medium-low heat, toast the coconut flakes, stirring constantly, until golden brown, about 3 minutes. Transfer to a plate and set aside. Add the oil to the pan and heat over medium. Add the peanuts and toast, stirring constantly until fragrant and golden brown, 5 minutes. Season lightly with salt and transfer to the bowl with the coconut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the sugar and 2 tablespoons water. Whisk together to dissolve the sugar. Add the lime juice to the bowl. Add the fish sauce, chile and garlic. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off the tops and bottoms of the grapefruits with a sharp knife, so each fruit sits flat on your work surface. Slice off the rest of the peels in strips, cutting down the length of the fruit and carefully removing the white pith as you go. Over a large bowl, use your fingers to pull the citrus flesh off the membrane in large pieces. You can also use your knife to slice the flesh off the membrane. Discard the membrane and transfer the flesh to a large bowl. You should have about 5 cups fruit flesh with some juice in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the bowl of citrus, add half of the cilantro, all the basil leaves and the dried shrimp, if using. Pour in 1/4 cup dressing and toss gently to combine. Add the coconut and peanut mixture, and toss with a couple more tablespoons of the dressing. Divide the salad among bowls, or transfer to a serving platter. Top with the remaining cilantro leaves, spoon over the remaining dressing and sprinkle with the crispy shallots. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023642-grapefruit-herb-salad-with-coconut-and-crispy-shallots"}