{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Pad Thai", "description": "Pad Thai is Thailand’s national dish, but not because it is traditional. The government codified it in the 1930s as a way of encouraging national pride in the unique ingredients of Thailand. It has been adopted and adapted all over the country, but one constant is that the dish is made almost entirely of long-lasting ingredients like rice noodles and tamarind, making it easy on the home cook. The savory, tart sauce is very simple to assemble, and it lasts well in the fridge. Watcharee Limanon, a cooking teacher in Yarmouth, Maine, who shared this recipe, said that although salty dried shrimp are used in the original recipe, many Thai cooks (and most of her students) now prefer fresh shrimp.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2022/03/23/dining/17padthairex1/merlin_203116326_32624565-ffae-482d-9a55-043cf31afb0b-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 to 3 servings", "recipeCuisine": "thai", "recipeCategory": "noodles, main course", "keywords": "egg, rice noodles, shrimp, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1018}, "recipeIngredient": ["8 ounces sen lek (dried 1/8-inch-wide flat rice noodles​) or other pad Thai noodles", "1/4 cup minced garlic", "2 tablespoons minced shallot", "1/4 cup minced Thai sweet preserved radish (optional; see Tip)", "10 to 12 peeled and deveined medium shrimp", "8 ounces superfirm (pressed) tofu, cut into bite-size cubes or rectangles (1 cup)", "4 large eggs, lightly beaten", "2 cups bean sprouts", "1 small bunch garlic chives or scallion greens, cut into 1-inch lengths (1/2 cup)", "3 tablespoons vegetable oil, plus more for cooking eggs", "Chopped peanuts, chile powder and lime wedges, for serving", "1/3 cup fish sauce", "1/3 cup tamarind liquid or concentrate", "1/3 cup coconut or other palm sugar or dark brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the noodles: Place dried noodles in a large bowl and cover with hot tap water. Let soak for 20 to 30 minutes while you prepare the remaining ingredients, allowing the water to cool, and stirring and separating the noodles occasionally with your hands. When ready, noodles will be white, limp and almost soft to the bite. (They will cook a little more later on.) Pour off all the water, fluff noodles with your hands, and set aside.   "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: Combine the fish sauce, tamarind and coconut palm sugar in a small saucepan. Bring to a simmer over medium heat, stirring often, just until sugar has dissolved, 3 to 4 minutes. Set aside to cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line up the ingredients in the order they’ll be cooked: Place the garlic, shallot, radish and shrimp in a bowl, then line up the tofu, noodles, sauce, eggs, bean sprouts and chives. When ready to cook, place 1 cup of hot tap water near the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons of oil in a 14-inch wok, a heavy 12-inch skillet or a large Dutch oven medium-high heat until shimmering. (If using a smaller pan, cook in 2 batches.) Add the contents of the garlic bowl and stir-fry over medium heat, adjusting the flame so the ingredients are sizzling but not popping or scorching, until the shrimp are nearly pink, 2 to 3 minutes. Add the tofu and stir-fry to heat through, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add noodles and raise the heat as high as it goes, tossing and separating them with a wok turner, tongs or both. When noodles are sizzling, add about half the sauce and 1 tablespoon water, and stir-fry, tossing to coat and cook through. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste a noodle for doneness and seasoning. If needed, add more sauce and water, and keep cooking, turning often, until noodles are softened and savory.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push noodles to one side of the pan, add enough oil to lightly coat the other side, and add the eggs. Use the spatula to scramble the eggs, stirring and scraping until cooked through and just dry, 1 to 2 minutes, then stir them into the noodles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bean sprouts and chives, and stir to combine. Serve immediately, passing the peanuts, chile powder and lime wedges to adjust seasoning to taste."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023042-shrimp-pad-thai"}