{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian Broccoli Salad", "description": "This adaptable make-ahead salad is a great instant lunch or side dish. It starts with raw broccoli florets and stems, thinly sliced into irregular shapes to create many textures. As the broccoli sits with salt and vinegar, it softens and becomes slaw. Its mellow flavor is contrasted by the loud ingredients typically found in an Italian sub or chopped salad, like shallots, pickled peppers, olives and provolone. Feel free to add more protein in the form of cured meats, chickpeas, lentils or mozzarella; vegetables like sweet tomatoes or iceberg lettuce; or basil.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/03/28/dining/as-broccoli-salad/as-broccoli-salad-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, salads and dressings, vegetables, main course, side dish", "keywords": "almond, broccoli, olives, provolone", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 835}, "recipeIngredient": ["1 small shallot, thinly sliced", "1 1/2 pounds broccoli (about 2 medium heads)", "Kosher salt (Diamond Crystal) and black pepper", "1/2 cup roasted, salted almonds, coarsely chopped", "1/4 cup drained, sliced pickled peppers, such as peperoncini", "1/4 cup pitted, torn olives, such as kalamata or Castelvetrano", "1/3 cup extra-virgin olive oil, plus more as needed", "1/3 cup red wine vinegar, plus more as needed", "3 slices provolone (about 3 ounces), torn or cut into bite-size pieces (or use 1 1/2 ounces aged provolone)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the sliced shallot under cold water and transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the stalks away from the broccoli heads. Using a knife or vegetable peeler, remove the fibrous outer layer of the stalks so its light green insides emerge; compost or discard the outer layer. Thinly slice the stalks crosswise, then thinly slice the heads into bite-size pieces. (A mix of shapes and sizes adds texture to the salad, so chop up the broccoli a few ways; there’s no one right way to go about it.) Transfer to the large bowl as you go, then transfer any loose bits from the cutting board to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the broccoli generously with salt and pepper, then add the almonds, pickled peppers, olives, oil, vinegar and provolone. Toss vigorously with a spoon until everything is combined and the broccoli is shiny with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and adjust seasonings with salt, pepper, oil and vinegar as needed. Let sit at least 10 minutes before serving. The salad improves with age as its flavors meld, and it can be refrigerated for up to 4 days. Before serving, bring to room temperature and adjust salt, pepper, oil and vinegar to taste, as flavors change in the fridge."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023076-italian-broccoli-salad"}