{"@context": "http://schema.org", "@type": "Recipe", "name": "Thanksgiving Stuffing", "description": "This deeply savory, buttery sage stuffing builds layers of flavor with each step. First, whole sage leaves fry in melted butter for a pretty garnish that offers pleasurable crispy bits. The butter ends up browned, nutty and infused with the herb’s woodsy aroma, and helps chopped sage, fennel seeds, poultry seasoning and cayenne bloom for a fragrant blend that tastes like sausage. Milk in place of watery boxed stock means there’s a base of richness that only dairy can provide. The combination of white bread and cornbread results in a classic but amped-up Thanksgiving stuffing with textural integrity and a hint of sweetness to boot.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/11/16/dining/15STUFFINGREX-thanksgiving-stuffing/14STUFFINGREX-thanksgiving-stuffing-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, side dish", "keywords": "brown butter, cornbread, fennel seeds, milk, sage, sourdough, stuffing and dressing, fall, winter, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2670}, "recipeIngredient": ["8 ounces crusty white bread, such as country loaf or sourdough, cut into 1/2-inch dice (about 6 cups)", "8 ounces store-bought or <a href=\"https://cooking.nytimes.com/recipes/1022722-cornbread\">homemade cornbread</a>, cut into 1/2-inch dice (about 3 cups)", "1/2 cup unsalted butter", "10 fresh sage leaves, plus 1/3 cup coarsely chopped sage (3/4 ounce)", "1 tablespoon fennel seeds", "1 teaspoon salt-free poultry seasoning", "1/4 teaspoon ground cayenne", "1 large yellow onion, finely diced", "Salt and black pepper", "2 celery stalks, finely diced", "2 cups whole milk, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread all the bread cubes on a large sheet pan and bake until brittle, 20 to 25 minutes. Cool completely on the pan. (The cooled bread can be stored in an airtight container for up to 5 days.) Raise the oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a large skillet over medium heat. Dip a wadded-up paper towel into the melted butter and grease a 1 1/2- to 2-quart shallow baking dish or pan with it. Unwad the paper towel and line a plate with it. Add the whole sage leaves to the butter and cook, stirring occasionally, until the speckled milk solids at the bottom of the pan start to brown and the sage leaves become crisp, 2 to 4 minutes. Using tongs, transfer the sage to the paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chopped sage, fennel seeds, poultry seasoning and cayenne to the browned butter and cook, stirring constantly, until fragrant, 30 to 60 seconds. Add the onion and season generously with salt and pepper. Cook, stirring occasionally, until the onion begins to soften, about 5 minutes. Stir in the celery and continue cooking for 2 minutes. Stir in the milk and heat until steaming. Taste and add salt and pepper; the milk should be assertively seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the toasted bread cubes to a large bowl. Pour the hot milk mixture over the bread and gently toss with two spoons until the bread is thoroughly soaked; add more milk if needed. Spread the stuffing in the buttered baking dish and cover with foil. Bake until warmed through, 10 to 15 minutes. Uncover and bake until the top is crispy and a little darker in color, about 10 minutes. Scatter with the fried sage leaves and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023649-thanksgiving-stuffing"}