{"@context": "http://schema.org", "@type": "Recipe", "name": "S’mores", "description": "The perfect campfire s’more is perfect because it’s a reflection of you: Maybe you reach for dark chocolate rather than stick to milky bars or swap in cookies or saltines for the graham crackers. But there are a few best practices, including tool and setup tips from the camp-cooking experts <a href=\"https://www.freshoffthegrid.com/\">Megan McDuffie, Michael van Vliet</a> and <a href=\"https://www.tiktok.com/@kenapeay?lang=en\">Kena Peay</a> that ensure the marshmallow roasts to gooey, charred excellence and the chocolate surrenders to the heat of the marshmallow, melting but not liquifying. While delicious s’mores can be <a href=\"https://cooking.nytimes.com/recipes/992-indoor-smores\">achieved indoors</a> with a microwave, broiler, gas stovetop or even a candle with some fight in it, a campfire or fire pit imparts a nostalgic woodsy smokiness. Add-ons like jam, peanut butter, chile flakes or fresh berries are fun to try out. What’s nonnegotiable is that you enjoy s’mores with friends, fellow campers, grandchildren or whomever you love.", "author": {"@type": "Person", "name": "Tanya Sichynsky"}, "image": "https://static01.nyt.com/images/2022/08/08/dining/SMORESREX-smores/merlin_210763791_566f449f-66b1-40ec-a407-ac2bdb3b4307-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "As many as you like ", "recipeCuisine": "", "recipeCategory": "easy, quick, snack, finger foods, dessert", "keywords": "chocolate, graham cracker, marshmallow", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "recipeIngredient": ["Neutral cooking oil, such as canola", "Regular or jumbo marshmallows ", "Graham crackers, split into even squares, or saltine crackers", "Milk or dark chocolate bars, at room temperature", "Flaky or coarse salt (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Expertly assemble and ignite a campfire. (Watch a how-to video, if you need.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Procure roasting skewers: Metal skewers are the way to go, as they won’t leave bits of tree bark behind in your marshmallow. (Flammable twigs and wooden skewers aren’t the safest options for younger kids.) Double-pronged roasting sticks designed for marshmallows will keep marshmallows secure as they soften over the flames, but extra-long metal skewers work just fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a s’more: With a paper towel, rub a little neutral cooking oil over the end of the metal skewer where the marshmallows will go; this keeps the sugary pillows from sticking. Skewer 2 regular marshmallows or 1 jumbo marshmallow onto the rod."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top a cracker with 1 or 2 squares of chocolate, depending on size and personal preference. Sprinkle a little salt over the chocolate, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast your marshmallows: Resist the urge to immediately plunge them directly into the flames. Hold the marshmallows over the top of the flames, and roast, rotating often, until the marshmallows are golden, gooey in the center and slumped slightly down the skewer, 2 to 3 minutes. Lower the marshmallows into the flames, let them catch fire briefly and then carefully blow them out. A perfect marshmallow is a burnished marshmallow, after all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately place the charred, skewered marshmallows on the chocolate-topped cracker. Take the unadorned cracker and press down as you pull out the skewer so that the gooey marshmallows ooze over the chocolate and out of the edges of the crackers. Devour immediately. Repeat, repeat, repeat."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023383-smores"}