{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Spice Bundt Cake", "description": "This tall and tender Bundt cake pulls off the trick of being cozy and zingy at the same time. It gets its soft crumb from yogurt (although you could use sour cream or buttermilk) and its pop from puckery fresh cranberries and a mix of cardamom, coriander and ginger. It’s festive with a cranberry icing and classic with a dusting of powdered sugar. And it’s a cake that can go through the seasons — think about swapping the cranberries for dried fruit in the winter and berries in the summer. It’s great with blueberries.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2022/12/14/multimedia/09CAKESREX2-cranberry-bundt-1-6a2e/12CAKES-REX2-cranberry-bundt-1-6a2e-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "snack, cakes, dessert", "keywords": "Bundt cake, cardamom, cranberry, ground coriander, make-ahead, yogurt, christmas, thanksgiving, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1001}, "recipeIngredient": ["3/4 cup/170 grams unsalted butter, at room temperature and cut into chunks (plus more for the pan if not using nonstick baker’s spray)", "2 1/2 cups/320 grams all-purpose flour (plus more for the pan if not using nonstick baker’s spray)", "2 teaspoons baking powder", "3/4 teaspoon fine sea salt", "1/2 teaspoon baking soda", "1 1/4 teaspoons ground cardamom", "3/4 teaspoon ground coriander", "1/2 teaspoon ground ginger", "1 1/2 cups/300 grams granulated sugar", "Finely grated zest of 1 orange or 2 small tangerines", "1/3 cup/80 milliliters neutral oil", "3 large eggs, at room temperature", "2 teaspoons pure vanilla extract", "1 cup/235 grams plain Greek yogurt, at room temperature and drained of excess liquid, if necessary", "2 cups/200 grams fresh or frozen (unthawed) cranberries, coarsely chopped", "2 1/4 cups/275 grams confectioners’ sugar", "2 tablespoons plus 1 teaspoon (maybe a bit more) cranberry or pomegranate juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and heat it to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Butter a large (12- to 13-cup) Bundt pan, dust the interior with flour and tap out the excess, or coat the pan with nonstick baker’s spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the flour, baking powder, salt and baking soda and then whisk in the cardamom, coriander and ginger; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the granulated sugar in the bowl of a stand mixer fitted with the paddle attachment or in a large mixing bowl that will work with an electric mixer. Add the zest and, using your fingertips, rub it into the sugar until you catch a whiff of orange. Drop in the butter. Beat the sugar and butter together on medium-high speed for 3 to 4 minutes, until pale, creamy and fluffy. Pour in the oil and beat for a couple of minutes more to blend it in well, turn off the mixer and scrape the bowl and beater(s). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One by one, beat in the eggs, beating for a minute after each egg goes in. Beat in the vanilla — the mixture will look like frosting — then blend in the yogurt on low speed. Turn off the mixer, scrape the bowl and beater(s) well and add half the flour mixture. Working on low, mix until the dry ingredients are almost incorporated. Turn the mixer off, add the remaining flour mixture and, again, beat until almost blended. It’s fine if you can still see flour here and there. Working by hand with a flexible spatula, fold in the cranberries and any remaining flour. Scrape the batter into the pan and push it gently into the pan's curves, leveling the top as best as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake for 55 to 60 minutes, until a tester inserted comes out clean. The cake will be deeply golden brown and pull away from the sides of the pan when prodded. Transfer the pan to a rack, let rest for 5 minutes and then unmold the cake onto the rack. Allow it to come to room temperature before icing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the icing: Put the confectioners’ sugar in a medium bowl and sprinkle over the juice. Stir the juice into the sugar. You’re aiming for an icing that flows easily off the side of a spoon. If needed, add more juice by droplets. Either keep the cake on the rack and slip a piece of parchment or a sheet pan under the rack to catch drips, or transfer the cake to a platter. Spoon the icing over the cake, allowing it to run down the sides. Let the icing dry before serving. Covered, the cake will keep at room temperature for at least 4 days. (If you haven't glazed the cake, it can be wrapped well and frozen for up to 2 months; defrost, still wrapped, at room temperature.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023730-cranberry-spice-bundt-cake"}