{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Chile Biscotti", "description": "The word “biscotti” comes from the Latin biscoctus, or twice cooked: The dough is rolled into logs and given a spell in the oven, then cooled, sliced and slotted back in to bake a little more. The second turn in the oven essentially sucks them dry and gives them that signature crunch. Too much crunch, however, and they can be a little flinty. The pastry chef Mark Sopchak makes biscotti that are shorter and narrower — “Biscottini!” an Italian passerby once said — and ever so slightly softer, with the addition of butter. These cookies are thin enough to snap smartly under the teeth and then obligingly crumble. Inspired in part by Mexican mole, they have a touch of creaminess from cashews and a wild streak of chile powder, just enough to make you hum.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2022/05/27/dining/LG-chocolate-chile-biscotti/merlin_207647055_369531ad-ad01-4757-8a2e-cf0d42e12260-articleLarge.jpg", "totalTime": "PT4H15M", "recipeYield": "36 to 40 small biscotti", "recipeCuisine": "italian", "recipeCategory": "cookies and bars, dessert", "keywords": "cashew, chocolate chips, cocoa powder, christmas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 651}, "recipeIngredient": ["2 cups/272 grams all-purpose flour, plus more for dusting", "1/3 cup/32 grams Dutch-processed cocoa powder", "1 1/2 teaspoons baking powder", "1/4 teaspoon salt", "1/2 cup/114 grams unsalted butter, at room temperature", "3/4 cup/151 grams granulated sugar, plus more for sprinkling", "2 tablespoons ancho chile powder", "2 large eggs", "1 teaspoon vanilla extract", "2/3 cup/85 grams roasted and unsalted cashews, roughly chopped", "1/2 cup/100 grams chocolate chips (any type)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the center of the oven and heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, cocoa powder, baking powder and salt. In a stand mixer fitted with a paddle attachment, beat the butter, sugar and chile powder on medium-low speed until smooth and well combined, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the speed to medium. With the mixer running, add the eggs, 1 at a time, pausing to scrape down the sides of the bowl if needed, then add the vanilla extract. Beat until well mixed, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the speed to low and, with the mixer running, add the flour mixture a little at a time. Continue mixing until the dry ingredients are almost incorporated, scraping the bowl as needed, then add the cashews and chocolate chips all at once. Keep mixing until the cashews and chocolate have integrated and a thick dough has formed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in half and roll each half into a 12-inch log. (You can use a sheet of wax or parchment paper to help roll the dough evenly, or dust with extra flour if the dough is sticky.) Place both logs on a half-sheet pan lined with parchment paper, then flatten both logs with your palms until about 1-inch thick. Sprinkle each with a little granulated sugar to evenly coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the logs lose their sheen, 20 to 25 minutes. There should still be some softness in the middle of each log when gently pressed. Be careful not to overbake, as the logs may break when sliced later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the oven, take out the biscotti and let cool on the sheet pan for a few hours. (The longer they rest, the easier they will be to slice without breaking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the second bake, heat the oven to 300 degrees. (The temperature is lower for gentler, more even baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a serrated knife, slice each log at an angle into ½-inch slices. You may trim and discard the ends or bake them along with the other slices — they taste just as good. Place the slices, cut sides down, on the same parchment-lined half-sheet pan. (You don’t need to be careful about spacing them out.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 25 minutes, or until the biscotti are no longer soft to the touch. They will harden a little further after cooling. Remove from the oven and cool completely on the pan. The biscotti will keep for 2 weeks in an airtight container at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023233-chocolate-chile-biscotti"}