{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Cooker Chicken Gumbo", "description": "Gumbo is a celebrated Cajun and Creole stew of many variations, often starring meat and seafood, all richly flavored with a toasty roux. The precise origins of the word gumbo are often debated, but it’s likely derived from West African, Central African and Choctaw languages. Okra and roux are fundamental to gumbo; filé powder, or ground sassafras leaves, is sometimes added to help thicken the stew. It is certainly not traditional to make gumbo in a slow cooker, but it works beautifully: Microwaving the roux and precooking the vegetables in a microwave-safe ceramic (check your manual, and never use metal) insert minimizes hands-on time and clean up without sacrificing that deep flavor. This recipe is highly customizable: Add sliced andouille sausage before cooking, or toss in raw shrimp 10 minutes before serving. Use bone-in, skin-on chicken if you prefer, and fresh okra instead of frozen.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2022/09/07/dining/sdg-slow-cooker-chicken-gumbo/sdg-slow-cooker-chicken-gumbo-articleLarge.jpg", "totalTime": "PT5H30M", "recipeYield": "5 to 6 servings", "recipeCuisine": "cajun, creole, southern", "recipeCategory": "dinner, soups and stews, main course", "keywords": "chicken thigh, okra, slow cooker", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 527}, "recipeIngredient": ["1/2 cup all-purpose flour", "1/2 cup vegetable oil", "8 garlic cloves, smashed and chopped", "2 celery stalks, finely chopped", "1 white onion, finely chopped", "1 green bell pepper, finely chopped", "2 tablespoons tomato paste", "2 teaspoons coarse kosher salt, plus more to taste", "2 fresh or dried bay leaves", "2 teaspoons sweet or hot paprika", "1 teaspoon smoked paprika", "1 teaspoon garlic powder", "1/2 teaspoon ground cayenne, plus more to taste", "1/2 teaspoon dried thyme", "Black pepper", "3 cups chicken stock or broth", "1 1/2 to 1¾ pounds boneless, skinless chicken thighs", "1-pound bag frozen sliced okra (optional)", "Cooked rice, for serving", "Sliced scallions and hot sauce, for topping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the insert of a 6- to 8-quart slow cooker, whisk the flour and oil together until evenly combined. (If your insert doesn’t fit in your microwave, or if it is not microwave-safe, use a large microwave-safe bowl. Never put metal in the microwave.) Microwave on full power for 3 minutes, then whisk well. Using oven mitts, rotate the insert or bowl if your microwave doesn’t rotate. Microwave in 15- to 30-second increments, whisking and rotating after each, until the roux is the color of milky coffee or peanut butter. (Total cooking times can vary from 4 to 15 minutes depending on the strength of your microwave, so keep a close eye on it.) See Tip for stovetop roux instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the garlic, celery, onion, bell pepper, tomato paste and salt into the roux until evenly combined. Microwave for 4 to 8 minutes, stirring occasionally, until softened. Using mitts, remove the insert and set it into the slow cooker base. (If using a separate container, scrape the mixture out into the slow cooker.) Stir in the bay leaves, paprikas, garlic powder, cayenne, thyme and several generous grinds of black pepper. Stir in the chicken stock and chicken thighs. Cook on low until the chicken is very tender, about 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 15 minutes before the gumbo is done, add the frozen okra, if using. Before eating, remove and discard the bay leaves and break the chicken apart into coarse pieces by pressing the chicken against the walls of the insert with a large spoon or spatula. Taste for seasoning and add more black pepper, salt and cayenne if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the gumbo in bowls topped with hot rice and scallions. Pass hot sauce at the table if you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023446-slow-cooker-chicken-gumbo"}