{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash, Leek and Za’atar Pie", "description": "This comforting pie makes a great vegetarian centerpiece, ideal for a celebration. It benefits from being assembled the day before, receiving a good amount of time to set in the fridge and thus involving a lot less work on the day you plan to enjoy it. You can also bake the whole thing a few hours in advance, then just reheat it in the oven for 20 minutes, if you like. Use any extra pastry trim to cut out fun, festive shapes like holly leaves or stars to personalize your pie. Serve this alongside roasted veggies or a big leafy salad.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2022/12/20/multimedia/25EAT-butternut-squash-pie-Alternate-1-f473/25EAT-butternut-squash-pie-Alternate-1-f473-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, main course, side dish", "keywords": "butternut squash, cream cheese, feta, leek, make-ahead, party, puff pastry, savory pie, swiss chard, za'atar, fall, winter, thanksgiving, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 762}, "recipeIngredient": ["1 small (2-pound) butternut squash, peeled, halved lengthwise, seeded and cut into 1-inch pieces", "1 tablespoon maple syrup", "1/2 teaspoon ground cinnamon ", "4 tablespoons extra-virgin olive oil", "Fine sea salt and black pepper", "1 large leek, trimmed, halved lengthwise, then thinly sliced crosswise", "8 scallions, trimmed and finely chopped", "3 garlic cloves, minced", "1 tablespoon plus 1 1/2 teaspoons za’atar ", "¼ pound Swiss or rainbow chard, leaves and stems finely chopped (about 2 cups)", "3/4 cup/6 ounces cream cheese", "2/3 cup/3 1/2 ounces finely crumbled feta", "2 (14-ounce) sheets puff pastry", "1 large egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix together the butternut squash, maple syrup and cinnamon with 1 tablespoon oil and 1 teaspoon salt. Spread onto a large baking sheet and bake until just cooked through, 15 to 20 minutes. Remove from the oven, let cool for 15 minutes, then transfer back to the bowl and refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the remaining 3 tablespoons oil to a medium saucepan; heat over medium-high. Once hot, stir in the leek, scallions, garlic and 1 teaspoon salt; cook, stirring occasionally, until the leeks have softened but not browned, about 8 minutes. Add 1 tablespoon za’atar and stir 1 minute more, until fragrant, then stir in the chard and 1 tablespoon water. Cook for 2 minutes, stirring occasionally, just until the leaves have wilted, then remove from the heat. Transfer the mixture to a separate bowl and set aside to cool for 15 minutes, then refrigerate until needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, use a spatula to combine the cream cheese, feta and a good crack of pepper. Stir this into the butternut squash mixture then return to the fridge. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a clean work surface, unroll or unfold both sheets of puff pastry; roll each into a 10-by-16-inch rectangle. Cut one sheet down to a 6-by-16-inch rectangle, and, if you like, use small festive cutters to cut out shapes from the trim. Place the trimmed puff pastry sheet on a large, parchment-lined baking sheet; pierce it all over with a fork then use a knife to lightly mark a 1-inch border around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the cooled leek mixture on top of the base of the trimmed puff pastry sheet, avoiding the edges, then dollop the butternut squash mixture on top. Brush the border with some of the beaten egg. Take your other sheet of pastry, drape it over the pie and trim the excess dough. Use a fork to press down and seal the border, then trim and discard any rough edges. Brush the pie and the cutouts (if using) with some of the remaining beaten egg, then arrange the cutouts on top of the pie. Sprinkle all over with the remaining 1 1/2 teaspoons za’atar. Refrigerate the pie on its baking sheet, uncovered, for at least 1 hour, or overnight if getting ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake the pie, heat the oven to 425 degrees. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the chilled pie until golden, about 15 minutes. Reduce the temperature to 350 degrees and cook for a further 45 minutes, or until cooked through. Remove from the oven and set aside to cool for at least 20 minutes. Transfer onto a large platter or board, slice crosswise into segments and serve warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023626-butternut-squash-leek-and-zaatar-pie"}