{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Turkey Burgers", "description": "There are a couple steps to ensure a crisp on the outside, juicy on the inside and all around delicious grilled turkey burger. Grated onion and barbecue sauce give the patties savoriness and provide additional moisture, so they don’t dry out from the high heat of the grill. Coating the patties in a mixture of barbecue sauce and mayonnaise guarantees a seared and glazed exterior. If you’d like to turn these into cheeseburgers, simply drape sliced cheese — preferably Cheddar or pepper Jack — over the patties in the last two minutes of grilling and cover the grill.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/08/02/dining/AS-Grilled-turkey-burgers1/merlin_209335332_b700c807-291b-44db-8ecb-7a61222f7de4-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, burgers, main course", "keywords": "barbecue sauce, ground turkey, mayonnaise, onion, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 297}, "recipeIngredient": ["Neutral oil (such as canola), for greasing", "1 medium yellow onion, peeled", "1 pound ground turkey", "1/4 cup store-bought or homemade barbecue sauce", "2 tablespoons mayonnaise", "Kosher salt (such as Diamond Crystal)", "Black pepper", "4 hamburger buns", "Toppings (such as shredded iceberg, sliced onion, tomato and pickles) and condiments (mayonnaise, barbecue sauce or mustard), as desired "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grill to medium-high. Lightly grease a plate and set aside. Coarsely grate 1/4 cup onion; reserve the remaining onion. In a medium bowl, mix the turkey, grated onion and 2 tablespoons barbecue sauce. Form 4 patties about 4 ½ inches wide (about 5 ounces each). Press a small dimple in the center of each patty, then place the burgers on the plate and refrigerate until firm (at least 5 minutes or, covered, up to 2 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, stir together the remaining 2 tablespoons barbecue sauce with the mayonnaise; season with 1 teaspoon each of salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to grill, dip the reserved onion in oil. Clean the grates with a grill brush, then grease the grates with the oiled onion. (This perfumes the grill and your patties.) Lightly coat the tops of the burgers with some of the mayo mixture (about 1/2 teaspoon per patty). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the burgers, mayo side down, until well browned and patties release from the grates, 4 to 6 minutes. (If flare-ups occur, move to an area of the grill where there are no flames underneath. For a gas grill, close the lid between flips, listening and keeping an eye out for flare-ups.) Spread mayo mixture on the tops of the patties, then flip and grill on the second side until cooked through, another 4 to 6 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a plate and let rest for at least 5 minutes. Grill the cut sides of the buns until toasted, 1 to 2 minutes. Build burgers on the buns with the patties and desired toppings and condiments."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023342-grilled-turkey-burgers"}