{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Spicy Pan-Seared Pork Chops", "description": "Simple pork chops taste luxurious when they’re draped in ginger butter and a sticky-sweet whiskey sauce. The ingredient list here is minimal thanks to unsulphured molasses, a natural byproduct of sugar processing. It delivers an intriguing sweetness that is smoky, bitter and savory — like honey, chicory, coffee and soy sauce in one ingredient. And, in this recipe, it melds with whiskey and ginger to add warmth and spice, as well as brown sugar and butter to soften the assertive edges. Serve these chops with roasted carrots, mashed sweet potatoes or grits.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/12/07/multimedia/as-spicy-sweet-pork-chops-1-b457/as-spicy-sweet-pork-chops-1-b457-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 3 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, for two, quick, weeknight, meat, main course", "keywords": "date night, fresh ginger, molasses, pork chop, skillet, whiskey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 274}, "recipeIngredient": ["2 (1- to 1½-inch-thick) bone-in pork rib chops, patted very dry", "1 tablespoon plus 1 teaspoon light brown sugar", "Salt", "¼ cup whiskey or apple cider vinegar", "3 tablespoons unsulphured molasses (see Tip)", "1 tablespoon neutral oil, such as canola or grapeseed", "1 (2-inch) piece ginger, thinly sliced and smashed, plus 1 teaspoon peeled and finely grated", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat the pork chops with 1 teaspoon brown sugar, and sprinkle generously with salt. In a liquid measuring cup or small bowl, stir together 3 tablespoons water, the remaining 1 tablespoon brown sugar, whiskey and molasses. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat the oil over medium. Add the pork chops and cook, flipping every 2 minutes, until browned on the outside and the internal temperature in the thickest part is 110 to 120 degrees, 8 to 10 minutes. Reduce heat if sugar is burning. If your chops have a fat cap, using tongs, stack both chops on top of each other, then grab both chops together and hold upright to sear the fat caps until crisp, about 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the chops back down in a single layer and top with the sliced ginger. Add the butter, tilt the skillet and baste the pork by spooning the melting butter and drippings over the pork until the internal temperature registers 135 degrees, 2 to 3 minutes. Turn off the heat and transfer the pork and ginger to a plate to rest for at least 5 minutes. Pour off all but 2 tablespoons of the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the molasses mixture into the skillet. Bring to a simmer over medium, standing back as it might sputter or flame. Reduce heat to medium-low and simmer until the sauce resembles maple syrup and coats a spoon, 3 to 5 minutes. It can be tempting to crank the heat, but don’t, or the sauce risks tightening or burning. If your sauce gets too thick, thin with water. Turn off heat and stir in the grated ginger."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the sliced ginger and stir resting juices into the sauce. Serve the pork chops with a spoonful of the sauce."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023728-sweet-and-spicy-pan-seared-pork-chops"}