{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken and Vegetables With Tahini", "description": "This comforting but peppy chicken-and-vegetable combo accommodates any root vegetables that you like or need to use up. Roast them alongside morsels of boneless chicken thighs that have been tossed with ginger, dill and citrus zest. What comes out of the oven needs just a drizzle of straight-from-the-jar tahini: It is nutty, creamy and a great counterpart to sweet root vegetables, for those times you just don’t feel like making a sauce. Finish with more herbs and maybe a scattering of red-pepper flakes and sesame seeds, then pile the mixture over whole grains, a salad or sautéed greens, or into a pita. For a vegetarian version, swap the chicken for chickpeas, extra-firm tofu or tempeh.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2022/03/02/dining/as-tahini-chicken/merlin_198330990_7d933f6d-aa97-4a13-9010-9ddf928236a1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry, main course", "keywords": "carrot, chicken, ginger, root vegetables, tahini, fall, spring, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 934}, "recipeIngredient": ["1 1/2 to 2 pounds boneless, skinless chicken thighs, cut into 1-inch pieces", "2 tablespoons grated ginger (from a 3-inch root)", "1/4 cup coarsely chopped dill or cilantro leaves and stems", "1 tablespoon lime or lemon zest (from 1 to 2 fruits)", "5 cups 1/2-inch-diced root vegetables (about 1 1/2 pounds, peeled if desired), such as parsnips, sweet potatoes, carrots, yellow beets, turnips and celery roots ", "2 tablespoons extra-virgin olive oil or melted coconut oil", "Kosher salt (Diamond Crystal)", "Black pepper", "3 tablespoons tahini, well-stirred", "Red-pepper flakes and toasted sesame seeds (optional), for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees with a rack in the lower third of the oven. On a sheet pan, combine the chicken, ginger and 2 tablespoons of the chopped dill. Sprinkle about 1 tablespoon lime zest over the mixture, then toss with your hands to combine. Add the root vegetables, olive oil, 2 teaspoons salt and a few generous grinds of pepper. Toss to coat, then arrange in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until the vegetables are soft and caramelized and the chicken is cooked through, 30 to 35 minutes. (Check the mixture halfway through cooking; if some vegetables are browning too quickly, give them a stir.) If you want the chicken more browned, run the pan under the broiler for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the tahini over the sheet pan and let sit, 2 to 3 minutes. Sprinkle with the remaining dill, as well as the red-pepper flakes and sesame seeds as desired. Cut one of the limes into wedges for squeezing over. (Refrigerate the other for another use.)"}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023013-roast-chicken-and-vegetables-with-tahini"}