{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Broccoli Rabe and White Beans With Burrata", "description": "With just a few ingredients, this impressive and quick dish boasts many flavors and textures. Roasting broccoli rabe creates tender stems while the leaves crisp like chips. The broccoli rabe cooks alongside paprika-stained white beans, which become warm, creamy and even crisp in spots as they roast. Eat the beans and greens warm or at room temperature, as a starter or vegetarian main, with slices of orange and a puddle of creamy burrata for softness and sweetness. (You could also use ricotta, thick yogurt or avocado instead of the burrata.) This dish is good on its own, or with farro, pearl couscous or crusty bread.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2023/01/04/multimedia/as-bitter-greens-with-citrus-and-burrata-1-4e66/as-bitter-greens-with-citrus-and-burrata-1-4e66-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, appetizer, main course, side dish", "keywords": "beans, broccoli rabe, burrata, extra virgin olive oil, smoked paprika, vegetables, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "recipeIngredient": ["1 pound burrata", "1 bunch broccoli rabe (about 1 pound), tough ends removed, halved crosswise", "1/4 cup extra-virgin olive oil, plus more for serving", "Salt and black pepper", "1 (15-ounce) can white beans, rinsed and patted very dry", "1 teaspoon smoked paprika ", "2 oranges "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the burrata out of the fridge to let it warm to room temperature. Heat the oven to 400 degrees and, if desired, line a sheet pan with parchment or foil for easier cleanup. On the sheet pan, toss the broccoli rabe with 2 tablespoons olive oil and salt until coated. Spread it out (it will be crowded). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together the white beans, 1 tablespoon olive oil, the smoked paprika, a pinch of salt and lots of black pepper until coated. Spoon the beans over the broccoli rabe; set aside the bowl (no need to rinse). Roast until the broccoli rabe is tender and crisp in spots, 15 to 20 minutes. Let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut off the top and bottom of the oranges and set it on one of the flat, cut sides. Follow the curve of the fruit to cut away the peel and pith. Squeeze the peels into the reserved bowl to get out any juice. Cut the fruit in half from top to bottom, then slice into ¼-inch-thick half-moons and pluck out the seeds. If your pieces are especially large, halve them again. Transfer the fruit and any juice on the cutting board to the bowl. Drizzle with the remaining 1 tablespoon olive oil and a pinch of salt and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To eat, transfer the broccoli, beans and burrata to a platter or plates, then top with the orange slices and a drizzle of the juices in the bowl. Season with more salt, pepper and olive oil as you like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023789-roasted-broccoli-rabe-and-white-beans-with-burrata"}