{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Mushrooms With Smoky Pomegranate Sauce", "description": "For the very best roasted mushrooms, this recipe employs a steam-roast method, which allows the mushrooms to caramelize and crisp while retaining a surprising amount of moisture. They’re tossed on a sheet pan with olive oil, poultry seasoning and granulated onion for flavor, then covered tightly with foil and set in the oven to steam in their own juices until tender. Finally, they’re broiled just until their edges crisp, and their natural essence becomes more concentrated with deep nutty notes. An easy pan sauce made with pomegranate juice, peppercorns and ancho chile provides a burst of tanginess and brilliant color — and it is easily made vegan with the use of vegan butter.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2022/11/16/dining/09VEG-THANKSGIVING-roasted-mushrooms-with-smoky-pomegranate/merlin_216141147_90702cee-ff80-454c-b785-cc35178e8a64-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables, main course, side dish", "keywords": "ancho chile, black peppercorn, oyster mushroom, pomegranate juice, rosemary, shallot, christmas, thanksgiving, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 222}, "recipeIngredient": ["1/4 teaspoon poultry seasoning", "1/4 teaspoon granulated onion", "1 1/2 teaspoons kosher salt (such as Diamond Crystal)", "1 teaspoon black pepper", "4 tablespoons extra-virgin olive oil, plus more for brushing", "3 pounds oyster mushrooms, torn into small clusters, or other mushrooms (see Tip)", "6 small fresh rosemary sprigs ", "3 tablespoons unsalted butter or vegan alternative ", "1 large shallot, minced", "1 dried ancho chile, torn into big pieces, seeds and stem discarded", "2 large garlic cloves, minced", "4 teaspoons whole black peppercorns, coarsely crushed using the flat side of a knife", "Kosher salt (such as Diamond Crystal)", "1 teaspoon vegetable stock concentrate (such as Better Than Bouillon), optional", "2 cups pomegranate juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees and set a rack closest to the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mushrooms: In a small bowl, stir together the poultry seasoning, granulated onion, salt and pepper. Lightly brush 2 large sheet pans with olive oil to coat. Divide the mushrooms among sheet pans. Drizzle each batch with 2 tablespoons olive oil, then gently toss to coat. Sprinkle the mushrooms evenly with the spice blend and toss to coat again. Tuck the rosemary sprigs among the mushrooms, wrap tightly with aluminum foil and set both sheet pans in the oven to tenderize the mushrooms, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mushrooms steam, prepare the pomegranate sauce: In a medium saucepan, heat the butter over medium until melted. Stir in the shallot, chile, garlic and peppercorns. Season with 1/4 teaspoon salt and cook, stirring frequently, until fragrant and softened, about 5 minutes. Stir in the stock concentrate (if using), then pour in the pomegranate juice and cook over medium-high, whisking occasionally, until the liquid is the consistency of maple syrup and thick enough to coat a spoon, 15 to 20 minutes. Strain through a fine-mesh sieve, pushing on the solids to extract any liquid. You should have about 1/2 cup sauce, which will keep, refrigerated, for up to 2 days. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the mushrooms have steamed, heat the broiler to high. Pull the mushrooms from the oven and remove the foil. Working with 1 sheet pan at a time, return the mushrooms to the rack nearest the broiler and cook, uncovered, until browned and caramelized at the edges, 4 to 6 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard rosemary and season mushrooms to taste. Arrange the mushrooms on a serving platter. Drizzle lightly with pomegranate sauce, passing the remaining sauce at the table."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023635-roasted-mushrooms-with-smoky-pomegranate-sauce"}