{"@context": "http://schema.org", "@type": "Recipe", "name": "Tamales de Rajas con Queso (Poblano and Cheese Tamales)", "description": "A plant-based breakfast or midday snack sold in the streets of Oaxaca, tamales de rajas y queso rival pork- and chicken-filled tamales in their appeal. Unlike their corn husk-wrapped northern cousins, these tamales feature charred banana leaves, which give them a roasted, almost vegetal flavor. The masa is then pressed on top before it’s filled, sauced and wrapped. ", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/06ESSENTIALSREX-tamales/merlin_214158642_2d8eed8c-77e5-4f73-bd06-68af80df0c8c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 tamales", "recipeCuisine": "mexican", "recipeCategory": "breakfast, lunch, snack, project, main course", "keywords": "cherry tomato, chiles de árbol, cornmeal, mozzarella, poblano, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "recipeIngredient": ["5 medium poblano chiles (626 grams)", "1 1/4 cups extra-virgin olive oil", "1 pint cherry tomatoes", "1 medium white onion, thinly sliced", "2 garlic cloves, finely grated", "2 chiles de árbol, stemmed and crushed", "1 tablespoon kosher salt (such as Diamond Crystal)", "3 pounds fresh, coarse grind corn masa for tamales, “unprepared” (see Tip, or use 4 1/4 cups masa harina) ", "1 pound fresh or thawed frozen banana leaves, washed and patted dry", "4 ounces queso Oaxaca or mozzarella, torn or cut into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rajas mixture: Roast the chiles. To roast the chiles on a gas stove (see Tip for other methods), turn 3 of the burners to high and set 2 chiles poblanos on each of the 2 grates and the remaining chile on the third. Roast over the flames, turning them occasionally, until all sides are charred, about 4 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chiles to a large bowl, cover the bowl tightly with plastic wrap, and let the chiles steam for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil, tomatoes, onion, garlic and chiles de árbol in a medium saucepan over medium, stirring occasionally, until tomatoes and onion are very soft but still hold their shape and the oil is rapidly boiling, 8 to 10 minutes. Remove from heat and strain oil into a heatproof bowl. Set aside vegetables and oil until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the stems, then peel and remove seeds from each chile (use gloves if you have them — poblanos can be spicy – and don’t be tempted to rinse the peels off with water, which will wash off all of the flavor). Cut the chiles into 1/4-inch-wide strips. Add the rajas to the tomato-onion mixture and gently stir to combine. Set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the tamales: In a small measuring cup, stir salt into 1/4 cup warm water until partly dissolved. In a large bowl, mix the masa, salt water and reserved tomato-onion oil with your hands until the mixture is shiny, smooth and easily spreadable, about 5 minutes. (It should be the consistency of thick cake frosting.) Cover the bowl with plastic wrap and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the tamales, unfold a banana leaf (it should be 2 to 3 feet long). If you have gas burners, heat 1 on high. Using tongs if necessary, hold the leaf at each end and very slowly move the leaf over the flame, allowing it to drag across the grates, leaving it in one place until you see light discoloring coming through the top. Continue moving the leaf very slowly over the burner until the entire leaf is lightly charred and smells very toasty and fragrant, about 3 to 7 seconds to see charring in one spot. Repeat with the remaining banana leaves. If you don’t have gas burners, unfold the leaves and place them in a large stockpot. Cover with water and bring to a boil. Cook for 3 minutes to soften, then drain, cool and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tough center rib and cut the leaf into 12-inch-long pieces; reserve the scraps. The leaves will vary in width from 10 to 16 inches depending on the age and type of tree they came from. Ideally, you want a piece that’s at least 12 by 10 inches. If your leaves are narrow or have holes in them, you can double up and slightly offset the leaves to get the right length. Arrange the leaf so a long side is facing you. Measure out 1/2 cup (160 grams) of masa and place it onto the center of the leaf and shape into a 6-inch by 3-inch rectangle about 1/2-inch thick. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange 1/4 cup of rajas mixture evenly over the top of the masa. Top with a few pieces of queso."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold a long side of the leaf over the filling, then fold over the other long side to cover. Fold the 2 short ends over the seam side of the tamal. Set the tamal on a sheet pan seam- and fold-side down. Repeat to assemble the remaining tamales."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a metal basket, steamer basket or rack insert into a tamal pot, stockpot or pasta pot. Fill with enough water so it comes up to just below the basket (you don’t want the water to touch the tamales). Line the bottom of the basket with half of the reserved banana leaf scraps to cover any exposed metal. Arrange and stack the tamales, seam-side down, in the basket. Cover the tamales with remaining banana leaf scraps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pot and bring the water to a boil over high heat. Reduce the heat to low to keep the water at a simmer and steam for 35 minutes, adding more water as needed to keep some liquid in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove a tamal and set aside to cool for 5 minutes. (If you don’t let the tamal rest before checking, the masa will stick to the leaf and appear gummy.) Unfold the leaf — if the masa sticks, it’s not ready. If it’s not ready, carefully refold and return the tamal to the pot. Cook for 5 minutes more, then check again. If the leaf peels back easily and no masa sticks, your tamales are done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat, uncover the pot and let sit for 5 minutes before serving."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023505-tamales-de-rajas-con-queso-poblano-and-cheese-tamales"}