{"@context": "http://schema.org", "@type": "Recipe", "name": "Kubbeh Pie", "description": "One of the most recognized foods across the Arab world and the Mediterranean, kubbeh has countless variations, and different <a href=\"https://cooking.nytimes.com/search?q=kibbe\">pronunciations</a> depending on country or even region. Usually made of a bulgur-based shell with a meat, onion and nut filling, the Levantine croquettes are a staple in any feast or spread and a prominent feature on Arab holiday tables across the U.S. The pie form is a substantially easier version that captures all the delicious flavors in a main dish, without requiring shaping individual parcels or deep frying. A garlicky spread like <a href=\"https://cooking.nytimes.com/recipes/1016438-tzatziki\">tzatziki</a> or tahini sauce (recipe below) provides the perfect fresh contrast to the kubbeh’s warm, earthy flavors. ", "author": {"@type": "Person", "name": "Reem Kassis"}, "image": "https://static01.nyt.com/images/2022/12/14/multimedia/07kubbehrex2-kubbeh-pie-1-6b92/07kubbehrex2-kubbeh-pie-1-6b92-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings (or 12 to 16, if part of a spread)", "recipeCuisine": "", "recipeCategory": "dinner, main course, side dish", "keywords": "allspice, beef top round, bulgur, ground beef, ground cinnamon, ground cumin, make-ahead, pine nut, project, tahini, walnut, yogurt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 76}, "recipeIngredient": ["10 ounces extra-lean beef (round cuts such as eye, top and bottom round, or top sirloin or tip all work), trimmed of any fat, gristle or silver skin, and cut into cubes", "1 3/4 cups extrafine (No. 1) bulgur (see Tip) ", "1 small yellow onion, quartered", "1 teaspoon fine sea salt", "1/2 teaspoon ground allspice", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground cumin", "1/4 teaspoon ground black pepper", "Melted ghee or olive oil, for greasing and baking ", "Slivered almonds or pine nuts (optional), to garnish", "1/2 cup coarsely chopped walnut pieces", "1/4 cup pine nuts ", "1/4 cup olive oil", "2 medium or 1 large yellow onion, finely diced (about 2 cups)", "1 pound ground beef", "1 teaspoon fine sea salt", "1/2 teaspoon ground allspice", "1/2 teaspoon ground cinnamon", "1/4 teaspoon freshly ground black pepper", "1/2 cup tahini", "1/4 cup lemon juice", "1/4 cup plain yogurt", "1/2 teaspoon sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Prepare the shell: Place the beef cubes in a single layer on a parchment-lined plate or cutting board and put in the freezer to partially freeze (this makes grinding easier), about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start the filling by toasting the nuts: Add the walnuts and pine nuts to a baking sheet on separate sides, spread in an even layer and bake until lightly golden, 5 to 7 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the bulgur in a large bowl and soak in 1 3/4 cups of cold water. Allow to sit for 15 to 30 minutes, by which point the bulgur should have absorbed all the water. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the 1/4 cup olive oil in a skillet over medium. Fry the diced onions until translucent and soft, stirring occasionally, about 8 minutes. Add the ground beef, salt, allspice, cinnamon and pepper and continue cooking, stirring to break up the meat, until any released water has evaporated, about 4 minutes. Remove from heat, mix in the toasted nuts and set aside. The filling can be prepped up to 1 day in advance. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the shell: Put the quartered onion, salt and spices into the bowl of a food processor and process until finely ground, scraping down the sides with a spatula, as needed. Add the partially frozen meat, in batches if necessary, and process until smooth and pasty. Add the soaked bulgur and pulse until combined. Transfer to a bowl and knead briefly until smooth and evenly combined. Dough can be used right away or covered and refrigerated up to 1 day. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees and prepare a bowl of ice water nearby to wet your hands while you shape the kubbeh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the pie: Line a 10- to 12-inch round or 9-by-13-inch rectangular baking dish (metal is traditional, but glass will also do) with plastic wrap, leaving a generous overhang. Divide the shell mixture in half and spread one half, wetting your hands to make it easier, in an even layer over the base of the lined baking dish. Using the plastic overhang, lift this layer out of the pan and set aside. This will become the top of the pie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously grease the bottom and sides of your baking dish with ghee or olive oil. Spread the remaining shell mixture in an even layer in the bottom of the pan. Spoon in the filling and press it evenly into the shell with your hands. Take the top layer you prepared earlier and carefully flip it over the filling, discarding the plastic wrap. With wet hands, gently pat it down and smooth it out to fully cover the shell. Brush generously with ghee or olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the tip of a sharp knife, score the top layer to form a geometric pattern, rinsing the knife between each cut. If using a rectangular dish, the most customary is a diamond pattern, which can be achieved with criss-crossing diagonal lines. If using a round dish, you can do diamonds or divide the circle into quarters or eighths then do a diamond pattern within each triangle. Once you have created your pattern, cut all the way through the bottom of the kubbeh along the lines that you want each serving size to be, whether you want smaller portions for an appetizer or larger portions for a main. If you are garnishing the top, you can firmly press a sliver of almond or a pine nut within each diamond shape. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, uncovered, for 35 to 45 minutes, until golden brown. Check it once or twice during cooking, and if it seems dry, brush with more ghee or olive oil. Allow to cool for 10 minutes before slicing and serving hot or at room temperature"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are preparing the tahini sauce, put all the ingredients in a bowl with 4 tablespoons of water and mix until smooth and evenly incorporated. It will seize at first, but keep stirring and it will smooth out. Serve alongside the kubbeh. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023651-kubbeh-pie"}