{"@context": "http://schema.org", "@type": "Recipe", "name": "Artichoke and Olive Farro Salad", "description": "Farro, a nutty Italian grain with a chewy texture, is an excellent candidate for a savory, herb-flecked pantry salad that travels well. The grain is not intimidated by bold flavors: Tangy oil-marinated artichokes, briny kalamata olives, feta and crisp red onion take wholesome farro by the hand and lead it straight to the dance floor. Cook times vary depending on the type of farro. Quick-cooking, pearled or semi-pearled all work well, but hulled is not recommended here, as it would need soaking and takes a long time to cook. Don’t be shy with the oil and vinegar: The farro absorbs them the longer it sits. If farro is not available, you can use orzo (see Tip), or other hearty grains like barley, wheat berries or freekeh. ", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/07/27/dining/22COOLERSREX1/22COOLERSREX1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings ", "recipeCuisine": "", "recipeCategory": "dinner, lunch, grains and rice, salads and dressings, main course", "keywords": "artichoke hearts, dill, farro, feta, kalamata olives, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 328}, "recipeIngredient": ["Kosher salt (such as Diamond Crystal) and black pepper", "1 cup quick-cook, pearled or semi-pearled farro, rinsed and drained (see Tip) ", "2 tablespoons red wine vinegar, plus more as needed", "2 tablespoons extra-virgin olive oil, plus more as needed", "1/3 cup pitted kalamata olives, sliced in half lengthwise", "About 1 cup (5.4 ounces) marinated quartered artichoke hearts from a jar, coarsely chopped", "1/2 cup crumbled feta", "1/3 cup chopped fresh dill leaves", "1/4 medium red onion, finely chopped (about ⅓ cup) ", "1/4 cup thinly sliced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside a sheet pan or a large plate. Bring a medium pot of well-salted water to a boil. Add the farro and give it a stir. Reduce the heat to medium-high and cook according to package instructions, skimming off any foam that rises, until the grains are tender and plump. Depending on the type of farro used, this can take anywhere from 15 to 45 minutes. Drain the farro and transfer to the sheet pan or plate; spread out and cool to room temperature, 10 to 15 minutes. (If the farro is left to cool in the strainer, it will keep cooking, take longer to cool and turn mushy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the farro to a medium mixing bowl. Add the vinegar, oil and ½ teaspoon salt, and stir to combine. Add the olives, artichoke, feta, dill, red onion and chives, and season with black pepper to taste. Stir and taste. Add more salt, vinegar and oil, as needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve right away or store in the fridge for up to 2 days. The farro will absorb the vinegar and oil the longer it sits. Adjust seasoning, vinegar and oil before serving. "}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023352-artichoke-and-olive-farro-salad"}