{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Honey Nut Squash and Chickpeas With Hot Honey", "description": "Colorful and meatless, sweet and fiery, this sheet-pan dinner is an exuberant combination of cold-weather vegetables and warming spices that will perk up any weeknight. Although the recipe takes about an hour from start to finish most of it is hands-off, and the actual prep time is relatively short. If you don’t have hot honey, you can substitute regular honey and a pinch of cayenne. And try to use canned chickpeas prepared with sea salt; the unsalted kind are bland.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/01/28/multimedia/28apperex-1-9164/28apperex-1-9164-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, vegetables, main course", "keywords": "butternut squash, chickpea, cilantro, sheet-pan, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2066}, "recipeIngredient": ["2 (14.5-ounce) cans chickpeas (preferably not “no salt added”), drained and rinsed", "2 1/2 pounds honey nut or butternut squash, peeled, trimmed, seeded and cut into 1-inch cubes (6 cups)", "1 3/4 teaspoons baharat, garam masala or another spice blend", "1 1/4 teaspoons fine salt, plus more as needed", "5 thyme sprigs", "1/8 teaspoon red-pepper flakes", "3 tablespoons extra-virgin olive oil, plus more as needed", "1 small red onion, thinly sliced", "1 teaspoon cider vinegar or rice wine vinegar, plus more as needed", "1/2 cup fresh cilantro leaves or dill sprigs, or a combination", "1 to 2 tablespoons hot honey, plus more to taste", "Plain whole-milk yogurt or sour cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line one sheet pan with parchment paper and a second sheet pan with a clean kitchen towel or paper towels. Place drained chickpeas on the towel-lined sheet pan and gently rub them dry. Place the pan on the back of the stove and let the chickpeas dry as you prepare the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the squash on the parchment paper-lined pan and toss with 1 teaspoon baharat, 1/2 teaspoon salt, thyme sprigs, red-pepper flakes and 2 tablespoons oil. Spread squash into an even layer and roast for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 20 minutes of roasting, in a medium bowl, combine chickpeas, red onion, remaining 3/4 teaspoon baharat, 3/4 teaspoon salt and 1 tablespoon oil, and toss until well combined. Add the mixture to the pan of squash and stir everything well. Continue roasting for another 30 minutes, tossing the mixture halfway through, until the squash is golden brown and tender, and the chickpeas and onions are slightly crispy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven, sprinkle vinegar and herbs on top and toss. Drizzle with hot honey and toss again to combine. Taste and season with more salt, more hot honey and vinegar to taste. Serve with dollops of yogurt if you’d like."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023687-roasted-honey-nut-squash-and-chickpeas-with-hot-honey"}