{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Spaghetti With Roasted Artichokes", "description": "Lemon zest, lemon juice, Parmesan and basil come together for a silky and vibrant sauce that makes this weeknight-friendly pasta sing. The addition of roasted artichoke hearts adds texture and complements the zestiness of the dish. There’s no better time than a weeknight to embrace canned or frozen artichoke hearts, as they are immensely less work than whole fresh ones, and they roast beautifully — and effortlessly — in a hot oven. Holding onto that salty, starchy pasta water is key to ensuring that each spaghetti noodle is enveloped in the lemony sauce; use it judiciously to emulsify the sauce as you quickly toss it.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2022/05/10/dining/nd-lemon-spaghetti-with-roasted-artichokes/nd-lemon-spaghetti-with-roasted-artichokes-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas, main course", "keywords": "artichoke hearts, lemon zest, parmesan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1678}, "recipeIngredient": ["1 pound frozen halved artichoke hearts (thawed in a strainer), or 2 (14-ounce) cans halved artichoke hearts in water, drained", "5 tablespoons extra-virgin olive oil", "Kosher salt (such as Diamond Crystal) and black pepper", "1 pound spaghetti", "6 ounces Parmesan, very finely grated", "1 large lemon, zested (about 1/2 heaping teaspoon) and juiced (about 3 tablespoons)", "1 tablespoon unsalted butter", "1/4 cup torn basil leaves, plus more for garnishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently pat the artichoke hearts with a paper towel to remove excess moisture. Place the artichoke hearts in a mound in the center of the baking sheet. Add 2 tablespoons oil and 1 teaspoon salt, season with pepper and gently toss to combine. Scatter the artichoke hearts in an even layer and roast for 20 minutes. Flip the hearts and roast for an additional 10 minutes, until browned and a little crisp around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of well-salted water to a boil. Add the spaghetti and cook until al dente, about 10 minutes or according to package directions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, in a serving dish large enough to accommodate the spaghetti, add the Parmesan, 1 teaspoon salt, 1/2 teaspoon pepper and the lemon zest; toss to combine. Add the lemon juice and the remaining 3 tablespoons olive oil; stir to combine. The mixture should resemble a thick paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the serving dish next to the pasta pot. Scoop out  and reserve 1 cup of the pasta water. Drizzle 2 tablespoons of it over the Parmesan-lemon mixture; stir to thin out the mixture a little."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, lift out some of the spaghetti (with its cooking water still clinging to it) and transfer to the Parmesan-lemon mixture; quickly toss and drag the spaghetti in a circular motion around the dish to incorporate the sauce. Repeat until you have transferred and tossed all of the spaghetti."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter, basil and 1 tablespoon of the pasta water to the spaghetti, and keep tossing until you have a silky sauce clinging to it. Add more pasta water, 1 tablespoon at a time, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with the roasted artichokes, a little more black pepper and torn basil, and serve."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023185-lemon-spaghetti-with-roasted-artichokes"}