{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Broccoli and Lemon With Chile and Garlic", "description": "Alongside piles of roasted eggplant, the charred broccoli salad has become somewhat of a mascot on the salad display at Ottolenghi restaurants and delis throughout London. So much so, in fact, that it can’t be removed from the menu, let alone tampered with. But here, the favorite is played with: Charred lemons and anchovies, savory with umami, add sourness and funk. Serve this alongside your protein of choice, or as part of an al fresco spread.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2022/05/08/magazine/08mag-eat-site/08mag-eat-site-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings, vegetables, side dish", "keywords": "anchovies, broccoli, chiles, lemon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 556}, "recipeIngredient": ["Salt", "2 small or medium broccoli with stalks (about 1 ½ pounds/700 grams)", "7 tablespoons/103 milliliters olive oil, plus more for grilling", "1 large Fresno chile, thinly sliced at an angle, seeds and all", "6 garlic cloves, thinly sliced lengthways", "5 to 6 anchovies packed in oil, drained", "1 large lemon, cut into 8 thin rounds and seeded, the rest squeezed for 1 teaspoon juice", "1 1/2 tablespoons flat-leaf parsley leaves, roughly chopped", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of well-salted water to a boil over medium-high. Keep a large bowl of ice water next to it. Meanwhile, trim the broccoli so 2 inches/5 centimeters of stalk remain attached. Cut the broccoli in half lengthwise, then cut each half lengthwise again to give you 4 wedges per head."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the broccoli by adding it to the boiling water and cooking for 3½ minutes, until softened. The stalks should retain a nice bite. Use a pair of tongs to remove the wedges and plunge them straight into the ice water to stop them from cooking further. Once completely cool, drain and dry them well, then place in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add 6 tablespoons/89 milliliters of oil, the chiles and garlic to a small frying pan and place it over medium heat. Cook for 7 to 10 minutes, stirring occasionally, until the garlic is golden and the chiles start to become transparent. Use a slotted spoon to transfer the solids to a plate lined with paper towels and set aside to cool and crisp further."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the anchovies to the pan and place over low heat. Cook gently, stirring occasionally, for 10 minutes, until an anchovy is soft enough to be easily squashed with the back of a spoon. Set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, well-greased grill pan over high heat and ventilate your kitchen well. (See Tip for outdoor grilling.) Toss the broccoli gently with 1½ teaspoons olive oil. Once the pan is very hot, grill the broccoli in 2 batches, turning so that all the flat sides have nice grill marks, 6 to 8 minutes per batch. Transfer to a tray to cool down. Grill the lemon rounds for 1½ minutes per side, until nicely charred, then transfer to a chopping board. When cool enough to handle, finely chop the lemon (skin and all) and transfer to a small bowl along with the lemon juice, parsley and remaining 1½ teaspoons olive oil. Mix well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the broccoli has cooled, top with the anchovy oil mixture and toss gently to combine. Arrange on a large serving platter and top evenly with the charred lemon mixture. Lastly, sprinkle over the fried chile and garlic and the flaked salt."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023173-grilled-broccoli-and-lemon-with-chile-and-garlic"}