{"@context": "http://schema.org", "@type": "Recipe", "name": "Kakuni (Braised Pork Belly)", "description": "Kakuni — “square-simmered” in Japanese — is a dish of pork belly cubes that are tender and savory after simmering slowly in a base of soy sauce, sugar and sake. The dish is eaten all over Japan, but its origins are in China. The dish most likely stemmed from dongpo pork: a Chinese braised pork belly dish believed to have been created in the Song dynasty. Because of a strong Chinese presence on Japan’s island of Kyushu, Japanese-Chinese style dishes emerged over time, becoming more distinctly local with each passing century. Now, kakuni remains popular in hubs like Nagasaki — but it’s cooked in homes and izakayas all over. By blending basic Japanese ingredients and allowing ample patience while cooking, a deeply flavorful and rich dish that embodies comfort results. ", "author": {"@type": "Person", "name": "Bryan Washington"}, "image": "https://static01.nyt.com/images/2022/04/03/magazine/03mag-eat-site/03mag-eat-site-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "2 to 4 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, meat, main course", "keywords": "ginger, pork belly, sake", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 205}, "recipeIngredient": ["1 1/2 pounds boneless pork belly, cut into 2 1/2-inch squares", "1 knob ginger (1 1/2 inches), scrubbed and sliced ", "1 1/2 cups sake", "<a href=\"https://cooking.nytimes.com/recipes/1020468-perfect-boiled-eggs\">Soft-boiled eggs</a> (optional)", "3 tablespoons granulated sugar", "3 tablespoons soy sauce", "Karashi (Japanese mustard paste), for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a frying pan over medium (you don’t need to oil the pan) and sear the pork pieces on all sides until lightly browned, about 3 minutes per side. At the same time, bring a medium pot of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pork from the frying pan and wipe off the excess fat with paper towels. Place the pork and ginger in the boiling water, cover with a Japanese drop lid (see Tip) or make your own by shaping a sheet of aluminum foil into a round slightly smaller than the diameter of your pot, cutting large holes all through the foil for ventilation and setting it over the pork. Simmer for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain pork and rinse under running water. Discard ginger. Place pork in a bowl, cover with cold water and allow meat to cool for 5 minutes, changing the water twice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the pork pieces in a single layer in the same pot (no need to wash), and add the sake and enough water so the liquids just cover the meat (about 4 cups). Bring to a boil over medium heat, skimming the scum as needed, then reduce the heat to low. Cover with the drop lid or foil with holes. Simmer for 1 hour, replenishing with water if needed. If you want to serve this dish with soft-boiled eggs, start preparing them now and then peel them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the pork has simmered for an hour, add the sugar to the pot. Simmer for another 5 minutes, then check meat for tenderness. A skewer should slide through easily. Continue simmering if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the soy sauce to the pot, along with the peeled soft-boiled eggs, if using. Simmer for another 10 minutes. Remove the pot from the heat, and allow the dish to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, pour 1/4 cup broth from the pot into a frying pan, and allow it to reduce for 5 minutes to create a sauce. To serve, place kakuni pork pieces and eggs, if serving, in dishes, and top with the sauce. Serve with karashi to taste, if using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023078-kakuni-braised-pork-belly"}