{"@context": "http://schema.org", "@type": "Recipe", "name": "Radicchio Caesar Salad", "description": "This fragrant take on <a href=\"https://cooking.nytimes.com/recipes/1018732-caesar-salad\">Caesar salad</a> uses up an entire tin of anchovies and replaces the sweet romaine with gloriously bitter radicchio. For the dressing: Though you could use a raw egg yolk and slowly stream in oil while whisking constantly, relying on the already emulsifying qualities of store-bought mayonnaise gets you to creamy heights with less fuss. This salad does not keep well, so serve it immediately, while the radicchio is still plump and crunchy. There’s no added salt in this recipe, as the many anchovies season both the bread crumbs and the dressing. But should your radicchio be especially bitter — pleasant though that flavor can be — feel free to add a pinch of salt to help tame the bitterness.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/07/15/dining/EK-Radicchio-Caesar-Salad-15SALADREX/EK-Radicchio-Caesar-Salad-15SALADREX-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, for two, lunch, weeknight, salads and dressings, appetizer, main course, side dish", "keywords": "anchovies, parmesan, radicchio, worcestershire sauce, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "recipeIngredient": ["1 (2-ounce) tin flat anchovy fillets packed in olive oil", "1/2 cup coarse or panko bread crumbs", "1 garlic clove, finely grated", "3 tablespoons extra-virgin olive oil", "1 tablespoon mayonnaise", "1 tablespoon fresh lemon juice, plus more if needed", "1/2 teaspoon Worcestershire sauce", "2 tablespoons finely grated Parmesan, plus more for topping", "Freshly ground black pepper", "1 large head or 2 small heads radicchio (1 pound), any wilted outer leaves removed, quartered lengthwise, cored and leaves separated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the bread crumbs: Add all of the anchovy oil from the tin (about 2 tablespoons) to a large skillet. Transfer the anchovies from their tin to a cutting board, draining them well. Finely chop 2 anchovies and add to the skillet, then turn the heat to medium-high. Cook the anchovies, stirring occasionally, until they start to sizzle, about 1 minute. Stir in the bread crumbs and cook, stirring constantly, until golden and toasted, 5 minutes. Transfer to a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: Set aside 4 anchovies (for garnish later) and finely chop the rest (there should be about 6). Add the chopped anchovies to a large bowl, along with the garlic, olive oil, mayonnaise, lemon juice, Worcestershire sauce and Parmesan. Season generously with pepper and whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dress the salad: Add the radicchio leaves to the dressing and toss. The salad should be lightly dressed, not thickly caked. Taste for acidity, adjusting with more lemon juice if your radicchio is especially bitter. Transfer to a large plate, piling the leaves high. Top with a final grating of Parmesan and the bread crumbs, and garnish with the remaining anchovies. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023292-radicchio-caesar-salad"}