{"@context": "http://schema.org", "@type": "Recipe", "name": "All-Butter Pie Crust", "description": "Foolproof and versatile, this pie dough starts with a trick from the chef and television personality Carla Hall. She dissolves sugar and salt in ice-cold water before adding it all to the flour to form a supple dough that’s easy to roll and evenly seasoned. Here, vinegar is also stirred into the solution to ensure a tender crust. Whether you make the dough by hand, with a stand mixer or a food processor, you’ll end up with a flaky pastry that tastes great with sweet or savory fillings.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2022/11/13/dining/13PIESREX-butter-crust/merlin_214888215_15d69a3d-1be2-455a-8cb0-f88cdb7e9397-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 disks (for 2 single-crust pies or 1 double-crust pie)", "recipeCuisine": "", "recipeCategory": "easy, pies and tarts", "keywords": "freezer friendly, make-ahead, pie crust, white vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 450}, "recipeIngredient": ["1/3 cup/85 grams ice-cold water", "2 teaspoons distilled white vinegar", "2 teaspoons granulated sugar", "1 teaspoon fine sea or table salt", "1 cup/228 grams cold unsalted butter, cut into 1/2-inch cubes", "2 1/2 cups/330 grams all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together the water, vinegar, sugar and salt until the sugar and salt dissolve. Put in the freezer until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough in a stand mixer, toss the butter with the flour in the mixer bowl until evenly coated. Beat with the paddle on low speed until the mixture resembles coarse crumbs. It’s OK if there are a few pea-size clumps, but there shouldn’t be many. Add the water solution all at once and beat on low speed until the mixture forms large clumps and no floury bits remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough in a food processor, pulse the butter and flour until coarse crumbs form. Add the water solution all at once and pulse until the mixture forms large clumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough by hand, toss the butter with the flour in a large bowl until evenly coated. Using a pastry cutter or your fingers, cut or smoosh the butter and rub it into the flour until coarse crumbs form. It’s OK if there are some almond-size pieces, but there shouldn’t be many. Add the water solution all at once and stir with a fork or your hand until the dough comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whichever method you used, gather the dough into a large mass (about 660 grams total). If making single-crust or regular double-crust pies, divide the dough in half to form 2 disks (330 grams each). For a lattice pie, form a little more than a third of the dough into a disk for the bottom (250 grams), then split the remaining in half to form 2 disks for the top (205 grams each)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the disks tightly in plastic wrap and refrigerate until firm, at least 1 hour and preferably 1 day. The dough can be refrigerated for up to 3 days or frozen for up to 2 months. Thaw overnight in the refrigerator before using."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023573-all-butter-pie-crust"}