{"@context": "http://schema.org", "@type": "Recipe", "name": "Brussels Sprouts Caesar Salad", "description": "This mix of roasted, caramelized brussels sprouts and slawlike raw slices is topped with a lemony, garlicky dressing that’s a bit like Caesar, but lighter, brighter and anchovy-free (though you could add some if you like). Serve it as a satisfying side dish to a simple pasta or roast chicken, or as a light meal on its own.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2023/01/28/multimedia/18apperex2-brussels-kpcq/18apperex2-brussels-kpcq-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, vegetables, main course, side dish", "keywords": "baguette, brussels sprout, extra virgin olive oil, lemon juice, pecorino romano, salad, stale bread, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 365}, "recipeIngredient": ["2 pounds brussels sprouts, trimmed", "1/3 cup plus 3 tablespoons extra-virgin olive oil, plus more as needed", "Salt and freshly ground black pepper", "1 small baguette or chunk of sourdough bread (about 8 ounces), preferably day-old, torn into bite-size pieces (about 4 cups)", "1/2 cup grated Pecorino Romano, (about 3 ounces), plus more as needed", "1 1/2 tablespoons freshly squeezed lemon juice, plus more as needed", "3 garlic cloves, finely grated or minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Cut about 1 1/4 pounds brussels sprouts in half lengthwise, and put them on a rimmed sheet pan along with any leaves that fell off as you were cutting. Drizzle with 1 tablespoon oil and a large pinch of salt and black pepper. Toss well, then spread sprouts in an even layer. Roast until golden brown and tender, about 12 to 20 minutes, tossing halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On another baking sheet, toss bread pieces with 2 tablespoons olive oil to coat evenly. Spread in an even layer, sprinkle with salt, and bake in the same oven as the brussels sprouts, until crunchy and evenly browned, about 14 to 18 minutes, tossing halfway through. Taste a crouton and add more salt if needed. Let croutons cool on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the sprouts and croutons roast, use a food processor fitted with the slicing disk, or a chef’s knife, to thinly slice the remaining 3/4 pound brussels sprouts. Place slices in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a small bowl, combine cheese, lemon juice, garlic, 3/4 teaspoon salt and several grinds of black pepper. Slowly whisk in remaining 1/3 cup olive oil until emulsified. Taste and adjust seasoning by adding more salt, lemon juice or pepper, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour just enough of the dressing over shaved raw brussels sprouts to coat them. Using your hands, massage dressing into the sprouts. Taste and add more dressing if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add croutons and roasted brussels sprouts to the bowl and toss well. Taste and season with more cheese, salt, olive oil and lemon juice to taste. The salad should be lively in flavor and nicely coated in dressing, but not oily. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023846-brussels-sprouts-caesar-salad"}