{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Full English Breakfast", "description": "There’s always a night when you want to have breakfast for dinner, and this is how to do it British-style, in a very untraditional, sheet-pan take on the classic. Drizzled with Worcestershire sauce, the roasted mushroom and tomatoes become especially savory while the eggs are cooked until crisp-edged and runny-yolked, right in the sausage drippings. This recipe works best with pork sausages, which will release a flavorful slick of brawny fat. But other kinds of sausages — turkey, chicken, plant-based — will also work well. Serve this with plenty of buttered toast, and if you like, baked beans (most authentically, straight from a can).", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2022/09/14/dining/09apperex1-breakfast/09apperex1-breakfast-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, easy, for two, weeknight, meat, main course", "keywords": "breakfast sausage, egg, plum tomato, sheet-pan, white mushrooms", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 445}, "recipeIngredient": ["8 ounces white button or cremini mushrooms (4 cups), halved or quartered if large", "4 small plum tomatoes, halved lengthwise", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "1 teaspoon Worcestershire sauce, plus more for serving", "3 thyme sprigs", "Salt and freshly ground black pepper", "8 breakfast sausage links, either cooked or uncooked is fine, pricked all over with a fork", "4 large eggs", "Buttered toast, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. In a medium bowl, toss together the mushrooms, tomatoes, olive oil, Worcestershire sauce, thyme sprigs and a pinch each of salt and pepper. Place sausage links onto a rimmed sheet pan and spread vegetables evenly around the sausages. Bake until browned and crisp, 15 to 20 minutes, tossing halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the pan out of the oven and use a spatula to push the vegetables and sausages to one side. Drizzle the empty side of the pan with a little olive oil, then crack in the eggs; season lightly with salt and pepper. Immediately return the pan to the oven and roast until the whites are just set, the yolks are still runny, 3 to 5 minutes longer. If you prefer medium or hard egg yolks, cook a minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, cut the eggs apart. Slide them off the pan and onto plates right away to stop the yolks from solidifying. Discard thyme sprigs and serve vegetables with the eggs, drizzling with a dash of Worcestershire sauce, and more salt and pepper, if you’d like. Serve with buttered toast."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023465-sheet-pan-full-english-breakfast"}