{"@context": "http://schema.org", "@type": "Recipe", "name": "Nougat With Honey and Pistachios", "description": "Nougat is not exactly for the faint of heart: Preparing it involves heating honey and a sugar syrup separately to different temperatures and streaming them into beaten egg whites in rapid succession. Make sure you have all of your ingredients ready before you start cooking, and the reward is a candy unlike any other with a snow-white color, fresh honey flavor and lots of toasted pistachios to temper the sweetness and add crunch.", "author": {"@type": "Person", "name": "Claire Saffitz"}, "image": "https://static01.nyt.com/images/2022/12/12/multimedia/12candyrex3-nougat/12candy4-1-ccc1-articleLarge.jpg", "totalTime": "PT6H45M", "recipeYield": "About 50 pieces", "recipeCuisine": "", "recipeCategory": "candies, dessert", "keywords": "christmas, hanukkah, coconut oil, corn syrup, egg whites, honey, make-ahead, pistachio, plan-ahead, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 260}, "recipeIngredient": ["Vegetable oil spray", "2 1/2 cups/314 grams shelled, skinless pistachios (see Tip)", "3 large egg whites", "1 tablespoon/13 grams plus 1 1/4 cups/250 grams granulated sugar", "1/2 teaspoon kosher salt (such as Diamond Crystal)", "1/4 cup/87 grams light corn syrup", "1/2 cup/188 grams honey", "3 tablespoons refined coconut oil or cocoa butter, melted", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pan: Lightly coat the inside of an 8-inch square pan with vegetable oil spray. Line the bottom and sides with parchment paper, smoothing to eliminate air bubbles, then lightly spray the parchment paper. Set the pan aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the nuts: Heat the oven to 350 degrees. Scatter the pistachios on a rimmed baking sheet and toast, tossing once, until they’re golden and fragrant, 8 to 10 minutes. Reduce the oven temperature to 200 degrees, then remove the pistachios from the oven, and let them cool on the baking sheet for 5 minutes. If needed, wrap loosely in a clean kitchen towel and rub off as much of their skins as you can. Turn off the oven, and return the baking sheet to the still-warm oven to keep the nuts warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare to make the nougat: Combine the egg whites, 1 tablespoon/13 grams sugar and the salt in the bowl of a stand mixer fitted with the whisk attachment. In a small, heavy saucepan, combine the corn syrup, remaining 1 1/4 cups/250 grams sugar and 1/4 cup/57 grams water, and set aside. Fill a glass with water, place a pastry brush inside, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook and stream in the honey: Place the honey in a separate small saucepan and clip a candy thermometer to the side. Bring the honey to a boil over medium heat and cook, swirling the saucepan occasionally. When the honey reaches 235 degrees, turn the mixer on medium-low and beat the egg white mixture until the whites are broken up, about 20 seconds, then increase the speed to medium-high and continue to beat until the mixture forms medium peaks, about 1 minute. When the honey registers 248 degrees, remove the saucepan from the heat and, with the mixer on medium-high, very slowly stream the honey into the egg white mixture, pouring it down the side of the bowl and avoiding the whisk to prevent splatter. Continue to beat on medium-high until the mixer bowl is warm (not hot) to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook and stream in the sugar: While the egg white mixture is whipping, set the saucepan with the sugar mixture over medium-high heat and stir gently with a heatproof spatula just until sugar dissolves to form a clear syrup, about 2 minutes. Let the mixture come to a boil and use the wet pastry brush to brush down the sides of the saucepan to dissolve any stuck-on sugar crystals. (Don’t forget to check the egg white mixture and turn off the mixer whenever necessary.) Clip the candy thermometer to the side of the saucepan (it’s OK if it’s coated in honey), reduce the heat to medium and boil the mixture without stirring, occasionally swirling the saucepan, until it registers 310 degrees, then remove from the heat immediately. With the mixer running on medium-high speed, stream the sugar mixture into the bowl just as you did the honey. Once you’ve added all of the sugar mixture, increase the speed to high and continue to beat until the sides of the bowl are warm but not hot and the mixture is very thick, dense and voluminous, about 4 minutes (the mixer might strain against the mixture)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the nougat: Turn off the mixer, add the melted coconut oil or cocoa butter and vanilla to the bowl, and beat on high just until the nougat is smooth. (The mixture will separate but then come back together, which is normal.) Turn off the mixer and remove the bowl. Remove the nuts from the oven and add to the bowl, then fold the nougat with a large flexible spatula until the nuts are evenly distributed. Scrape the nougat into the prepared pan and smooth the surface, working it into an even layer all the way to the sides and corners. Cover the nougat with a piece of parchment paper sprayed with more oil and smooth, then let it sit at room temperature until it’s completely set, at least 6 hours but preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the nougat: Uncover the nougat and use the parchment paper to lift it out of the pan and transfer it to a cutting board. Use a serrated or chef’s knife coated in vegetable oil spray to cut the slab into quarters in one direction, then slice each third crosswise into 1/2-inch pieces to make about 50 pieces."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023721-nougat-with-honey-and-pistachios"}