{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta al Pomodoro", "description": "Pomodoro, the Italian word for tomato, comes from pomo d’oro (“golden apple”), and also refers to this sauce. A good pomodoro leans into the inherently savory, umami-rich flavor of the tomatoes, so use the best ones you can find. Any combination of low-water, high-flavor tomatoes like plum, grape, cherry and Campari, cooked down to their purest essence, makes for the most vibrant result. Thin spaghetti works best here, as its airy bounciness catches the pulpy tomato sauce beautifully, but regular spaghetti would taste great, too. Add basil at the end, if you’d like, or a dusting of cheese, but a stalwart pasta al pomodoro made with peak-season tomatoes needs neither.", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/08/21/dining/21EAT-EK-pasta-al-pomodoro/merlin_211545387_5042dbc4-2fa7-4ec9-b10e-b39ccd0ed5fa-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas, main course, side dish", "keywords": "tomatoes, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1169}, "recipeIngredient": ["1/2 cup extra-virgin olive oil", "4 large garlic cloves, lightly crushed and peeled", "3 pounds ripe tomatoes (any mix of plum, grape, cherry and Campari), coarsely chopped", "Salt", "1 pound thin spaghetti"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the olive oil and garlic to a large Dutch oven or high-sided skillet. Turn the heat to medium-high and cook the garlic, stirring occasionally, until fragrant and lightly golden, and small rapid bubbles form around the cloves, 1 to 3 minutes. Remove the garlic from the pot and discard (or eat)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully and gently lower the chopped tomatoes into the hot oil and cook, stirring constantly, until the tomatoes let off some liquid and the sauce starts to bubble steadily. Season generously with salt. Lower the heat to medium and simmer, stirring occasionally, until the tomatoes break down and the sauce reduces significantly, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a metal sieve, strainer or food mill over a medium bowl. Carefully pour in the tomato sauce. If using a sieve or strainer, push the sauce through with a spoon or flexible spatula, until all that remains are seeds and skins. Be sure to repeatedly scrape off the valuable pulp collecting on the bottom of the sieve (by holding the sieve down against the edge of the bowl and pulling it back). You should have about 2 cups of sauce in the bowl. Taste and add more salt, if needed, then return the sauce to the Dutch oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the spaghetti in a large pot of salted boiling water until al dente. Drain the pasta and add to the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to high and cook, stirring constantly, until the sauce reduces slightly and the pasta is well coated but not drowned in the sauce, about 2 minutes. Remove the pot from the heat and let it sit so the pasta can absorb the sauce further, about 5 more minutes. Serve immediately."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023408-pasta-al-pomodoro"}