{"@context": "http://schema.org", "@type": "Recipe", "name": "Gorditas de Flores de Jamaica (Spicy Hibiscus-Stuffed Gorditas) ", "description": "Flor de jamaica is a type of hibiscus flower that is dried and often boiled with sugar and spices to make agua fresca, a sweet-tart beverage found across Mexico. In a savory main, the boiled flowers, which have an almost meaty, mushroomlike texture, are often pan-fried, seared or charred. But here, they’re stewed with dried chiles, cinnamon and sweet potato to make a saucy filling for a gordita — a thick corn patty that’s griddled, split and stuffed.", "author": {"@type": "Person", "name": "Rick A. Martínez"}, "image": "https://static01.nyt.com/images/2022/10/12/dining/06ESSENTIALSREX-gorditas/merlin_214158354_2663a1e4-137d-4686-a346-d094abeca7db-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 gorditas", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, project, main course", "keywords": "ancho chile, black bean, chiles de árbol, cornmeal, guajillo chiles, hibiscus, refried beans, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "recipeIngredient": ["2 ancho chiles (36 grams), stemmed and seeded ", "1 guajillo chile (11 grams), stemmed and seeded ", "1 to 2 cascabel chiles or chiles de árbol (6 to 12 grams), stemmed and seeded (1 for medium, 2 for spicy)", "1 teaspoon dried oregano, preferably Mexican ", "1/2 teaspoon coriander seeds", "1/2 teaspoon cumin seeds", "1 bay leaf", "1/2 teaspoon black peppercorns ", "4 teaspoons kosher salt (such as Diamond Crystal)", "3 cups/90 grams dried flor de jamaica (hibiscus flowers), picked through", "1 (3-inch) stick canela (Ceylon cinnamon) or (1-inch) stick cassia cinnamon", "1/4 cup extra-virgin olive oil", "1 large sweet potato (340 grams), peeled and chopped into 1/2-inch pieces", "1/2 medium white onion, chopped", "2 garlic cloves, finely grated", "1 3/4 pounds/794 grams fresh yellow, blue, pink, or white fine-grind corn masa for tortillas (or 2 1/2 cups masa harina, see Tip)", "2 tablespoons extra-virgin olive oil", "2 teaspoons kosher salt (such as Diamond Crystal)", "1 1/2 cups refried black beans", "Sliced iceberg lettuce, chopped onion, chopped cilantro, crema and crumbled queso fresco, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Combine the chiles, oregano, coriander, cumin, bay leaf, peppercorns, salt and 2 cups water in a medium saucepan. Bring to a boil over high heat, cover and reduce to a simmer. Cook until chiles are very tender, about 15 minutes. Transfer to a blender and purée until completely smooth. Set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fill a large pot with water and add the flor de jamaica. Vigorously stir for about 30 seconds to clean the flowers. Using a mesh strainer, lift the flowers out of the pot and discard the sandy water. Repeat with fresh water until you don’t feel any more sand at the bottom of the pot. Return jamaica to pot and add 4 cups water and canela. Bring to a boil over high heat, cover, reduce to a simmer and continue cooking until the jamaica are very tender, about 10 minutes. Strain through a fine mesh sieve and save the liquid (concentrated hibiscus tea) for cocktails or agua fresca. Transfer cooked jamaica back to the pot and rinse with cold water, jostling to thoroughly clean. Drain and discard water; squeeze out excess water. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet over medium-high and cook jamaica, tossing occasionally, until steam has subsided and any liquid in the pan has evaporated, about 5 minutes. Add sweet potato, onion and garlic, and cook, tossing occasionally, until edges of the jamaica are reddish brown and the onion is very tender, about 10 minutes more. Add chile purée and bring to a boil, cover, reduce to a simmer and continue to cook, stirring occasionally, until the sweet potato is cooked through and the salsa has reduced and is slightly thickened, 25 to 30 minutes. Taste and add salt, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the gorditas: In a large bowl, knead the fresh masa, oil, salt and 1 tablespoon warm water until well incorporated and the mixture is soft and pliable but doesn’t stick to your hands, about 4 minutes. If the mixture is dry, crumbly or sticks to your hands, add a tablespoon or two of warm water and continue to mix. Cover and let sit for 30 minutes to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 8 balls (about 98 grams each), keeping them covered with a damp towel. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut and remove the zip-top from a 1-gallon freezer bag. Cut the sides of the bag, so that you have 2 square pieces of plastic. If you’re using a tortilla press, trim the sides of the bag to fit the flat surface of the press. Line the press with the cut plastic (or use a smooth, flat-bottomed skillet), and working with 1 ball at a time, press each portion of masa into a 5-inch round about 1/3-inch thick. Carefully peel off the plastic and transfer the disk to a parchment-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large cast-iron skillet or griddle over medium and cook the gordita until the center puffs slightly and the gordita is browned in spots, 3 to 4 minutes per side. Repeat with the remaining gorditas. Let sit 10 minutes to cool slightly before you split them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Insert a sharp paring knife into the edge of the warm gordita. Cut a pocket into the gordita, leaving it intact on the other side (similar to a pita bread) to prevent the filling from leaking out. Repeat with the remaining gorditas. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the gorditas with a few tablespoons of beans spread evenly over the interior. Layer with 1/3 cup of the guiso de jamaica. Top with lettuce, onion, cilantro, crema and queso."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023508-gorditas-de-flores-de-jamaica-spicy-hibiscus-stuffed-gorditas"}