{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash Lasagna Pie", "description": "This comforting dish lands somewhere between a lasagna and a pie. Thinly sliced butternut squash and broken dried lasagna noodles are all tossed together in one bowl with cheese, spices and a red pepper sauce, then pressed into a cake pan before baking, at which point everything softens and cooks together into imperfectly perfect layers. A simple béchamel topping is made while your pie is in the oven, leaving you ample time to get on with assembling a big salad or a side dish of your choosing.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2022/10/16/magazine/16mag-eat-site/16mag-eat-site-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, main course", "keywords": "basil, butternut squash, coriander seed, cumin seed, feta, garlic, lasagna, lasagna noodle, parmesan, fall, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1231}, "recipeIngredient": ["¼ cup olive oil, plus more for greasing the pan", "8 garlic cloves, roughly chopped", "2 tablespoons tomato paste", "1 tablespoon cumin seeds, roughly crushed in a mortar and pestle", "1 tablespoon coriander seeds, roughly crushed in a mortar and pestle", "2 teaspoons Aleppo chile flakes", "1 (12-ounce) jar red peppers, drained", "1 teaspoon light brown sugar", "Fine sea salt and black pepper", "1 small butternut squash (about 1 ¾ pounds), peeled, halved, deseeded and cut into ⅛-inch-thick slices ", "8 ounces dried lasagna noodles, each roughly broken into 3 or 4 pieces", "7 ounces baby spinach (10 lightly packed cups)", "1 packed cup basil leaves, torn in halves", "1 cup crumbled Greek feta", "Heaping ½ cup finely grated Parmesan", "3 tablespoons unsalted butter", "⅓ cup all-purpose flour", "1 1/2 cups whole milk, plus more if needed", "2 garlic cloves, minced", "Fine sea salt", "1/4 cup finely grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pie: Heat the oven to 400 degrees. Grease a 9-inch springform cake pan then line it with a piece of parchment paper large enough to cover the base and hang over the sides by a couple inches; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil to a small frying pan and heat over medium-high. Once it’s hot, add the garlic and cook for about 1 minute, stirring until fragrant but not browned. Add the tomato paste, cumin, coriander and chile flakes and cook for 1 minute more, stirring often, until deeply red. Set aside to cool slightly, then add to a small food processor with the red peppers, sugar, ½ teaspoon salt and a good grind of pepper; blitz until smooth. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the mixture into a very large bowl and add the squash, lasagna sheets, spinach, basil, feta, Parmesan, 1¼ teaspoons salt and a good grind of pepper. Use your hands to make sure everything is nicely coated. Transfer this mixture to your lined cake pan, adding a third at a time and pressing lightly to ensure everything is even and compact. Using heavy-duty aluminum foil, wrap the cake pan all around until tightly sealed, place on a baking sheet and bake for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toward the last 15 minutes of baking time, make the béchamel: Melt the butter in a medium saucepan over medium-high heat. Whisk in the flour and cook, whisking steadily, for 2 to 3 minutes, or until it starts to smell like popcorn. Slowly pour in the milk ½ cup at a time, whisking with each addition until fully incorporated. Turn the heat down to medium then add the garlic and ¼ teaspoon salt. Use a spatula to stir and cook for 2 minutes, stirring to ensure the bottom doesn’t scorch, until nice and smooth. Off the heat, stir in the Parmesan. If the pie isn’t done, cover the top with a piece of parchment paper to prevent a skin from forming. The béchamel is easier to handle when warm; if needed, reheat gently with a splash of milk to loosen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the pie has cooked for 1 hour, remove it from the oven and carefully unwrap the top foil and paper, crinkling it down and around the sides of the pan to expose the top. Spoon the béchamel on top, using a spatula to distribute it evenly over the surface. (Take care not to mix it with the base; you want the béchamel to remain white.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the oven temperature up to 450 degrees, place the cake pan back on its baking sheet and bake for another 15 to 20 minutes, rotating halfway through, until nicely browned on top. Set aside to cool for at least 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully release the pie from the springform pan, loosening the outer ring then using the parchment to help lift it onto a serving plate or board. Serve warm or at room temperature."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023449-butternut-squash-lasagna-pie"}