{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple Milk Bread", "description": "Inspired by the fluffy loaves at White Windmill, a bakery and cafe in Atlanta, this milk bread — a type of soft, bouncy white bread made with, yes, milk — is an homage to the Korean American community along the city’s Buford Highway and beyond. Milk bread exists across many cultures, but its distinguishing feature is the tangzhong — a cooked paste of flour and milk — that helps keep the bread from drying out. Maple syrup and a sturdier crumb distinguish this loaf from milk breads found at Asian bakeries. This one, which appears in “Korean American: Food That Tastes Like Home,” by Eric Kim (Clarkson Potter, 2022), has a deeply savory, pancake-sweet flavor and tastes fabulous plain, fresh out of the oven, or toasted, buttered and adorned with jam; honey and flaky sea salt are equally welcome as toppings. (Watch the video of <a href=\"https://youtu.be/pyv6lO1SBS0\">Eric Kim making maple milk bread here</a>.)", "author": {"@type": "Person", "name": "Eric Kim"}, "image": "https://static01.nyt.com/images/2022/03/20/magazine/SHORT-milk-bread-audio-app/SHORT-milk-bread-audio-app-mediumThreeByTwo440-v3.jpg", "totalTime": "PT1H5M", "recipeYield": "1 loaf", "recipeCuisine": "", "recipeCategory": "breads, dessert", "keywords": "bread flour, maple syrup, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1018}, "recipeIngredient": ["1/2 cup/72 grams bread flour", "1 cup/237 milliliters whole milk ", "1/2 cup/118 milliliters heavy cream ", "4 cups/576 grams bread flour, plus more as needed", "1 cup/336 grams maple syrup ", "1 large egg ", "1 1/2 teaspoons coarse kosher salt or 2 3/4 teaspoons kosher salt (Diamond Crystal)", "4 1/2 teaspoons/14 grams active dry yeast (2 envelopes) ", "Nonstick cooking spray "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tangzhong: In a medium pot, whisk together the bread flour and milk until relatively smooth. Set over medium-low heat and cook, whisking constantly, until the mixture thickens into a texture not unlike mashed potatoes or grits, 2 to 3 minutes. You may see lumps at first, but as you continue to whisk and the flour cooks, your mixture will smooth out. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bread: Remove the pot from the heat and whisk in the cream until smooth, which will cool down the mixture and add some necessary fat. To the creamy mixture, add 4 cups/576 grams bread flour, the maple syrup, egg, salt and yeast, and stir with a wooden spoon or rubber spatula until you can no longer see any streaks of egg or flour. Cover the pot with a lid and let sit in a warm place to proof and hydrate until doubled in size, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To knead by hand, keep ½ cup/72 grams bread flour next to you. Dust a clean work surface with some of the flour and turn the dough out onto the surface. Dust some more flour on top of the dough and on your hands, and knead the dough into a ball using both hands. As you start to feel the dough get sticky, add more of the flour. The goal here is to not use more than that ½ cup of flour to knead the dough and, at the same time, to develop enough gluten in it so that it’s no longer sticky, 5 to 7 minutes. Alternatively, knead with a stand mixer: Transfer the dough from the pot to the bowl of a stand mixer fitted with the dough hook attachment. Knead on medium-low speed for 15 minutes; it will become pretty sticky and cling to the bowl. Turn the dough out onto a floured surface. Dust some more flour on top of the dough and on your hands, and form the dough into a ball using both hands, adding more flour as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 9-by-5-inch loaf pan with cooking spray. Cut the dough in half with a knife, then flatten each piece using your hands, pulling the corners of each piece up and over the center, all around, so that you’re creating two tight balls. Twist the pulled-up edges to seal and turn the balls over so their smooth sides are facing up. Nestle the two balls side by side in the pan and let sit, covered with a clean kitchen towel, in a warm place in your kitchen until the dough balls have risen an inch above the rim of the pan, 1 1/2 to 2 1/2 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oven to 350 degrees. Bake the bread until the crust is dark brown and an instant-read thermometer inserted in the center reads 185 to 190 degrees, 40 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and let cool in the pan for 5 minutes before taking out the bread and slicing into it. (Technically it should cool completely, but come on: There’s nothing like the glorious experience of tearing into a fresh, warm loaf of sweet milk bread.) The bread will keep for up to 3 to 4 days in a closed container at room temperature."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Maple Milk Bread", "description": "“You can take comfort in knowing that someone who has never made bread before is the person who developed this recipe, which means you can probably do it, too.” Eric Kim is back! He’s in the studio kitchen showing us how to make his Maple Milk Bread recipe, which appears in Eric’s new cookbook, “Korean American: Food That Tastes Like Home.” It’s inspired by the milk breads found in Asian bakeries, but Eric’s recipe is distinguished by maple syrup and a sturdier crumb.", "thumbnailUrl": "https://static01.nyt.com/images/2022/03/20/magazine/SHORT-milk-bread-audio-app/SHORT-milk-bread-audio-app-mediumThreeByTwo440-v3.jpg", "uploadDate": "2022-03-30T19:54:16.000Z", "duration": "PT11M46S", "transcript": "", "contentUrl": "https://vp.nyt.com/video/2022/03/30/99745_1_EK-Maple-Milk-Bread-Video_wg_240p.mp4"}, "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023030-maple-milk-bread"}