{"@context": "http://schema.org", "@type": "Recipe", "name": "Sunset Pavlova With Sweet Vinegar and Rosemary", "description": "A Pavlova is among the best desserts to serve at a dinner party, as it brings the wow factor but is also very forgiving. If the meringue cracks in places, you don’t need to fuss as you’ll be covering it with cream and fruit. You can play with the flavoring of the cream and change up the fruits. If you can’t find kumquats, feel free to swap them out for muscat or green seedless grapes, or an orange, peeled and sliced into rounds. You can make the meringue base up to two days in advance, as long as you let it cool completely before storing in an airtight container. Keep it in the coolest part of your kitchen, away from direct sunlight, to avoid any humidity. ", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2022/08/14/magazine/14mag-eat-site/14mag-eat-site-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dessert", "keywords": "cream, egg whites, fruit, meringue, orange juice, superfine sugar, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 315}, "recipeIngredient": ["7 ounces/200 grams egg whites (from 6 to 7 large eggs), at room temperature", "1 3/4 cups plus 2 tablespoons/370 grams superfine (caster) sugar", "2 teaspoons cornstarch", "2 teaspoons apple cider vinegar", "Scant ½ cup/100 milliliters orange juice", "3 tablespoons/40 milliliters apple cider vinegar", "4 fresh rosemary sprigs, plus 1 teaspoon chopped leaves, for serving", "1/4 cup/50 grams superfine (caster) sugar", "2 teaspoons lemon juice", "1 1/4 cups/300 milliliters heavy whipping cream", "Scant 1/2 cup/100 grams mascarpone", "2 tablespoons plus 1 teaspoon/30 grams superfine (caster) sugar", "8 cardamom pods, shells discarded and seeds finely crushed or ground", "2 large ripe but firm nectarines", "3 ripe but firm yellow or red plums", "6 kumquats (or 1 orange, peeled and sliced into rounds, or additional muscat grapes)", "1 cup/100 grams seedless muscat grapes", "2 passion fruits, halved and insides scraped, or ¼ cup passion fruit purée"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees and line a large baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the meringue: Add the egg whites to the base of a stand mixer with the whisk attachment in place and beat on medium-high speed until firm peaks form, 3 to 4 minutes. With the machine running, add the superfine sugar, a spoonful at a time, until the meringue is stiff and glossy, about 4 minutes more. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a spatula to gently fold the cornstarch and vinegar into the meringue until evenly mixed through. Transfer the meringue to your prepared baking sheet and use a spatula to spread it into an oblong shape that’s roughly 14 inches long and 10 inches wide. Use your spatula to create spiky peaks across the surface of the meringue for a more rustic look. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the meringue in the oven, then immediately turn the temperature down to 300 degrees Fahrenheit. Bake for 1 hour, until dry on the outside but chewy through the center. Leave to cool at room temperature, about 30 minutes. Don’t worry if it cracks in places."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the syrup: Add the orange juice, vinegar, rosemary sprigs and superfine sugar to a small saucepan and place it over a medium-high heat. Bring to a simmer, then cook for 6 to 7 minutes, until reduced by about half. Off the heat, stir in the lemon juice and set aside to cool completely. It’ll thicken to a maple syrup consistency as it cools."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cream: Add all the ingredients to the bowl of a stand mixer with the whisk attachment in place. Beat on medium-high speed until soft-medium peaks form, 1½ to 2 minutes. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fruit topping: Use a mandoline to finely shave one side of the nectarine to get very thin rounds until you hit the pit, then shave the opposite side. Chop off the narrower ends and save these to snack on. Repeat with the plums. Set both aside on a large plate, separately. Use a small serrated knife to finely slice the grapes and the kumquats into thin rounds of around the same thickness. Set the sliced kumquats on the same plate, discarding the pits. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, use the parchment paper to help you transfer the meringue to a large serving platter or board. (Alternatively, you can serve it right from the sheet pan.) Top the cooled meringue with the cream by dolloping and spreading it across the meringue using the back of a spoon, leaving a 1-inch gap from the edges. Artfully top with the nectarines, plums, grapes and kumquats. Dot with the passion fruit. Remove the rosemary sprigs from the syrup and place these on top of the fruit then pour the syrup all over the fruit. Lastly, sprinkle with the extra chopped rosemary. Serve right away, or within the hour, as the meringue will soften as it sits."}], "isAccessibleForFree": "False", "hasPart": {"@type": "WebPageElement", "isAccessibleForFree": "False", "cssSelector": ".recipe"}, "publisher": {"@context": "http://schema.org", "@type": "Organization", "name": "NYT Cooking", "url": "https://cooking.nytimes.com", "alternateName": ["nytimes cooking", "New York Times Cooking"], "image": [{"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoRed.svg", "height": 31, "width": 168, "@context": "http://schema.org", "@type": "ImageObject"}, {"url": "https://static01.nyt.com/applications/cooking/4c5221e/assets/SiteLogoBlack.svg", "height": 24, "width": 131, "@context": "http://schema.org", "@type": "ImageObject"}], "sameAs": ["https://www.facebook.com/groups/nytcooks/", "https://www.facebook.com/nytcooking/", "https://www.instagram.com/nytcooking/", "https://twitter.com/nytfood", "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}, "link": "https://cooking.nytimes.com/recipes/1023400-sunset-pavlova-with-sweet-vinegar-and-rosemary"}