{"@context": "http://schema.org", "@type": "Recipe", "name": "Pilaf aux fruits de mer (Molded rice with seafood)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, mussels, rice, shrimp", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 748, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "52 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1518 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["5 tablespoons, plus one teaspoon, butter", "1 cup finely chopped onion", "1 1/2 cups raw rice", "2 1/4 cups water", "Salt to taste, if desired", "2 pounds well-scrubbed mussels, about six cups", "1/2 cup dry white wine", "4 sprigs fresh parsley", "1/2 pound raw shrimp, shelled and deveined", "1/2 pound raw scallops, preferably bay scallops - if sea scallops are used, cut them into quarters", "1/4 cup finely chopped shallots", "3 tablespoons flour", "1/2 cup, plus two tablespoons, heavy cream", "2 tablespoons finely chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt two tablespoons of the butter in a saucepan and add onehalf cup of the onion. Cook, stirring, until the onion is wilted. Add the rice, water and salt, and stir. Bring to the boil. Cover closely and simmer 17 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the mussels in a small kettle and add the remaining onions, wine and parsley. Cover closely and bring to the boil. Let cook two minutes, shaking the kettle, until the mussels open. Drain and reserve the cooking liquid. There should be about one and one-half cups. Let the mussels cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the reserved mussel liquid into a saucepan, and add the shrimp and scallops. Bring to the boil and let simmer, stirring, about one minute. Remove the shrimp and scallops with a slotted spoon and strain the liquid. There should be about one and three-quarter cups. Set the seafood aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mussels are cool enough to handle, remove the meat and discard the shells. There should be about one and one-half cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt two tablespoons of butter in a saucepan and add the shallots. Cook until the shallots are wilted. Add the flour and stir, using a wire whisk. When blended, add the reserved one and one-half cups of cooking liquid, stirring rapidly with the wire whisk. Add one-half cup of heavy cream and bring to the boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the remaining two tablespoons of heavy cream into a small skillet and add the seafood mixture. Stir just to heat through. Cook just to rid the food of excess liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half a cup of the sauce to the seafood and stir to blend. Add half of the chives and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a six-cup mold with one teaspoon of butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about three-quarters of the rice into the mold. Make a hollow in the center of the rice while building up the rice around the inside of the mold, pressing firmly to make it adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the seafood, plus one-half cup of sauce, into the center of the rice. Cover with as much of the remaining rice as possible. Press down firmly on the rice to make it adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully unmold the rice mold onto a round platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the sauce in the saucepan, swirl in the remaining one tablespoon of butter and the remaining chives. Bring to the simmer. Spoon a small amount of the sauce around the rice mold. Serve with the remaining hot sauce."}]}