{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Suckling Pig With Sage-Apple Stuffing", "description": "Of all meat dishes, perhaps suckling pig most strongly suggests celebration. The well-roasted pig with its shiny amber skin and moist, distinctive-tasting meat always makes for a memorable meal. Many home cooks are intimidated by this dish, but there really is no reason; and for those concerned about fat in the diet, the young pig has less body fat than more mature meats.\n\nThe major consideration before buying a suckling pig is oven size: most conventional home ovens can hold a pig of about 14 pounds. Measure oven dimensions before shopping. Those who fear that a whole pig will drip fat all over the oven will be surprised to discover how little it yields. The suckling pig has thick, tough skin that retains the inner fat; a 14-pound pig gives off only about a quarter of a cup of fat drippings, which should used for basting the roast.", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT3H", "recipeYield": "12 - 14 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "apple, sage, suckling pig, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 336, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "9 grams", "sodiumContent": "455 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 slices of bread, cut into 1/4-inch cubes", "1 pound bacon, sliced crosswise in thin pieces", "2 pounds medium onions, coarsely chopped (approximately 4 cups)", "2 tablespoons dried sage, coarsely chopped", "1 tablespoon dried rosemary", "1/4 pound unsalted butter", "4 Golden Delicious apples, or 2 pounds, peeled, cored and cut into chunks about 1/4 inch thick", "4 hard-cooked eggs, coarsely chopped", "1 cup coarsely chopped parsley", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "The stuffing:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bread cubes on a flat cookie sheet or roasting pan in one layer in oven until they are lightly toasted, about 7 minutes. Shake pan occasionally as they bake. Remove from oven and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium-high heat, saute bacon strips just enough to cook without browning, about 5 minutes, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions to pan and stir well. Season with sage and rosemary and blend. Cook over medium heat, stirring, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter to pan, then the apples. Stir and simmer 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a large bowl. Combine with chopped eggs, toasted bread cubes and parsley. Mix well. Season lightly with salt and generously with black pepper and stir. This mixture may be stored in the refrigerator, covered, for several hours; bring it to room temperature before stuffing pig."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "The pig:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse inside of pig well and drain in sink. Pat dry. To make pig more compact so it fits in oven, tie front and rear feet against the body. To do this, tuck rear feet up against each side of belly just forward of the hip joints. Secure feet either by tying with kitchen twine or by making 2 vertical incisions, about 2 inches apart, on sides of belly just in front of hips and tucking feet through the loose flaps of skin. Do the same on both sides of neck to secure front feet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the cavity well with salt and pepper and fill with stuffing. Using a large, thick trussing needle and kitchen twine, truss the pig tightly, starting from the hindquarters and continuing toward the neck."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pig belly side down in a roasting pan measuring about 17 by 14 inches (with a rim to retain the melted fat). Brush skin with oil and season with salt and pepper. Cover ears and hind section with aluminum foil (this prevents fat from dripping off the sheet into the oven and prevents ears from burning). Scatter onion halves around pig and place roasting pan in preheated oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 1 hour reduce heat to 350 degrees and cover pig loosely with aluminum foil. Every 15 minutes or so brush pig with some of its fat drippings. After 2 hours total cooking time (1 hour after covering with foil), remove foil from hind section."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat thermometer registers 160 degrees in the leg, shoulder and hind section, pig is done. It should require about 2 3/4 to 3 hours total cooking time. Remove pig from oven and let sit in a warm place, covered with aluminum foil, about 1/2 hour before serving."}]}], "link": "https://cooking.nytimes.com/recipes/1027-roast-suckling-pig-with-sage-apple-stuffing"}