{"@context": "http://schema.org", "@type": "Recipe", "name": "Mock Eggs Benedict", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast", "keywords": "cheese, eggs, prosciutto, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "recipeIngredient": ["3 cups sauce Mornay (see <a href=\"http://cooking.nytimes.com/recipes/10274-sauce-mornay-cheese-sauce\" target=\"_blank\">recipe</a>)", "8 cups water", "1/4 cup white vinegar", "4 tablespoons butter", "8 thin slices cooked ham or prosciutto, about a quarter pound", "8 eggs", "4 English muffins, split in half", "1/2 teaspoon paprika", "Parsley sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce and set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the water into a skillet (a heavy 10-inch stainless steel, aluminum or nonstick pan is suitable). Add the vinegar and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the butter in a skillet (a 10- or 11 1/2-inch skillet is suitable). Add the ham slices and turn once. Let stand only enough to heat through, about one minute. Remove the skillet from the heat and let stand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully break the eggs, one at a time, into the simmering water. Let simmer about three minutes. As gently as possible, using a heavy standard perforated kitchen spoon, turn the eggs in the water. Remove the skillet from the heat and let the eggs stand to the desired degree of doneness. Remember that the eggs will continue to cook even after the skillet is removed from the heat. The total cooking time, once the eggs are added to the water, is about five minutes. Time may vary, depending on the size of the eggs and their temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a dish with several layers of kitchen paper toweling. Using a perforated spoon, carefully remove the eggs onto the paper. Let drain briefly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining butter. Brush the muffin halves with melted butter and place cut side up under the broiler. Broil briefly until brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange two muffin halves browned side up on individual serving plates. Top each half with a slice of ham. Top each ham slice with a poached egg. Spoon an equal portion of sauce over each egg. Sprinkle with paprika. Garnish with parsley sprigs."}]}