{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Gravy", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT5H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "beef, carrot, celery, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["1 1/2 pounds trimmings from a 9- or 10-pound piece of beef for roasting (include both fat and lean, and bone scraps, if any)", "2 large carrots", "2 large ribs celery", "1 large onion", "Stems for 1/2 pound mushrooms", "1/2 cup parsley", "4 quarts white stock (chicken, duck, veal or pork), or brown stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the meat and fat into small dice, put them into a roasting pan (along with bones) and roast in the oven for 1 hour, or until browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim all the vegetables, chop them fine, add them to the browned meat in the pan and continue roasting for a half hour to an hour longer, or until they are browned (but not blackened). Meanwhile, boil the stock down by half in a stockpot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the roasting pan from the oven, set it over a top burner, add a quart of the stock to it and stir and scrape the pan to release all the browning. Empty the pan into the stockpot, rinse it with a little water to get out any remaining pieces, add the rinse water to the pot, and simmer, covered, for 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the finished gravy into a container and refrigerate both it and the residual solids overnight. Remove the cake of fat from the gravy before reheating. Add to the gravy any meat juices (defatted) that the roast gives up. (The solids may be made into a spread by adding salt, dry mustard and finely diced celery.)"}], "link": "https://cooking.nytimes.com/recipes/10288-beef-gravy"}