{"@context": "http://schema.org", "@type": "Recipe", "name": "Maida Heatter's Rugelach (Walnut Horns)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "About 36 cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "cream cheese, flour, walnut, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 118, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "5 grams", "sodiumContent": "24 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound unsalted butter at room temperature", "1/2 pound cream cheese at room temperature", "1/2 teaspoon salt, optional", "2 cups sifted all-purpose flour", "1/2 cup, plus 2 tablespoons, granulated sugar", "3 teaspoons cinnamon", "3 tablespoons melted butter", "3/4 cup currants or raisins", "1 1/4 cups walnuts, finely chopped", "1 egg yolk", "1 teaspoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry the night before you are ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, put the butter, cream cheese and salt into the large bowl of an electric mixer. Beat on medium, then high speed, until the mixture is creamy and smooth. Then beat on low speed while gradually adding the flour. If the dough starts to overly coat the beaters, scrape the dough off the beaters and continue adding flour, stirring it in with the hands until thoroughly and evenly blended. The dough will be extremely sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the dough off the hands and fingers. Rinse, wash and dry the hands. Turn the dough out onto a well-floured board. Flour the hands and gather the dough into a short sausage shape. Cut this into three pieces of equal size. Flatten each piece slightly and wrap each piece in clear plastic wrap. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, preheat the oven to 350 degrees. Line two cookie sheets with aluminum foil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sugar and cinnamon for the filling and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one ball of dough on a floured pastry cloth. Hammer the dough firmly to soften it slightly. Do not let it become warm. Quickly roll out the dough, turning it occasionally, with a floured rolling pin into a circle about 12 inches in diameter. Don't worry about a slighly uneven edge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pastry brush, brush the dough with a tablespoon of the melted butter. Sprinkle the dough all over with one-third of the cinnamon-sugar mixture. Sprinkle with one-third of the currants or raisins and one-third of the walnuts. Roll the rolling pin lightly over the top to press the filling slightly into the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a long, sharp knife, cut the circle into 12 pie-shaped wedges. Roll each wedge jellyroll fashion, rolling from the outside toward the point. Do not be dismayed if some of the filling falls out. Place each roll, point side down, about one inch apart on one foil-covered cookie sheet. Repeat with a second ball of dough and then a third, filling and rolling each as indicated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the glaze, beat the egg yolk with the water. Brush the top of each walnut horn lightly and evenly with the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each sheet on a rack in the oven and bake for 30 minutes. Preferably at mid-point during the baking, you should reverse the sheets top to bottom and front to back, to insure even browning. When the horns are cooked, remove them with a metal spatula and transfer them to racks to cool."}]}