{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Stew With Potatoes and Carrots", "description": "", "author": {"@type": "Person", "name": "Christopher Idone"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "Six to eight servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1055, "unsaturatedFatContent": "38 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "78 grams", "fiberContent": "5 grams", "proteinContent": "53 grams", "saturatedFatContent": "34 grams", "sodiumContent": "1502 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 tablespoons unsalted butter", "3 tablespoons vegetable oil", "5 pounds lamb shoulder and breast, boned and trimmed and cut into 2-inch pieces", "Salt and freshly ground pepper to taste", "4 cups lamb stock or half lamb and half veal stock (see note below)", "1/2 teaspoon crushed dried sage", "2 ounces Scotch (optional)", "4 medium russet potatoes, peeled and quartered lengthwise", "2 bunches finger carrots, scraped", "1 pint pearl onions", "4 small turnips", "2 tablespoons sugar", "1/2 cup finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 275 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet melt two tablespoons of butter with one tablespoon of oil over high heat. Season one-third of the lamb pieces with the salt and pepper and brown the meat on all sides until lightly crusted, about 10 minutes. Place the browned meat pieces in a large casserole or Dutch oven and reserve. Pour off the fat from the skillet. Add one cup of stock and bring to a boil and deglaze the pan by scraping up the brown bits from the bottom of the pan. Pour the boiled stock into the casserole and repeat the process two more times until the meat and three cups of stock have been used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining cup of stock to the casserole. Add the sage and Scotch and cover and bake for one-and-a-half hours. Allow to cool to room temperature. Cover and refrigerate for 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees and remove the casserole from the refrigerator. Skim off the residue of cold fat and place the casserole, covered, in the oven and bake for 30 minutes while you prepare the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot of lightly salted boiling water, cook the potatoes for 10 minutes or until slightly resistant when pierced with a knife. Remove the potatoes with a slotted spoon and set aside. Add the carrots to the boiling water and cook for four minutes or until slightly resistant when pierced with a knife. Drain and set aside. When the stew has baked for 30 minutes, add the partially cooked potatoes and carrots to the stew for an additional 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, trim the pearl onions and cut an &quot;X&quot; at the base of each. Bring a pan of lightly salted water to a boil. Add the onions and cook until tender, about eight minutes. Drain and rinse the onions under cold running water. Drain again and remove the outer skins. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the turnips and cut in half and into one-quarter-inch wedges. Bring a saucepan of lightly salted water to a boil. Add the turnip wedges and cook until crisp tender, about four minutes. Drain and rinse under cold running water. Drain again and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saute pan, melt the remaining two tablespoons of butter over medium heat and add the onions and turnips. Sprinkle with the sugar and continue to cook until the onions and turnips are golden and caramelized, tossing often. About 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the stew meats, potatoes and carrots onto heated plates or soup plates with some of the sauce. Divide the onions and turnips among the plates and sprinkle with the chopped parsley. Serve immediately."}]}