{"@context": "http://schema.org", "@type": "Recipe", "name": "Ed Cooper's Cod Cakes", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H", "recipeYield": "10 to 12 cakes (5 to 6 servings)", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cod, eggs, potato, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 553, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "3 grams", "proteinContent": "27 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1458 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 pound salt cod (see note)", "3 medium-size potatoes, unpeeled if desired", "3/4 pound fresh cod or scrod", "3 eggs", "1 teaspoon baking powder", "2 medium-size onions, chopped", "Salt and freshly ground black pepper to taste", "4 to 6 drops Tabasco sauce, or to taste", "Vegetable oil or lard for frying, sufficient to make a 1/2-inch layer in a frying pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse salt cod under running water for 5 to 10 minutes to remove salt. Put in a pan, cover with cold water and heat to just below boiling. Drain immediately and cover with fresh cold water. Repeat the heating and draining procedure two or three times, until cod is pleasantly but not overpoweringly salty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut potatoes in half and put in a pan with salt cod and fresh cod. Cover with cold water. Place over medium heat, bring to a boil, cover and simmer for 20 minutes, or until potatoes are tender and easily pierced with a fork. Remove from heat, let cool slightly and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a potato masher, roughly break up the cod and the potatoes. Continue mixing together until the mixture is cohesive. Lightly beat the eggs and add to the mixture, together with the baking powder. Add the chopped onions and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the mixture and add salt, pepper and Tabasco. When seasoning is correct, form mixture into flattened balls that will fit comfortably in your palm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put an inch of lard or vegetable oil in the bottom of a heavy-duty saute pan. Set over medium heat and heat oil until a bread cube dropped into the oil turns golden quickly. Ease cod cakes into the hot fat and cook about 15 minutes to a side, turning once. Adjust heat so cod cakes do not burn, but become golden all over. Drain on paper towels, if desired."}]}