{"@context": "http://schema.org", "@type": "Recipe", "name": "Van Cortlandt Punch", "description": "Here’s a bit of New York City history for you: This punch was originally served in 1710 at the inauguration of Jacobus Van Cortlandt, one of the last old Dutch politicians and the city’s 30th mayor (he returned to office in 1719 as the city’s 33rd.) The recipe was brought back to light by Richard Ferrugio, who catered the inaugural of Mayor Edward I. Koch in 1986. Mayor Van Cortlandt's swearing-in, Walt Whitman wrote, was a full-day affair “much in keeping with the celebrations of the Old Netherlands.” He added: “Very popular were all the hot punches, seasoned and tempted with brandy.” This is the perfect libation for a winter inaugural party, when you can watch a ceremony that lends a little class to the blood sport of politics.", "author": {"@type": "Person", "name": "Suzanne M. Charle"}, "image": null, "totalTime": "PT10M", "recipeYield": "18 cups", "recipeCuisine": "", "recipeCategory": "easy, cocktails", "keywords": "apple, apple brandy, cinnamon, fall, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 359, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "21 milligrams", "sugarContent": "48 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 sticks cinnamon", "15 cloves", "5 cardamom pods", "1 gallon sweet apple cider", "2 cups applejack or apple brandy, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cinnamon sticks, cloves and cardamom pods in a cheesecloth bag and tie securely. Heat the cider with spices until piping hot. When ready to serve, add the apple brandy, and garnish with orange slices and apple wedges."}], "link": "https://cooking.nytimes.com/recipes/10365-van-cortlandt-punch"}