{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Potato Waffles", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT30M", "recipeYield": "About 6 6 1/2-inch round waffles", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "potato, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 267, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "393 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 russet potatoes (total weight about 1 1/4 pounds)", "1/4 cup extra-virgin olive oil", "1 small onion, peeled and finely chopped", "2/3 cup milk", "Salt and freshly ground pepper to taste", "2 large eggs", "1 cup all-purpose flour", "2 teaspoons double-acting baking powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and wash potatoes. Cut into small, even pieces and put them in large pot of cold, well-salted water; bring to boil. Lower heat and cook until you can pierce potatoes easily with fork. Drain and reserve about half a cup of potato water. Transfer potatoes to large mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in small skillet over low heat and saute the chopped onion just until it softens a bit. Pour the oil and onions over the potatoes, then add the milk to the still-warm skillet -- just to take the chill off it. Pour the milk over the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash potatoes with oil and milk. Add a fourth cup of warm potato water, reserving the rest, and continue to mash until the mixture is smooth and looser than mashed potatoes you'd serve as a side dish. If it seems stiff, add more potato water, little by little, until you reach the desired consistency. Taste and season liberally with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat your waffle iron. If you want to hold the finished waffles until serving time, preheat your oven to 200 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the batter by beating the eggs into the potatoes. Whisk together the flour and baking powder and fold them into the potatoes with a rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter or spray the grids of your waffle iron, if needed. Brush or spray the grids again only if subsequent waffles stick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon out a half cup of batter (or the amount recommended by your waffle iron's manufacturer) onto the hot iron. Smooth the batter evenly almost to the edge of the grids with a metal spatula or wooden spoon. Close the lid and bake until brown and crisp. Serve the waffles immediately or keep them, in a single layer, on the rack in the oven while you make the rest of the batch. Top with basil or rosemary olive oil or butter."}]}