{"@context": "http://schema.org", "@type": "Recipe", "name": "Uighur Nan With Cumin and Onion", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Six large flatbreads", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread flour, cumin seeds, scallion, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 460, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "92 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "3 grams", "proteinContent": "16 grams", "saturatedFatContent": "0 grams", "sodiumContent": "533 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 teaspoons dry yeast", "2 1/2 cups lukewarm water", "5 to 6 cups unbleached white bread flour", "1 tablespoon sea or kosher salt", "3 tablespoons finely chopped scallions", "1 teaspoon cumin seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the yeast over the warm water in a large bowl. Stir to dissolve. Stir in 3 cups flour, a cup at a time. Stir the dough 100 times in the same direction, about 1 minute, to develop the gluten. Add 2 teaspoons salt, then continue adding flour until the dough is too stiff to stir. Turn out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes, adding more flour if necessary to prevent sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and lightly oil the bread bowl. Add the dough, cover with plastic wrap, and let rise until doubled in volume, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the lower third of your oven and arrange quarry tiles, if you have them, on the rack, leaving a 1-inch gap between the tiles and the oven walls. If you have no quarry tiles, place 1 large or 2 small baking sheets on the rack to preheat. Preheat the oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down and turn out onto a lightly floured surface. Divide into 6 pieces. Using lightly floured hands, flatten each piece into a 4to 5-inch round. Cover the rounds with a dry cloth. Keeping the remaining pieces covered as you work, roll each dough round out on a lightly floured surface into a 10-inch round. The dough may spring back as you roll; it's best to work on 2 or 3 dough rounds at a time, alternating between them, to give the gluten time to stretch before you resume rolling. Then cover the large rounds with plastic wrap and let rise for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with 2 breads at a time, using a bread stamp or a fork, stamp the center portion of each bread; work from the center out until the dough is thoroughly pricked and flattened, leaving a 1 1/2- to 2-inch rim all around. Sprinkle a scant teaspoon of scallions, a generous pinch of cumin seed and a generous pinch of salt over the center of each bread, then dip your fingers in water and sprinkle the centers of the breads."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide each round onto a baker's peel or flour-dusted baking sheet and slide off onto the quarry tiles or preheated baking sheet. Bake until the tops of the breads begin to brown, 8 to 10 minutes. Transfer to a rack to cool for 5 minutes, then wrap in a cloth to keep soft and warm. Repeat with the remaining dough, scallions, cumin and salt. Serve warm."}]}