{"@context": "http://schema.org", "@type": "Recipe", "name": "Patrick O'connell's Butter Pecan Ice Cream", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT20M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "butter, pecans, dessert", "aggregateRating": null, "recipeIngredient": ["2 1/2 cups heavy cream", "1 cup milk", "1/2 cup butter", "1 1/2 cups whole pecans", "9 egg yolks", "1 cup sugar", "1 teaspoon pure vanilla extract", "Caramel sauce for ice cream (<a href=\"http://cooking.nytimes.com/recipes/1040-caramel-sauce-for-ice-cream\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine one cup of the cream with the milk in a saucepan and bring to the boil. Pour the mixture into another container and chill thoroughly. A film will form on top when the mixture is chilled. Remove this film."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a heavy skillet and add the pecans. Cook, shaking the skillet and stirring, until the pecans begin to brown. Strain but reserve both the butter and pecans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the yolks in a mixing bowl and add one-half cup of the sugar. Beat thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the remaining one and one-half cups of cream and one-half cup of sugar to the boil in a heavy saucepan. Slowly pour half of this mixture into the egg mixture, beating constantly. Return this mixture to the saucepan with the remaining cream and sugar mixture and heat gently without boiling or the eggs might curdle. Stir in the reserved butter in which the pecans were cooked and add the vanilla. Pour and scrape the mixture into a mixing bowl and add the chilled cream mixture. Add the pecans and pour and scrape the mixture into the container of a hand-cranked or electric ice cream freezer. Freeze according to manufacturer's instructions. Serve with caramel sauce."}]}