{"@context": "http://schema.org", "@type": "Recipe", "name": "Sauteed Soft-Shell Crabs", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT40M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "main course, soft-shell crab, spring, summer", "aggregateRating": null, "recipeIngredient": ["2 tablespoons olive oil", "1 shallot, finely chopped", "1/2 clove garlic, chopped (any green part removed)", "2 tomatoes, peeled, seeded and diced", "Coarse salt and freshly ground pepper to taste", "Cayenne pepper to taste", "1/4 pound chilled, unsalted butter, cut into small cubes", "1 teaspoon chopped parsley", "1 tablespoon chopped fresh basil", "1 to 2 drops lemon juice (optional)", "2 medium leeks", "Peanut oil for deep frying", "8 hotel or 12 prime crabs, cleaned", "Milk for dipping", "Flour for dredging", "3 tablespoons peanut oil", "Parsley or basil leaves for garnishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a saute pan and add shallot and garlic. Cook gently for about two minutes, or until translucent. Add the tomatoes and stir until the juices are released."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn up the heat and cook until the tomatoes are somewhat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with salt, pepper and cayenne."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and whisk in the butter, a few cubes at a time. Adjust seasoning and stir in the parsley and basil. Add lemon if necessary. Keep the sauce warm (do not overheat or it may curdle)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the leeks. Remove the green part and cut the leeks in julienne. Wash and dry them thoroughly. Heat the peanut oil in a deep fryer and fry the leeks until light golden brown and crisp. Drain on paper towels and salt lightly. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crabs. Dip the crabs in milk, then in seasoned flour. Heat the peanut oil in a large skillet and saute the crabs, starting with the shell side down first, for two minutes. Turn over and saute for one-and-a-half to two minutes on the other side. Drain of paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the crabs on heated plates. If serving two crabs person, spread tomato butter on each plate and place the crabs in a V shape, with the legs facing each other. Mound the fried leeks in the middle of the V and garnish with parsley or basil leaves. If serving three crabs, arrange them in a triangle and mound the the leeks in the center. Garnish."}]}