{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Roasted Fish With Fried Capers", "description": "Salt-packed capers have become a growing presence in grocery stores. They tend to be larger than capers cured in vinegar and brine, more like the flower buds that they are, and pleasingly vegetal in flavor. When you fry them in olive oil, the oil intensifies their saltiness and turns their outer leaves into a crisp shell, creating delicious crunchy bits that can be used as both seasoning and texture. Here, they stud fillets of pan-roasted striped bass, but you could use any meaty white fish like cod or halibut. It's a bright and flavorful alternative to the usual weeknight fish dish, and it can be on the table in about a half hour.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2017/04/06/dining/06COOKING-ROASTED-STRIPED-BASS1/06COOKING-ROASTED-STRIPED-BASS1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, seafood", "keywords": "capers, striped bass, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 141}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "41 grams", "saturatedFatContent": "2 grams", "sodiumContent": "590 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons salt-packed or brined capers", "2 tablespoons olive oil, plus more for frying", "1 clove garlic, crushed", "4 fillets striped bass, or other meaty white fish like cod or halibut (about 2 pounds)", "Sea salt and freshly ground pepper", "1 lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Soak the salt-packed capers in water for 10 minutes, drain, rinse, then thoroughly pat dry. (If using brined capers, drain them and pat dry.) Pour 1/2 inch olive oil into a small saucepan and place over medium-high heat. When the oil is hot enough to toast a bread crumb in 30 seconds, add the capers. Be careful, the oil may sputter. Fry until the capers fluff up and begin to brown on the edges, 30 to 60 seconds. Drain the capers on a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining 2 tablespoons oil in a large nonstick sauté pan. Place over medium-high heat and add the garlic clove. Season the fish with salt and pepper. When the garlic bubbles on the edges, lay the fish in the pan, skin side down. Sauté until browned on the bottom, 4 to 5 minutes, then put the pan in the oven and roast until the fish is just cooked through, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a fillet on each of 4 plates. Sprinkle the fried capers over the fillets and serve with wedges of lemon."}], "link": "https://cooking.nytimes.com/recipes/10410-pan-roasted-fish-with-fried-capers"}