{"@context": "http://schema.org", "@type": "Recipe", "name": "Reddish Mole (Coloradito)", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "main course, pork butt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["3 pounds pork butt, bone in, trimmed of most but not all fat", "1 head garlic, unpeeled, halved crosswise, plus 6 garlic cloves, minced", "1 teaspoon whole black peppercorns, bruised plus 5 whole black peppercorns", "3 bay leaves", "2 teaspoons salt, or to taste", "1 thick slice day-old challah or brioche,", "4 dried ancho chiles, tops and seeds removed", "4 dried guajillo chiles, tops and seeds removed", "1 2-inch piece canela, or 2 teaspoons ground Ceylon cinnamon", "5 cloves, or 1/8 teaspoon ground cloves", "1/4 cup lard or vegetable oil", "1 small onion, coarsely chopped", "3 medium ripe tomatoes, coarsely chopped", "1/3 small yellow plantain, peeled and chopped (about 1 cup)", "12 sprigs fresh thyme", "6 sprigs fresh oregano", "3 tablespoons sesame seeds, toasted", "1/4 cup dark raisins", "3/4 cup blanched almonds", "1 1/2 ounces Mexican chocolate, coarsely grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pork butt, head of garlic, 1 teaspoon of bruised black peppercorns, bay leaves and 1 teaspoon salt in a 5 to 6 quart saucepan. Add enough cold water to cover well (10 to 12 cups). Bring to a boil over high heat and immediately reduce the heat to low. Remove any foam that collects on top. Simmer, partly covered, until the meat is tender, about 2 to 2 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift out the pork, letting it drain well, and let cool to room temperature. Raise the heat to high and boil the stock until reduced to about 6 to 8 cups. Strain the stock through a fine-mesh seive, discarding the solids; let sit until the fat can be skimmed off (or refrigerate several hours and lift off the solidified fat). Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard any visible fat from the pork butt. Pull the meat from the bones, carefully tear it into long shreds, and refrigerate if not using at once. You should have about 3 to 4 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, crush the bread to fine crumbs. You should have about 1 cup. Set aside. Place the ancho and guajillo chiles in a bowl. Pour over boiling water to cover, and let soak for 20 minutes. Meanwhile, in a spice grinder, coffee grinder or with a mortar and pestle, grind together the canela, cloves and remaining 5 peppercorns. Set aside. Drain the soaked chiles and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet, heat half the lard over medium heat until rippling. Add the ground spices and cook, stirring, just until fragrant, 1 to 2 minutes. Add the onion, minced garlic, tomatoes, plantain, thyme, oregano, sesame seeds, raisins and almonds. Cook, uncovered, stirring frequently, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let this cooked mixture cool for about 10 minutes, then place half the mixture in a food processor with 1 cup of the reserved pork broth and half the drained chiles. Process to a smooth puree (about 3 minutes on high). Repeat with the remaining sauce mixture, another cup of pork broth, and the remaining chiles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or deep skillet, heat the remaining lard over medium high heat until rippling. Add the pureed mixture, stirring well to prevent splattering. Stir in the remaining stock, a little at a time. Cook, covered, stirring frequently, for 15 to 20 minutes, until the chiles lose the raw edge of their flavor. Stir in the bread crumbs and cook, stirring frequently, until the mixture is lightly thickened, about 10 minutes. Stir in the chocolate and cook, stirring constantly, until it is well dissolved. Add the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the reserved shredded pork. Cook, partly covered, stirring occasionally, just until heated through, 7 to 10 minutes. Taste for seasoning. Serve."}], "link": "https://cooking.nytimes.com/recipes/10418-reddish-mole-coloradito"}