{"@context": "http://schema.org", "@type": "Recipe", "name": "Reole Pralines", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT40M", "recipeYield": "30 pralines", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, pecan", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 169, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "4 grams", "sodiumContent": "6 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Melted butter for greasing the pans", "1 1/2 cups brown sugar", "1 1/2 cups granulated sugar", "8 tablespoons butter", "1/2 cup heavy cream", "1/2 cup milk", "2 tablespoons dark Karo syrup", "1/2 pound shelled, coarsely broken pecan halves, about 2 cups, toasted (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the inside of two baking sheets all over with a little melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "It is not imperative that you use a candy thermometer to prepare these pralines, but a thermometer is very much of an asset. It is also preferable that you cook the candy on a metal heat-control pad, the best-known brand of which is Flame-Tamer. This distributes the heat evenly and discourages burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the brown sugar, granulated sugar, butter, cream, milk and syrup in a saucepan and bring to the boil, stirring. Cook about 20 minutes, stirring constantly and checking the temperature often if a thermometer is used. When the candy achieves the soft-ball stage, the syrup will form a soft ball when a small portion is dropped into a basin of cold water and registers 235 degrees on the thermometer. Do not exceed that temperature at this point. Add the pecans and continue cooking, stirring constantly, until a temperature of 240 degrees - no more - is achieved. When ready, the syrup will have a non-glossy, lusterless look. Work quickly at this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the saucepan from the heat while beating. Take care that the candy does not harden. Use two spoons and spoon about four teaspoons of the mixture at a time onto the buttered baking sheets, spacing the mounds about three inches apart to allow the rounds to spread to about two and one-half inches in diameter. Let cool and transfer the pralines to a dessert plate, using a wide metal spatula. The pralines should be crumbly and not chewy."}]}