{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Feta With Honey", "description": "A drizzle of honey and a blast of heat transform a standard block of crumbly feta into an unexpectedly luscious, creamy spread for pita and vegetables. This, with a hunk of crusty bread and a glass of chilled white wine, is the perfect warm weather supper. If you can't get your hands on thyme honey, the regular sort will do just fine.", "author": {"@type": "Person", "name": "Sara Dickerman"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Feta/Feta-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, easy, for one, lunch, quick, weekday, dips and spreads", "keywords": "appetizer, feta, thyme honey, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1099}, "recipeIngredient": ["1 8-ounce slab Greek feta, blotted dry", "2 tablespoons extra-virgin olive oil", "1 tablespoon Greek thyme honey, or other honey", "Freshly ground black pepper", "Greek-style pita bread, toasted and cut into wedges", "Heirloom tomatoes, roasted beets, nuts or pickled vegetables (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Select a small oven-to-table earthenware dish or a small ovenproof sauté pan lined with aluminum foil to help transfer the cheese to a plate after roasting. Place the feta in the dish and cover with the olive oil. Bake until the cheese is soft and springy to the touch but not melted, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Heat the honey in the microwave or over a pan of simmering water until it is fluid enough to be spread with a pastry brush and then paint the surface of the feta with it. Broil until the top of the cheese browns and just starts to bubble. Season to taste with black pepper. Serve immediately with pita wedges and, if desired, sliced heirloom tomatoes, roasted beets, nuts or pickled vegetables."}]}