{"@context": "http://schema.org", "@type": "Recipe", "name": "Giuliano Bugialli's Pane Toscano", "description": "The crust and light yeastiness is achieved by giving the bread two risings, then baking it on a hearth where it rises again. The hearth can be improvised: Bake the bread on an oven rack lined with bricks or unglazed terra cotta tiles 1/2 to one inch thick, and allow an extra 10 minutes for the oven to preheat.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT7H", "recipeYield": "One large loaf", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "all-purpose flour, yeast", "aggregateRating": null, "recipeIngredient": ["2 cakes (1 ounce) compressed fresh yeast", "1/4 cup lukewarm water", "1/2 cup plus 1 tablespoon unbleached all-purpose flour", "6 cups unbleached all-purpose flour", "1 1/4 cups lukewarm water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sponge: Dissolve the yeast in the water in a small bowl, stirring with a wooden spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the one-half cup flour in a larger bowl, add the dissolved yeast and mix with a wooden spoon until all the flour is incorporated and a small ball of dough is formed. Sprinkle the additional tablespoon of flour over the ball of dough, then cover the bowl with a clean dish towel and put it in a warm place, away from drafts. Let stand until the sponge has doubled in size, about one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Arrange the six cups of flour in a mound on a clean work surface or pastry board and make a well in the middle. Place the sponge from the first rising in the well along with one-half cup of the lukewarm water. Carefully mix the water into the sponge with a wooden spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining water and then, using your hands, gradually begin to mix in the flour from the rim of the well little by little. Keep mixing until all but four or five tablespoons of the flour are incorporated (about 15 minutes). Then begin to knead the dough with the palms of your hands until the dough is homogeneous and smooth, about 20 minutes. Mix the remaining flour into the dough if necessary to keep the dough from being sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the loaf into a round or oval and place it on a floured cotton dish towel. Wrap the dough loosely in the towel and put it in a warm place away from drafts to stand until double in bulk, about one hour."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the sponge:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Be sure the bricks or tiles you are using are free of dust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the dough has doubled in size, carefully remove it from the towel and place it on the bricks in the oven. Bake the bread for 55 minutes. Do not open the oven for the first 30 minutes of baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the finished bread from the oven and place it on a board on one of its sides, so the air can circulate around it. Do not lay the bread flat. You may have to balance it in some manner. If you have one of those V-shaped racks used for roasting poultry, you can balance the bread in it for cooling. The bread must cool at least three hours before it is cut or broken for eating."}]}], "link": "https://cooking.nytimes.com/recipes/10425-giuliano-bugiallis-pane-toscano"}