{"@context": "http://schema.org", "@type": "Recipe", "name": "Tortilla Soup", "description": "This version of the classic Mexican soup calls for fried tortilla chips to be blended in with the broth and chiles. This yields an earthy bisque with a gentle, smoky heat. And it can be prepared in under a half hour.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "easy, quick, soups and stews", "keywords": "appetizer, side dish, chicken broth, corn tortillas, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 356, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "9 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1331 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 dried ancho chili, split, veins and seeds removed (see note)", "1 dried guajillo chili, split, veins and seeds removed", "1 tablespoon corn oil, plus additional for frying", "6 corn tortillas, cut into 1/4-inch strips", "1 small onion, peeled and coarsely chopped", "4 cloves garlic, peeled and crushed with the side of a knife", "8 ounces plum tomatoes (about 3), coarsely chopped", "8 ounces cherry tomatoes", "4 to 6 cups chicken broth", "Sea salt", "Juice of 1 lime, plus 1 lime cut into wedges", "1 avocado, peeled, pitted and sliced lengthwise into long strips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan over medium heat, toast the chilies on all sides. (They are toasted when the skins bubble and turn color; don't let them burn.) Transfer to a bowl and cover with water (about 1/4 cup)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the saucepan with 1/4 inch oil and heat to 350 degrees, until the oil shimmers. Fry the tortilla strips in 3 batches until golden, about 2 minutes per batch. Drain on paper towels and set aside. Let the oil cool, then discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the saucepan back over medium heat. Add 1 tablespoon corn oil. Add the onion and garlic and sauté until soft, about 5 minutes, then scrape into a blender. Drain the chilies and coarsely chop; add about half of each kind to the blender, along with all the tomatoes. Blend until smooth. Add about 4/5 of the fried tortillas and pour in 3 cups of the broth. Blend for a minute. Season to taste. The soup should have a gentle, smoky heat. If it is too mild, blend in the remaining chilies to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the soup into the saucepan and simmer, continuing to stir in broth until the soup is like a light bisque. Season to taste with salt and lime juice. Ladle it into bowls, garnishing it with avocado and tortilla strips. Serve with a wedge of lime."}]}