{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Stuffed Lobster With Ginger Butter", "description": "This is a slightly tricky recipe because even the slightest overcooking can leave the flesh of the lobster dry and rubbery. A good way to grill it is to halve the lobster, searing it briefly meat side down, then flipping it and continuing to cook with the grill's lid on, in effect roasting it. This technique gives the lobster a wonderful smoky edge yet retains the moisture. A ginger-butter sauce and a stuffing combining seasoned breadcrumbs and the lobster roe add a special touch.", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "butter, ginger, lobster, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 690, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "1 gram", "proteinContent": "91 grams", "saturatedFatContent": "15 grams", "sodiumContent": "2350 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["3 lobsters, 2 1/4 to 2 1/2 pounds each (half lobster per guest)", "1/2 cup breadcrumbs", "1/4 tablespoon fresh chopped tarragon", "10 tablespoons sweet butter", "Salt and freshly ground black pepper", "2 tablespoons vegetable oil", "2 large shallots, finely diced (about 1/4 cup)", "2 teaspoons freshly grated ginger", "2 tablespoons white wine vinegar", "2 tablespoons heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Kill the lobsters by plunging a large chef's knife into the joint where the head meets the body. Halve the lobsters lengthwise and cut off the claws. Set aside. Discard the sac on each half lobster near the head. Also remove the the long white strip along the meat, which is the intestines. Remove the lobster roe and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine the breadcrumbs, tarragon, 4 tablespoons butter, the lobster roe, salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the meat of the lobsters with vegetable oil and place them, meat side down, over the fire, along with the claws. Cover and cook about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip the lobsters and the claws and fill the cavities where the roe was with the breadcrumb mixture. Place one tablespoon of butter and the shallots in a saucepan and place over the grill. Cover the grill and continue cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the butter in the saucepan is melted, about 2 minutes, add two tablespoons of white wine vinegar and 2 tablespoons grated ginger. When the vinegar has reduced, another 2 minutes, add 2 tablespoons heavy cream and stir well. Bring to a boil, reduce by half, then stir in remaining butter. When all the butter has melted, remove sauce from heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the cover and cook the lobster about 8 more minutes. Serve each guest a lobster half with sauce over the meat, and a claw."}], "link": "https://cooking.nytimes.com/recipes/10458-grilled-stuffed-lobster-with-ginger-butter"}