{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Duck With Sauteed Turnips", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT9H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "duck, turnip, main course, summer", "aggregateRating": null, "recipeIngredient": ["2 ducks (6 pounds each)", "1 tablespoon salt", "1 bay leaf", "1 teaspoon thyme", "1 clove", "1/2 teaspoon black peppercorns", "2 cloves garlic, peeled, crushed and chopped coarsely", "4 tablespoons olive oil", "2 pounds white turnips", "2 tablespoons sweet butter for turnips", "1 garlic clove, peeled and left whole", "4 tablespoons sweet butter for duck sauce", "2 tablespoons chopped shallots", "1/4 cup chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the ducks' legs, including thighs. Using a boning knife, slice the legs three-quarters of the way through at the joint where they meet the thighs. Cut from the skinless side. This flattens the meat, allowing it to cook faster. Run the knife along both sides of the legbone and thighbone, from the skinless side, just to separate the meat. Remove all skin from the legs and thighs. Remove the duck breasts and skin them. (A butcher can do all this for you.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all the duck meat in a roasting pan. Combine the salt, bay leaf, thyme, clove and black peppercorns in a blender or spice grinder. Grind them to a powder. Sprinkle the powder all over the duck pieces. Rub the duck pieces with 2 tablespoons of the olive oil and add the garlic. Cover with plastic wrap and let marinate for several hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before cooking the duck, slice the turnips very thinly. You should have about six cups. Place the turnips in a large skillet, preferably cast iron, with the remaining olive oil, 2 tablespoons butter and garlic clove. Place the skillet over the hot grill along with the duck legs, uncovered. Cook the turnips, turning them occasionally, until they are soft, about 15 minutes. Remove from grill, cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the duck legs for about 20 minutes, turning occasionally. When the duck legs are done, remove them from grill and place in a roasting pan. Keep warm. Place the breasts on the grill. Cook for about 10 minutes, turning once. Place the breasts in the roasting pan with the legs and add the shallots, butter and parsley. Place roasting pan over the grill and let the butter melt and mix with the duck juices. Place the duck meat on a serving platter or serving dishes. Mix the pan juices well and bring to a boil. Pour over duck meat and serve with the turnips."}], "link": "https://cooking.nytimes.com/recipes/10459-grilled-duck-with-sauteed-turnips"}