{"@context": "http://schema.org", "@type": "Recipe", "name": "Oranges filled with orange sorbet and cloudberry jam", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT40M", "recipeYield": "10 servings", "recipeCuisine": "scandinavian", "recipeCategory": "", "keywords": "cloudberry jam, orange, dessert", "aggregateRating": null, "recipeIngredient": ["12 egg yolks", "1 1/3 cups sugar", "Pinch salt", "2 whole vanilla beans", "4 1/4 cups liquid, half cream and half milk", "Finely grated peel of two oranges", "1/4 cup undiluted frozen orange juice concentrate", "Julienned peel of three oranges", "10 oranges", "10 large green leaves, any decorative kind 1 approximately", "1 5-ounce jar cloudberry jam (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sorbet, beat yolks thoroughly. Add sugar and salt, and combine well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Split vanilla beans, remove seeds and reserve for another use. Heat milk and cream together with vanilla-bean pods until mixture is hot but not boiling. Stir a little of the hot liquid into the yolk mixture, then return all to milk mixture and cook, stirring, until thick enough to coat back of spoon. Strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add finely grated peel of oranges and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mixture in an ice-cream machine and process. When slushy, add orange juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch julienned pieces of orange peel in boiling water two to three minutes. Drain. Boil peel in additional water to cover until tender, about five minutes. Cool, drain and dry. Add to sorbet mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, cut off tops of 10 oranges, reserve slices. Cut off thin slice from bottom if necessary to make orange stand up. Scoop out insides using grapefruit knife. Reserve orange sections for other uses."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill shells with sorbet mixture, making indentation in center. Place reserved top slice on an angle in the indentation. Put in freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place filled orange on a large green leaf on dessert plate. Spoon cloudberry jam on top of sorbet and serve."}]}