{"@context": "http://schema.org", "@type": "Recipe", "name": "Pineapple Coconut Tarte Tatin", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "coconut, pastry, pineapple, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "recipeIngredient": ["3/4 cup sugar", "2 large pineapples, trimmed, peeled, cored and cut into 1/4-inch thick rings", "4 tablespoons unsalted butter", "1/2 cup shredded coconut, toasted", "Tarte Tatin pastry (<a href=\"http://cooking.nytimes.com/recipes/10504-tarte-tatin-pastry\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Position rack in bottom third of oven. Place the sugar in a 10-inch skillet or tarte Tatin pan over low heat. When some of the sugar begins to melt, begin stirring with a wooden spoon until the sugar is melted and begins to turn a pale golden color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat. Arrange the pineapple rings in layers, overlapping them slightly. Cut the butter into small pieces and scatter over the pineapple. Place the pan over medium heat. Cook until the sugar turns a deep caramel color and the juices released from the pineapple are nearly evaporated, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough and cover the pineapple according to the directions in the pastry recipe. Bake until the crust is golden brown, about 25 to 30 minutes. Remove from oven and set aside for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a small, sharp knife around the edge of the tarte to loosen. Place a large plate or platter over the skillet. Holding the plate and skillet together using 2 kitchen towels, carefully but quickly invert the tarte onto the plate. Sprinkle the toasted coconut over the top. Let stand a few minutes to cool slightly. Cut into wedges and serve with vanilla ice cream if desired."}], "link": "https://cooking.nytimes.com/recipes/10508-pineapple-coconut-tarte-tatin"}