{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Tarte Tatin", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, pastry, pear", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 43}, "recipeIngredient": ["6 firm, large pears", "2 tablespoons fresh lemon juice", "3/4 cup sugar", "4 tablespoons unsalted butter", "Tarte Tatin pastry (<a href=\"http://cooking.nytimes.com/recipes/10504-tarte-tatin-pastry\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Position rack in bottom third of oven. Peel the pears, cut them in half lengthwise and core them. Place in a large bowl and toss with the lemon juice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sugar in a 10-inch skillet or tarte Tatin pan over low heat. When some of the sugar begins to melt, begin stirring with a wooden spoon until all of the sugar is melted and begins to turn a pale golden color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat. Arrange the pear halves in the pan spoke fashion, cut side up, with the narrow end of the pears toward the center, as close together as possible. Fill in the center with the remaining pears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the butter into small pieces and scatter over the pears. Place the pan over medium heat. Cook until the sugar turns a deep caramel color and the juices released from the pears are nearly evaporated, about 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough and cover the pears according to the directions in the pastry recipe. Bake until the crust is golden brown, about 25 to 30 minutes. Remove from oven and set aside for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a small, sharp knife around the edge of the tarte to loosen. Place a large plate or platter over the skillet. Holding the plate and skillet together using 2 kitchen towels, carefully but quickly invert the tarte onto the plate. Let stand a few minutes to cool slightly. Cut into wedges and serve with or creme fraiche if desired."}]}