{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Vegetables, Marinated", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 servings as a first course", "recipeCuisine": "", "recipeCategory": "", "keywords": "asparagus, baby artichokes, fava beans, side dish, spring, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 534, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "30 grams", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1496 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup extra-virgin olive oil Approximately", "1/4 cup red wine vinegar (or to taste)", "1 tablespoon Dijon mustard", "2 cloves garlic", "Coarse salt and freshly ground pepper to taste", "2 red peppers", "1 yellow pepper", "20 baby artichokes", "1 1/2 pounds fresh fava beans", "1/2 head cauliflower", "1 pound thin asparagus", "2 tablespoons chives, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the oil, vinegar and mustard, tasting as you go so that the proportions of oil to vinegar are correct."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the garlic cloves in half, leaving the skins on, and with the tip of a knife, remove the greenish or yellow shoot in the center of the clove. Place the garlic in a press and squeeze into the oil-vinegar mixture. Season to taste with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler. Cut the peppers into strips about two inches wide, removing the seeds. Place the peppers skin side up on a broiling pan and broil until the skins are charred and puffed. Place the pepper strips in a paper bag and close the bag. Let rest for a few minutes, then remove the peppers and peel away the skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the peppers into thin strips. While they are still warm, toss in a little of the garlic vinaigrette sauce and place on a serving platter large enough to hold all the vegetables attractively."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the artichokes in a vegetable steamer and steam until cooked. Peel the fava beans and steam (if you have a Chinese bamboo steamer several layers can be cooked at the same time). Break the cauliflower into florets, trim the asparagus, and steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the tops off the artichokes about one-half inch down and remove the outer leaves. The part you have left should be tender enough to eat whole. Dust the artichokes in some of the vinaigrette dressing and place on the serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the tough skin from the fava beans and toss the beans in the dressing. Place on the serving platter along with the cooked cauliflower and asparagus. Pour the remaining dressing over the asparagus and cauliflower and sprinkle the vegetables with the chives. Let sit at room temperature for an hour before serving."}], "link": "https://cooking.nytimes.com/recipes/10500-spring-vegetables-marinated"}