{"@context": "http://schema.org", "@type": "Recipe", "name": "Tarte Tatin Pastry", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT50M", "recipeYield": "Pastry for two tartes Tatin", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, butter, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "recipeIngredient": ["2 cups all-purpose flour, plus additional for rolling dough", "1 teaspoon salt", "1 cup cold unsalted butter, cut into small pieces", "1 egg yolk", "2 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, combine the flour and salt in a large mixing bowl. Add the butter. Rub the flour and butter together between your fingers until most of the butter is incorporated and only pea-size pieces remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the egg yolk and water. Add to the flour mixture and stir until dough begins to come together. Use your hands to gently press the dough into a ball. Refrigerate until firm but not hard, about 30 minutes (if making ahead, let dough stand at room temperature until pliable but still cold). Do not roll out until just before the tarte Tatin's fruit is finished cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To roll out the pastry, flour a work surface and a rolling pin well. Divide the dough in half (freeze the remaining dough if not needed). Pat the dough into a flat disk with your hands. Roll the dough into a circle that is almost 1/4 inch thick, flouring the surface under the dough and the rolling pin frequently to prevent sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place the pastry round over the fruit in the skillet (see Tarte Tatin recipes). Trim the dough to 1/2 inch larger than the skillet. Tuck the overhanging dough in around the fruit."}]}