{"@context": "http://schema.org", "@type": "Recipe", "name": "Paula Wolfert’s Roasted Vegetables With Garlic and Herbs", "description": "This recipe came to The Times in 1991 by way of Paula Wolfert, the prolific Mediterranean cookbook author and James Beard Award winner. It is a simple treatment she obtained from a woman in Corfu, an island off the coast of Greece in the Ionian Sea. It makes the best of a medley of vegetables – and the recipe can be varied according to what is on hand. \"The combination of intense, good flavors – charred tomatoes, Greek olive oil and the herb accents of parsley, dill and mint – is wonderful, she says. Imported feta cheese (this <a href=\"https://cooking.nytimes.com/recipes/10427-roasted-feta-with-honey\">roasted version</a> would be lovely), oily black olives and crusty bread are the best accompaniments. Oh, and wine.", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": "https://static01.nyt.com/images/2017/03/08/dining/08COOKING-ROASTED-VEGETABLES1/08COOKING-ROASTED-VEGETABLES1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, lunch", "keywords": "main course, side dish, summer, vegan, vegetarian, vegetables", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 383}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 236, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "810 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds ripe tomatoes, peeled, cored, sliced thin, sprinkled with a pinch of sugar", "1 1/2 pounds medium boiling potatoes, pared, each cut into six wedges", "1 pound medium red or yellow onions, each cut into six wedges", "1 pound zucchini, trimmed, rinsed, cut into one-and-a-fourth-inch chunks", "2 ribs celery, trimmed, stringed, and cut into one-and-one-fourth-inch chunks", "2 teaspoons fine chopped garlic", "2 teaspoons fine salt", "1/2 teaspoon fine ground pepper", "1/3 cup fine chopped parsley", "1 1/2 tablespoons chopped dill", "1 teaspoon chopped fresh mint or marjoram", "1/4 cup fruity extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set an oven rack in the upper middle position. Preheat the oven to 400 degrees. Oil a large baking dish (such as a 13-by-11-by-2-inch lasagna pan)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread half the tomatoes on the bottom of the dish. Scatter the potatoes, onions, zucchini and celery on top. Lay the remaining tomatoes over the vegetables. Sprinkle with the garlic, salt, pepper and herbs and drizzle with oil. Bake the dishes for 30 minutes. Remove it from the oven; stir carefully to redistribute the vegetables, then bake for another 30 to 40 minutes without disturbing. Serve hot or lukewarm."}], "link": "https://cooking.nytimes.com/recipes/10568-paula-wolferts-roasted-vegetables-with-garlic-and-herbs"}