{"@context": "http://schema.org", "@type": "Recipe", "name": "Jimmy Bradley’s Salad With Gruyère", "description": "“I’m a big proponent of what you might call stoner food,” the chef and restaurateur Jimmy Bradley told me in 2003, when he gave me this recipe for what amounts to fondue topped with a potato salad topped with a green one. “I think there should always be something on the menu at my restaurants, where someone can come in and see it and say, ‘Yeah, man, I want some of that right now, and then we’ll figure out the rest of the meal.” Well, yeah, man: a pool of warm Gruyère, topped with batons of bacon, wedges of potato, a bitter salad of greens, the cold against the warm, the salty against the faintly sweet and acidic? Pair that with a slightly chilled red wine and someone special and you can figure out the rest later.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/12/11/dining/ss-salad-with-gruyere/merlin_147141453_907e7742-b596-4def-bbce-c35ff1eb0f4a-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "appetizer, arugula, belgian endive, gruyère", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 669, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "24 grams", "sodiumContent": "791 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 Yukon Gold potatoes, about 5 ounces each, peeled and quartered lengthwise", "2 tablespoons olive oil", "Salt and freshly ground pepper", "10 ounces bacon, cut into 1-inch pieces", "1 tablespoon unsalted butter", "1 tablespoon all-purpose flour", "2 shallots, finely chopped", "1 cup white wine", "1 cup heavy cream, or more if needed", "2 cups shredded Gruyère cheese", "1 1/2 teaspoons sherry vinegar", "1/2 teaspoon Dijon mustard", "1 head Belgian endive, leaves separated", "4 to 6 cups cleaned, torn arugula or dandelion greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place potatoes in a shallow foil-lined roasting pan; drizzle with 1/2 tablespoon olive oil and toss to coat. Sprinkle lightly with salt and pepper and toss. Bake 40 minutes, until tender and crisped, stirring after 20 minutes. Loosely cover with foil; keep warm in low oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fry bacon until crisp. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the roux. Melt butter over medium heat. Stir in flour and cook, stirring, for about 10 minutes until the mixture is golden. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine shallots and wine in a nonreactive saucepan; boil until reduced to 1/3 cup. Reduce heat to medium. Stir in the reserved roux and heavy cream, simmer and stir in cheese, a little at a time, until melted and mixture is smooth. Taste; season with pepper. If necessary, thin with more cream. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine remaining oil, the vinegar and mustard in a large bowl. Whisk until blended. Season lightly with salt and pepper. Add warm potatoes, bacon, endive and arugula or dandelion greens; toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle fondue into a large bowl and place the salad atop or serve in individual shallow bowls."}], "link": "https://cooking.nytimes.com/recipes/10584-jimmy-bradleys-salad-with-gruyere"}