{"@context": "http://schema.org", "@type": "Recipe", "name": "Bouillabaisse", "description": "", "author": {"@type": "Person", "name": "R. W. Apple Jr."}, "image": null, "totalTime": "PT3H40M", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "fish fillets, fish stock, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 538, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "44 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1598 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 to 4 pounds mixed fish fillets (John Dory, red mullet, red snapper, porgy, pompano, striped bass, monkfish, grouper, hake), cut into 3-inch chunks", "1 tablespoon pastis (Ricard or Pernod)", "1 1/2 to 2 teaspoons saffron threads, crumbled", "3/4 cup olive oil", "Salt and freshly ground black pepper", "4 quarts Fish Stock for Bouillabaisse (<a href=\"http://cooking.nytimes.com/recipes/10582-fish-stock-for-bouillabaisse\">see recipe</a>), plus a few tablespoons for rouille", "2 pounds (about 3 large) potatoes, peeled and cut into 1/2-inch slices", "Cayenne pepper", "4 to 5 cloves peeled garlic", "1 small hunk country bread, crust removed", "1 baguette or loaf of country bread, cut into slices and dried in oven"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine fish, pastis, two pinches of saffron and 1/2 cup olive oil. Season lightly with salt and pepper, and mix well without breaking up fish. Cover, and refrigerate for at least three hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy-bottomed stockpot, combine fish stock and remaining saffron. Place over high heat, and bring to a rapid boil. Add potatoes, and cook for 7 minutes. Add largest, firmest pieces of fish from the bowl, and cook for 2 minutes. Add remaining pieces of fish, and continue to boil until potatoes are tender, about 10 more minutes. Season with salt, pepper and cayenne to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rouille: Crush 2 to 3 cloves garlic, and use a mortar and pestle to mash with a pinch of cayenne pepper. Dunk hunk of bread into 2 to 3 tablespoons hot fish stock, squeeze out liquid, and add to mortar. Mash well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take 2 to 3 slices potato from Bouillabaisse, and mash with pestle into a thick paste. Gradually add remaining olive oil, drop by drop, mashing mixture in a circular motion until thick and smooth. (If mixture breaks up, add a teaspoon or two of hot fish stock or a little more soup-soaked bread.) Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove fish and potatoes from soup, and arrange on a large serving platter. Ladle some soup over fish, and keep warm. Rub slices of bread with 2 cloves garlic, and place in a dish on the table along with bowl of rouille. Have diners dab croutons with rouille and place them in soup plates. Ladle soup over croutons, and place a serving of fish and potatoes into each plate."}], "link": "https://cooking.nytimes.com/recipes/10583-bouillabaisse"}