{"@context": "http://schema.org", "@type": "Recipe", "name": "Sausage and Mushroom Risotto With Raisins", "description": "This risotto is a variation on a dish the chef and restaurateur Jimmy Bradley’s grandmother made when he was a kid, shuttling between parents in Rhode Island and Philadelphia. Mr. Bradley hauled it out one day when he had mushrooms to spare; it started as a special and was until recently served on the menu at the Red Cat, beneath a sweet-and-sour glazed quail. You don’t need the quail. As is true in so much of Bradley's cooking, there is a genuine interplay of flavors and textures at work in the dish. Above the foundation of broth-enriched rice, the sweet of the raisins rides calmly into the bite of the radicchio. Meanwhile, the soft, salty whoosh of the cheese rises up over the loamy richness of the mushrooms like steam over a marsh. The sausage seems an elegant afterthought, fennel-studded excess to help blunt autumn’s chill.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, one pot", "keywords": "arborio rice, italian sausage, raisins, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "8 grams", "sodiumContent": "719 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup golden raisins", "6 ounces sweet or hot Italian sausage (about 1 1/2 links), casings removed", "2 small cloves garlic, finely minced", "3 ounces (1 cup) cremini mushrooms, cleaned, trimmed and quartered", "4 1/2 cups lightly salted chicken broth", "2 tablespoons butter", "1 tablespoon olive oil", "3 tablespoons finely minced onion", "2 tablespoons finely minced celery", "1/2 teaspoon kosher salt or to taste", "1/4 teaspoon freshly ground black pepper, or to taste", "1 1/2 cups Arborio rice", "1/2 cup white wine", "1 small head radicchio (8 ounces), shredded (4 cups)", "1/3 cup freshly grated Parmesan cheese", "1 tablespoon fresh thyme leaves (no stems), finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place raisins in a bowl; cover with hot water. Set aside to plump."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine sausage and garlic in a large skillet over medium-high heat. Cook 5 minutes, breaking up sausage, until meat begins to brown. Reduce heat and add mushrooms. Cover and cook 10 minutes, stirring occasionally, until mushrooms start to exude liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer broth in a saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in oil in an enamel-lined cast-iron casserole over medium heat. Add onion, celery, 1/2 teaspoon salt and 1/4 teaspoon pepper; sauté 5 minutes, until vegetables are translucent. Add rice and cook, stirring, 1 to 2 minutes, until edges of rice are translucent and coated with pan juices. Add wine and simmer 3 minutes, stirring continuously, until wine has almost evaporated. Add 1/2 cup hot broth; stir over medium-low heat until rice mixture is moist, not runny. Repeat, adding 1/2 cup hot broth at a time, until rice is al dente and mixture is creamy (about 20 minutes; adjust heat to keep rice cooking gently and add more hot broth or water if needed)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain raisins and add to rice. Add sausage mixture, radicchio, Parmesan and thyme and mix well. Taste and adjust seasonings if necessary. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/10585-sausage-and-mushroom-risotto-with-raisins"}