{"@context": "http://schema.org", "@type": "Recipe", "name": "Fannie Lou’s Derby Pie", "description": "The Kentucky Derby is a two-minute horse race, but its cultural impacts are long-lasting, including a rich culinary tradition of <a href=\"https://cooking.nytimes.com/recipes/1016295\">mint juleps</a>, <a href=\"https://cooking.nytimes.com/recipes/1020198\">hot browns</a> and Derby pie. Only Kern’s Kitchen Inc. can make a true “Derby-Pie” — the creators of the dessert trademarked the term before partnering with the Kentucky Derby Festival — but while the naming practices are sticky, the concept is universal: a chocolate-chip and walnut-laden batter baked in a pie crust. This version is adapted from author ZZ Packer, who shared her great-aunt’s recipe. Many versions exist — some spike the batter with bourbon; others swap in varying nuts or crown the pie with whipped cream — but Fannie Lou’s is easy to assemble, and makes a lasting impression.", "author": {"@type": "Person", "name": "Matt Lee and Ted Lee"}, "image": "https://static01.nyt.com/images/2014/05/23/dining/Almost-Derby-Pie/Almost-Derby-Pie-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "southern", "recipeCategory": "pies and tarts", "keywords": "dessert, pie crust, semisweet chocolate chips, walnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 191}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 593, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "14 grams", "sodiumContent": "191 milligrams", "sugarContent": "36 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 unbaked 9-inch pie crust <a href=\"http://cooking.nytimes.com/recipes/12319-all-purpose-pie-dough\">(see recipe)</a>", "4 tablespoons butter, melted", "2 large eggs", "1 teaspoon vanilla extract", "1 cup dark brown sugar", "1/2 cup flour", "3/4 cup chopped walnuts", "3/4 cup semisweet-chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Transfer the crust to a pie plate and prick the bottom with a fork. Cover lightly with a sheet of foil, pressing it gently into the crust and making sure the edges are covered. Place weights (metal pie weights or dried beans) on the foil to weigh down the bottom and hold up the sides of the crust. Bake for 10 minutes, then remove foil. Continue baking until the crust is firm and has lost its sheen but is not browned, about 5 more minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the butter, eggs and vanilla extract. Add the brown sugar and flour and stir until thoroughly blended. Using a rubber spatula, fold in the walnuts and chocolate chips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the crust. Bake until puffed and golden brown, about 30 minutes. Remove from the heat and place on a rack to cool. Serve warm."}]}