{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Caramel Calvados Crepes", "description": "There is no doubt that this recipe is an undertaking, what with cooking the apples, making the crepes and some Calvados-flavored sauce. But if you want, you could do away with the sauce and crepes, and serve the buttery, almost caramelized apples over good vanilla ice cream. And even though you need to rustle up the three components, it is an easy choice when you have guests over, as everything can be made in advance. The apples and sauce can be reheated at the last minute and their warmth heats up the thin, pliable crepes.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/05/14/dining/Crepes/Crepes-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 473, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "14 grams", "sodiumContent": "76 milligrams", "sugarContent": "42 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup flour", "1 1/3 cups milk", "1 large egg", "2 tablespoons unsalted butter, melted, more for frying", "2 teaspoons Calvados or Apple Jack", "4 Gala apples", "Juice of half a lemon", "2 tablespoons butter", "2 tablespoons sugar", "4 tablespoons butter", "1/3 cup light brown sugar", "1/3 cup light or dark corn syrup", "1/3 cup heavy cream", "2 teaspoons Calvados or Apple Jack"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the crepes:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or food processor, combine flour, milk and egg. Process just until blended. Pour into a pitcher and stir in 2 tablespoons melted butter and the Calvados."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a crepe pan or small nonstick skillet over medium-high heat. Brush with butter. Allow pan to heat for about a minute; if it is not hot enough batter will not spread thinly. Ladle a scant 1/4-cup batter into pan and quickly swirl so batter forms a thin pancake. Return pan to heat and watch for tiny bubbles to form on surface and edges of pancake. Flip pancake; it should be light golden brown. Allow to cook about 30 seconds longer, then transfer to a plate lined with parchment paper. Continue making pancakes, layering each one with parchment. Crepes may be covered and stored at room temperature for up to a day."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the apple filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, core and cut each apple in two. Cut the two pieces into four wedges, and cut each wedge crosswise. Place in a saucepan and add lemon juice, butter and sugar. Place over medium heat and cook uncovered, stirring occasionally, for 10 minutes. Cover and continue to cook and stir for another 10 minutes. Allow to cool for 5 minutes before serving."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan combine the butter, brown sugar and corn syrup. Bring to a boil and simmer for 2 minutes, then add cream and Calvados. Continue to simmer until thickened slightly, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, place a room-temperature crepe on a plate. Spoon warm apple filling into center, and fold edges over it. Drizzle warm sauce on top. Repeat with remaining crepes, and serve."}]}]}