{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Halibut With Anchovies, Capers And Garlic", "description": "Three classic flavors are often overlooked these days, so much so that when I prepared a dish combining them not long ago, I seemed to be tasting it for the first time. This combo is garlic, anchovies and capers, a natural southern Mediterranean team that is strong and distinctive. Its brininess makes it incompatible with many foods, but it is ideal with fish, especially sturdy fish like halibut and swordfish. Creating a dish out of these ingredients is almost as easy as simply searing the fish and serving it with lemon. The fish is quickly browned, then allowed to finish cooking in the oven while the no-fuss sauce cooks in the pan.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/19/dining/19COOKING-SEAREDHALIBUT2/19COOKING-SEAREDHALIBUT2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick", "keywords": "anchovy fillets, capers, halibut, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 460}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 434, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "0 grams", "proteinContent": "41 grams", "saturatedFatContent": "8 grams", "sodiumContent": "583 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 tablespoons butter (or more oil)", "1 1/2 to 2 pounds halibut or swordfish steaks", "Salt and pepper to taste", "4 anchovy fillets or more to taste", "1 tablespoon or more minced garlic", "1 tablespoon drained capers", "1/2 cup dry white wine", "1 teaspoon lemon juice, or to taste", "Chopped fresh parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Put a large skillet, preferably nonstick, over medium-high heat, and leave it there until hot. Add oil and butter together. Butter should sizzle. When butter foam subsides, add fish, and season it lightly with salt and pepper. Brown fish, basting with pan juices, then turn, and brown again. Do not worry about cooking through. Turn off heat, put fish on an ovenproof plate, and place it in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat under skillet to medium, and add anchovies and garlic. Cook, stirring occasionally, until anchovies break up, just a couple of minutes. Add capers and wine, and turn heat to high. Cook until wine is reduced by half. Return fish and its juices to pan, and turn it in sauce once or twice. Fish should be cooked through by now. (A thin-bladed knife inserted into its thickest part will meet little resistance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste sauce, add some lemon juice, then taste again. It should be strong-tasting but only mildly acidic. Remove fish to serving plate, spoon sauce on top, and garnish with parsley."}]}