{"@context": "http://schema.org", "@type": "Recipe", "name": "Confit De Canard", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four legs and four wings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "duck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 464, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "0 grams", "proteinContent": "7 grams", "saturatedFatContent": "16 grams", "sodiumContent": "271 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 Peking or Long Island ducks, 5 pounds each", "3 tablespoons coarse salt", "1 tablespoon freshly ground black pepper", "1 teaspoon minced thyme leaves", "1 teaspoon minced rosemary leaves", "1 bay leaf, crushed", "1 teaspoon quatre epices (recipe below)", "1 head garlic, cloves separated and peeled", "6 cloves", "6 cups rendered duck fat", "1 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the duck into two legs with thighs attached, two breasts and wings. Cut off the wing tips and reserve. Reserve the two breasts for another use. Remove the excess fat from the carcass and set both carcass and fat aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the salt, pepper, thyme, rosemary, bay leaf and quatre epices. Rub the mixture all over the legs and wings. Place in a large bowl. Stud the 6 largest garlic cloves each with a whole clove. Tuck between the duck pieces. Cover and refrigerate for 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the reserved duck fat and 1 cup of water in a heavy-bottom saucepan. Bring the water to a boil, lower the heat and simmer until the fat has melted and the water has evaporated, about 1 hour. Remove from heat and pass the liquid through a strainer lined with cheesecloth. Pour the fat into a Mason jar and cool to room temperature. Refrigerate until completely cooled. It will keep for up to four months refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the rendered duck fat in a large, heavy-bottom casserole or pot over medium heat. Remove the duck pieces from the refrigerator and wipe off the spice mixture. Reserve the garlic. Slide the duck into the fat. Add the garlic. Slowly cook the duck over low heat until the leg meat can be easily pierced with a toothpick, about 2 hours for the wings and about 2 1/2 hours for legs. Do not allow the fat to boil. Using a slotted spoon, carefully transfer the duck to a tall glass jar or crock. Pass the duck fat through a strainer lined with cheesecloth into the jar. The duck should be completely covered by the fat. Cool to room temperature. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you plan to store the confit for an extended time, cover the solid fat with half a layer of vegetable oil to form an airtight seal that will keep the confit longer. Refrigerate at least a week before eating; it can keep up to 3 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to use, remove from refrigerator. Let stand at room temperature until the fat softens. Remove the pieces and wipe off excess fat."}], "link": "https://cooking.nytimes.com/recipes/10614-confit-de-canard"}