{"@context": "http://schema.org", "@type": "Recipe", "name": "Torta Turchesca (Venetian Rice-Pudding Tart)", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "arborio rice, dates, golden raisins, dessert, fall, winter, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 467, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "16 grams", "sodiumContent": "49 milligrams", "sugarContent": "23 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/3 cups all-purpose flour", "4 teaspoons sugar", "3/4 teaspoons grated lemon zest", "11 tablespoons cold unsalted butter, cut into chunks", "4 teaspoons water", "3/4 teaspoon vanilla extract", "1/4 cup golden raisins", "2 3/4 cups whole milk", "1/2 cup Arborio rice", "1/2 cup heavy cream", "1/3 cup sugar", "1/4 cup chopped pitted dates", "2 teaspoons grated orange zest", "1/2 teaspoon cinnamon", "4 large egg yolks", "1/2 teaspoon rose water", "3/4 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust: Pulse flour, sugar and zest in a food processor. Add butter and pulse until the mixture resembles coarse meal. Add water and vanilla and pulse to combine. Gather the dough into a ball. (Add a teaspoon or 2 of water if it seems dry.) Flatten the ball into a disk, wrap in plastic and refrigerate 1 hour or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Unwrap the dough and place it between 2 new sheets of plastic. Roll the dough out to an 11-inch circle. Remove the top sheet of plastic and invert the dough over a 9-inch tart pan. Remove the second sheet of plastic and ease the dough into the bottom and up the sides of the pan. Trim the dough off the sides. Line the tart shell with foil and fill with dry beans or pie weights. Bake for 15 minutes. Remove the weights and foil and bake until golden, about 10 minutes more. Cool on a wire rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling: Soak the raisins in boiling water to cover for 30 minutes. Drain and set aside. In a saucepan, combine 2 cups of the milk and the rice. Bring to a simmer, adjust the heat, cover and simmer until the rice is tender, about 15 minutes. Stir in remaining milk, raisins, cream, sugar, dates, zest and cinnamon. Raise heat to medium. Stirring occasionally, return mixture to a simmer and immediately remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. In a bowl, whisk together the yolks, rose water and vanilla. Gradually stir in 1/2cup of the warm rice, then stir the mixture back into the pan containing the rest of the rice. Spoon the filling into the tart shell and smooth the top. Bake until lightly browned, 25 to 30 minutes. Cool 10 minutes before serving warm with whipped cream."}]}