{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterscotch Pudding", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dark brown sugar, egg yolks, heavy cream, dessert, fall, spring, summer, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 487, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": null, "proteinContent": "6 grams", "saturatedFatContent": "21 grams", "sodiumContent": "252 milligrams", "sugarContent": "38 grams", "transFatContent": null}, "recipeIngredient": ["6 large egg yolks", "3/4 cup granulated sugar", "1 cup whole milk", "2 cups heavy cream", "1/4 cup firmly packed dark brown sugar", "1 teaspoon vanilla extract", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place yolks in a large mixing bowl and whisk lightly. Set aside. Combine the sugar and 1/4 cup water in a heavy, medium saucepan and place it over low heat. Cook until the sugar is dissolved, about 7 minutes. Raise the heat to high and cook, watching it closely, until the sugar turns a golden amber color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sugar is cooking, whisk the milk, cream and brown sugar together in another saucepan and place it over high heat. Bring just to a boil and remove from the heat. As soon as the caramel is golden, remove it from the heat and immediately begin to slowly stir in the hot milk and cream. (Be careful as the mixture will bubble up and sputter.) Continue to stir until all the milk has been added. Pouring in a slow, steady stream, whisk the hot cream mixture into the eggs. Whisk in the vanilla and salt. Strain through a fine-mesh strainer. Refrigerate until cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Using a spoon, skim off any air bubbles from the top of the custard mixture. Divide the mixture between 6 -cup ramekins or custard cups and place them in a roasting pan. Add boiling water to the pan to come halfway up the sides of the ramekins and cover the pan with aluminum foil. Bake the puddings until they are set around the edges but still have an area in the center about the size of a quarter that remains somewhat loose, about 50 minutes. Remove custards from the roasting pan and refrigerate several hours or overnight. Serve with whipped cream if desired."}], "link": "https://cooking.nytimes.com/recipes/10628-butterscotch-pudding"}