{"@context": "http://schema.org", "@type": "Recipe", "name": "Poached Eggs With Date Chorizo Paste", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 appetizer servings", "recipeCuisine": "spanish", "recipeCategory": "breakfast, brunch", "keywords": "dried chorizo, eggs, medjool dates, fall, spring, summer, winter, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 311, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "302 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Butter at room temperature", "White truffle oil", "6 eggs", "Fine sea salt", "1/4 cup sugar", "1/2 cup medjool dates, pitted and coarsely chopped (available at stores with a good dried fruit selection)", "3/4 cup chorizo, skinned and cut into thin slices", "3 tablespoons rice wine vinegar", "Freshly ground black pepper", "2 tablespoons extra virgin olive oil, with more for the bread", "Coarse salt", "6 thick slices rustic country bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Two days before serving, prepare eggs. For each egg, lay out a 12-inch square of plastic wrap. Generously grease it with butter, and then sprinkle with truffle oil and salt. Crack an egg in center of each, then quickly collect edges of plastic wrap. Twist ends of wrap tightly, and tie with string. Refrigerate two days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pan, combine sugar with 1/4 cup water and bring to a boil. Let cool. Meanwhile, in a food processor, combine dates, chorizo, vinegar and 2 tablespoons of the sugar syrup. Season with pepper. Puree until smooth, scraping down sides of bowl with a spatula. The mixture should be thick but not stiff. Pulse in the olive oil, and then water (a tablespoon at a time) as needed. Taste, and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put paste on a large square of cheesecloth. Wrap in a ball, and squeeze with your hands over a bowl. (This is messy and time-consuming, but makes the resulting paste markedly smoother and strains out any chewy pieces of chorizo.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pan of water to a simmer. Using a slotted spoon, gently add egg packages to water. Simmer 3 1/2 minutes, for a runny yolk. Meanwhile, toast bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When eggs are done, transfer packages to paper towels to drain. Place one package on each of six plates, and cut open at top with scissors. Discard plastic wrap, making sure all the oil stays on the plate. Sprinkle egg with coarse salt. Spoon a little date-chorizo paste around it. Sprinkle olive oil on toast, and serve with eggs."}], "link": "https://cooking.nytimes.com/recipes/10632-poached-eggs-with-date-chorizo-paste"}