{"@context": "http://schema.org", "@type": "Recipe", "name": "Iraqi Lentil Soup With Meatballs", "description": "This recipe came to The Times in a 2004 article about iftar, the breaking of the fast during Ramadan, the monthlong Muslim holiday during which observers abstain from food and drink from sunrise to sunset. Soup, like this hearty, spiced lentil soup with meatballs and angel hair pasta, is a common iftar meal as it provides substantial nutrition as well as plenty of hydration. It is adapted from a recipe belonging to Suad Shallal, who moved with her family from Iraq to the United States, in 1966. It was served at her son Andy's restaurant, Mimi's American Bistro in downtown Washington, each day during Ramadan. (The restaurant is now closed.) Mrs. Shallal's recipe calls for ground allspice, but feel free to experiment with other spices found in Middle Eastern cooking like cumin, coriander, cardamom and turmeric. And don't forget to taste and season with salt as you go.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2018/01/16/dining/16COOKING-IRAQIMEATBALLS1/16COOKING-IRAQIMEATBALLS1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "pastas, soups and stews", "keywords": "appetizer, brown lentils, ground meat, pasta, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 247}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 543, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "8 grams", "proteinContent": "33 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1116 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 medium onions, minced", "1 pound ground beef or lamb or both", "1/2 cup finely chopped parsley", "1 cup soft bread crumbs", "1 teaspoon salt plus salt to taste", "1/4 teaspoon pepper", "1/2 teaspoon allspice, freshly ground from about 5 whole allspice", "2 tablespoons pure olive oil", "10 cups chicken broth", "1 pound brown or yellow lentils", "3 rounds angel hair pasta (about 2 ounces)", "2 carrots, diced fine", "Juice of one half lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees, and line a baking pan with parchment paper. Place half the onions and the ground meat, parsley, bread crumbs, salt, pepper and allspice in a medium mixing bowl. Blend ingredients, and form into balls the size of walnuts. Turn onto the baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 10 minutes, remove from pan, and drain on a paper towel. In a soup pot, sauté remaining onions in olive oil over medium heat until golden. Add chicken broth and bring to boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick any stones from over lentils, place in bowl, cover with cold water, and drain. Add them to soup, turn heat to low, and simmer slowly for about 20 minutes or until lentils are almost tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble angel hair pasta into soup, along with carrots and meatballs. Simmer slowly for another 5-10 minutes or until lentils and noodles are cooked, adding more chicken broth or water as needed. Just before serving, squeeze lemon into soup."}], "link": "https://cooking.nytimes.com/recipes/10708-iraqi-lentil-soup-with-meatballs"}