{"@context": "http://schema.org", "@type": "Recipe", "name": "Muqueca With Pirao", "description": "", "author": {"@type": "Person", "name": "Christopher Idone"}, "image": null, "totalTime": "PT1H", "recipeYield": "Ten servings", "recipeCuisine": "brazilian", "recipeCategory": "dinner, project", "keywords": "fall, spring, summer, main course, manioc flour, shrimp, snapper", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 785, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "10 grams", "proteinContent": "41 grams", "saturatedFatContent": "28 grams", "sodiumContent": "1381 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 10 cups fish stock", "2 coconuts for coconut milk", "1 cup olive oil", "5 garlic cloves, peeled and thinly sliced", "4 medium onions, thinly sliced", "2 large ripe tomatoes, peeled, seeded and chopped", "1 cup chopped parsley", "2 bay leaves", "1 tablespoon fresh oregano, or 1 teaspoon dried", "Salt and freshly ground pepper to taste", "3 dozen medium-sized shrimp in shell", "3 pounds snapper or grouper fillets with skin (heads and trimmings reserved for steps 8 and 12)", "1 cup manioc flour", "3 tablespoons dende oil (see note)", "2 teaspoons hot pimente oil or tabasco"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the stock and coconut milk a day or two ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat a large nonreactive (such as glass or enamel) saute pan with a half cup of the olive oil and place over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Saute the garlic in the oil just until golden, about four or five minutes. Add the onions and cook just until wilted, stirring frequently, about five or six minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes, parsley and seasonings. Heat thoroughly and add one cup of fish stock and four cups prepared coconut milk. Bring to a boil, reduce the heat and simmer for 15 minutes. Cool and reserve. (This can be prepared a day ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt and pepper the shrimp and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the fish fillets, checking for stray bones, into one-and-a-half-inch cubes, salt and pepper the cubes and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over medium heat, bring eight cups of fish stock to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the fish heads and trimmings to the stock, simmer for 15 minutes, strain and reserve the heads and keep the stock warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil in a nonreactive saute pan over medium-high heat. Add the shrimp and saute briefly, until they are pink. Remove and reserve the shrimp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the fish cubes and saute them until they are golden but not thoroughly cooked. Remove and reserve with the shrimp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Deglaze the pan with a half cup of the warm fish stock and add the reserved coconut-fish stock mixture and bring to a simmer and keep warm over very low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pirao, pick away the cheeks and excess meat from the heads and trimmings. Combine one cup of the fish meat with about a quarter cup of fish stock and puree in a food processor or electric blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-sized heat-proof bowl, add the manioc flour and whisk in the heated stock a little at a time until it is the consistency of farina."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the fish puree, one tablespoon of dende oil and one teaspoon of pimente oil, or to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and keep warm over a pan of simmering water while you finish cooking the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat and bring the coconut-fish mixture to a simmer. Add the shrimp, cubed fish and their juices and bring to a simmer. Add the remaining two tablespoons of dende and one teaspoon of pimente oil. Transfer to a heated soup tureen or wide shallow soup plates and accompany with the pirao, slaw and boiled rice. Usually the shrimp are served in their shells and the shells eaten. If they are to be peeled - then they should be peeled just before reheating in the coconut-fish stock mixture."}]}