{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp and Grits", "description": "Once a popular morning meal throughout the South, shrimp and grits is no longer restricted to breakfast tables below the Mason-Dixon line. Variations of the dish now appear on breakfast, lunch and dinner menus across the country from Maine to Oregon. This recipe is an adaptation of one that Julia Reed discovered at Pearl’s Café, a restaurant in landlocked Sewanee, Tenn., that evokes shrimp cardinale, a dish found in New Orleans. It is “a superb version, a highly seasoned, creamy concoction with chunks of tomatoes” that is served over a pile of grits enriched with plenty of butter, salt and Cheddar.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": "https://static01.nyt.com/images/2016/12/30/dining/30COOKING-SHRIMPGRITS2/30COOKING-SHRIMPGRITS2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "cajun, creole, southern", "recipeCategory": "breakfast", "keywords": "cheddar, grits, shrimp, main course, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 667}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 685, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "3 grams", "proteinContent": "39 grams", "saturatedFatContent": "26 grams", "sodiumContent": "890 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 cup grits", "1/4 teaspoon salt", "6 ounces Cheddar cheese, grated", "3 tablespoons butter", "4 tablespoons butter", "3/4 cup chopped onion", "1/2 cup chopped green bell pepper", "2 gloves garlic, minced", "1 cup diced ripe tomatoes with a little of their juice (chopped canned tomatoes are preferable to less-than-perfect fresh tomatoes)", "1/2 teaspoon dried thyme", "1 tablespoon flour", "1 pound medium to large raw shrimp, shelled (reserve shells for stock)", "1/2 to 1 cup shrimp stock (see note)", "1 tablespoon tomato paste", "1/3 cup heavy cream", "2 teaspoons Worcestershire sauce", "2 dashes Tabasco", "Salt to taste", "2 tablespoons chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the grits, bring 3 1/2 cups water to a boil and stir in the grits. Reduce heat to low, cover and cook for 15 to 20 minutes, until the grits are tender and the liquid has been absorbed. Remove from heat, add the salt, cheese and butter and stir until melted. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the shrimp, melt the butter in a large skillet over medium heat and sauté the onion, pepper and garlic until softened, about 3 minutes. Add the tomatoes and juice and thyme; bring to a simmer. Cook for 2 or 3 minutes. Sprinkle with flour and stir well. Add the shrimp and stir constantly until they begin to turn pink, about 2 minutes. Add 1/2 cup stock and cook for 2 to 3 minutes more. Add the tomato paste and stir until blended. Add the cream, Worcestershire and Tabasco and more stock if needed to make a spoonable sauce that generously coats the shrimp. Heat thoroughly, being careful not to let it come to a boil. Taste for salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a portion of grits in the center of each plate and spoon shrimp over or around it. Sprinkle with parsley."}]}