{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Bread Salad", "description": "This is, quite possibly, the bread salad to end all bread salads. Judy Rodgers, the legendary chef and bread lover, developed it to serve alongside <a href=\"http://cooking.nytimes.com/recipes/1015770-zuni-cafe-chicken\">roast chicken</a>, but it's perfect paired with any roast meat. Bread chunks are mixed with a sharp vinaigrette, softened currants, toasted pine nuts and lightly cooked scallions and garlic. Everything is piled into a roasting pan then slid into the oven just before the chicken comes out and stays in while the chicken rests (if you're not making it with chicken, heat the oven to 450, turn it off and pop the salad in for 15 minutes). At the last minute, toss the bread mixture with arugula and vinaigrette. Top with your meat of choice (or not) and dig in.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/07/19/dining/19COOKING-ZUNIWARMBREADSALAD2/19COOKING-ZUNIWARMBREADSALAD2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "appetizer, side dish, arugula, ciabatta bread, dairy-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 180}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 473, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "5 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "434 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon dried currants", "1 tablespoon red wine vinegar", "2 tablespoons pine nuts", "8 to 10 ounces slightly stale ciabatta or other open-textured white bread", "8 tablespoons extra virgin olive oil", "1 1/2 tablespoons Champagne vinegar or white wine vinegar, approximately", "Salt and coarsely ground black pepper", "3 garlic cloves, slivered", "1/4 cup thinly sliced scallions", "4 tablespoons lightly salted chicken stock or lightly salted water", "4 cups arugula leaves or mustard greens, rinsed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place currants in a small dish, add red wine vinegar and 1 tablespoon warm water, and set aside. Heat broiler. Place pine nuts in small baking dish, and toast under broiler until very lightly colored. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut bread into three or four large chunks. Closely trim off most of the crust and reserve, if desired, to toast and use for bread crumbs or to float in soup. Brush bread all over with 2 tablespoons olive oil. Briefly broil bread chunks, turning until crisp and golden on surface. Remove from oven, trim off any charred tips, and tear chunks into irregular pieces, from 2-inch wads to large crumbs. You should have 4 cups. Place in wide metal, glass or ceramic salad bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk 1/4 cup olive oil with 1 1/2 tablespoons Champagne vinegar. Season with salt and pepper. Drizzle 1 1/2 tablespoons of this dressing over bread and toss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one tablespoon olive oil in a small skillet. Add garlic and scallions, and cook, stirring constantly, over low heat until softened but not colored. Add to bread and fold in. Drain currants and fold in. Add pine nuts and fold in. Drizzle salad with stock or water, and fold in. Taste a couple of pieces of bread. Add a little more vinegar, salt and pepper if necessary. Toss well, and transfer to a 4-cup baking dish. Tent lightly with foil. Do not wash salad bowl. Set salad aside until about 30 minutes before serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Place bread salad in oven, turn off heat, and leave for 15 minutes. Return salad to bowl. Add greens, remaining vinaigrette, and enough of remaining olive oil so bread is not dry. Toss again. Serve with grilled or roasted meat."}], "link": "https://cooking.nytimes.com/recipes/10721-warm-bread-salad"}