{"@context": "http://schema.org", "@type": "Recipe", "name": "Matelote of Monkfish", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "dairy-free, nut-free, main course, monkfish, pearl onions, slab bacon", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 278, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "28 grams", "saturatedFatContent": "3 grams", "sodiumContent": "744 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 ounces tiny pearl onions", "1 1/2 pounds monkfish", "2 tablespoons fine, dry breadcrumbs", "2 ounces slab bacon, diced", "1/2 cup finely chopped red onion", "1 tablespoon minced fresh tarragon", "1 cup dry red wine, or more, to taste", "1/2 cup fish stock", "1 tablespoon tomato paste", "Salt and freshly ground black pepper", "1 tablespoon soft unsalted butter (optional)", "Sprigs of fresh tarragon for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small pot of water to a boil, add the onions and cook for two minutes. Drain the onions and run under cold water. Peel the onions and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the monkfish into slices about three-fourths of an inch thick. Pat them dry on a paper towel and lightly dust them on one side with the breadcrumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select a heavy skillet large enough to hold the monkfish in a single layer. Place the bacon in the skillet and cook the bacon over medium heat, stirring it around, until it is crisp and golden brown. Remove the bacon from the skillet to a bowl, draining as much fat as possible back into the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the bacon fat over medium heat, add the pearl onions and toss them briefly in the bacon fat until they begin to turn golden. Remove them from the skillet and add them to the bowl with the cooked bacon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Then add the monkfish to the skillet crumb-side down and sear the fish on one side only over medium-high heat, until it is browned. Remove the fish from the skillet and set it aside on a platter, covered loosely with a sheet of foil or waxed paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the red onion in the skillet and cook it over low heat until it is soft but not brown. Stir in the tarragon, wine and fish stock. Increase the heat and cook the sauce until it is reduced by half. Stir in the tomato paste and cook a few minutes longer, until the sauce has thickened to the consistency of heavy cream. Season to taste with salt and pepper. The recipe can be prepared to this point up to two hours in advance. It will then require only five minutes further cooking before serving. If you are preparing the recipe in advance, cover the pan and set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, reheat the sauce over medium heat and adjust the seasonings if necessary. You may want to add a tablespoon or two of additional wine to bring up the flavor. If desired, you can enrich the sauce by swirling in the soft butter. Add the bacon and pearl onions to the sauce, along with any juices in the bowl. Then carefully place the slices of monkfish in the skillet in a single layer, browned side up. Cook about five minutes, until the monkfish is just cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the monkfish slices among four warmed dinner plates. Carefully spoon some of the sauce with the pearl onions and bacon around, not over, the fish. Garnish each serving with a sprig of tarragon. Serve with noodles and mushrooms."}], "link": "https://cooking.nytimes.com/recipes/10748-matelote-of-monkfish"}