{"@context": "http://schema.org", "@type": "Recipe", "name": "Biscotti", "description": "These classic Italian cookies get their signature crispness from being twice-baked: First, the dough is cooked in logs, cut into slices, then baked again. Because they travel and keep well, a pile of them makes an excellent gift wrapped in a cellophane bag and tied with a ribbon. Feel free to experiment with add-ins: Sub in hazelnuts or pistachios for the almonds. Add mini chocolate chips or dried cranberries, or a teaspoon of citrus zest. Or take the cookies over the top by drizzling with melted chocolate, glazing with icing or dusting with sprinkles. You do you.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2019/11/26/dining/vanilla-biscotti/vanilla-biscotti-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 24 cookies", "recipeCuisine": "italian", "recipeCategory": "cookies and bars", "keywords": "almond, vanilla bean, dessert, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "78 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 vanilla bean, split in half lengthwise", "3/4 cup granulated sugar", "1/2 cup unsalted butter, at room temperature", "2 eggs", "2 teaspoons vanilla extract", "2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/2 teaspoon fine sea salt", "1 1/4 cups slivered almonds, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Position rack in center of oven. With a small knife, scrape the seeds from the vanilla bean and place in a small bowl. Add the sugar and use your fingers to mix the vanilla evenly into the sugar. Set aside. With an electric mixer, cream the butter until light. Add the vanilla sugar and mix until fluffy. Add the eggs and the vanilla extract and mix until smooth. Stir together the flour, baking powder, salt and almonds and stir into the butter mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper. Divide the dough into 3 pieces. On a lightly floured surface, shape each piece of dough into a log that is about 1 1/4 inches in diameter. Place the logs on the baking sheet, spacing them as far apart as possible. Bake in the center of the oven until lightly browned, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the logs on a cutting board and let them cool slightly. With a serrated knife, cut the logs on the diagonal into 1/2-inch-thick pieces. Place on the baking sheet, cut side down. Bake until lightly browned, about 15 minutes, turning once. Transfer the cookies to a rack to cool. Store in an airtight container."}]}