{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Green Borscht", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "16 servings", "recipeCuisine": "eastern european, russian", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "appetizer, main course, beet, potato, sorrel, gluten-free, nut-free, vegetarian", "aggregateRating": null, "recipeIngredient": ["4 leeks", "2 onions, peeled", "2 carrots, broken into a few pieces", "4 ribs celery", "4 cloves garlic", "6 black peppercorns", "1/2 teaspoon kosher salt", "4 tablespoons butter", "3 large leeks, about 2 1/2 pounds", "4 large potatoes, cut in 1/2-inch dice", "3 golden beets, peeled and cut into 1/4-inch dice (about 3 cups)", "1 pound fresh lima beans, shelled to make 1 cup", "3 zucchini, about 1 pound, quartered lengthwise and cut crosswise in 1/4-inch slices", "2 heads green-leaf lettuce, shredded", "2 cups sorrel", "Greens from 3 beets, chopped", "3/4 cup dill-pickle juice", "1/4 cup fresh dill, minced", "1/4 cup white vinegar", "2 tablespoons kosher salt and freshly ground black pepper to taste", "1 1/2 cups sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the stock, wash the leeks by trimming their ends, slicing them lengthwise in quarters and separating and rinsing each layer under cold water. Put them in a large pot along with the other ingredients, cover with 6 quarts of water and bring to a boil. Reduce the heat and simmer for 2 1/2 hours, until only a 1/2 gallon of liquid remains. Remove from the heat, strain and discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the soup, melt the butter in a large pan. Wash the leeks thoroughly; trim so only the white part remains; julienne and soften them in a large pot over medium-low heat, stirring, about 5 minutes. Stir in the potatoes and cook for 5 minutes. Add the beets and continue to cook, stirring, 5 minutes; then add the lima beans and cook 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the zucchini, lettuce, sorrel and beet greens, cover with the stock and bring to a boil. Reduce heat, add 1/2 cup of the pickle juice and simmer until the potatoes are tender. Add 1/8 cup of the dill and cool in the refrigerator. Before serving, stir in the remaining 1/2 cup of pickle juice, the vinegar, salt, pepper and remaining dill. Serve chilled with a dollop of sour cream in each bowl. (The borscht can be made several days ahead.)"}]}