{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Homestyle Sourdough Baguettes", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT18H", "recipeYield": "Two baguettes", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread flour, sourdough, whole wheat flour, dairy-free, nut-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "recipeIngredient": ["1/2 cup sourdough (<a href=\"http://cooking.nytimes.com/recipes/10803-sourdough\">see recipe</a>)", "1 cup water", "1/2 cup whole-wheat flour", "3 to 3 1/2 cups unbleached bread flour, plus flour for the work surface", "2 teaspoons salt", "Cornmeal for baking sheets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sourdough with the water and allow to sit until the sourdough relaxes and begins to dissolve, about 20 minutes. Beat in the whole-wheat flour and one cup of the bread flour, cover tightly with plastic wrap and allow to rise until very bubbly and light, six to eight hours depending on the warmth of the room."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat in the salt and another cup of flour, again cover and let rise until double in size, five to seven hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a kneading bowl or food processor fitted with a eel blade and knead in the remaining flour, a third of a cup at a time, until the dough is smooth, shiny and elastic. Cover and let rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a baking sheet with cornmeal. Divide the dough in half and roll each half into a thin snake about one-and-a-half inches in diameter. Place the snakes, well separated, on the baking sheet, cover lightly with a dampened tea towel or plastic wrap and allow to rise until double in size, about one to one-and-a-half hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Make several shallow diagonal slashes across the loaves with a razor blade and put the sheet in the oven. Being careful not to get burned by the steam, throw about a quarter cup of water onto the oven floor and shut the oven at once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the bread for 35 to 45 minutes, or until the baguettes are crusty and well browned. Cool on wire racks."}], "link": "https://cooking.nytimes.com/recipes/10802-simple-homestyle-sourdough-baguettes"}