{"@context": "http://schema.org", "@type": "Recipe", "name": "Focaccia With Salt Cod And Potatoes", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H25M", "recipeYield": "4 main-course servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pizza and calzones", "keywords": "main course, nut-free, vegetarian, pizza dough, potato, salted cod", "aggregateRating": null, "recipeIngredient": ["Basic dough (<a href=\"http://cooking.nytimes.com/recipes/10816-basic-dough\">see recipe</a>)", "1/2 pound salt cod, soaked in water for 24 hours, water changed twice", "1 1/2 cups milk", "2 large baking potatoes, peeled and cut into 1-inch cubes", "6 cloves garlic, peeled and minced", "1 teaspoon freshly ground pepper", "2 tablespoons olive oil", "3 tablespoons heavy cream", "2 teaspoons chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough. While it is rising, drain and rinse the salt cod, and cut it into 2-inch pieces. Place in a medium saucepan, and cover with the milk. Bring to a simmer over medium heat, and simmer slowly for 10 minutes. Drain and coarsely chop the cod. Place in a large bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a medium saucepan, and cover with water. Bring to a boil, reduce to a simmer and cook until the potatoes are tender, about 10 minutes. Drain and add the potatoes to the cod. Use the back of a fork to coarsely mash the potatoes into the cod; the mixture should be rough. Gently stir in the garlic and pepper. Fold in the olive oil and then the cream, without making the mixture a smooth puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Mound the salt cod mixture on the rolled crust, leaving a 1/2-inch border around the circumference. Bake until crust is golden brown, about 20 minutes. Sprinkle with parsley, cut into wedges and serve hot."}], "link": "https://cooking.nytimes.com/recipes/10820-focaccia-with-salt-cod-and-potatoes"}