{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Pear-and-Almond Charlotte", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 - 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "almond, pear, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 617, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "106 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "15 grams", "proteinContent": "10 grams", "saturatedFatContent": "7 grams", "sodiumContent": "227 milligrams", "sugarContent": "65 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup sugar, plus more for coating the mold", "6 pounds pears (about 12 large), peeled, cored and cut into 1/2-inch slices", "1 cup almonds, sliced and toasted", "1/4 cup Amaretto liqueur", "3/4 teaspoon cinnamon", "1/2 teaspoon ginger", "6 tablespoons unsalted butter", "12 slices good-quality white sandwich bread, crusts removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, heavy skillet over medium heat and add the sugar. Cook, stirring occasionally with a fork, until the sugar is melted and golden. Immediately add the pears and cook, stirring gently, until the pears are very soft, about 20 to 25 minutes. Remove from the heat and stir in the almonds, liqueur, cinnamon, ginger and 2 tablespoons of the butter. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Melt the remaining 4 tablespoons butter and use a pastry brush to coat the interior of an 8-cup charlotte mold. Dust the bottom and sides with sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack 6 slices of bread and cut the stack in half diagonally with a sharp knife. Cut each half again, diagonally, to make 24 triangles. Dip each triangle in butter and use 12 of them to line the bottom of the mold, narrow ends meeting in the center and each piece overlapping slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the remaining bread slices into strips about 1 1/2 inches wide. Dip each in butter and arrange the strips around the sides of the mold, overlapping them slightly. Pour 1/2 of the pear mixture into the mold and press it down lightly. Lay the remaining 12 triangles on top, and pour the remaining pear mixture into the mold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 20 to 30 minutes. Remove from the oven and allow to stand for 10 minutes. Invert onto a platter. Slice and serve hot with vanilla custard sauce (recipe follows)."}], "link": "https://cooking.nytimes.com/recipes/1083-hot-pear-and-almond-charlotte"}