{"@context": "http://schema.org", "@type": "Recipe", "name": "Fantasy of Eggs", "description": "The best tool for cleanly removing the narrow end of an eggshell is an egg topper, which stamps a perfect circle into the eggshell that you can lift off with the tip of a knife. The only problem is that the best egg toppers, which are different from egg cutters, are an investment -- the Inox professional egg topper is $55 at surlatable.com. If you don't have an egg topper, simply crack the eggs open gently to remove the yolk intact and use small cups instead of the eggshells for serving.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Fantasy-of-Eggs/Fantasy-of-Eggs-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, cognac, eggs, sea-urchin roe, gluten-free, nut-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 276, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "0 grams", "proteinContent": "12 grams", "saturatedFatContent": "13 grams", "sodiumContent": "357 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 eggs, preferably organic", "1 tablespoon butter", "1/2 shallot, minced", "4 ounces sea-urchin roe", "1 tablespoon Cognac", "2 tablespoons tomato juice", "1/2 cup chicken broth", "1 cup cream", "Salt", "Cayenne pepper", "Juice of 1 lime", "2 tablespoons crème fraiche", "About 2 teaspoons caviar (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cutting from the narrow end of the eggs, open the eggshells with an egg topper. Separate the egg yolks from the whites, making sure the yolks stay intact. Reserve the whites for another use. Carefully rinse out the shells and set aside to dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, melt the butter over medium heat. Add the shallot and sweat until translucent. Add the sea-urchin roe and cook for 2 minutes, then pour in the Cognac and, using a long match, carefully light the alcohol and burn it off. Once the flame subsides, add the tomato juice and chicken broth and simmer for 5 minutes. Pour in the cream, bring to a simmer and then let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooled sauce to a blender and, while holding the lid firmly in place, puree it until smooth. Strain and season to taste with salt, cayenne and lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a pot of salted water to 145 degrees. Carefully lower the yolks, one by one, into the water and, moderating the heat, cook for 6 minutes. Remove each with a slotted spoon and set in a shallow dish. Do not let the yolks touch one another."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, froth the sea urchin sauce in the blender or with a hand-held milk frother. Into each eggshell (or small cup), carefully drop a yolk. Place 1 teaspoon creme fraiche on top. Garnish with 1/4 teaspoon or so of caviar and finish with the sea-urchin sauce."}], "link": "https://cooking.nytimes.com/recipes/10845-fantasy-of-eggs"}