{"@context": "http://schema.org", "@type": "Recipe", "name": "Le Bernardin's Salmon-Caviar Croque-Monsieur", "description": "When the stock market is doing well, people with money to spend go out to spend it — thereby serving as unwitting patrons of the culinary arts. In the late '90s, the chef Eric Ripert said, “Everybody was a bit, I think, crazy and inclined to indulge in excess because of the end of the millennium.\" His contribution to the madness was this croque-monsieur layered not with ham and béchamel but with something even more indulgent: smoked salmon, Gruyère and caviar on brioche. Make it home, and don't look at the grocery bill. It is in service of luxurious flavor.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/06/04/dining/Salmon-Caviar/Salmon-Caviar-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 2 to 4", "recipeCuisine": "french", "recipeCategory": "dinner, easy, lunch, quick, weekday", "keywords": "appetizer, main course, gruyère, smoked salmon, sturgeon caviar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "recipeIngredient": ["4 slices fine-textured brioche or white bread, crusts removed", "About 1 1/2 ounces Swiss Gruyère cheese, sliced paper thin", "1 ounce fresh or pasteurized sturgeon caviar", "2 to 4 slices smoked Atlantic ++or Norwegian salmon", "2 tablespoons clarified butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the bread on a work surface. Cover two of the slices with cheese in a single layer. Spread a layer of caviar on the cheese, not quite to the edges. Cover with a slice of smoked salmon, trimmed to fit exactly to the edge of the bread. Top each sandwich with the remaining bread slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the butter in a nonstick skillet over medium heat. Lay the sandwiches in the skillet and cook, pressing down gently with a spatula, taking care that none of the caviar oozes out, until browned on one side. Add the remaining butter, turn the sandwiches over and fry on the second side until toasted. Transfer the sandwiches to a cutting board, slice each in quarters and serve."}], "link": "https://cooking.nytimes.com/recipes/10844-le-bernardins-salmon-caviar-croque-monsieur"}