{"@context": "http://schema.org", "@type": "Recipe", "name": "Fluke Crudo With Lime, Sea Salt and Olive Oil", "description": "Dave Pasternack, the chef at Esca in New York, has a few tips for preparing crudo. Tell your fishmonger that the fish you’re buying is to be served raw. You want fresh-filleted fish, not something that is already cut. Then, once you have your fillet, take it home, chill it and then slice it. When you are ready to serve it, get ready for the easiest recipe on earth. Sprinkle the fish with lime juice, coarse sea salt and the best olive oil you can find. That’s it. You have a sophisticated plate of food that took you no time at all. Pair the dish with a chilled Sancerre and see if you don’t relish in your good fortune.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT10M", "recipeYield": "4 appetizer servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, weekday", "keywords": "appetizer, main course, dairy-free, gluten-free, nut-free, vegetarian, fluke, lime", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 104, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "14 grams", "saturatedFatContent": "1 gram", "sodiumContent": "336 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound fresh fluke fillet, skinned and chilled", "1 to 2 limes", "Coarse sea salt", "Extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the fillet in half lengthwise at its natural seam. Then slice the fillet horizontally from end to end at an angle like lox. The slices should be about 1/8-inch thick and 2 inches wide. Divide among 4 small plates. Cover and chill for at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, juice the lime over the fish; be generous. Season with sea salt and sprinkle with olive oil. Serve."}], "link": "https://cooking.nytimes.com/recipes/10852-fluke-crudo-with-lime-sea-salt-and-olive-oil"}