{"@context": "http://schema.org", "@type": "Recipe", "name": "Scrambled Eggs With Bay Scallops And Bacon", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner", "keywords": "bacon, bay scallops, eggs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1037, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "72 grams", "fiberContent": "2 grams", "proteinContent": "50 grams", "saturatedFatContent": "32 grams", "sodiumContent": "1373 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 slices of lean bacon", "6 fresh large eggs", "4 tablespoons butter", "Salt and freshly ground white pepper", "2 tablespoons heavy cream or half-and-half or milk according to your conscience", "Chopped fresh Italian parsley, tarragon or chives to taste", "8 ounces very fresh bay scallops", "4 slices brioche, lightly toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil or fry the bacon over medium heat so that when the slices are done they lie flat. Drain on paper-towel-covered plate and set aside in a warm oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into a colander, over the top of a double boiler or heat-safe bowl and beat gently using a whisk or a wooden spoon to push the eggs through. Add one tablespoon of butter and the salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the eggs in the double boiler or place bowl over pan of simmering water over medium heat, whisking constantly, taking care to scrape the sides of the pot where the eggs will first coagulate. When the eggs begin to thicken, add the cream, half-and-half or milk. You may add a raw egg yolk at this time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove eggs from the heat when they have formed small, bright yellow curds. You may add some flat parsley, freshly snipped tarragon or chives to the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile pat the scallops dry with a paper towel and melt the remaining butter over medium-high heat in a 10-inch nonstick pan. When the butter bubbles but before it darkens and begins to smoke, add the scallops in one layer. Cook until they turn brown, about 3 minutes. Turn and cook until browned on all sides, about 2 more minutes. Remove scallops with a slotted spoon and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, pile the eggs at one end of a warmed oval platter and the scallops at the other. Separate the eggs and scallops with a bacon fence."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with toasted brioche and chilled prosecco."}]}