{"@context": "http://schema.org", "@type": "Recipe", "name": "Par-Cooked Lobsters", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "lobster, white vinegar, main course", "aggregateRating": null, "recipeIngredient": ["3 1 1/2- to 2-pound live lobsters", "White vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lobsters in a container with tight-fitting lid. Cover with cold water, remove lobsters and measure water. Pour water into another large pot, and add 1 tablespoon vinegar for every quart of water. Boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return lobsters to lidded container. Pour the hot water over them, cover and steep 2 minutes for 1 1/2-pound lobsters, 3 minutes for 2-pound lobsters. Remove lobsters. Reserve water in container."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull off lobster claws and knuckles, and return to hot water for 5 minutes. Twist off tails, and discard bodies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Snip through bottom sides of tail shells with shears. Remove meat. Discard shells. Cut tail meat in half lengthwise. Remove vein running through top of meat. Place meat on a platter lined with paper towel, cover with plastic wrap and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove claws from hot water. Twist off knuckles, and reserve. Hold claw, pull down on small pincer and pull it off. Use heavy shears to snip shell at knuckle end enough to open it; remove meat in one piece. Add to platter with tail meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use shears to snip through the knuckle shell, pry open and remove meat. Add to the platter."}], "link": "https://cooking.nytimes.com/recipes/10915-par-cooked-lobsters"}