{"@context": "http://schema.org", "@type": "Recipe", "name": "Asparagus Three Ways: Raw, Cooked, Puréed", "description": "", "author": {"@type": "Person", "name": "Alain Ducasse"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, asparagus, eggs, white wine vinegar, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 193, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "615 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds asparagus, medium thickness", "Salt", "1/2 tablespoon butter", "1 whole egg", "2 egg yolks", "Freshly ground black pepper", "1 tablespoon white wine vinegar", "3 tablespoons extra virgin olive oil", "2 tablespoons crushed black truffles or 1 tablespoon black olive paste or 1 tablespoon genuine balsamic vinegar at least 50 years old"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Snap off ends of asparagus stalks where they break naturally. Discard ends. Peel asparagus. Select 16 of the most uniform and thickest spears and set aside. Cut remaining stalks in half, place in a saucepan of well-salted water and simmer until very tender, about 5 minutes. Drain, and pur&#233;e in food processor or blender. You should have about 1 1/4 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Lightly butter 4 small round ovenproof containers, preferably 3- to 4-ounce size. Porcelain ramekins or custard cups, heatproof glass bowls or tiny nonstick muffin or dariole molds can be used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 2/3 cup pur&#233;e with egg and egg yolks. Season to taste with salt and pepper. Transfer to buttered molds. Place molds in a baking dish, and add simmering water to come halfway up sides of molds. Bake 45 minutes or until custards are set and surface is fairly firm to the touch. Remove from oven, leaving molds in water bath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While custards bake, cut a 2-inch-long piece from the tip of each reserved asparagus stalk. Cut each tip piece in half lengthwise, place in a saucepan of salted water, bring to a simmer and cook until just tender, about 2 minutes. Drain, and set aside on absorbent paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a vegetable peeler, shave 4 or 5 ribbons lengthwise from remaining pieces of stalk, leaving center portion intact. Place ribbons in a bowl of ice water. Mince centers no larger than peppercorns. Fold minced asparagus into remaining pur&#233;e, and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat vinegar and oil together but not enough to emulsify completely. Season to taste with salt and pepper. Add truffles, olive paste or balsamic vinegar, and stir lightly to combine but not blend thoroughly. Vinaigrette should remain somewhat broken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon asparagus pur&#233;e with minced raw asparagus in a circle in center of each of 4 large salad plates. Unmold custards on top of pur&#233;e. Surround each with 8 cooked halved asparagus tips, cut side down, like spokes of a wheel. Drain raw asparagus ribbons and pat dry. Scatter over cooked tips, and pose one that's nicely curled on each custard. Drizzle vinaigrette on plate around asparagus."}], "link": "https://cooking.nytimes.com/recipes/10913-asparagus-three-ways-raw-cooked-pureed"}