{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Corn Soup With Honeydew Polka Dots", "description": "", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": null, "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, corn on the cob, honeydew, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 286, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "554 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 medium to large ears corn, shucked", "2 cups homemade chicken broth or 1 17-ounce can chicken broth with 1/4 cup filtered water", "2 cups filtered water (if using canned broth, substitute milk for water)", "1 teaspoon salt ( 3/4 teaspoon if using canned broth and milk)", "1/8 teaspoon cayenne pepper", "1 ripe honeydew melon", "1 to 1 1/2 cups buttermilk (or more)", "2 teaspoons minced chervil or 1 teaspoon minced basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate kernels from 4 ears corn into a large bowl, using coarse side of grater (there should be 1 cup grated corn, including juices); discard cobs. Using paring knife, cut kernels from remaining 6 ears (there should be 3 cups); set aside. Break 4 cobs in half, and combine with grated corn, chicken broth and water in 1 1/2 gallon stockpot; discard 2 remaining cobs. Bring to simmer, and cook, covered, for 10 minutes, stirring occasionally. Remove cobs from broth with tongs, and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour mixture into blender, and pur&#233;e until completely smooth. Return to pot. Stir in whole kernels, bring to a simmer, and cook until corn is crisp-tender, about 5 minutes. Transfer soup to bowl (not plastic). Stir in salt and cayenne. Cover, and refrigerate, or stir over ice water bath at room temperature until very cold (about 5 hours in refrigerator, 1 hour over ice)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve and seed melon. With melon baller, make tiny balls (there should be about 1 1/4 cups) or cut melon into dice. Cover melon balls and chill over ice until ready to use (up to 1 hour before serving)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, stir buttermilk into soup. Taste, and adjust seasoning. Toss melon balls with chervil or basil, and sprinkle with salt. Divide melon balls among 6 chilled shallow bowls. Pour cold soup around melon."}], "link": "https://cooking.nytimes.com/recipes/10935-chilled-corn-soup-with-honeydew-polka-dots"}