{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Noodles With Sesame Sauce, Chicken And Cucumbers", "description": "It doesn't surprise me how often people order cold noodles with sesame sauce at Chinese restaurants. What is surprising, though, is how few people make the dish at home. It is incredibly easy to prepare, with common ingredients, and you can serve it as a main course or appetizer.\n\nYou don't even need sesame sauce. Peanut butter is an acceptable substitute, as long as you use good peanut butter, simply defined as that made with peanuts and salt. (The name brands contain about 10 percent added hydrogenated fat, plus a couple of other typical additives.) Creamy is more common, but chunky is also good.\n\nIt's easy enough to buy sesame paste (tahini) at health-food stores specializing in Middle Eastern ingredients and even at supermarkets. Sesame oil, which contributes mightily to the flavor of the finished dish, is a staple sold in Asian food stores (and, increasingly, in supermarkets).", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/02/28/dining/28COOKING-COLDNOODLES-CHIX-CUKES2/28COOKING-COLDNOODLES-CHIX-CUKES2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick, noodles", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 715}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 672, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "6 grams", "sodiumContent": "736 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "1 to 2 cups shredded cooked chicken or about 8 ounces boneless chicken breast", "1 pound cucumber", "12 ounces long pasta like linguine, or 16 ounces fresh Chinese egg noodles", "2 tablespoons dark sesame oil", "1/2 cup sesame paste (tahini) or peanut butter", "2 tablespoons sugar", "3 tablespoons soy sauce, or to taste", "1 teaspoon minced ginger, optional", "1 tablespoon rice or wine vinegar", "Hot sesame oil or Tabasco sauce to taste", "1/2 teaspoon freshly ground black pepper, or more", "At least 1/2 cup minced scallions for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot of water to boil and salt it. If your chicken is uncooked, poach it in water as it comes to a boil; it will cook in about 10 minutes. Meanwhile, peel cucumbers, cut them in half, and, using a spoon, scoop out seeds. Cut cucumber into shreds and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water comes to a boil, cook pasta until tender but not mushy. (If chicken is not done, you can still add pasta; remove chicken when it is done.) While pasta is cooking, whisk together sesame oil and paste, sugar, soy, ginger, vinegar, hot oil and pepper in a large bowl. Thin sauce with hot water, so that it is about the consistency of heavy cream; you will need 1/4 to 1/2 cup. Stir in cucumber. When pasta is done, drain it and run pasta (and chicken, if necessary) under cold water. Drain. Shred chicken (the easiest way to do this is with your fingers)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss noodles and chicken with sauce and cucumbers. Taste and adjust seasoning as necessary (the dish may need salt), then garnish and serve."}], "link": "https://cooking.nytimes.com/recipes/10945-cold-noodles-with-sesame-sauce-chicken-and-cucumbers"}