{"@context": "http://schema.org", "@type": "Recipe", "name": "Old-Fashioned Clam Chowder", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, clams, seafood, gluten-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "7 grams", "sodiumContent": "620 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 to 3 pounds soft-shell or steamer clams (30 to 40 clams) in the shell", "1 cup salt mixed with 12 cups cold water", "", "2 ounces salt pork, pancetta or blanched bacon (see note), diced", "3 tablespoons unsalted butter", "2 medium yellow onions, halved and thinly sliced", "2 or 3 medium potatoes, peeled and cubed (about 2 1/2 cups)", "Freshly ground black pepper to taste", "2 bay leaves", "2 cups whole milk", "1/2 cup evaporated milk or light cream", "Salt to taste", "1/4 cup chopped fresh chives or flat-leaf parsley", "Common crackers, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over clams, discarding any with cracked shells or that feel heavy, an indication they are full of mud. Rinse them under cold running water to get rid of surface grit. If clams are very gritty, set them in a bowl with brine solution and keep cool, or refrigerate for 2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain clams, and place in a large, heavy soup kettle; add about 1/2 inch water to kettle, and set over medium heat. Cook, uncovered, stirring frequently with a wooden spoon, until all clams have opened. As they open, remove them from kettle and set aside. (Any clams that fail to open after 10 to 15 minutes should be discarded.) Strain clam liquor through several layers of cheesecloth into a 2-cup measuring cup, and set aside. Remove clams from shells, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse out soup kettle and return to stove top. Add salt pork, pancetta or bacon dice and 1 tablespoon butter, and cook slowly over medium-low heat until dice brown a little on edges. Use a slotted spoon to remove dice from fat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions to fat and cook, stirring frequently, until soft but not brown. Stir in potatoes, and continue cooking another 5 minutes, until potatoes begin to soften. Add enough water to clam liquor in measuring cup to make 2 cups; pour this over potatoes. Add black pepper and bay leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer gently, partially covered, until potatoes are tender. Add whole milk and simmer again. Stir in clams and evaporated milk or cream, stirring gently so as not to break open clam bellies. Taste, and add salt if necessary. Let come just to a simmer, and remove from heat. (Do not let chowder come to a full boil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chowder can be set in a cool place for several hours to develop flavors. Reheat to a simmer (do not let boil), then stir in chives or parsley and remaining butter just before serving. Pass common crackers at the table if you wish."}]}