{"@context": "http://schema.org", "@type": "Recipe", "name": "Alfredo Viazzi's Quails Hunter Style", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "main course, quail", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 737, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "2 grams", "proteinContent": "44 grams", "saturatedFatContent": "14 grams", "sodiumContent": "673 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup crustless bread chunks or 4 slices white bread, trimmed of crusts", "1/2 cup plus 2 tablespoons extra virgin olive oil", "1 1/2 teaspoons finely chopped garlic", "4 juniper berries, crushed", "Coarse salt", "3 to 4 fresh sage leaves", "2 tablespoons brandy", "1 dozen fresh quails, cleaned", "3 tablespoons butter", "1 tablespoon rosemary leaves", "8 pieces imported dried porcini, presoaked in lukewarm water 1 1/2 hours in advance, and 2 tablespoons soaking water reserved", "1/2 cup Barolo wine, or other robust dry red", "1 teaspoon Balsamic vinegar", "Freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak bread in 1/2 cup olive oil in a mixing bowl; work the oil well into the bread. Add garlic, juniper berries, salt to taste and sage leaves. Knead all ingredients into the bread. Add the brandy and mix well. Divide the mixture into 12 parts, and stuff each quail with one part. Cover the quails with a towel and leave out at room temperature for five hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the stuffing out of quails and set the quails aside. Melt the butter in a saucepan over medium flame. Break up the bread stuffing into the butter. Cook for 5 minutes. Add the rosemary and porcini to the pan. Lower the flame and simmer, stirring with a wooden spoon. Add the porcini water and keep simmering. Add the wine and let evaporate for 8 minutes. Mix well and remove from fire. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Split the quails down from the breast side, leaving them attached by the backbone. Rub the quails with a mixture of the remaining 2 tablespoons olive oil, vinegar, and salt and freshly ground pepper to taste. Heat a cast iron skillet or a griddle to very hot. Lay the birds on the griddle, open side down. Place a heavy object over them to press them down flat. Add some extra oil if necessary and cook 10 minutes. Turn the quail on their backs, replace the heavy object over them and cook another 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the sauce, stirring and tasting for seasoning. Arrange the quails on a serving platter and spoon the sauce over them. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/10968-alfredo-viazzis-quails-hunter-style"}