{"@context": "http://schema.org", "@type": "Recipe", "name": "Pino Luongo's Squab Salmi Style", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "gluten-free, main course, squab", "aggregateRating": null, "recipeIngredient": ["4 squab", "Coarse salt and freshly ground pepper to taste", "4 livers from the squab (or substitute chicken livers)", "Dry red wine to cover (about 3 cups)", "2 tablespoons juniper berries", "1 large red onion", "1 carrot, finely chopped", "1 stalk celery, finely chopped", "2 tablespoons unsalted butter", "1 tablespoon fresh sage leaves", "1 1/2 cups Gaeta or Nicoise olives, pitted and chopped", "8 whole olives", "4 tablespoons olive oil", "Chicken broth to cover"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the squab, season with salt and pepper and place in a non-corrosive bowl. If they have their livers, leave them inside the birds. Add the red wine to cover, juniper berries, half the red onion, chopped fine, carrot and celery. If using chicken livers, add them to the marinade. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day chop the livers and sautee them in butter with the sage over high heat until brown. Mix in the chopped olives and stuff this mixture into the cavities of the squab. Sew the birds closed and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Slice the remaining half red onion and sautee it in olive oil in a roasting pan over medium heat until soft. Add the stuffed squab to the pan and cook slowly, turning, until they absorb the taste of the olive oil and onion, about three to four minutes. Drain the vegetables from the marinade and reserve the wine. Cover the birds with roughly equal amounts of red wine and broth and add some whole olives. Cover loosely with foil and roast in the oven. Start to check for doneness after about 10 minutes by piercing the birds with a fork. When the juices run clear, the squab is done."}]}