{"@context": "http://schema.org", "@type": "Recipe", "name": "Sour Cherry Tart", "description": "Gloria Zimmerman picks well-ripened sour cherries from the cherry tree in a friend's yard each summer, pits them and freezes them. Although this tart can be made with sweet cherries, it is better made with sour cherries. The pate brisee recipe is very rich and must be handled with care to make it conform to the tart mold. The unglazed tart should not be refrigerated; it should be served while still lukewarm - difficult to do in a restaurant - with strong coffee.", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "One 11-inch tart", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cherries, sour cherry, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 49}, "recipeIngredient": ["About 3/4 cup flour (4 ounces)", "1/2 teaspoon sugar", "1/8 teaspoon salt", "3/4 stick (3 ounces) cold unsalted butter, cut into 1/2-inch pieces", "3 tablespoons ice-cold water", "1 1/4 pounds sour cherries, pitted", "2 tablespoons minute tapioca", "3/4 cup sugar", "1/4 teaspoon almond extract", "1/4 cup almonds ground in a food processor with 1 tablespoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pate brisee, place the flour, sugar, salt and butter pieces in owl and crush the butter into the dry ingredients with the tips of your fingers until combined somewhat but with pieces of butter still visible in the mixture. Add the ice water and stir with a fork just until the mixture holds together. Gather it up, pressing it between your hands to flatten it and make it round, and wrap it in plastic wrap. Refrigerate for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub a small amount of flour into a pastry cloth and roll the dough into a very thin circle, about 12 1/2 inches in diameter. Roll the dough onto the rolling pin and gently fit it into the bottom and up the sides of an 11-inch tart pan with a removable bottom. Press the dough against the sides of the pan to fill in any holes and make it adhere to the metal. Remove any excess overhanging dough by rolling the rolling pin across the top of the pan. Refrigerate the tart shell for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a bowl combine the cherries, tapioca, sugar and almond extract. Sprinkle the ground almond-sugar mixture in the pastry shell and arrange the cherry mixture on top. Place the tart pan on a cookie sheet and bake in a 400-degree oven for one to one-and-a-quarter hours, until the dough is nicely browned. Unmold and serve with strong coffee."}], "link": "https://cooking.nytimes.com/recipes/10988-sour-cherry-tart"}