{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Beans And Greens Cooked In The Fireplace", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H", "recipeYield": "Six to eight servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "beans, greens, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 122, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "660 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra-virgin olive oil", "1 large onion, peeled and diced", "2 ounces pancetta, finely chopped, optional", "6 to 8 cloves garlic, peeled and chopped", "3/4 pound cooking greens (mustard, collard, Swiss chard, kale, etc.)", "2 teaspoons salt, plus more to taste", "Freshly ground black pepper to taste", "2 tablespoons balsamic vinegar, plus more to taste", "2 cups coarsely chopped, drained, canned plum tomatoes", "2 cups dried cannellini or flageolet beans, soaked overnight in 1 gallon cold water", "4 to 6 cups chicken broth, fresh or low-sodium canned", "2 teaspoons chopped fresh thyme, or 1/2 teaspoon dried", "1 bay leaf", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a gentle oak fire in the fireplace, or preheat the oven to 400 degrees. Allow the fire to burn so that coals develop. If no hanging cauldron is available, use a fireplace grill or a brick structure that allows the pot to stand well above the fire. There should be very little flame when it comes time to cook the beans, and the pot should be at least 8 inches above the coals."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet on the stove, warm the olive oil over medium heat. Saute the onion (and pancetta) until the onion is golden, about 15 minutes. Remove from the heat. Stir in the chopped garlic. Remove half of this mixture from the skillet and place in a round- bottomed cauldron or a flat-bottomed casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the skillet with the remaining onion mixture over medium heat. Add half of the greens and cook, turning them constantly with a pair of tongs until wilted, about 4 minutes. About 1 minute before the greens are done, stir in 1/2 teaspoon salt, pepper to taste and 1 tablespoon of the vinegar. When the greens are wilted, remove from the pan and set aside. Place the remaining greens in the same skillet and cook, stirring and seasoning as above. Let cool and chop all the greens coarsely. Add the tomatoes and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans. Add them to the cauldron or casserole. Add chicken broth to cover the beans by 3/4 of an inch. Add the thyme and bay leaf. Lightly season with 1 teaspoon salt and pepper. Seal aluminum foil around three-quarters of the rim of the pot and leave it loose over the other quarter, letting it overhang the edge by 3 to 4 inches, forming a tunnel that traps the smoke rising from the fire. Place over the fire or in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for 45 minutes, making sure the broth simmers gently and that the liquid does not completely evaporate. During this time, add chicken broth if necessary to keep the mixture quite moist. Lift the foil up and stir in the greens. Continue cooking until the beans are soft and creamy, about 1 to 1 1/2 hours. Remove from the heat, stir in the parsley and season to taste with salt, pepper and balsamic vinegar. Remove the bay leaf. This dish is best when cooked at least 30 minutes before serving and can be made the day before."}]}