{"@context": "http://schema.org", "@type": "Recipe", "name": "Glazed Poppy Seed Tea Cake", "description": "", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": null, "totalTime": "PT40M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dessert, poppy seed", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 289, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "122 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon flour; more for flouring pan", "1/2 cup sliced blanched almonds", "1 cup blue poppy seeds", "1/4 teaspoon salt", "3/4 teaspoon ground cinnamon", "1/2 teaspoon ground allspice", "2 teaspoons finely grated lemon peel", "6 tablespoons unsalted butter, softened; more for greasing pan", "1/4 cup sugar", "4 eggs, separated", "1/4 cup milk", "2 tablespoons milk", "1 1/4 cups powdered sugar", "Pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oven rack in middle position; heat oven to 300 degrees. Grease and flour one 8-inch round cake pan. Spoon flour and almonds into clean spice grinder, and process to fine meal. Transfer to medium bowl. Spoon a third of the poppy seeds into grinder, and process to break them open, adding them to almonds and flour. Repeat with remaining poppy seeds. Fluff, and separate clumps. Stir salt, cinnamon, allspice and lemon peel into ground mixture. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In bowl of mixer with paddle attachment, beat butter on medium speed until light and fluffy, about 40 seconds. Scrape down bowl, add 3 tablespoons sugar and beat until smooth and light, 2 minutes. Add egg yolks one by one, beating well after each addition. Scrape down mixture with rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With machine on low speed, add poppy seed mixture in three equal parts and milk in two, starting and ending with poppy seed mixture. Scrape down batter with rubber spatula, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, beat 2 egg whites on medium speed with whisk attachment until foamy. (Save remaining whites for another use.) With machine running, add 1 teaspoon sugar; continue beating until soft peaks form, sprinkle in 2 remaining teaspoons sugar and beat until peaks are shiny and supple."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir a fourth of the egg whites into cake batter with rubber spatula. Fold in remaining whites, and turn batter into cake pan, smoothing top. Bake until cake is light brown on surface and tests clean with toothpick, 35 to 40 minutes. Remove cake from oven, cool in pan on wire rack 5 minutes, turn out of pan onto rack and cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine ingredients for glaze in small bowl, and whisk until smooth. Pour glaze all at once on surface of cooled cake, and smooth with small spatula. Let glaze become firm, slice cake and serve."}], "link": "https://cooking.nytimes.com/recipes/10997-glazed-poppy-seed-tea-cake"}