{"@context": "http://schema.org", "@type": "Recipe", "name": "Prune-Stuffed Gnocchi With Vin Santo Glaze", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "main course, potato, prune", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 498, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "11 grams", "sodiumContent": "516 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["20 pitted prunes", "2 cups vin santo or Madeira", "4 ounces foie gras, veins removed", "4 ounces butter, in pieces", "1 1/2 pounds Idaho (high-starch) potatoes", "2 cups flour, approximately", "1 egg", "1/8 teaspoon grated nutmeg", "Salt and pepper to taste", "1 big shallot, roughly chopped", "10 sprigs thyme", "12 peppercorns", "12 coriander seeds", "1/4 cup cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate prunes in wine for at least 3 hours, or up to 24 hours. Meanwhile, combine foie gras and butter with a wooden spoon; wrap in plastic and refrigerate until firm. Boil potatoes, skins on, in water to cover until very soft; cool just until you can handle them, then peel and rice or mash; refrigerate until cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put potatoes in a bowl, along with about half the flour, the egg and nutmeg; mix until just combined. Season with salt and pepper. Add enough flour to make a delicate but only slightly sticky dough. Transfer half the dough to a lightly floured work surface; roll out a sheet about 1/8-inch thick. Use a cookie cutter to make 3-inch circles; repeat rolling and cutting with remaining dough until you have about 40 circles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain prunes and reserve wine; cut prunes in half. Put a piece of prune in middle of each dough circle, then fold over and seal. Lay each package on a floured surface while you make sauce. (Packages can be refrigerated for a couple hours, or frozen for several days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 20 to 30 minutes before you're ready to eat, bring a large pot of water to a boil and salt it. Put wine in a small saucepan along with shallot, thyme, peppercorns and coriander. Over high heat, reduce mixture to about 1/4 cup, a thick glaze. Add cream, and cook until it reduces slightly, 3 to 5 minutes. Lower heat and use a wooden spoon to beat in a little of the foie gras-butter; as it melts, add a bit more. When it's all incorporated, put sauce through a strainer to remove herbs and any remaining foie gras veins; keep warm but not hot or it will break. (If it threatens to break, beat in a bit of hot water and it will become smooth again.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop pasta a few at a time in boiling water; they're done when they rise to the top, about 2 minutes later. Drain and keep warm until they're all cooked. Serve with sauce spooned over."}], "link": "https://cooking.nytimes.com/recipes/10991-prune-stuffed-gnocchi-with-vin-santo-glaze"}