{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Tenderloin Niçoise", "description": "It is human nature to want to spend money on food for an important occasion. It is not necessary, but we still do it. And every now and again, that feels good. A beautiful fillet or tenderloin of beef is something special: Even those who do not cook know that. The joy is that these cuts are simple to prepare, needing nothing except to be roasted, rested and sliced. The accompanying vegetables are not served in great heaping bowls on the table, but are chopped and added as an abundant garnish to the welcoming platter of meat. I have called this style niçoise because the components – potatoes, tomatoes, olives and beans – take their inspiration from that traditional stalwart, the salade niçoise.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2017/05/16/dining/16COOKING-BEEF-NICOISE1/16COOKING-BEEF-NICOISE1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "lunch", "keywords": "beef tenderloin, haricot vert, potato, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 136}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 756, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "3 grams", "proteinContent": "51 grams", "saturatedFatContent": "19 grams", "sodiumContent": "891 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 beef tenderloin, about 4 1/2 pounds", "1 to 2 tablespoons vegetable oil", "Sea salt", "8 egg-size new potatoes, peeled", "Extra virgin olive oil", "1/2 cup haricots verts or other fine green beans, in 1-inch lengths", "3 ripe plum tomatoes", "Pinch of sugar", "Freshly ground black pepper", "1/4 cup pitted black olives, halved", "1/4 cup basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Generously season the beef with salt and pepper. Place beef in a roasting pan, and rub it with vegetable oil. Roast for 30 minutes, then reduce heat to 325 degrees. Roast until internal temperature reaches 125 degrees (for rare) or 140 degrees (for medium rare), about 30 to 50 minutes depending on thickness of roast. While beef roasts, prepare vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pan of salted water to a boil, and add potatoes. Cook until tender, about 30 minutes. Drain, allow to cool slightly, and cut into 1/4-inch dice. Place in a bowl, and toss with a small amount of olive oil. Season with salt to taste, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring another pan of salted water to a boil, and add green beans. Cook until bright green and barely tender. Drain immediately, and plunge into a bowl of cold water, then drain again. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pan of water to a boil, and remove from heat. Add tomatoes, and allow to sit for several minutes, until skins split. Remove tomatoes with a slotted spoon. Peel and halve them, discarding seeds. Cut tomato pulp into 1/4-inch dice, and sprinkle with a little salt and sugar. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When beef is cooked to taste, remove from oven, and sprinkle with salt and pepper. Allow to rest for a few minutes, then carve into thin slices, reserving any juices. Arrange on a platter, and drizzle with juices. Toss beans and diced potatoes together, and scatter around beef. Scatter tomato dice over beef, and sprinkle with olives. Strew with basil leaves, and serve."}]}