{"@context": "http://schema.org", "@type": "Recipe", "name": "Intense Chocolate Mousse Cake", "description": "There is very little that needs to be said about a chocolate mousse cake. This one lives up to its name. It is gloriously intense. But the whisked egg whites ensure that it has a balancing lightness. A slice of it, with a smattering of fresh raspberries and a dollop of cream, or better still, sour cream, is the perfect finale. It may also invite a certain inelegant gluttony at the end. I have noticed that even those who claim not to go in for desserts come back for more. The confectioners' sugar is optional, of course, and may be excluded for Passover.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2015/10/26/dining/26COOKING-FLOURLESSCHOCCAKE1/26COOKING-FLOURLESSCHOCCAKE1-articleLarge.jpg", "totalTime": "PT1H5M", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "brandy, chocolate, dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1177}, "recipeIngredient": ["10 ounces bittersweet chocolate", "9 tablespoons unsalted butter", "6 large eggs, room temperature and separated", "Pinch of salt", "3/4 cup sugar", "2 tablespoons brandy", "1 teaspoon confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Position the oven rack in lower center of the oven. Cover the outside of a 9-inch springform pan with a double layer of foil. Using a microwave oven or double boiler, melt together chocolate and butter; set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk together egg yolks and 1/2 cup sugar until pale, frothy and increased in volume. Whisk in brandy, then fold in chocolate mixture. Place a kettle of water over heat, and bring it to a boil. Using an electric mixer, whisk egg whites and salt until thick. Add remaining 1/4 cup sugar, and continue to whisk until stiff and shiny but not dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold about 1/2 cup whisked egg whites into the chocolate mixture to lighten it. Gently fold in remaining whites, being careful not to let the mixture deflate. Pour mixture into lightly-buttered springform pan, and place pan in a roasting pan. Add boiling water to roasting pan to come halfway up side of springform pan. Bake for 45 minutes; top of cake will be hard and inside will be gooey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cake pan from water, and place on a rack to cool completely. Unwrap foil and remove side of springform pan. Place cake on a serving platter. Just before serving, dust top with confectioners' sugar passed through a sieve."}], "link": "https://cooking.nytimes.com/recipes/11001-intense-chocolate-mousse-cake"}