{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Anchovies and Arugula", "description": "The original version of this recipe, which I wrote in 2000 to accompany a column about the many wonders of anchovies, is one of the rare Minimalist recipes I wasn’t entirely happy with when I re-examined it. The problem was the proportions of the ingredients. My thinking about pasta dishes has evolved, and the more-sauce-less-pasta approach that’s emerged is one that’s pretty brilliant, if I do say so myself. So, it was a bit of a shock to look back at my original recipe and find that, for four people, I called for a full pound of pasta but only two cups of arugula. The resulting dish is delicious, thanks to garlic and anchovies, but uniformly starchy and a bit lacking in textural and flavor contrast. You can barely even taste the arugula when there’s only a half-cup in each serving. So I decided to do a little tweaking. My new version contains almost equal parts cooked pasta and raw arugula. Thanks to the increase in greenery, Pasta With Anchovies and Arugula 2.0 is lighter and more interesting than the original, though no less satisfying.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/08/dining/anchovy/anchovy-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, quick", "keywords": "dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 320}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 362, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "306 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["Salt and fresh-ground black pepper", "4 tablespoons extra virgin olive oil", "4 large cloves garlic, peeled and slivered", "8 anchovy fillets, or more to taste, with some of their oil", "1/2 pound linguine or other long pasta", "6 cups arugula, washed, dried and chopped", "1/2 teaspoon or more crushed red pepper flake"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot of water to a boil, and salt it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put half of the olive oil in a deep skillet, and turn the heat to medium. A minute later, add the garlic and the anchovies. When the garlic sizzles and the anchovies break up, turn the heat to its lowest setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta until it is tender but not mushy. Reserve 1 cup of the cooking liquid, and drain. Add pasta and arugula to skillet, along with enough of the reserved cooking water to make a sauce. Turn heat to medium, and stir for a minute. Add salt and pepper to taste, plus a pinch or more of red pepper flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn pasta and sauce into a bowl, toss with remaining olive oil and serve."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pasta With Anchovies and Arugula", "description": "Mark Bittman more than triples the greens in a punchy pasta recipe from the Minimalist archives.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/08/dining/anchovy/anchovy-mediumThreeByTwo440.jpg", "uploadDate": "2011-07-29T19:46:06.000Z", "duration": "PT4M52S"}, "link": "https://cooking.nytimes.com/recipes/11005-pasta-with-anchovies-and-arugula"}