{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Raisin Cookies", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "40 - 48 cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "cocoa, raisins", "aggregateRating": null, "recipeIngredient": ["1 apron", "1 large mixing bowl", "1 set of measuring cups", "1 set of measuring spoons", "1 sifter", "1 wooden spoon", "2 teaspoons", "1 cookie sheet", "1 spatula", "2 potholders", "1 wire cooling rack", "aluminum foil", "1 stick of butter, plus 1 or 2 teaspoons for greasing the cookie sheet", "1 cup sugar", "2 eggs", "1 cups all-purpose flour", "2/3 cup cocoa", "2 teaspoons baking powder", "1/2 teaspoon salt", "1 cup raisins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a stick of butter out of the refrigerator, open the wrapping and leave the butter on the kitchen counter until it gets pretty soft - allow at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the butter is soft, wash your hands and put on an apron."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the butter in the bowl, and beat it with the wooden spoon until it gets creamy. Beat in the sugar until it is thoroughly mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack open both eggs, and put them into the bowl that has the butter and sugar in it. Be careful not to get any bits of eggshell in the bowl. Beat the eggs with the butter and sugar until they are all mixed in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the sifter, and put these ingredients into it: the flour, the cocoa, the baking powder and the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift them into the bowl with the butter, sugar and eggs. Slowly mix everything together with the wooden spoon until it becomes brown and gooey. Then mix in the raisins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have an adult turn on the oven for you and set it to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap your cookie sheet with a piece of aluminum foil, keeping it nice and smooth. Smear the remaining 1 or 2 teaspoons butter all over the foil. Scoop up a teaspoon of the batter. Now, take the second teaspoon and use it to push the batter off onto the cookie sheet. Keep doing this until you have formed about 18 cookies, leaving about 2 inches of space space between the cookies. Don't worry that you have batter left over. You can make another batch of cookies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have an adult help you put the cookie sheet into the oven. Let the cookies bake for 15 minutes - the tops will no longer look shiny. Have an adult take the cookies out of the oven and help you slide them off the cookie sheet with the spatula and put them on the wire rack. Let them cool while you make another batch of the cookies with the rest of the batter."}]}