{"@context": "http://schema.org", "@type": "Recipe", "name": "Skate With Sauteed Spinach And Fried Potatoes", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fish, skate, spinach, main course", "aggregateRating": null, "recipeIngredient": ["2 large Idaho potatoes, peeled and cut into 1/2-inch cubes", "3 cups vegetable oil", "1 1/2 pounds fresh spinach", "2 tablespoons butter", "Salt and freshly ground black pepper", "4 large, skinless skate wing fillets, 5 to 7 ounces each", "2 cups milk", "1 1/3 cups flour", "2/3 cups cracker meal", "3 tablespoons clarified butter (homemade or from an Indian market) or oil", "2 tablespoons finely sliced chives", "2 lemons, cut into wedges", "Italian parsley sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in cold water, and set aside. Place a large saute pan over medium-high heat, and add oil. Drain potatoes, dry thoroughly on paper towels and add a single cube to the oil. If oil is hot enough for the cube to begin sizzling immediately, add the rest of the potatoes. Saute until barely golden, about 1 1/2 minutes. Transfer to a plate lined with paper towels, and set aside. Reserve the pan with the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove stems and wilted leaves from spinach, wash thoroughly and drain well. In a large saute pan over medium heat, melt the butter (not the clarified butter), add the spinach and toss until wilted. Season to taste with salt and pepper. Drain well, return to pan and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan of oil to medium-high heat. When oil is hot, return potatoes to pan, and fry until golden brown and crispy. Drain on paper towels, and salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, shallow bowl, combine skate wings and milk, and soak for 15 minutes. In a large mixing bowl, combine flour and cracker meal. Remove wings from the milk, and season both sides with salt and pepper to taste. Dredge the wings in the flour mixture, pat off excess and set aside on a plate. In a large saute pan over medium-high heat, heat clarified butter until sizzling. Add skate wings with the smoother sides down, and fry until golden brown, about 2 minutes. Turn the wings, and fry an additional 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, mound spinach at the top of each plate. Place skate like an inverted fan beneath spinach. Sprinkle potatoes over spinach, and sliced chives over skate wing. Garnish plate with lemon wedges and parsley sprigs, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11016-skate-with-sauteed-spinach-and-fried-potatoes"}