{"@context": "http://schema.org", "@type": "Recipe", "name": "Jambon Persillè", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT7H", "recipeYield": "10 appetizer servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, dairy-free, ham", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 102, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "300 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 bottle dry chardonnay", "3/4 cup veal or chicken stock", "4 shallots", "2 cloves garlic", "2 bay leaves", "3 sprigs tarragon", "1 teaspoon black peppercorns", "1 large bunch curly parsley", "1 piece cooked ham, about 2 pounds", "2 tablespoons powdered gelatin", "Salt and freshly ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the wine, roughly half the stock, the shallots, garlic, bay leaves, tarragon and peppercorns in a saucepan. Cover, bring to a boil and reduce to a simmer. Strip the parsley leaves from the stems and add the stems to the wine mixture. Simmer for 30 minutes. Wash and dry the parsley leaves, chop them and place in a small bowl. Pour 1/4 cup boiling water over the leaves to set the color and leave to cool. Pull apart the ham into uneven chunks, discarding fat and any sinew. (The finished aspic looks best if the ham isn't cut into cubes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining stock into a medium bowl, sprinkle the gelatin on top and leave it until spongy, about 5 minutes. Strain the wine mixture into a measuring cup. There should be about 3 cups; if not, add a little water. Bring the wine mixture just back to a boil and pour it over the gelatin. Let stand a minute, then stir to melt the gelatin. Season with salt and pepper (remember, ham is salty) and let cool until tepid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour a shallow layer of aspic into a 2-quart glass bowl or terrine mold and chill in the refrigerator or over ice water until set. Mix the ham with the parsley (along with its liquid) in a large bowl. Add the remaining tepid aspic, mix well and transfer to the mold. Press the pieces of ham well below the surface of the aspic and make sure no air bubbles are trapped beneath the ham. Cover and chill until set, at least 6 hours. (It keeps well up to a week, but once cut should be eaten within a day or two.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, dip the mold in hot water for 15 to 30 seconds. Run a knife around the edge, unmold onto a platter and slice."}], "link": "https://cooking.nytimes.com/recipes/11019-jambon-persille"}