{"@context": "http://schema.org", "@type": "Recipe", "name": "Anne Kearney's Double-Salmon Rillettes", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT4H40M", "recipeYield": "12 appetizer servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, salmon, smoked salmon", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 197, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "0 grams", "proteinContent": "12 grams", "saturatedFatContent": "4 grams", "sodiumContent": "316 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound fresh salmon, skin removed, cut into 2-inch cubes", "Kosher salt", "Freshly ground white pepper", "4 tablespoons unsalted butter, softened", "3 cups white Burgundy", "1/2 cup finely diced shallots", "2 strips lemon peel", "1/2 pound thinly sliced smoked salmon, cut into thin strips", "Juice of 1 lemon, or to taste", "2 tablespoons chopped fresh chives, or more to taste", "1 tablespoon chopped fresh dill, or more to taste", "2 tablespoons crème fraîche or sour cream, plus more for serving", "Salmon roe for serving", "French-bread croûtes for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 3-cup terrine with plastic wrap, leaving 6 inches over each side. (Or you can serve the rillettes in 12 individual 2-ounce ramekins.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the fresh salmon in a bowl, sprinkle lightly with the salt and pepper and toss. Smear the bottom of a large sauté pan with 2 tablespoons butter and add the wine, shallots and lemon peel. Add the salmon cubes, spreading them out to ensure even cooking. Bring to a simmer and cook until the salmon is just medium or medium-well, 2 to 3 minutes. Remove the salmon to a bowl with tongs, leaving as many shallots as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the liquid until only 1/4 cup remains, about 15 minutes. Pour through a sieve into the bowl with the salmon. Cool for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the smoked salmon, a splash of lemon juice, the chives, dill, crème fraîche and the remaining 2 tablespoons butter. Using a rubber spatula, smear the butter onto the sides of the bowl first; then gently work the rest of the ingredients well into one another. (The poached salmon will break down into shreds.) Taste and adjust lemon juice and seasonings if necessary. Place in the terrine. Cover with the plastic wrap and refrigerate at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use the excess plastic wrap to lift the salmon mixture slightly from the container. Invert the terrine onto a serving platter. Remove the plastic wrap and slice. Garnish each slice, or the ramekins, with crème fraîche and salmon roe. Serve with French-bread croûtes."}]}