{"@context": "http://schema.org", "@type": "Recipe", "name": "Sauteed Skate With Summer Tomatoes And Basil", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT20M", "recipeYield": "2 generous servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "fish, skate, tomato, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "recipeIngredient": ["4 skinless skate wing fillets, about 4 to 5 ounces each", "Salt and freshly ground black pepper", "1 1/2 cups flour", "2 tablespoons olive oil", "2 tablespoons butter", "4 teaspoons fresh lemon juice", "1 1/2 cups diced ripe tomatoes (about 2 medium)", "Tabasco sauce", "4 to 5 fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Thoroughly dry skate fillets with paper towels, and season to taste with salt and pepper. Spread flour in a large, shallow dish. Dredge fillets in flour, pat off excess, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large non-stick skillet over high heat, and add the olive oil. When oil is hot, add skate wings so that they lie flat, in a single layer. Brown until the under side is lightly golden, about two minutes. Use a wide spatula to turn the fillets, and saute until surface is golden and flesh is opaque, about two minutes more. Transfer fillets to heated dinner plates, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to medium heat, and add the butter, stirring with a wooden spoon. As soon as the butter turns a medium nut-brown, stir in the lemon juice. Add tomatoes, and warm briefly &#8212; about 5 to 10 seconds for very ripe tomatoes, 15 to 30 seconds for firm tomatoes. Remove pan from heat, add 4 or 5 drops of Tabasco sauce, and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon tomatoes over skate. Tear basil leaves into bite-sized pieces, and scatter over tomatoes. Serve immediately."}]}