{"@context": "http://schema.org", "@type": "Recipe", "name": "Kalua Pig", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": null, "totalTime": "PT5H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "collard greens, pork, dairy-free, gluten-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 94, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "128 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 6- or 7-pound picnic ham or pork butt, trimmed of skin but not fat", "1 tablespoon smoked paprika", "2 tablespoons kosher salt", "1 bunch collard greens, washed and trimmed of stems but with ribs intact"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees. With a sharp knife, score pork on all sides. Mix paprika and salt together, and rub seasoning evenly over pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap shoulder as completely as possible with large collard leaves and secure with butchers' twine. Place roast in center of a large sheet of tinfoil, and gather foil up and around roast. Put an additional sheet or two of foil over roast as necessary, so it is completely wrapped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pork shoulder on a rack in a roasting pan measuring 9 by 13 inches, and pour an inch of water into pan. Transfer pork to oven, and cook for half an hour. Reduce temperature to 450 degrees, and cook for 4 hours, adding more water every half-hour if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pork from oven, and let rest 10 minutes. Transfer to a pan or a large platter with sides steep enough to collect juices. Unwrap tinfoil, and remove wrapping of cooked greens. With your fingers, pull pork off and shred it. Serve with a bowl of cooking liquid and poi, for dipping."}]}