{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Curd Napoleon", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, lemon, phyllo", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 589, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "23 grams", "sodiumContent": "107 milligrams", "sugarContent": "41 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 large egg yolks", "1/2 cup fresh lemon juice", "Grated zest of 2 lemons", "3/4 cup sugar", "8 tablespoons (1 stick) unsalted butter, cubed, kept cold", "6 sheets phyllo dough, thawed according to package directions", "1/2 cup clarified butter (homemade, or may be purchased from Indian markets and specialty shops), melted", "1/2 cup confectioners' sugar", "2 cups fresh raspberries, or other seasonal berry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the lemon curd: In the bottom of a double-boiler, pour several inches of water, and bring to a simmer. In the top of the double-boiler, combine the egg yolks, lemon juice, and zest. Add the sugar, and whisk to blend. Fit the pans together, and whisk the egg mixture constantly until thickened, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pans from the heat, and whisk in the butter, a piece at a time, until completely incorporated. Place the top of the double-boiler in a large bowl of ice water, and stir frequently until chilled. Transfer to a covered container, and refrigerate. The curd may be stored, refrigerated, for up to three days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Line two baking sheets with parchment paper. Place the phyllo sheets on a dry work surface, and cover with a slightly dampened cloth. Remove one phyllo sheet, and lightly brush with clarified butter. Top with two more sheets, brushing each with butter. Make a second stack with the remainign three sheets of phyllo, buttering each one. Using a sharp, round 3-inch cookie cutter, cut out 12 circles from each stack. Sprinkle generously with confectioners' sugar, and transfer to a baking sheet. Cover phyllo disks with a sheet of parchment paper, and fit another baking sheet on top. Bake until golden, about 5 minutes; do not overcook. Remove top baking sheet and parchment paper, and allow phyllo disks to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Place a dab of lemon curd in the center of each plate, and press a phyllo disk on top of it. Top the phyllo with 1 tablespoon of lemon curd. Arrange four raspberries on the curd. Top with another phyllo disk, more lemon curd, and raspberries, continuing until each napoleon has three layers of berries. Top with a phyllo disk, and sprinkle with confectioners sugar. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11025-lemon-curd-napoleon"}