{"@context": "http://schema.org", "@type": "Recipe", "name": "Oysters Rockefeller", "description": "There are as many so-called original recipes for oysters Rockefeller as there are types of oysters. One account has it that the dish first surfaced at Antoine’s in New Orleans in 1899. It was said to have been devised by Jules Alciatore, a grandson of the restaurant’s founders. According to the story, a shortage of snails from Europe had the restaurant in jitters, and Mr. Alciatore was experimenting in the kitchen, looking for a substitute. At that time, oysters were never cooked at all, let alone fancied up with a sauce. He did so, making a sauce of watercress, scallions, celery, anise, spinach and other seasonings. It was a big hit, and he named it after America’s richest man, John D. Rockefeller. Some revisionists contend that spinach was not in the original dish. My version calls for celery, spinach, scallions, parsley, garlic, anchovy fillets and Tabasco. The anchovy is my own liberal interpretation.", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, oyster, seafood", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 564, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "4 grams", "proteinContent": "37 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1199 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["24 oysters", "1 lb. fresh spinach", "1/2 cup coarsely chopped celery", "1/2 cup coarsely chopped scallions", "1/2 cup chopped parsley", "1 clove garlic", "2 anchovy fillets", "4 tablespoons butter", "2 tablespoons flour", "1/2 cup heavy cream", "1/4 teaspoon Tabasco sauce", "1/4 cup freshly grated Parmesan or Romano cheese", "2 tablespoons Ricard or Pernod", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the oysters, leaving them on the half shell, and reserve the oyster liquor. Arrange them in a baking pan; then, chill until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over the spinach and remove any tough stems and blemished leaves. Rinse well and place in a saucepan. Cover and cook, stirring, until wilted. Drain well, and squeeze to remove all moisture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the container of a food processor, combine the drained spinach, celery, scallions, parsley, garlic and anchovies. Blend to a fine texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, heat 2 tablespoons butter. Add spinach mixture. Cook and stir for about 1 minute. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining butter in a saucepan. Add the flour, blend, and stir with a wire whisk. Add the oyster liquor, stirring vigorously with the whisk. Stir in the cream, season with Tabasco, and cook for about 2 minutes. Add the spinach mixture, cheese and liqueur. Blend well and let cool. Add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon equal parts of the spinach mixture on top of the oysters and smooth over the tops. Bake for 20 to 25 minutes or until piping hot."}], "link": "https://cooking.nytimes.com/recipes/11034-oysters-rockefeller"}