{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Cranberry Beans", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beans, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["2 cups dried cranberry, kidney or pinto beans, soaked overnight and drained", "3 slices lean bacon, diced", "6 chicken breasts and/or thighs and drum sticks", "Coarse salt and freshly ground pepper", "Flour for dredging", "1 medium onion, chopped", "2 celery ribs, chopped", "1 garlic clove, minced", "3/4 cup dry white wine", "1 teaspoon chopped fresh thyme", "1 teaspoon chopped fresh rosemary", "1 fresh or canned plum tomato, seeded and diced", "2 tablespoons chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beans in a three-quart sauce pan, cover to one inch above the beans with cold water and bring to boil. Turn off heat, cover pot, let the beans stand in hot water for an hour. Drain off water, cover beans with fresh water and bring to boil. Turn down heat and simmer beans, partly covered until they are tender, about 50 to 60 minutes. Drain beans, preserving liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook bacon in large skillet over medium heat, stirring frequently until it is browned but not crisp, about 10 minutes. Using a slotted spoon, put bacon on paper towels to drain, leaving fat in skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken pieces dry, season with salt and pepper and dredge them in flour, shaking off any excess. Heat bacon fat over medium-high heat. When it is hot, add chicken pieces and cook them, in batches if necessary, turning them once until they are golden brown and crisp -- about 15 minutes. Remove chicken to Dutch oven and pour off all but two tablespoons of the fat from bacon. Return cooked bacon to pan. Add onion, celery and garlic and cook until they are wilted, about five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to high, add wine, bring to boil, scraping up the brown bits from bottom of pan. Pour mixture over chicken, cover pot, cook over medium-high heat for three minutes. Add beans, thyme, rosemary, salt and pepper to taste and two cups of reserved bean cooking liquid. Stir well, bring to boil, turn down heat and simmer, covered, for about 15 minutes, until chicken is done. Beans may absorb some of the liquid; add more bean juice so there is plenty of sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and adjust seasoning. Put chicken, beans and sauce into serving dish and sprinkle with diced tomato and parsley."}], "link": "https://cooking.nytimes.com/recipes/11048-chicken-with-cranberry-beans"}