{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Flan", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "8 to 10 servings", "recipeCuisine": "irish", "recipeCategory": "dinner", "keywords": "dessert, rhubarb", "aggregateRating": null, "recipeIngredient": ["Pastry dough for one-crust pie (about 12 ounces)", "2 pounds rhubarb", "8 pelargonium geranium leaves (scented geraniums), optional", "5 tablespoons orange juice, preferably from blood oranges", "1/2 cup sugar, approximately, plus heaping 1/3 cup", "2 whole eggs", "2 egg yolks", "Grated rind of 1 orange, preferably blood orange", "6 ounces goat-cheese curd (see note)", "2 tablespoons slivered almonds", "Creme fraiche for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Roll out pastry and use it to line a 10-inch fluted tart pan (the kind with a removable bottom). Cover pastry with foil or parchment paper and weigh down with dried beans, to keep it from shrinking during cooking. Bake in oven 20 minutes or until edges of pastry start to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As pastry cooks, make filling. Trim and wash rhubarb and cut into 2-inch lengths. Put in a saucepan with geranium leaves, if desired, orange juice and the half-cup of sugar. Bring to boil and simmer, uncovered, about 10 minutes, stirring occasionally, or until rhubarb is thoroughly softened. Taste and add more sugar if necessary. Remove from heat and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat whole eggs and the yolks with remaining sugar until thick and pale yellow. Beat in orange rind and cheese curd."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside about 1/4 cup of rhubarb. Fold remaining rhubarb into curd mixture and pour into the pastry case. Use reserved rhubarb to swirl in a pattern over the top of the tart. Arrange slivered almonds on top. Bake 35 to 40 minutes; remove to cool to room temperature before serving. Tart will be slightly runny when it comes out of the oven but will firm a little as it cools. But it should not be tough and custardy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with dollops of creme fraiche."}], "link": "https://cooking.nytimes.com/recipes/11078-rhubarb-flan"}