{"@context": "http://schema.org", "@type": "Recipe", "name": "Robert Redford’s Cake", "description": "Usually cakes are named for famous people who like them. There's a flourless chocolate cake named after the late queen mother. (It was served to her once at tea in a private house, and, the story goes, she began featuring it at royal parties.) There is even a cake, a genoise layered with kirsch-flavored crème mousseline and strawberries, named after a bandleader, Ray Ventura, who was popular in France just after World War II. This cake was developed by the legendary baker Maida Heatter. Robert Redford was reported to have been wild about a chocolate cake sweetened with honey he ate in a Manhattan restaurant, so Heatter procured the recipe and gave it his name.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "16 servings", "recipeCuisine": "", "recipeCategory": "dinner, cakes", "keywords": "chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 442, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "17 grams", "sodiumContent": "85 milligrams", "sugarContent": "33 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 sticks unsalted butter, plus additional for greasing pan", "Fine breadcrumbs or flour for dusting", "1 cup blanched hazelnuts or almonds", "12 ounces semisweet chocolate", "1/2 cup honey", "10 eggs, separated", "1/4 teaspoon salt", "3/4 cup heavy cream", "12 ounces semisweet chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Butter a 10-by-3-inch round or springform cake pan. Line bottom with parchment. Butter parchment. Dust with fine breadcrumbs or flour. Shake out excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make cake: Grind nuts to a powder in a food processor. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break up chocolate and melt in the top of a double boiler over shallow, warm water on moderate heat. Transfer to a bowl and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in the bowl of an electric mixer, beat butter until soft. Gradually add honey; beat until smooth. Add egg yolks, two or three at a time, beating until mixed after each addition. (The mixture will look curdled, but it is O.K.) Add nuts and chocolate mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, beat egg whites with salt until whites barely stand up when the beater is raised. Fold egg whites into chocolate in three batches. Pour into pan. Bake at 375 degrees for 20 minutes. Reduce temperature to 350. Bake for 50 minutes more, until a cake tester comes out clean. Remove and let cool. Remove from pan. With a long sharp knife, level top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make frosting: Break up chocolate. In a saucepan over medium heat, cook cream until it forms a skin on top. Add chocolate, reduce heat to low and stir with a whisk until smooth. Transfer to a bowl and stir occasionally until cool and slightly thick. Pour icing over cake and smooth top and sides until covered. Serve immediately, or store overnight at room temperature."}], "link": "https://cooking.nytimes.com/recipes/11109-robert-redfords-cake"}