{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Spiced Squab", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, squab", "aggregateRating": null, "recipeIngredient": ["6 squab, about 1 pound each", "4 cloves garlic, peeled", "1 2-inch piece of ginger root, peeled and sliced", "2 tablespoons aniseed, pan-toasted and crushed", "1/2 teaspoon saffron filaments, chopped fine", "1 tablespoon paprika", "1 teaspoon cayenne", "1/2 cup lemon juice", "1 small bunch fresh coriander, chopped, to yield 4 tablespoons", "4 green onions or scallions, chopped, to yield 4 tablespoons", "1 1/2 cup light olive oil", "Freshly ground black pepper to taste", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove heads and feet from squab. Insert a sharp knife through neck cavity and carefully split each bird down the back, keeping breast intact. Remove backbone, then carefully remove breastbone, cartilage and ribs. The bird should look like a butterfly, with only wing and leg bones attached."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place garlic cloves and ginger in the bowl of a food processor, and blend to a paste. Add aniseed, saffron, paprika, cayenne and lemon juice, and blend about 30 seconds to combine. Transfer blended ingredients to a mixing bowl, add chopped coriander and green onions and whisk in olive oil. Add freshly ground black pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place squab in a shallow ceramic or enameled dish, add spice marinade and turn to coat well. Cover and refrigerate overnight. Bring to room temperature before grilling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler or outdoor grill to highest temperature. Sprinkle squab with salt. Grill squab, skin-side-up, for 4 minutes, and then turn to grill 3 minutes, skin-side-down. Baste frequently with marinade while cooking. Test for doneness: squab are best served rare. Suggested times are for a very hot fire. A home broiler will take longer than mesquite or charcoal briquettes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with couscous, rice or a combination of bulgur wheat and rice, sprinkled with minced green onions and accompanied by a lemon wedge."}], "link": "https://cooking.nytimes.com/recipes/11119-grilled-spiced-squab"}