{"@context": "http://schema.org", "@type": "Recipe", "name": "Rigatoni With White Bolognese", "description": "White Bolognese, a meat sauce made without tomato, is a variation you rarely see in America.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2015/12/09/dining/09COOKING-RIGATONIWHITEBOLOGNESE1/09COOKING-RIGATONIWHITEBOLOGNESE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "beef, pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2395}, "recipeIngredient": ["Extra virgin olive oil", "1/2 sweet onion, peeled and finely chopped", "2 medium carrots, peeled and finely chopped", "1 stalk celery, finely chopped", "Sea salt", "Freshly ground black pepper", "1 pound mild Italian pork sausage meat, removed from casings", "1 pound ground beef (not lean)", "1 1/2 cups dry Italian white wine", "1 cube beef bouillon dissolved in 2 cups simmering water", "1 1/2 ounces dried porcini mushrooms rehydrated in 3 cups lukewarm water", "1/3 cup heavy cream", "1 pound rigatoni", "3/4 cup freshly grated Parmigiano-Reggiano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough oil to a large, deep sauté pan to coat the base and place over medium-high heat. When the oil shimmers, add the onion, carrots and celery and sauté until glassy and just tender, about 5 minutes. Season lightly with salt and pepper. Add the sausage and beef to the pan, breaking it into walnut-size pieces, and brown well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in the wine and keep at a rapid simmer until the pan is almost dry. Then pour in 1 1/2 cups beef bouillon and lower the heat to medium. Simmer gently, uncovered, until the bouillon is nearly gone, stirring now and then. Meanwhile, chop the rehydrated porcini into small pieces, reserving the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add mushroom liquid to the sauce to cover the meat halfway (about 1 cup) along with the porcini and continue simmering until the sauce is loose but not soupy, about 10 minutes. Taste and adjust salt and pepper; it should be highly seasoned. When the consistency is right, fold the cream in. Remove from the heat and cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta water is at a full boil, add the rigatoni and cook until still firm, but not hard, in the center. When the pasta is almost done, scoop out 1 cup of pasta water and reserve. Drain the pasta and then return it to the pot. Pour the pasta sauce on top and fold in with a wooden spoon. The pasta should not be dry. Add a little pasta water or mushroom liquid to loosen it. (It will continue to soak up sauce on the way to the table.) Serve in one large bowl or in individual bowls, passing the cheese at the table."}]}