{"@context": "http://schema.org", "@type": "Recipe", "name": "Lobster Salad With Roasted Chili and Baby Corn", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "corn, lobster, dairy-free, main course", "aggregateRating": null, "recipeIngredient": ["2 lobsters, weighing 1 1/4 to 1 1/2 pounds each", "12 ears of fresh baby corn", "2 sweet red peppers", "1 sweet yellow peppers", "1 hot green poblano chili", "1 head of radicchio", "3 small heads of oak-leaf lettuce", "3 or 4 small heads of other lettuces, such as green leaf, limestone, bibb or baby red", "1 bunch of fresh marjoram", "3/4 cup of extra-virgin olive oil", "2 tablespoons lime juice", "12 small Italian plum tomatoes, red and yellow if available, cut in half", "1 lime, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In two inches of water, steam lobsters approximately 12 minutes, until shells turn bright red and antennae can be pulled out with a sharp tug. Drain lobsters immediately, and set aside until cool enough to handle. Shell lobster tails, remove black intestinal vein and slice tail meat into half-inch slices. Shell claws, but leave claw-meat intact. Set lobster meat aside in a cool place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring another pan of water to a boil. Shuck baby corn ears, and carefully drop into boiling water. Cook 1 minute, then drain and cool. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Holding peppers and chili with a long-handled fork, turn them briefly over a high flame. Alternately, place under a broiler, turning when necessary. When skin is blackened and peeling, place in a paper bag for 5 minutes. Rub skin off peppers and cut flesh in julienne strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash all greens and dry carefully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make dressing in a large bowl: Mix olive oil, 2 tablespoons lime juice and finely chopped marjoram. Turn salad greens in dressing and remove from bowl. Arrange greens on four dinner plates, alternating colors for presentation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss corn ears in dressing and remove. Arrange in spokes on greens. Place pepper and chili strips between corn ears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the center of each plate, place an intact lobster claw, removed from shell. Arrange a quarter of the lobster slices around claw. Garnish with tomato halves and wedges of remaining lime."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour extra dressing on lobster."}], "link": "https://cooking.nytimes.com/recipes/11125-lobster-salad-with-roasted-chili-and-baby-corn"}