{"@context": "http://schema.org", "@type": "Recipe", "name": "Barbecued Baby Chicken With Corn Pudding", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, corn, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["2 tablespoons melted butter", "6 to 12 ears fresh corn, enough to make 4 cups", "6 large eggs at room temperature", "2 cups half-and-half", "1/2 cup all-purpose flour", "Salt and freshly ground white pepper to taste", "2 tablespoons sugar", "1 teaspoon nutmeg", "4 tablespoons soft butter", "1 cup very finely chopped scallions, including green tops", "1/2 cup honey", "1/4 cup Worcestershire sauce", "2 cloves garlic, finely chopped", "1 tablespoon dry mustard", "1 teaspoon chili powder", "1 cup Sauternes or sweet white wine", "1/2 cup sherry-wine vinegar", "Salt and freshly ground black pepper to taste", "Tabasco to taste, if desired", "1 stick (4 ounces) butter", "4 1-pound chickens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "The corn pudding:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a round 10-inch baking dish, 2 1/2 inches deep, with melted butter. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove husks and silks from corn. With a sharp knife, carefully scraping upward, slice corn kernels into a bowl, reserving the cob. With the back of the knife, carefully scraping downward, scrape remaining part of kernels and milk from cob into the bowl. You should have about 4 cups in all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the steel blade of the food processor. Place corn in container with eggs, half-and-half, flour, salt, pepper and sugar and process just 3 to 4 seconds. This can be done in 2 batches if necessary. Pour mixture into prepared baking dish. Sprinkle top with nutmeg and dot with softened butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dish in a larger pan in preheated oven. Add enough hot water so that it comes halfway up the sides of the baking dish. Bake 1 hour, or until a knife inserted in the center comes out clean. Serve immediately."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "The barbecued baby chicken:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan mix all ingredients except chickens and butter and bring to a boil. Reduce heat and simmer for 10 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash chickens and trim fat from cavities. Place each chicken, breast-side-down, on a counter, and with a sharp knife or poultry shears, cut down the backbone on each side and remove it. Remove the breastbone. Press down on the chicken to break the breast cartilage so the bird lies flat. Coat each chicken generously with the barbecue sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat butter in a skillet or pan large enough to hold all 4 birds. Place them, skin-side-down, in the pan, and pour remaining sauce over them. Saute chickens for 15 to 20 minutes, turning at least once. (The chickens may be sauteed well ahead of time, if desired, and kept refrigerated until ready for the final cooking. Bring them to room temperature before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, preheat broiler or charcoal grill. Broil chickens until golden on each side, basting generously with the sauce. On a charcoal grill, they will take 10 to 15 minutes to a side, a little less under a kitchen broiler - 7 to 10 minutes to a side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately."}]}], "link": "https://cooking.nytimes.com/recipes/11128-barbecued-baby-chicken-with-corn-pudding"}