{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn-and-Tomato Parfait With Basil", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/23/dining/Corn-and-Tomato-Parfait-With-Basil/Corn-and-Tomato-Parfait-With-Basil-articleLarge.jpg", "totalTime": "PT6H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, corn, tomato", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 234, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "644 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ears of sweet corn", "Sea salt", "2 pounds very ripe tomatoes", "2 cups tightly packed basil leaves", "3 sheets gelatin", "1/3 cup olive oil", "Freshly ground black pepper", "Basil sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the corn pudding: slice the kernels off the cobs with a knife into a bowl. Scrape the length of the cobs with the knife to collect the ''milk'' remaining on them. Pass the liquid and kernels through a juicer. Place the corn juice in a nonreactive saucepan and slowly heat it up, stirring frequently. As it gets close to a simmer, season with a pinch of salt. The juice will begin to thicken like custard because of the natural cornstarch. Continue to stir until it completely thickens, then remove from the heat, strain and cool. Cover the top with a piece of plastic wrap so it does not form a skin. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomato jelly: roughly chop the tomatoes and place in a bowl. Tear 1 cup of the basil leaves. Mix the basil with tomatoes and season generously with salt. Pass through a juicer or purée in a blender. (You might have to do this in batches.) Pour the juice or purée into a nonreactive bowl lined with a kitchen towel or several layers of cheesecloth. Gather up the corners of the towel and tie with string. String the bag up carefully to the bottom of a shelf in the refrigerator so it hangs over the bowl and allows the tomato water to drip slowly into the bowl. (Do not squeeze the cloth.) Drain for 6 hours. Taste the water and adjust the seasoning with salt. Ladle out 3 cups of the tomato water into another bowl. Place 1 cup of the remaining tomato water in a saucepan and add the gelatin; let stand 10 minutes, until completely soft. Slowly heat this mixture, stirring constantly, until the gelatin is dissolved. Stir the gelatin mixture into the remaining tomato water, cover and return to the refrigerator to set overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the basil oil: place the remaining cup of basil leaves in a strainer and blanch in a saucepan of boiling salted water for 10 seconds. Plunge the basil into ice water to chill completely. Remove and squeeze out the water. Slice the basil thinly and then place in a blender and turn on a low speed. Slowly drizzle in the olive oil and blend for 2 minutes. Pour the basil oil into a strainer lined with a kitchen towel and allow to drain a clear, emerald oil. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the salad, have ready 6 martini glasses. Spoon 2 tablespoons of corn pudding into the bottom of the glass so it fills approximately 1 1/2 inches of the bottom. Spoon on top 1 tablespoon of the basil oil. Next, gently spoon on a layer of the tomato jelly about the same thickness as the pudding. Season with a grind of pepper. Garnish with a basil sprig."}]}