{"@context": "http://schema.org", "@type": "Recipe", "name": "Blue Crab And Melon Soup With Nori Crème Fraîche", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": "https://static01.nyt.com/images/2014/06/02/dining/Blue-Crab-And-Melon-Soup/Blue-Crab-And-Melon-Soup-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, cantaloupe, crab: melon, gluten-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 295, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "14 grams", "saturatedFatContent": "6 grams", "sodiumContent": "704 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 live hard-shell blue crabs", "5 pounds ripe Cavaillon or cantaloupe melon (about two cantaloupes, three Cavaillons), skinned, cut into 1-inch cubes, seeds reserved", "3 tablespoons unsalted butter", "3/4 pound leeks, washed, tops trimmed, sliced thinly (about 1 1/4 cups)", "1 teaspoon salt, more to taste", "1/2 cup chardonnay", "1/2 cup cold crème fraîche", "1 sheet seaweed paper (nori), available at Asian markets", "6 ounces lump crab meat", "2 tablespoons chives, sliced thinly", "Freshly ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour enough water into a large stockpot fitted with a strainer basket to reach bottom of strainer. Bring to a boil, and add crabs. Cover and steam for five minutes. Transfer steamed crabs in strainer to sink to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, purée melon in a food processor until smooth, and reserve (you should have six and a half cups purée)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When crabs are cool enough to handle, clean them: with kitchen scissors, cut off eyes and mouth, and remove and discard top shells and spongy, pointed gills beneath. From underside of each crab, remove cape of shell that tapers to a point, and discard. With a large sharp chef's knife, chop crabs into small pieces, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large soup pot, melt butter over medium-low heat, add leeks and salt, and sauté, stirring, until tender but not browned, six minutes. Add chopped crabs, and cook over medium heat about 8 minutes, or until pan is nearly dry and crabs are very fragrant. Pour 1/4 cup chardonnay into pan and continue to cook, stirring, two minutes. Pour melon purée over crabs and leeks, and add seeds. Simmer over medium-low heat for a half-hour, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place crème fraîche in a small bowl, and set it in a medium bowl filled with ice. Whip with a whisk until thick, about two minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear seaweed paper into pieces about 1-inch-square. Working in batches, process them to a powder in a spice grinder or coffee mill. Fold one tablespoon of powder into thickened crème fraîche."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain soup through a fine mesh strainer. Add remaining chardonnay, lump crab meat and chives. Season to taste with salt and freshly ground pepper, and divide evenly among six bowls. Garnish with dollops of nori crème fraîche and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11148-blue-crab-and-melon-soup-with-nori-creme-fraiche"}