{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Nougat Parfait With Orange Coulis", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2014/06/05/dining/Almond-Nougat-Parfait/Almond-Nougat-Parfait-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "almond, orange candy, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 578, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "20 grams", "sodiumContent": "165 milligrams", "sugarContent": "43 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup whole roasted almonds", "1/4 cup granulated sugar", "2 cups heavy cream", "2 large egg whites", "1/2 cup honey", "2 tablespoons finely diced orange Chuckles or other jelly candy", "2 tablespoons granulated sugar", "1/2 cup orange juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For caramelized almonds: Preheat oven to 250 degrees. Place almonds on a baking sheet and warm in oven for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan, combine sugar and 2 tablespoons water. Bring to a boil over high heat. When sugar has dissolved, add warm almonds and, stirring constantly, cook until sugar crystallizes. Continue to cook until sugar melts again and coats almonds. Remove from heat and turn almonds onto a clean work surface, separating almonds to avoid sticking. Allow to cool, then crush or roughly chop, setting aside 1/4 cup for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For nougat parfait: Whisk heavy cream until stiff, and refrigerate until needed. Place egg whites in bowl of a mixer fitted with a whisk attachment. Place honey in a small saucepan over high heat and bring to a boil. Whisk egg whites until they start to thicken, then slowly drizzle in the hot honey, gradually increasing speed of mixer until it is at full speed. Continue to whisk egg whites until they are very thick and completely cool (bowl will feel cool), about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in crushed almonds (except those reserved for garnish) and diced orange candy. Gently fold in whipped cream until blended. Place mixture in a gallon sealable plastic bag with one corner cut off, and pipe it onto a baking sheet in large mounds like meringues. Alternatively, it may be placed in a pastry bag with a large plain tip and piped into 12 1 1/2-inch stainless steel cylinder molds. Freeze until firm, about 4 hours, before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For orange coulis: In a small saucepan, combine sugar and 1 tablespoon water. Over medium heat, cook until it becomes an amber caramel. Meanwhile, in a second small pan over low heat, gently heat orange juice. When sugar has reached correct color, remove from heat and slowly add orange juice. Return to heat and cook to dissolve any hardened bits of sugar. Continue to reduce until slightly thickened, then remove from heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, if using molds, warm each mold with your hands to release it and place two unmolded parfaits on each plate. If using meringue-shaped parfaits, place two or three (depending on size and quantity) on each plate. Drizzle orange coulis around each plate, and sprinkle with reserved caramelized almonds."}], "link": "https://cooking.nytimes.com/recipes/11150-almond-nougat-parfait-with-orange-coulis"}