{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana-Cream Pie", "description": "Banana-cream pie is a fixture of Los Angeles dining, Jennifer Steinhauer reported for The Times in 2007. In large part, it seems that both the banana, a staple fruit in many parts of the world, and the cream pie, which is standard fare in the South and Midwest, appeal to the heterogeneous eaters of Los Angeles. Annie Miler, the owner and chef at Clementine, a bakery near Century City, who grew up baking banana-cream pies, told her, “People are sort of here from all over the country.” Her recipe follows. It’s fantastic.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Banana-Cream-Pie/Banana-Cream-Pie-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "banana, graham cracker crumbs, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 326}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 435, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "18 grams", "sodiumContent": "114 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cup graham-cracker crumbs, about 10 or 11 whole crackers", "1 teaspoon sugar", "4 tablespoons butter, melted", "1 2/3 cups milk", "1/4 cup plus 3 tablespoons sugar", "1/2 vanilla bean, seeds scraped out and reserved", "3 tablespoons cornstarch", "1 large egg", "2 large egg yolks", "1 1/2 tablespoons butter", "1 1/2 cups heavy cream", "1/4 cup creme fraiche", "3 1/2 medium bananas, sliced into 3/8-inch-thick rounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the graham shell:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. In a bowl, combine the crumbs and sugar. Add the butter and mix, first with a fork, then with your fingers, until the crumbs are moistened. Pour the mixture into a 9-inch pie pan, using a flat-bottomed cup to press the crumbs evenly. The edges of the shell will be crumbly. Bake until lightly browned, 9 or 10 minutes. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry cream: In a medium saucepan over medium heat, combine the milk, 1/4 cup sugar and the vanilla bean and seeds and bring to a simmer. Over a small bowl, sift the remaining 3 tablespoons sugar with the cornstarch. In a large bowl, whisk together the egg and yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the milk comes to a simmer, discard the vanilla bean. Add the cornstarch mixture to the eggs and whisk until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While whisking the egg mixture, slowly pour in about 1/4 of the milk. Transfer this mixture into the saucepan, set over low heat and simmer, whisking constantly, until it reaches the consistency of thick pudding. (Be careful not to curdle the eggs.) Remove from the heat and stir in the butter until incorporated. Pour into a shallow bowl, place plastic wrap directly on the surface and chill."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer or a whisk, whip the heavy cream and creme fraiche into peaks. Transfer the pastry cream to a large bowl and whisk until smooth. Fold in 1/2 cup of the whipped cream. Line the bottom of the cooled pie shell with a layer of bananas. Fold the remaining bananas into the pastry cream, then spoon it evenly into the shell. Mound the remaining whipped cream on top, swirling it decoratively. Chill and serve within 24 hours."}]}], "link": "https://cooking.nytimes.com/recipes/11172-banana-cream-pie"}