{"@context": "http://schema.org", "@type": "Recipe", "name": "Paillards of Chicken With Roasted Garlic, Peppers and Croutons", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, main course", "aggregateRating": null, "recipeIngredient": ["2 small red bell peppers", "2 small green bell peppers", "4 small heads garlic, lightly smashed so that the cloves break apart but the heads remain intact", "2 1/2 teaspoons olive oil", "4 4-ounce boneless, skinless half-breasts of chicken", "1/2 cup rich fowl glaze (<a href=\"http://cooking.nytimes.com/recipes/11188-rich-fowl-glaze\">see recipe</a>)", "1/2 teaspoon salt, plus more to taste", "Freshly ground pepper to taste", "1/2 French or Italian baguette, cut into 1/4-inch-thick rounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the bell peppers over a gas flame or under a broiler until charred on all sides. Place in a bowl and cover tightly with plastic wrap. Let stand for 10 minutes. Peel, stem, core, seed and derib the peppers. Cut them into 1-inch cubes and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Place the garlic heads in a small casserole dish with a lid. Drizzle with 2 teaspoons of the olive oil. Cover and roast until garlic is soft, about 1 hour 10 minutes. Set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the chicken between 2 sheets of plastic wrap and pound to a 3/8-inch thickness. Heat the remaining 1/2 teaspoon of the olive oil in a large nonstick skillet. Add the chicken, in batches if necessary, and saute until cooked through, about 2 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the pan, season with 1/2 teaspoon salt and set aside. Add the glaze to the skillet and cook until thickened slightly, about 1 minute. Return the chicken to the pan and coat with the glaze. Season with salt and pepper to taste. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bread rounds on a baking sheet and bake at 375 degrees until light brown and crisp. Place 1 chicken paillard on each of 4 plates, spooning the glaze on top. Garnish with some of the roasted peppers and 1 head of roasted garlic. Place the croutons beside the chicken and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11190-paillards-of-chicken-with-roasted-garlic-peppers-and-croutons"}