{"@context": "http://schema.org", "@type": "Recipe", "name": "Cognac-Ice-Cream Sandwiches", "description": "This recipe came to The Times from Meg Ray and Caitlin Williams, the owners of Miette Cakes, a bakery in San Francisco. They reimagined a classic booze pie as ice-cream sandwiches, literally a children’s dessert for adults. They replaced the graham-cracker crust with homemade graham crackers, turned the mousse into ice cream and elevated it with a relatively abstemious dose of Cognac. On the surface, it’s a tasty trifle, but there is subtlety too, with a little cinnamon here, some salt there.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Cognac-Ice-Cream-Sandwiches/Cognac-Ice-Cream-Sandwiches-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Makes 10 ice-cream sandwiches", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 618, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "24 grams", "sodiumContent": "272 milligrams", "sugarContent": "35 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups flour", "1/2 cup wheat flour", "1 teaspoon salt", "1/2 teaspoon cinnamon", "1 cup unsalted butter", "1/2 cup packed dark brown sugar", "1/4 cup honey", "1 cup milk", "2 cups cream", "2/3 cup sugar", "6 egg yolks", "2 tablespoons Cognac", "2 tablespoons chocolate liqueur"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the graham crackers: sift together the flours, salt and cinnamon. Set aside. In a mixer fitted with a paddle attachment, cream the butter and sugar. Add the honey and mix until blended. Add the dry ingredients in two batches, mixing until combined before adding the second batch. Mold the dough into 2 balls, wrap in plastic, flatten and chill for at least an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Roll out half the dough on a piece of parchment paper to a large square, 1/8-inch thick. Cut the sheet of dough into 3- by 3-inch squares, leaving them as is on the parchment; trim any excess dough from the edges. Transfer this sheet of dough to a baking sheet, using the parchment paper to lift it. Repeat with the remaining dough. Chill for 30 minutes. Bake until golden, 14 to 16 minutes. Let cool, then break into precut squares."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ice cream: in a heavy-bottomed saucepan over medium heat, heat the milk, cream and sugar until the sugar dissolves. Do not boil. Gently whisk the yolks in a bowl. Temper them by pouring 1/2 cup of the hot liquid into them, then whisk this into the hot liquid in the pan. Over medium heat, cook the custard, stirring continuously in a figure-eight pattern until it coats the back of a spoon. Strain into a heatproof bowl. Stir in the alcohol, then chill in the refrigerator. Churn in an ice-cream maker until thick. Freeze until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the sandwiches: scoop the ice cream onto a graham cracker, top with another graham cracker, press gently and serve."}], "link": "https://cooking.nytimes.com/recipes/11206-cognac-ice-cream-sandwiches"}