{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Steak with Pineapple and Onion Salsa", "description": "Most modern broilers are now unfortunately equipped with thermostats, so they cycle on and off, never really getting hot enough. Start by heating your oven to its maximum temperature, typically 550 degrees; then turn on the broiler. While the oven is preheating, leave a skillet or a grill pan (a ridged skillet) inside. The best pans for this are cast-iron, enameled cast-iron, or heavy-duty steel — not stainless steel, but what chefs call “black steel.” Almost needless to say, this pan must be all metal and not flimsy. Keep potholders handy. \n\nIn most cases, that skillet will stay as close to the heating element as possible, about two or three inches away. That’s roughly the distance you want if you have an old-fashioned under-oven broiler, even though it will allow you to put the food closer, almost in contact with the flames. Adjustments may also be needed with a really powerful broiler, of the kind more often found in restaurants, where two or three inches may be way too close. After a little experimenting, you’ll find the ideal distance for your broiler.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/broiledsteak-still/broiledsteak-still-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 731, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "5 grams", "proteinContent": "39 grams", "saturatedFatContent": "19 grams", "sodiumContent": "1129 milligrams", "sugarContent": "24 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 pineapple, peeled, cored and cut into thick rings (canned rings are O.K.; drain excess syrup)", "1 large onion, cut into thick slices", "3 tablespoons olive oil", "1 tablespoon minced fresh chile, like jalapeno or Thai, or to taste, or dried red chile flakes or cayenne to taste", "2 tablespoons chopped basil or mint leaves", "2 tablespoons lime juice", "Salt and freshly ground black pepper", "2 12- to 16-ounce sirloin strip or ribeye steaks, preferably at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start broiler; set rack about 4 inches from heat source. Brush pineapple and onion slices with olive oil and put on a baking sheet. Broil, turning once or twice, until soft and slightly charred, about 8 minutes total. Remove slices as they finish cooking and chop into bite-size chunks, saving as much juice as possible. When finished, set a cast-iron pan under broiler and let sit for about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine pineapple and onions with chile, basil and lime juice. Sprinkle with salt and pepper and stir to combine. Let sit for about 5 minutes, then taste and add more chile, lime or salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season steaks with salt and pepper. When pan is very hot, carefully remove from oven and add steaks; return to oven immediately. Broil steaks 6 to 10 minutes for rare to medium rare. (Timing will depend on thickness of meat and broiler heat; check by feel or by making a small slit in one steak and peeking in.) Serve steaks hot, with salsa."}], "link": "https://cooking.nytimes.com/recipes/11239-broiled-steak-with-pineapple-and-onion-salsa"}