{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Bouillabaisse", "description": "In traditional bouillabaisse, the fish is added last, after the sauce is made, so it does not overcook. But for this bouillabaisse, the chef Eric Ripert starts by browning the chicken on top of the stove. \"It's really a Provençal fricassee,\" Mr. Ripert told The Times in 2003. \"We didn't call it bouillabaisse in Provence, but except for the chicken and the chicken stock, it uses the same ingredients as a bouillabaisse, so you know exactly what it is.\"", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "soups and stews", "keywords": "appetizer, side dish, chicken, gold potatoes, saffron", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["1 frying chicken, cut in 10 pieces", "Salt and freshly ground white pepper", "2 tablespoons plus 3/4 cup extra virgin olive oil", "2 medium onions, thinly sliced", "1 cup thinly sliced leeks, white and light green only", "1 head garlic, peeled, all but 2 cloves sliced thin", "1/2 fennel bulb, sliced thin", "3 pinches saffron threads", "1/4 teaspoon cayenne pepper, or to taste", "2/3 cup diced ripe tomato or diced well-drained canned tomato", "1 tablespoon tomato paste", "1/2 tablespoon flour", "3 1/2 cups chicken stock", "8 small Yukon Gold potatoes", "1 6-inch piece baguette", "1 egg yolk", "1 6-inch strip orange peel", "1 ounce Pernod or Ricard", "4 branches fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry chicken, and season with salt and pepper. Pour 2 tablespoons oil in deep sauté pan or casserole large enough to hold chicken in a single layer. Place over high heat until starting to smoke, add chicken skin side down, and sauté until golden brown, turning to brown both sides. Remove chicken to a platter, lower heat to medium, and add onions, leeks, sliced garlic and fennel. Cook, stirring, until starting to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle on 2 pinches saffron and the cayenne, cook a few minutes longer, then add tomato and tomato paste. Cook a minute more, sprinkle with flour, stir, then return chicken to pan, along with any juices from the platter. Add stock, bring to a simmer, and cook 20 minutes. Remove 4 breast pieces from the pan. Continue cooking remaining chicken 15 to 20 minutes longer, until done, then remove from pan. Skim any foam from surface of sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While chicken cooks, place potatoes in a saucepan, add salted water to cover, and boil until just tender. Drain. Peel when cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place remaining pinch saffron in a small dish, and pour 1 tablespoon boiling water over it. Slice piece of baguette lengthwise in 4 pieces, and toast. Rub with one garlic clove, and brush with a little oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg yolk in a mixing bowl. Force remaining garlic clove through a press, and add it to yolk. Beat with a whisk. Strain in water from steeping saffron, and beat. Slowly drizzle in remaining olive oil, beating vigorously, until mixture thickens to mayonnaise consistency. Season with salt and pepper, and refrigerate until serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add orange peel, Pernod and thyme to sauté pan, cook 5 minutes, then remove orange peel and thyme. Season sauce with salt and cayenne to taste. Add potatoes and chicken to pan. Reheat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve chicken and potatoes in warm soup plates with sauce. Spread some of the garlic-saffron mayonnaise (aioli) on toasted baguette slices, and place one alongside each serving. (Reserve remaining aioli for another use.) Serve at once."}], "link": "https://cooking.nytimes.com/recipes/11254-chicken-bouillabaisse"}