{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple and Quince Tart", "description": "", "author": {"@type": "Person", "name": "Holly Brubach"}, "image": null, "totalTime": "P2DT3H30M", "recipeYield": "Serves 10 to 12", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, quince, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 349, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "12 grams", "sodiumContent": "102 milligrams", "sugarContent": "19 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups flour", "1 teaspoon sugar", "1/2 teaspoon salt", "12 tablespoons butter, cut into 1/4-inch cubes and chilled", "3 large quince (about 1 3/4 pounds), peeled, cored and chopped into 1/3-inch cubes", "8 tablespoons butter", "3/4 cup sugar", "4 medium apples (1 3/4 pounds), somewhat tart"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the shell: in a large bowl, combine the flour, sugar and salt. Using a pastry cutter, chop the butter into the flour mixture until pea-size and coated with flour. Add 4 to 5 tablespoons ice water and toss lightly with a fork. The dough will not come together at this point. Transfer the crumbly dough to the counter and, using the heel of your hand, smear the dough to marble the butter into it. Scrape up the dough and repeat this process one or two times until the dough comes together. Once the dough forms a ball, wrap it tightly with plastic wrap and press into a flattened disk. Refrigerate for 2 hours or up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a surface lightly dusted with flour, roll the dough into a 14-inch circle, 116-inch thick. Line an 1112-inch round tart pan with a removable bottom with the dough and place in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling by combining the quince, 4 tablespoons butter and 12 cup sugar in a heavy-bottomed medium saucepan set over medium heat. Cover and cook for 20 minutes, stirring every 3 to 5 minutes. Uncover, reduce the heat to low and cook until all the liquid has evaporated and the quince is tender and darker in color, about 40 minutes. Remove from the heat and cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust the rack to the bottom third of the oven. Preheat to 375 degrees. Peel, core and quarter the apples. Using a mandoline or a very sharp knife, slice the apples as thinly as possible and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tart shell from the freezer. Scrape the cooked quince into the shell and distribute it evenly. Layer the apples over the quince around the outermost edge of the tart with about 15 of the apple hanging over the rim of the pan. Each slice should overlap the preceding by half. Once you have made a full circle of apples around the outer edge, make a new circle closer to the center, overlapping the outer circle with about 14 of the apple slice. Continue layering until the quince is completely covered with apples."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a brown butter by melting the remaining 4 tablespoons butter in a small saucepan set over medium heat, stirring constantly, until golden brown and nutty-smelling. Drizzle the brown butter over the apples and sprinkle with the remaining sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tart on a sheet pan and cook for 70 minutes. Lower the oven to 350 degrees and bake until the apples have caramelized, the filling is bubbling and the crust is brown, another 20 minutes. Allow the tart to cool for 30 minutes on a wire rack; remove the tart pan. Serve warm with vanilla ice cream or creme fraiche."}]}