{"@context": "http://schema.org", "@type": "Recipe", "name": "Pommes Dauphine", "description": "", "author": {"@type": "Person", "name": "Guy Savoy"}, "image": "https://static01.nyt.com/images/2014/05/30/dining/Pommes-Dauphine/Pommes-Dauphine-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 to 6", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "gold potatoes, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "255 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound Yukon gold or other baking potatoes, scrubbed clean", "1 tablespoon coarse sea salt", "3 tablespoons unsalted butter, diced", "Fine sea salt", "1/2 cup flour, sifted", "2 medium eggs", "Freshly ground black pepper", "Vegetable oil for deep frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the potatoes and coarse sea salt in a large saucepan, and add enough cold water to cover by 1 inch. Bring to a boil over medium-high heat and cook, uncovered, until the potatoes are tender all the way through when tested with a knife. Drain and let stand until just cool enough to handle. Peel the potatoes and pass them through a food mill; this will yield about 2 cups of potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Line a medium baking dish with parchment paper. Spread the potatoes in the dish and bake for 10 minutes, stirring halfway through, to evaporate some of their moisture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pâte-à-choux: combine the butter, 1/2 teaspoon fine sea salt and 1/2 cup water in a medium saucepan. Place over medium-high heat and bring to a boil. Remove from heat, add flour all at once and stir vigorously with a wooden spoon until incorporated. Return to low heat and stir for 1 minute, until the mixture forms a ball and pulls away from the sides of the pan. Stir for 3 more minutes to evaporate some of the moisture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a medium mixing bowl and let cool for 2 minutes. Meanwhile, in a small bowl, beat 1 egg lightly with a fork. Set aside. Add the second egg to the potato mixture and stir with a spatula until well blended. Stir in the beaten egg, tablespoon by tablespoon, just enough to make the pâte-à-choux smooth, shiny and elastic; the entire egg may not be needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes to the pâte-à-choux, season with pepper and beat with a spatula to combine. (To store for up to 8 hours, place a piece of plastic wrap directly on the surface, cover and refrigerate.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 4 inches of oil in a deep fryer or large saucepan until a candy thermometer registers 320 to 340 degrees. Line a medium baking dish with a double layer of paper towels. The first pomme dauphine will be a test of the seasoning and the oil temperature. Using 2 tablespoons of the potato mixture, shape a 1-inch ball and drop it into the oil. It should fall to the bottom and bob up after a few seconds. (If it doesn't, the oil isn't hot enough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry until puffy, golden and crisp, about 3 minutes, flipping it from time to time with a mesh skimmer. Remove from the oil with the skimmer, transfer to the prepared dish and season with a pinch of salt. Shake the dish lightly so the paper towels absorb excess oil. Let cool for a minute, taste and adjust the seasoning of the potato mixture accordingly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with the remaining potato mixture, frying the pommes in batches of 3 or 4 and stirring them gently with a skimmer so they will not stick to each other. Keep warm in a 300-degree oven until all the batter is used. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11273-pommes-dauphine"}