{"@context": "http://schema.org", "@type": "Recipe", "name": "Citrus and Fennel Braised", "description": "", "author": {"@type": "Person", "name": "Heidi Julavits"}, "image": null, "totalTime": "PT5H", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "beef, fennel seeds, orange, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1139, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "8 grams", "proteinContent": "85 grams", "saturatedFatContent": "16 grams", "sodiumContent": "2290 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons fennel seed", "3 bay leaves", "1 orange, sliced", "8 cloves garlic, roughly chopped", "6 sprigs savory", "1 stick cinnamon", "1/2 cup olive oil", "1 5-pound beef eye-of-round", "7 large Spanish onions, sliced", "1 28-ounce can tomatoes, tomatoes crushed by hand and juice reserved", "1 bottle dry red wine", "1 bottle dry white wine", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Two days before serving, in a large, nonreactive container, combine the fennel seed, bay leaves, orange, garlic, savory, cinnamon and 2 tablespoons olive oil. Add the meat and rub to coat. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the marinade ingredients from the meat and reserve along with any liquid. In a braising pan fitted with a lid, heat the remaining olive oil over medium heat. Sear the meat well on all sides. Transfer to a plate. Add the onions and sauté until they begin to caramelize, 10 to 15 minutes. Stir in the reserved marinade ingredients and simmer for another 2 to 3 minutes. Add the tomatoes and their juice and cook over high heat until reduced by half, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Add the wines to the pan and bring to a boil. Simmer for 5 minutes. Return the meat to the pan, cover snugly with foil, then cover the pan with a tight-fitting lid. Braise, undisturbed, for 3 hours, or until a fork slides through the meat with little or no resistance. If necessary, continue to cook until tender, checking every 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meat to a platter. Pass the braising liquids and solids through a food mill and return them to the pan. Season to taste with salt and pepper. Add the meat to the pan and let cool. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Reheat the pan, 30 to 45 minutes, until heated through. To serve, thinly slice using a very sharp knife. Spoon some of the braising liquid over the top. If desired, serve with creamy polenta or mashed potatoes."}]}