{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Smoked Bacon, Leeks and Clams", "description": "Briny clams come together with smoky bacon and sautéed leeks in this showstopper. Quick to prepare, this weeknight recipe is decidedly sophisticated. First, sauté the bacon, add the garlic and leeks and add some good white wine and tomatoes. Toss with al dente linguine and top with clams and lemon juice. Finish with it with parsley and pine nuts, and pour yourself a glass of that wine. With this simple, elegant meal, you’ve earned it.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": "https://static01.nyt.com/images/2017/04/07/dining/07PASTAGUIDE6/07PASTAGUIDE6-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "italian", "recipeCategory": "dinner, quick, pastas", "keywords": "clams, pasta, smoked bacon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 159}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 869, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "103 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "6 grams", "proteinContent": "40 grams", "saturatedFatContent": "6 grams", "sodiumContent": "997 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "3 dozen littleneck clams", "3 tablespoons olive oil", "1/4 pound smoked bacon, cut into small cubes", "8 cloves garlic, thinly sliced", "2 cups thinly sliced leeks (white and light-green parts only)", "1/2 cup dry white wine", "1 teaspoon freshly ground black pepper, plus more to taste", "Pinch cayenne or crushed red pepper flakes", "1 to 1 1/2 cups cherry tomatoes, halved", "1 pound linguine", "3 tablespoons lemon juice (optional)", "1/4 cup coarsely chopped flat-leaf parsley", "1/4 cup lightly toasted pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of lightly salted water to a boil. Meanwhile, scrub the clams under cold running water with a stiff-bristled brush, then refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large saute pan over medium heat and add the olive oil. When the oil is hot, add the bacon and saute until the fat has rendered and the bacon starts to brown. Add the garlic and leeks and saute until the leeks have softened and released most of their liquid. Increase heat to high and add the wine, black pepper, cayenne and tomatoes; boil until the wine is reduced by half, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the linguine to the boiling water and cook until just before it is al dente. Meanwhile, add the clams and, if desired, the lemon juice to the saute pan. Cover and cook until the clams open completely, about 5 minutes. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the linguine and add to the pan with the clams; it will continue to cook when added to the mixture. Season to taste with salt and pepper. Garnish with parsley and pine nuts."}]}