{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry Chocolate Mousse Cakes", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "Two servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "chocolate, raspberry, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["2 tablespoons unsalted butter, at room temperature, plus butter for greasing the molds", "1 1/2 ounces unsweetened chocolate", "1/3 cup sugar", "1 large egg, separated, at room temperature", "2 tablespoons seedless raspberry preserves", "1/2 tablespoon eau de vie de framboises", "3 tablespoons all-purpose flour", "1/2 pint fresh raspberries", "1 tablespoon superfine sugar, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter two half-cup ramekins or molds. Line the bottoms of the molds with circles of wax paper and butter the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the chocolate in the top of a double boiler over hot, barely simmering water, making sure not to let the pan touch the water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cream the butter and sugar together until smoothly blended. (Although this can be done with a food processor or a mixer, it is better to do it by hand, because the quantity is so small.) Beat in the egg yolk, and stir in the raspberry preserves, the eau de vie and the melted chocolate. Stir in the flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg white until it holds a peak but still has a creamy quality. Stir a little of the egg white into the chocolate mixture to lighten the batter, then fold the remaining egg white into the chocolate mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter between the two prepared molds. Place the molds in a baking dish that will accommodate both comfortably and pour enough boiling water into the baking dish to come halfway up the sides of the molds. Place the baking dish in the oven and bake for 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the baking dish from the oven and allow the molds to cool in the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside one-quarter cup of the raspberries. Press the rest through a sieve to remove the seeds. If desired, sweeten the sauce to taste with the superfine granulated sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, unmold the cakes by running a knife around the inside of each mold, then inverting the cakes onto individual plates. (For the picnic, it is best to transport the cakes in their molds.) Peel off the wax paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Surround each cake with a pool of the sauce and scatter the reserved fresh raspberries in it."}], "link": "https://cooking.nytimes.com/recipes/11299-raspberry-chocolate-mousse-cakes"}