{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Corn, Zucchini And Tomatoes", "description": "The two things I love most about this dish of summer vegetables and pasta are the crunch of the corn against the tenderness of the pasta and the fact that I cannot seem to settle on a combination of flavorings that I think is best. Chile powder, a little bit of cayenne, perhaps some cilantro are all excellent choices. But with pasta this seems too heretical even for a culinary atheist like me, so I usually go in a tamer direction: a suspicion of garlic with some fresh tarragon or basil. It is flexible not only in its flavorings but in its ingredients. You can use onions, garlic or shallots, singly or in combination; add string beans (or even fresh limas) to the mix; substitute eggplant for the zucchini. Think of it as a delicious mélange of whatever is on hand.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/06/14/dining/14COOKING_PASTITOMATOES1/14COOKING_PASTITOMATOES1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick, pastas", "keywords": "corn, pasta, zucchini, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 509}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 615, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "7 grams", "proteinContent": "18 grams", "saturatedFatContent": "4 grams", "sodiumContent": "661 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt and pepper", "3 tablespoons extra virgin olive oil, or 2 tablespoons oil and 1 tablespoon butter", "1 cup corn kernels (from 2 or 3 ears)", "1 cup diced zucchini or summer squash (from 2 or 3 small vegetables)", "1 medium onion or 3 or 4 shallots, diced", "1/4 teaspoon minced garlic, optional", "1 or 2 sprigs tarragon", "4 plum or 2 large tomatoes, diced", "1 pound cut pasta, like penne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot of water to boil and salt it. Put 2 tablespoons oil in a large skillet over medium-high heat and add corn. Cook, stirring occasionally, until corn begins to brown. Add zucchini and some salt and pepper. Cook, stirring occasionally, until zucchini begins to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion or shallots and garlic if you are using it. Cook, stirring occasionally, until onion softens, about 5 minutes. Add tarragon and cook for 30 seconds, then tomatoes. Put pasta in boiling water and cook until tender but not mushy, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pasta cooks continue to cook sauce, reducing heat when tomatoes begin to break down. If sauce dries out (with plum tomatoes, this is likely), add some pasta cooking water, about 1/2 cup at a time. When pasta is done, drain it, toss with sauce and remaining oil or butter, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11305-pasta-with-corn-zucchini-and-tomatoes"}