{"@context": "http://schema.org", "@type": "Recipe", "name": "The Duchess of Devonshire's Beef Bourguignon", "description": "", "author": {"@type": "Person", "name": "Meredith Etherington-Smith"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "beef, red wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 663, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "45 grams", "saturatedFatContent": "9 grams", "sodiumContent": "932 milligrams", "sugarContent": "15 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 pounds stewing beef, cut into 1-inch pieces", "1 tablespoon vegetable oil, or more for browning", "1 large carrot, peeled and cut into thin rounds", "1 large onion, peeled and thinly sliced", "1 large clove garlic, peeled and crushed", "1 teaspoon salt, and more to taste", "1/2 teaspoon pepper, and more to taste", "2 tablespoons flour", "1 bottle red wine, like CÔtes du RhÔne", "Bouquet garni (2 to 3 sprigs each of thyme and parsley and a bay leaf, tied together with kitchen string)", "10 ounces white pearl onions", "2 tablespoons sugar", "1 tablespoon butter", "4 ounces sliced country-style smoked bacon", "10 ounces button mushrooms, cleaned, stems trimmed even with the caps", "Steamed or boiled potatoes or cooked noodles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Pat stewing beef dry. Heat 1 tablespoon oil in Dutch oven over medium-high heat and brown meat on all sides in batches, adding a little more oil if necessary. Remove meat with a slotted spoon as it cooks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add carrot and onion to drippings in the pan and sauté until golden. Add the garlic, salt and pepper and sauté for 1 minute. Sprinkle flour over vegetables and stir to coat. Cook for 1 minute. Add meat and mix well. Stir in wine gradually until flour is blended. Add bouquet garni and heat to boiling. Cover and bake 1 1/2 to 2 hours, until meat is tender, lowering heat to 300 degrees after 1 hour and adding a little water if the liquid is below the level of the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While beef cooks, heat a small saucepan of water to boiling, add pearl onions and boil for 1 minute. Drain and rinse with cold water. Snip tops of onions with kitchen scissors, pull back skins and trim them off at roots. Place peeled onions in the same saucepan and add 2 cups water, along with the sugar and butter. Heat to boiling and simmer, stirring frequently, until onions are transparent and tender, the liquid has evaporated and the onions are coated with a caramelized glaze, for about 45 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While onions cook, cut bacon crosswise into 1/4-inch wide pieces. Fry in a skillet over medium heat until browned and crisp. Remove bacon to a bowl and brown mushrooms on both sides in drippings. Add mushrooms to bacon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When beef is tender, remove bouquet garni and place meat in one bowl and its cooking liquid in another and clean out the pan. If cooking liquid is thin, boil it until it thickens to a coating consistency. Return the stew to the pan and adjust seasoning. Add onions, bacon and mushrooms and pour on liquid. Heat through. Serve with the potatoes or noodles."}], "link": "https://cooking.nytimes.com/recipes/11315-the-duchess-of-devonshires-beef-bourguignon"}