{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Breasts With Apricot Sauce And Grilled Fruit", "description": "", "author": {"@type": "Person", "name": "Peter Mcquaid"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "apricot, duck, fruit, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 277, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "26 grams", "saturatedFatContent": "2 grams", "sodiumContent": "807 milligrams", "sugarContent": "17 grams", "transFatContent": null}, "recipeIngredient": ["1 cup dried apricots", "1 1/2 cups fresh orange juice, and more if necessary to thin the sauce", "6 to 8 pieces fresh fruit for grilling, like plums, peaches and nectarines", "Olive oil for brushing", "4 duck breast halves (about 1 pound each)", "Grated zest from 2 oranges", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dried apricots and orange juice in a saucepan and heat to boiling. Remove from heat, cover and let steep about 30 minutes. When cool, place in a blender and purée, adding more orange juice to thin the sauce if necessary. Return sauce to the saucepan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a ridged grill pan over medium-high heat. Cut fruit in half and remove pits. Brush cut sides with olive oil and place oil side down on the pan. Grill until fruit loosens easily, about 5 minutes, and turn a quarter turn to make cross-hatching grill marks. Grill until tender, about another 4 minutes. Turn over to rounded side and grill until tender throughout, about 4 minutes. Remove to a plate and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Place duck breast on a cutting board with meat sides down. Score fat side diagonally (through the fat but not through to the meat) with parallel lines 1/4 inch apart. Turn duck breast around and score it the opposite direction so that the surface is covered with little squares. Sprinkle the fat with the orange zest, salt and pepper and rub the mixture in well. Preheat a deep skillet over medium-low heat and add duck breasts, skin side down. Cook without turning until skin is crispy and golden brown and much of the fat has rendered, about 10 minutes. Place duck breasts on a baking sheet with meat sides down and bake until medium-rare, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat sauce until simmering and pour enough of it over a platter to cover. Pour remaining sauce in a sauce boat. Thinly slice the duck on the bias and arrange the breasts with slices spread out on top of the sauce. Garnish with grilled fruit. Add extra sauce to taste."}]}