{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach Pie", "description": "You might be surprised to know that Linda Allard, the head of Ellen Tracy, is also known for her culinary skills. She even wrote a cookbook, ''Absolutely Delicious!'' from whence this recipe came. The crust calls for a combination of butter and lard which results in a superbly flaky crust, but if the idea of lard makes you bristle, all butter will work here too (you might need a bit more). Very little fuss is made over the peaches; just toss them with lemon juice, sugar and a scoop of flour to make it come together, then sprinkle with fresh nutmeg before topping with a blanket of dough. Bake until the juices bubble and peek through the golden crust. It's a simple and straightforward recipe, and the perfect showcase for ripe and juicy peaches.", "author": {"@type": "Person", "name": "Cathy Horyn"}, "image": "https://static01.nyt.com/images/2015/06/11/dining/PEACHPIE/PEACHPIE-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, peach, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 249}, "recipeIngredient": ["2 cups flour", "1 teaspoon salt", "2/3 cup cold lard (Allard usually uses 3 tablespoons of butter as part of the lard)", "1/4 cup ice water", "4 to 6 cups ripe peaches, peeled and sliced", "2 tablespoons lemon juice", "1 to 1 1/4 cups sugar", "1/4 cup flour", "Bit of freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the flour and the salt. Add the cold shortening in 2-inch pieces. Cut it into the flour until the mixture is crumbly. Squeeze a bit together (if it crumbles, add more shortening)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix in ice water, a couple of tablespoons at a time, with a fork until the dough sticks together. Pat it together, but do not overhandle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape into 2 flattened discs. Wrap in waxed paper and refrigerate for a few hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix peaches with lemon juice. Add sugar and flour and mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the first pastry disc and place in a 9-inch pie plate. Add filling. Grate nutmeg on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out second disc. Cut slits in a decorative pattern. Place on top of filling. Wet edges of bottom pastry with cold water. Trim pastry; pinch bottom and top edges together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake at 425 degrees for 15 minutes, turn down to 375 degrees and cook until peaches bubble and pastry is golden, about 45 minutes. Serve slightly warm with ice cream."}], "link": "https://cooking.nytimes.com/recipes/11311-peach-pie"}