{"@context": "http://schema.org", "@type": "Recipe", "name": "Michael Bao Huynh's Vietnamese Caramelized Pork", "description": "Thit kho to – a sticky-sweet pork dish with funky undertones of nuoc mam – is often served on Tet Nguyen Dan, the Vietnamese New Year and the nation's most important holiday. This recipe is adapted from Michael Bao Huynh, a chef and restaurateur who came to the United States as a refugee in 1982. Thit kho to is traditionally made with pork belly, but it can also be made with pork shoulder butt (as shown in the photo) – a lighter though no less delicious alternative. Serve the meat over a pile of snowy white rice with a bottle of hot pepper sauce nearby.", "author": {"@type": "Person", "name": "Dana Bowen"}, "image": "https://static01.nyt.com/images/2018/08/05/dining/07COOKING-VIETNAMESE-PORK1/07COOKING-VIETNAMESE-PORK1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "main course, pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 719}, "recipeIngredient": ["1 1/2 cups sugar", "2 1/2 pounds pork belly or butt, sliced into thin, inch-long strips", "1 tablespoon salt", "1/2 teaspoon freshly ground black pepper", "1/4 cup fish sauce", "2 heaping teaspoons minced garlic", "1 dash sesame oil", "1 medium Vidalia onion, sliced", "4 scallions, sliced, green part only", "Rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover bottom of a large, heavy skillet with one cup sugar and place over medium low heat. As soon as it melts and turns golden, add pork, raise heat to medium, and stir until coated. (Sugar will become sticky and may harden, but it will re-melt as it cooks, forming a sauce.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in remaining sugar, salt, pepper and fish sauce. Cover and cook 2 minutes. Uncover, stir in garlic and oil and lower to simmer to reduce sauce for about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in Vidalia onions and cook until translucent, 5 to 7 minutes. Pork should be caramelized; if not, raise heat and sauté while sauce further reduces. Transfer to serving bowl, and sprinkle with scallion greens."}], "link": "https://cooking.nytimes.com/recipes/11326-michael-bao-huynhs-vietnamese-caramelized-pork"}