{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Sweet-Savory Carnaroli-Rice Pudding", "description": "Mastic comes from the mastic tree and is often used as a spice. Here, it adds an herbal note. Mastic crystals and powder (sold as gum mastic) are available at kalustyans.com.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "challah bread, pistachio, rice, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 741, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "3 grams", "proteinContent": "16 grams", "saturatedFatContent": "23 grams", "sodiumContent": "749 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Vegetable oil for greasing pan", "1/2 cup sugar", "1/2 cup pistachios", "1/2 large loaf of challah bread, cut into 1-inch dice (about 5 cups)", "6 tablespoons unsalted butter, plus more for greasing", "2 tablespoons toasted pine nuts", "1/2 stick cinnamon", "Several threads of saffron", "1 teaspoon ground nutmeg", "1 teaspoon mastic crystals (optional)", "1 teaspoon grains of paradise", "1/4 teaspoon sea salt", "6 cups half-and-half, plus more for serving", "1/4 cup candied citron peel", "1 bay leaf", "Kosher salt", "1 cup carnaroli rice", "3 tablespoons sugar", "1/2 vanilla bean, seeds scraped", "2 tablespoons dried currants, soaked in warm water", "8 sun-dried tomatoes, soaked in warm water", "1 cup fresh ricotta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pistachio praline: Oil a baking sheet. In a small saucepan over medium-high heat, cook the sugar; swirl the pan as it begins to brown. When dark caramel, remove from the heat and stir in the pistachios. Spread on the baking sheet. Cool completely, then chop finely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pudding: Grind the challah in a food processor. Add 3 tablespoons butter and pulse until mixed. In a mini processor, grind the pine nuts, then blend with 3 tablespoons butter. Using a spice grinder, grind the cinnamon, saffron, nutmeg, mastic, grains of paradise and sea salt. In a small pan, heat 1 cup half-and-half with finely chopped citron peel and bay leaf until steaming."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring 2 quarts water and 1 tablespoon salt to a boil and add the rice. Blanch for 1 minute, then drain. Pour 5 cups half-and-half in a saucepan over medium heat until just steaming. Stir in 3 tablespoons sugar, the vanilla bean and seeds and the ground spices. Add the rice and simmer uncovered on low heat until the rice is al dente, 45 to 60 minutes. Drain well and discard the vanilla bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 3-inch-deep, 4-quart casserole. Drain the currants. Drain and coarsely chop the tomatoes. Spread half the rice in the casserole, then spread the ricotta and sprinkle with the currants, tomatoes and pine nuts. Spread with the remaining rice. Discard the bay leaf from the citron-peel infusion and pour over the rice. Cover with bread crumbs, then the praline. Bake until the topping is crisp, 15 to 20 minutes. If desired, gently fold in half-and-half when serving."}], "link": "https://cooking.nytimes.com/recipes/11352-baked-sweet-savory-carnaroli-rice-pudding"}