{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cauliflower and Broccoli With Salsa Verde", "description": "This recipe came to The Times in 2004, when Julia Moskin wrote a story about the developing culinary culture in McCarthy and Kennicott, two tiny villages in the hinterlands of Alaska. (\"Out here, you have a choice,\" said Mark Vail, a former Air Force cook who lives in McCarthy year-round. \"You can live on ramen noodles and baked beans, or you can learn to cook.\") Kirsten Richardson, a resident of Kennicott and a cook at the McCarthy Lodge, a local restaurant, developed this brightly-flavored riff on the weeknight vegetable. Just roast the broccoli and cauliflower, toss with a shallot-anchovy vinaigrette and toasted almonds then sprinkle with chopped parsley. It makes a satisfying mostly-meatless main or a delicious accompaniment to roast chicken.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/01/19/dining/19COOKING_ROASTCAULIFLnBROC1/19COOKING_ROASTCAULIFLnBROC1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 side dish servings", "recipeCuisine": "italian", "recipeCategory": "weeknight", "keywords": "broccoli, cauliflower, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 364}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 597, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "14 grams", "proteinContent": "17 grams", "saturatedFatContent": "6 grams", "sodiumContent": "829 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup whole shelled almonds", "1 large head broccoli, cut into florets (about 1 pound florets)", "1 large head cauliflower, cut into florets (about 1 pound florets)", "10 tablespoons extra virgin olive oil, divided", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper, plus more for dressing", "1 shallot, minced", "2 tablespoons red wine vinegar", "3 anchovy fillets, minced", "Juice of 1/2 lemon", "1 cup coarsely chopped Italian parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread almonds on a baking sheet and toast until brown and fragrant, 8 to 10 minutes. Leave oven on. When almonds have cooled, chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl, toss broccoli and cauliflower with 4 tablespoons olive oil, salt and pepper. Spread on two baking sheets and roast until tender, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix shallot and vinegar and set aside for 5 minutes. Whisk in anchovies, lemon juice, remaining 6 tablespoons olive oil, and salt and pepper to taste. Stir in almonds and parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove vegetables from oven, add to bowl and toss with sauce. Taste and add more salt, pepper, vinegar or lemon, if needed. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/11350-roasted-cauliflower-and-broccoli-with-salsa-verde"}