{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cauliflower, Parsnip and Leek Filling for Crepes", "description": "", "author": {"@type": "Person", "name": "Celia Barbour"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Filling and sauce for 12 crepes", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, side dish, cauliflower, leek, parsnip, fall, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 201, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "6 grams", "sodiumContent": "460 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds (1 small or half a large) cauliflower, broken into small florets, stem and leaves discarded", "6 tablespoons melted butter", "1/3 cup olive oil", "1/2 teaspoon freshly ground black pepper", "2 teaspoons dry (powdered) mustard", "2 1/2 teaspoons salt", "2 small leeks or 1 large leek, white and light green parts only", "3/4 pound (about 3 medium) parsnips, quartered lengthwise, tough core discarded", "3 large egg yolks", "2 tablespoons heavy or light cream or whole milk", "3 cups vegetable or chicken broth", "3 tablespoons flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a roasting pan in oven and preheat to 425 degrees. Place cauliflower in a large bowl. In a separate bowl, mix 3 tablespoons butter, the olive oil, pepper and mustard. Drizzle about two-thirds of mixture over cauliflower; mix well. Sprinkle with 1 1/2 teaspoons salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread cauliflower evenly in heated roasting pan and bake for 10 minutes. Meanwhile, halve leeks almost to root end, leaving root end in one piece. In a large bowl, combine leeks, parsnips, remaining 1 teaspoon salt and remaining butter-oil mixture. Mix well. Turn cauliflower over in pan, then add parsnips and leeks. Roast for 20 minutes, turning vegetables halfway through. Reduce heat to 325 degrees and roast until golden brown and tender, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer vegetables to a cutting board and chop into 1/4- to 1/2-inch pieces. Set aside. In a medium bowl, combine egg yolks and cream or milk and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, bring broth to a simmer. In another small saucepan over medium-low heat, whisk remaining 3 tablespoons butter with flour. Continue whisking for about 3 minutes; mixture should bubble gently but not brown. Remove from heat and slowly add broth, whisking to incorporate. Continue until all broth is used and sauce is smooth and creamy. Return to low heat and cook until slightly thickened, 2 to 3 minutes. Whisk into bowl of egg yolks and cream. Return to pan over medium-low heat just until steaming, 2 to 3 minutes; do not boil. Reserve 1 cup sauce for garnishing filled crepes. Add chopped vegetables to remaining sauce."}], "link": "https://cooking.nytimes.com/recipes/11378-roasted-cauliflower-parsnip-and-leek-filling-for-crepes"}