{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Gorgonzola and Arugula", "description": "The main characters here are Gorgonzola and arugula, the first of which appears in a number of different pasta sauces, all unsurpassed for their creaminess. But in many instances, to me at least, Gorgonzola-based sauces tend to be too slick and rich. This makes the addition of the fresh-tasting spicy arugula from the supermarket even more welcome. Not only does it provide a little bit of crunch, but its odd version of heat also gives a bit of an edge to what could otherwise be a soft, almost insipid sauce. Don't forget to finish up with a few hearty cranks of the pepper mill. A full teaspoon for the entire dish is not too much.\n\n(The original recipe called for 1/4 pound of Gorgonzola and 2 tablespoons of butter, but after many readers commented that the dish needed more sauce, we tested it and agreed. The figures you see below are for doubling the sauce, but if you prefer it the old way, just halve the Gorgonzola and butter.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/02/07/dining/07COOKING-PASTA-GORGONZOLA2/07COOKING-PASTA-GORGONZOLA2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "arugula, gorgonzola, pasta, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 919}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 735, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "88 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "4 grams", "proteinContent": "28 grams", "saturatedFatContent": "18 grams", "sodiumContent": "670 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter", "1/2 pound ripe Gorgonzola", "6 ounces arugula, washed and dried", "1 pound cut pasta, like ziti or farfalle", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil for pasta. Meanwhile, melt butter over low heat in a small saucepan. Add Gorgonzola and cook, stirring frequently, until cheese melts. Keep warm while you cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear arugula into bits, or use a scissors to cut it. Pieces should not be too small. Cook pasta until it is tender but not mushy. Remove and reserve a little cooking water, then drain pasta and toss it with arugula and cheese mixture, adding a bit of water if mixture seems dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and add seasoning. Dish should take plenty of black pepper. Serve."}]}