{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Souffle Cake", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, semisweet chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 978, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "105 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "4 grams", "proteinContent": "22 grams", "saturatedFatContent": "30 grams", "sodiumContent": "203 milligrams", "sugarContent": "96 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["7 tablespoons unsalted butter", "1 tablespoon flour", "Parchment paper", "7 ounces semi-sweet chocolate, cut up", "Grated zest of one orange", "2 teaspoons vanilla extract", "1 tablespoon finely ground almonds", "5 eggs, separated", "1/2 cup plus 1 tablespoon sugar", "Powdered confectioners' sugar for dusting", "8 egg yolks", "1/2 cup sugar", "1 teaspoon cornstarch", "1 quart milk", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 275 degrees. Butter and flour a 10-by-2-inch round cake pan and line with a circle of parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chocolate, butter, orange zest, vanilla and almonds in top of double boiler. Melt over hot water, stirring occasionally. Remove from heat as soon as chocolate is melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg yolks with half the sugar (in electric mixer, if desired) until mixture is thick and a slowly dissolving ribbon drops from a lifted beater. Fold lukewarm chocolate mixture into egg-sugar mixture with a large rubber spatula. Whip egg whites until foamy, then gradually add remaining sugar. Continue beating until stiff peaks form. Using rubber spatula, blend lightly but thoroughly into chocolate-egg mixture. Pour the batter into the prepared pan and bake for 1 hour and 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cake from oven and loosen sides with a sharp knife. Unmold onto a wire rack, then quickly and carefully reverse onto a second rack so that the cake is the right side up. The cake will sink slightly. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make Creme Anglais, whisk egg yolks and sugar together, or beat in an electric mixer, until thick and lemon colored. Mix cornstarch with a little cold milk and add to rest of milk. Scald milk and pour over yolk mixture, whisking constantly. Pour custard into a heavy pan, preferably of tin-lined copper. Avoid using a plain aluminum pan, which discolors sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir with a wooden spoon over low to medium heat until custard starts to coat spoon and reaches 165 degrees Fahrenheit on a candy thermometer. Do not cook over too high a heat, or the eggs will curdle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain into a clean dry bowl and stir in vanilla. Let cool, stirring occasionally to prevent skin from forming. Cover with plastic wrap and refrigerate. Makes 6 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, sprinkle the cake with sifted powdered sugar. If you wish, cut a large Christmas star of light cardboard and lay on top of the cake before dusting with sugar. Carefully remove the star, and the pattern will remain. Serve wedges of cake on dessert plates on a pool of Creme Anglais."}]}