{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Pea-Mint Soup", "description": "Buttermilk-simmered peas, plenty of mint, a touch of salt: That’s it. The chef Daniel Patterson brought the recipe to The Times in 2007. It benefits mightily not just from the use of fresh peas, but from real, homemade buttermilk as well, “nothing like the cultured, processed stuff that goes by the same name,” he wrote. This is true, as it happens, but luckily fresh buttermilk can increasingly be found at farmer’s markets and in specialty markets. Top the chilled soup with a few peas and a grind or two of fresh black pepper.", "author": {"@type": "Person", "name": "Daniel Patterson"}, "image": "https://static01.nyt.com/images/2014/04/11/dining/Pea-Mint-Soup/Pea-Mint-Soup-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, buttermilk, mint, peas, gluten-free, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 50, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "287 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 cups <a href= \"http://www.nytimes.com/recipes/11391/homemade-butter-and-buttermilk.html\">homemade buttermilk</a> (see note)", "4 cups shelled peas, plus more for garnish", "Salt", "10 mint leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, bring the buttermilk to a simmer and add 4 cups of peas and a large pinch of salt. Simmer for 1 to 2 minutes over medium heat, stirring often so that the buttermilk does not boil over. The peas should not be fully cooked and still have a slight bite to them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the peas and liquid immediately to a blender with the mint leaves and, starting on low speed, carefully blend (holding the lid on firmly with a dishcloth), working up to high speed for 60 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In order to preserve the vibrant color and flavor of the peas, the soup must be cooled immediately. Pass through a fine-mesh sieve into a bowl, then rest the bowl inside a larger bowl full of ice water. Stir continuously until cool, tasting occasionally; you will notice that the soup becomes sweeter as it cools. Adjust seasoning with salt and black pepper. Refrigerate until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle soup into bowls and top with fresh peas and freshly ground black pepper."}]}