{"@context": "http://schema.org", "@type": "Recipe", "name": "Halibut With Fava Beans and Asparagus", "description": "Fillet of halibut is served with a fresh sauce of sugar snap peas, fava beans, baby asparagus tips and bits of black truffle in this recipe adapted from the chef Eric Ripert of Le Bernardin.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "asparagus, fish, halibut, gluten-free, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 360, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "39 grams", "saturatedFatContent": "7 grams", "sodiumContent": "837 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon canola oil", "1 ounce diced prosciutto", "3 tablespoons finely chopped shallots", "1 cup chicken stock", "1/4 cup black truffles (about 2 truffles), chopped", "2 cups baby peas (10 ounces), shelled (frozen peas are fine)", "1 1/2 cups sugar snap peas (5 ounces), sliced into the bias into 1/4-inch slices", "12 asparagus tips", "1/2 cup fava beans (8 ounces in pods), shelled and outer skin removed", "Fine sea salt", "Freshly ground white pepper", "6 6-ounce halibut fillets", "5 tablespoons butter", "1 teaspoon oregano leaves, minced at last minute", "1 lemon", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat canola oil in a pan over medium heat and add prosciutto and shallots. Sweat until shallots are soft and translucent. Cover with stock and simmer for about 10 minutes. Stir in truffles. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the peas, sugar snaps, asparagus and fava beans separately in boiling water, until tender, about 1 minute. Remove from heat and immediately plunge into an ice-water bath to stop the cooking. Set aside fava beans, 1 cup of sugar snaps and asparagus. Place peas and 1/2 cup of sugar snaps in a blender or food processor and puree. Force puree through a fine-mesh sieve to remove any lumps or strings. Set aside in a small pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy casserole large enough to accommodate 6 fillets, bring 1/4 inch of salted water to a simmer. Salt and pepper each fillet on both sides. Gently poach for 3 to 5 minutes, until the halibut is just cooked through. Test for doneness by inserting a skewer in thickest part of fish for 5 seconds. Skewer should be warm upon removal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the chicken-stock-and- truffle mixture to a boil and carefully whisk in 4 tablespoons butter. Add remaining snap peas, fava beans and asparagus, along with oregano, and hold over low heat. Reheat pea puree and stir in remaining butter. Spoon some puree down center of plate in a line and top with a fillet, crosswise over puree. Squeeze lemon juice over halibut and a pinch of sea salt. Spoon over sauce. Repeat 5 times. Serve."}], "link": "https://cooking.nytimes.com/recipes/11399-halibut-with-fava-beans-and-asparagus"}