{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Celery Root Purée With Mushrooms", "description": "", "author": {"@type": "Person", "name": "Jill Santopietro"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "celeriac, celery root, mushroom, fall, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 350, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "7 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1037 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["3/4 ounce dried porcini mushrooms", "Juice of 2 lemons", "2 1/2 pounds (about 2 large) celery root", "1/2 cup extra-virgin olive oil", "1 large leek, white and light green parts only, cleaned and roughly chopped", "1 medium onion, peeled and roughly chopped", "1 clove garlic, peeled", "3 sprigs thyme, plus 1 1/2 teaspoons chopped thyme", "1 bay leaf", "Salt and freshly ground black pepper", "2 cups whole milk", "1 1/4 pounds mixed mushrooms (cremini, button or shiitake), cut into 1/4 -inch slices", "Truffle oil, optional", "Shaved Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. In a small pot, bring 3 cups water to a boil. Remove from the heat, add the porcini and let sit for 30 minutes. Strain through a fine-mesh sieve set over a bowl and set aside. Rinse and chop the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with cold water and add all but 2 tablespoons of the lemon juice. Peel, quarter and cut the celery root into 1/4-inch-thick slices and add to the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, ovenproof pot over medium-high heat. Heat 1/4 cup of the oil, then add the leek, onion, garlic, thyme sprigs, bay leaf and a pinch each of salt and pepper. Sauté until the onions are translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the celery root and add it to the onion mixture with the reserved mushroom broth and milk. Bring to a boil, cover tightly and transfer to the oven. Braise until the celery root is tender, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bay leaf and thyme sprigs. Using a blender or immersion blender, carefully blend the mixture to a smooth purée. (For a finer texture, strain through a fine-mesh sieve.) Place the pot over low heat and simmer until it reaches the consistency of porridge. Add the remaining 2 tablespoons lemon juice and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium-high heat, heat the remaining 1/4 cup oil. Add the fresh mushrooms and sauté until the water releases and evaporates. Add the rehydrated porcini and chopped thyme. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a few spoonfuls of the purée on each plate and drizzle with truffle oil, if using. Top with mushrooms and Parmesan."}]}