{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Thighs Stuffed With Chard", "description": "Stuffing boneless chicken has long been reserved for breasts, but most chicken breasts have so little flavor that you almost have to stuff them with fat. Thighs, however, are fattier and more flavorful, so a stuffing can be leaner and brighter. And now that boneless thighs are sold in many supermarkets, the only issues are flattening and rolling. But if you pound a thigh as you would a breast, it becomes large enough to stuff and roll (Because thighs are irregularly shaped, you’ll need to skewer them closed with a couple of toothpicks).  Almost any stuffing will work; just don’t overfill. My current favorite uses a light, leafy green, along with pine nuts and raisins. The result is nicely browned meat and a lean stuffing with acidity, crunch and sweetness. For more flavor, I like to finish with a splash of sherry; with the liquid spooned over the thighs and a sprinkle of parsley, the dish becomes downright impressive.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/02/20/dining/20COOKING-CHIXTHIGH-CHARD1/20COOKING-CHIXTHIGH-CHARD1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, swiss chard, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 87}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 569, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "55 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1037 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 to 2 pounds chard", "5 tablespoons olive oil", "1 tablespoon chopped garlic", "1/2 cup pine nuts", "1/2 cup raisins, soaked in warm water for about 10 minutes, drained", "Salt and pepper to taste", "8 boneless, skinless chicken thighs", "1/2 cup dry (fino) sherry or a flavorful white wine", "Chopped fresh parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut chard stems into 1- to 2-inch lengths, and coarsely chop leaves. Gently boil stems until almost tender. Add chopped leaves. Cook until soft, another couple of minutes. Drain well, pressing out water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons oil in large skillet over medium-low heat and add garlic; cook until garlic begins to color, a couple of minutes. Add pine nuts and cook another minute, stirring, then add chard, raisins and salt and pepper; cook, stirring, for about 2 minutes. (Stuffing can be refrigerated for two days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put each thigh between plastic wrap and pound thin, without tearing. Sprinkle with salt. Put spoonful of stuffing on one end and roll. Skewer closed with a toothpick or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put remaining oil in large, deep skillet over medium-high heat. Add thighs, browning on one side for about 5 minutes and adjusting heat if needed, then turn. Cook a minute or two, then turn heat to medium-low and add sherry. Let bubble for about 30 seconds, cover, and cook about 5 minutes, or until chicken thighs are quite firm and cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove to a platter. Reduce liquid in pan over high heat, if needed, and spoon over chicken. Garnish with parsley, and serve."}]}