{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallop Sate With Peanut Sauce", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "8 to 12 servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "appetizer, main course, peanut butter, scallops", "aggregateRating": null, "recipeIngredient": ["24 small bamboo skewers", "1 tablespoon soy sauce", "3 1/2 tablespoons Thai fish sauce", "4 tablespoons rice vinegar", "2 tablespoons chili oil, or to taste", "48 Peconic or Nantucket Bay scallops, about 1 pound", "1 small sweet red pepper", "4 tablespoons smooth unsalted peanut butter", "3 tablespoons orange juice", "Hot red pepper flakes to taste", "1 tablespoon finely minced scallions", "1 tablespoon finely minced fresh ciltantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the skewers in cold water to cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the soy sauce, a tablespoon and a half of the fish sauce, three tablespoons of the vinegar and a tablespoon of the chili oil in a bowl. Add the scallops, mix to combine, cover and allow the scallops to marinate one to three hours. Refrigerate them if they will be marinating more than an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the red pepper into strips about an inch wide, then cut into squares. Make 24 squares."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a small nonstick skillet, add the pepper squares and sear, tossing briefly about five minutes, just until the pepper squares begin to soften. Remove from the heat and set peppers aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile beat the peanut butter and orange juice together until well blended. Stir in the remaining fish sauce, vinegar and chili oil. Season to taste with hot red pepper flakes. Stir in the scallions and cilantro. Transfer to a small serving dish appropriate for a dip and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, thread two scallops on each of the skewers with a pepper square between them. Be sure the food on the skewers is placed close to the pointed end of the skewer so guests can easily bite the scallops and peppers off the skewers without having to imitate a sword swallower."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a grill or broiler. Grill or broil the skewers close to the source of heat until seared. Arrange the skewers on a serving platter and place the dish of peanut sauce in the middle or alongside. Pass as hors d'oeuvres with cocktails."}]}