{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Sea Bass Stuffed With Shellfish", "description": "Ask your fishmonger to debone and butterfly the fish for stuffing, keeping the head and tail attached. If wild striped bass or branzino is not available, any meaty, white-fleshed fish may be substituted.", "author": {"@type": "Person", "name": "Paul Greenberg"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Baked-Sea-Bass/Baked-Sea-Bass-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "Serves 10", "recipeCuisine": "", "recipeCategory": "", "keywords": "main course, sea bass, seafood, shellfish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 555, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "1 gram", "proteinContent": "57 grams", "saturatedFatContent": "5 grams", "sodiumContent": "935 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["18 littleneck clams", "18 mussels", "* cup white wine", "7 medium shrimp, shells and veins removed", "3 cloves garlic, lightly smashed", "1 medium onion, very thinly sliced", "3 tablespoons chopped parsley", "Juice of 1 1/2 lemons", "* cup extra-virgin olive oil", "1/2 cup plain dry bread crumbs", "Salt and freshly ground black pepper", "1 whole wild striped bass (about 6 pounds) or 3 whole branzini (about 2 pounds each)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a rack in the upper third of the oven. Preheat it to 475 degrees. Soak the clams and mussels for 5 minutes in a large bowl of cold water. Scrub the shells using a stiff brush. Drain. Discard any shellfish that don't shut when tapped. Pull away fibers from the mussels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the clams, mussels and wine in a large pot, cover and set over high heat. Shake the pan occasionally and remove the shellfish as soon as their shells open. Shell the clams and mussels and place their meat in a bowl. Strain the juices through a paper-towel-lined fine sieve and into the bowl of shellfish. Let soak for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the shellfish to a large bowl. Set the juices aside. Pat the shrimp dry, chop theminto bite-size pieces and add to the bowl of shellfish along with the garlic, onion, parsley, lemon juice, olive oil and bread crumbs. Season all over with salt and pepper and toss gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with 2 layers of foil, extending double the length of the pan. Pour some of the shellfish juices on the bottom of the pan and place the fish in the center. Season the inside of the fish with salt and pepper. Stuff it with the shellfish mixture. Moisten the skin side of the fish with some of the remaining shellfish juices. Fold the foil over the fish, crimping the edges to tightly seal it. In the upper third of the oven, roast the striped bass for about 40 to 45 minutes (or the small branzini for 15 to 20 minutes). Let rest for 10 minutes. Cut open the pouch. Remove the fins. Slice the fish across as you would a roast. Top each slice with some of the juices."}]}