{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Tomato Chowchow", "description": "Here is a chunky relish of cabbage and bell pepper commonly served in the South with salty cold cuts and meats. It couldn’t be simpler: simmer chopped vegetables for 15 minutes in a spiced brine — we use judicious amounts of clove, allspice, cinnamon and toasted coriander — and pack into jars. We tip the balance more toward green tomato than cabbage when green tomatoes are available because we love the tomatillo-like flavor of a green tomato — a near-apple flavor, but without the sweetness. It’s a delicious substitute for any relish you would spread over a hot dog or a burger, but we take it in other directions, too. Mixed one-to-one with good mayonnaise, green tomato chowchow makes the perfect dressing for coleslaw. Sometimes we’ll strain out the brine before we add the mayonnaise to make a killer tartar sauce. Or if we’re feeling indulgent, we’ll drain the chowchow, toss it with squid or small bay scallops and flood it with a fruity extra virgin olive oil for easy mock-ceviche.", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": "https://static01.nyt.com/images/2014/05/13/dining/chowchow-still/chowchow-still-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 quarts", "recipeCuisine": "southern", "recipeCategory": "condiments", "keywords": "cabbage, tomato, side dish, summer, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 44, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "186 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 whole allspice berries", "1 teaspoon celery seed", "1 teaspoon ground cinnamon", "1 teaspoon coriander seed, toasted", "2 teaspoons ground turmeric", "1 tablespoon kosher salt", "1 teaspoon freshly ground black pepper", "1 quart apple cider vinegar", "1 cup light brown sugar", "3 cups green cabbage, cut into small dice (from 1/2 pound green cabbage)", "3 cups Spanish onion, cut into small dice (from 1 1/4 pounds Spanish onions)", "2 cups red bell pepper, cut into small dice (from 3/4 pounds red bell peppers)", "6 cups green tomatoes, cut into small dice (from 2 1/4 pounds green tomatoes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pound the dry seasonings together in a mortar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring vinegar, sugar, and 2/3 cup water to a boil in a large stockpot, stirring to dissolve sugar. Add spices, reduce heat to low and simmer 10 minutes. Add cabbage, onion and bell pepper, return to a simmer and cook 5 minutes. Add the green tomato, stir thoroughly to incorporate, and cook 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a slotted spoon, transfer the relish to 2 quart jars or 4 pint jars. Fill to 1/4-inch from rim with remaining brine, agitate jars, and let stand 1 minute. Top up with brine, close jars and let them cool. Store jars in refrigerator up to 2 weeks."}], "link": "https://cooking.nytimes.com/recipes/11487-green-tomato-chowchow"}