{"@context": "http://schema.org", "@type": "Recipe", "name": "Sour Cream Ice Cream With Brown Sugar Strawberry Swirl", "description": "Wait to make this until good strawberries are available, because this fool-proof method lets their flavor and texture really shine through. Tangy from the sour cream, this is imbued with a caramel-tinged brown sugar sauce, and the ice cream itself has a soft but not runny texture. Think Mister Softee meets artisanal.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/28/dining/sourcreamicecream-still/sourcreamicecream-still-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 1 quart", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, sour cream, strawberry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 173, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "6 grams", "sodiumContent": "37 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["1 cup granulated sugar", "1 cup heavy cream", "1/2 cup whole milk", "9 egg yolks", "1 1/2 cups sour cream", "2 teaspoons vanilla extract", "Pinch salt", "1 quart fresh strawberries, hulled and chopped into 1/4-inch pieces", "3 tablespoons light or dark brown sugar", "1 tablespoon brandy"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size heavy saucepan, combine 1/2 cup granulated sugar with cream and milk. Bring to a simmer; turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together egg yolks and remaining 1/2 cup granulated sugar. Whisking constantly, slowly add about half (a cup or so) of hot cream mixture to yolks. Pour yolk mixture into saucepan with remaining cream. Cook, stirring constantly, over moderately low heat until mixture thickens enough to coat back of a spoon, about 7 minutes: do not let it come to a simmer or it will curdle. Immediately strain custard into a clean bowl. Whisk in sour cream, vanilla and salt. Cover custard tightly with plastic wrap and chill at least 3 hours or up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About an hour before you want to serve ice cream, combine strawberries and brown sugar in a bowl for 15 minutes. Transfer berries and accumulated juices to a skillet and bring just to a simmer. Remove from heat and stir in brandy. Use a slotted spoon to transfer berries to a bowl. Simmer juices in skillet until syrupy, about 5 minutes. Pour syrup over strawberries. Chill mixture in freezer until thoroughly cool but not frozen (15 to 30 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Churn custard in an ice cream machine according to manufacturer's directions. When ice cream has reached a soft-serve consistency, transfer to a bowl and swirl in the strawberry mixture with a quick folding action (you want to see red and white swirls, not pink). Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11490-sour-cream-ice-cream-with-brown-sugar-strawberry-swirl"}