{"@context": "http://schema.org", "@type": "Recipe", "name": "Onion Phyllo Pie", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "main course, side dish, onion, phyllo, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "7 grams", "proteinContent": "7 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1030 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["4 large sweet onions", "2 large red onions", "1/2 cup peanut oil", "1 large hot red chili, seeded and finely chopped", "Grated zest of 3 limes", "1 stalk lemongrass, trimmed and finely chopped", "3/4 cup flaked unsweetened coconut", "Salt and freshly ground black pepper to taste", "2 tablespoons light soy sauce", "10 to 14 sheets phyllo dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel all the onions and cut in half lengthwise. Thinly slice them lengthwise so that many pieces stay together at the root end."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons of the oil in a skillet over medium heat and add the onions. Cook until wilted, about 7 minutes. Add the chili, lime zest and lemongrass and sauté until the onions are tender but not mushy, 15 to 20 minutes. Remove from the heat and stir in the coconut. Season with salt and pepper and cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Blend the remaining oil and the soy sauce and brush some over the inside of an 8-inch pie plate. Place a sheet of phyllo over the plate and press lightly to line the bottom and sides. Brush with the oil-soy sauce mixture. Place another sheet of phyllo on top of the first one at an angle and brush with the oil-soy sauce mixture. Continue, using enough phyllo to cover the sides of the plate without any gaps, saving 2 sheets for the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the onion mixture into the pastry shell and fold the pastry over the filling. Brush with the oil-soy sauce mixture. Fold 1 sheet of phyllo in half and place it on top, crimping and tucking it in on the sides. Brush with the oil-soy sauce mixture. Repeat with the last sheet of pastry. Score the top in a diamond pattern with a sharp knife and bake until golden brown, about 30 minutes. Cool slightly."}], "link": "https://cooking.nytimes.com/recipes/11496-onion-phyllo-pie"}