{"@context": "http://schema.org", "@type": "Recipe", "name": "Herbed Cordoncini", "description": "", "author": {"@type": "Person", "name": "Corby Kummer"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Six to eight servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "mushroom, potato, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 334, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "7 grams", "sodiumContent": "410 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 ounce dried porcini (boletus) mushrooms", "2 pounds Idaho baking potatoes", "2 teaspoons salt", "Fresh herbs, leaves only and loosely packed: 1/2 cup parsley; 1/3 cup basil; 1/4 cup oregano; 1/4 cup mint; 1/4 cup rosemary; 2 tablespoons sage; 1 tablespoon thyme", "3 cloves garlic, peeled, with central stem removed", "4 tablespoons butter", "1 tablespoon minced shallots", "1 teaspoon white pepper", "2 cups all-purpose flour", "3/4 cup grated Parmigiano-Reggiano cheese", "3 egg yolks, lightly beaten", "Corn starch or potato starch for dusting", "Melted butter and freshly grated cheese, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the porcini in warm water to cover for five to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot, cover the washed but unpeeled potatoes in cold water and add one teaspoon of the salt. Boil for 30 to 45 minutes, until the potatoes are quite soft. As soon as they are done, drain and peel them and force them through a ricer or sieve while still hot. Set the potatoes on a plate or baking sheet to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are boiling, chop together the herbs and garlic until they are finely minced. There should be half a cup to a cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the porcini, reserving the liquid for another use, if desired. Rinse the pieces lightly until no dirt remains. Chop the mushrooms finely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a frying pan, melt the butter. Add the shallots and sautee for one minute or until translucent. Add the porcini and sautee until soft, about two or three minutes. Turn off the heat and stir in the herbs. Allow the mixture to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the potatoes are cool, place them on a clean counter or board and spread out into a layer about half-an-inch thick. Separate them with the fingertips; they should be floury and dry, with no large clumps. Sprinkle with the other teaspoon of salt, the white pepper, flour and cheese. Mix with fingertips, without kneading, keeping the mixture powdery."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the herb mixture and egg yolks evenly over the potatoes. Knead to mix all ingredients, applying as little pressure as possible to avoid a gummy texture when cooked. Form a rectangle about seven-by-nine inches, and about one-half-inch high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the potato dough into one-half-inch strips and roll each strip lightly to form logs. Cut the logs into half-inch lengths and roll them lightly in corn starch or potato starch. To form cordoncini, cup one hand to make a well and roll the dough with a back and forth motion between the hands into two-inch-long tapered cords. Repeat with all the pieces. Dust the cordoncini with more starch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook as soon as possible - the cordoncini will keep soft for several hours - in abundant boiling salted water. The cordoncini are done when they float to the surface, in about one or two minutes. Lift them out with slotted spoon or strainer. Toss with butter and freshly grated cheese and serve."}], "link": "https://cooking.nytimes.com/recipes/11510-herbed-cordoncini"}