{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple Crema", "description": "If you can start with truly natural dairy — definitely not ultrapasteurized and ideally bought from a farm or a farmers’ market— you are really ahead of the game. The reason I fell in love with this maple crema is that all the flavors were so pure that the maple syrup shone like a star.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/11/dining/crema-still/crema-still-articleLarge.jpg", "totalTime": "PT5H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, gluten-free, heavy cream, maple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 464, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": null, "proteinContent": "4 grams", "saturatedFatContent": "15 grams", "sodiumContent": "59 milligrams", "sugarContent": "51 grams", "transFatContent": null}, "recipeIngredient": ["2 cups pure maple syrup", "2 cups heavy cream", "1/2 cup whole milk", "6 large egg yolks", "2 teaspoons granulated sugar", "Pinch kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Put syrup in 4-quart saucepan and bring to a boil. (Use a large saucepan, syrup will bubble up quite high.) Lower heat to simmer and cook until reduced by about two thirds, 15 to 20 minutes. (Syrup is ready when a few drops on a chilled plate are very sticky when rubbed with your fingers.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and whisk in cream and milk. Return saucepan to heat and bring to low simmer. Meanwhile whisk yolks well with sugar and salt in large bowl. Remove maple cream from heat and let it cool for 5 minutes, then very slowly whisk it into the yolks. Strain through a chinois or fine-meshed sieve to remove any lumps of yolk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange 8 4-ounce ramekins or custard cups in a flat-bottomed roasting pan large enough to accommodate them with 3/4 inch of space in between the cups. Evenly divide the custard among the cups; do not fill to the top. Carefully add enough hot tap water to roasting pan to come a third of the way up sides of cups. Cover roasting pan with foil, tenting it slightly so that foil does not touch top of custards."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pan on middle rack of oven and bake for 35 minutes; rotate pan, then bake another 15 minutes and check for doneness. The custards are done when the centers are set a bit, even jiggly like gelatin. Total baking time will be 50 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from oven, remove foil, and let custards cool in water bath until you can safely pick them up, then let them cool to room temperature. Refrigerate at least 4 hours, until thoroughly chilled."}], "link": "https://cooking.nytimes.com/recipes/11517-maple-crema"}