{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Chops Surprise", "description": "This dish, which was featured in The Sunday Times Magazine in 2006, is a fussy dish that takes time, but impresses with its creativity and depth of rich flavor. The result of hard work in the kitchen is revealed with panache at the table, when dinner guests open their steaming packets of parchment paper to find a perfectly cooked veal chop swathed in mushrooms, ham and shallots. Cue applause!", "author": {"@type": "Person", "name": "Julia Child"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/Veal/Veal-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 487, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "28 grams", "saturatedFatContent": "19 grams", "sodiumContent": "716 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["11 tablespoons unsalted butter", "2 large shallots, finely chopped", "10 ounces mushrooms, trimmed, rinsed, dried and finely diced", "Salt and freshly ground black pepper", "6 veal chops, trimmed, 6 ounces each", "2 tablespoons vegetable oil", "12 thin slices cooked ham", "1 egg white, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons of the butter in a large skillet over low heat. Add the shallots and sauté until softened. Increase the heat to high and add the mushrooms. Season with salt and pepper. Sauté until all the moisture has evaporated, then spread the mixture on a plate to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Season both sides of the chops with salt and pepper. Heat the oil and 1 tablespoon of the butter in a large skillet over high heat. Add the chops and brown lightly on both sides. Transfer to paper towels to drain, and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut six 12-by-10-inch rectangles of parchment paper. Melt the remaining 7 tablespoons butter. Position a rectangle of parchment so that the 10-inch side is directly in front of you. Brush with butter, and place a tablespoon of the mushroom mixture in the middle of the lower half of the rectangle. Top with a slice of ham, topped with a veal chop. Cover the veal with another slice of ham and another tablespoon of mushrooms. Repeat with the remaining pieces of parchment paper, veal chops, mushrooms and ham."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a 1/4 -inch border of egg white along the 3 edges of the lower half of the rectangles. Fold the upper half of the rectangle over the veal, and align the edges. Again brush the 3 edges with egg white, then fold and crimp the edges to make a strong seal. Continue until all six chops are encased in parchment. Brush the surface of the parchment with the remaining melted butter, and brush the crimped edges again with egg white. Lay the veal packets on a baking sheet and bake until the packets are puffed and brown, about 15 minutes. Transfer each packet to a plate to be opened at the table."}], "link": "https://cooking.nytimes.com/recipes/11526-veal-chops-surprise"}