{"@context": "http://schema.org", "@type": "Recipe", "name": "Poached Lamb With Garlic", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT40M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "gluten-free, lamb, main course", "aggregateRating": null, "recipeIngredient": ["5 pounds lamb, shoulder or leg; trimmed, boned and rolled", "2 whole bulbs garlic, the cloves separated, peeled and smashed", "1 cup chicken broth, prepared by any standard recipe, or canned chicken broth", "1 cup heavy cream", "1 tablespoon cornstarch dissolved in 2 tablespoons cold water", "1 1/2 teaspoons kosher salt (add less if using canned broth)", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lamb, fat side up, in a 2-quart round or oval souffle dish with sides at least 2 1/2 inches deep. Sprinkle garlic cloves around and under the lamb. Pour the broth and cream over all. Cover tightly with microwave plastic wrap. Cook at 100 percent power for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pierce the plastic with the tip of a small knife to release steam, then uncover carefully. Turn the lamb over, re-cover, and cook 15 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lamb from the oven, pierce the plastic, and uncover. Place the lamb on a platter, and cover with plastic wrap. Let stand for 15 minutes while you prepare the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the cooking liquid and garlic into the bowl of a food processor, and puree until smooth. Pour back into cooking dish. Stir in the cornstarch mixture. Cook, uncovered, in the microwave oven for 5 minutes. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the lamb 1/4 to 1/2 inch thick. Pour the sauce onto a platter, and arange the lamb on top. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/11522-poached-lamb-with-garlic"}