{"@context": "http://schema.org", "@type": "Recipe", "name": "Potage A La Reine", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Six servings", "recipeCuisine": "french", "recipeCategory": "dinner, soups and stews", "keywords": "appetizer, main course, chicken", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 651, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "2 grams", "proteinContent": "35 grams", "saturatedFatContent": "22 grams", "sodiumContent": "858 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 chicken (about 2 1/2 to 3 pounds)", "1/2 teaspoon dried thyme", "2 bay leaves", "1 1/2 teaspoons salt", "1 leek, root end and damaged and wilted leaves removed and discarded, remainder julienned", "3 carrots, peeled and julienned", "2 ribs celery, preferably the white inner ribs, julienned", "6 large mushrooms, thinly sliced", "1/2 teaspoon salt", "2 chicken bouillon cubes", "3 tablespoons unsalted butter", "6 tablespoons all-purpose flour", "1 teaspoon freshly ground black pepper", "1 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken in a narrow, stainless-steel stockpot. Add enough water to cover the chicken, then add the thyme, bay leaves, and 1 1/2 teaspoons salt, and bring to a boil. Immediately reduce the heat and boil gently, covered, for 10 minutes. Let the chicken cool in the stock, still covered, for about 1 hour, or until lukewarm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain 3 cups of the stock from around the chicken and place it in a saucepan. Add the leek and bring the stock to a boil. Boil gently for 5 minutes. Add the carrots and celery, and bring the stock back to the boil. Boil gently for 3 minutes. Add the mushrooms and the 1/2 teaspoon salt, and boil gently for an additional 3 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the remaining stock. Peel off and discard the skin. Pick the meat from the bones and shred it into 1-inch pieces. Line a colander with dampened paper towels and strain the stock through the towels. Skim the fat from the surface of the stock (you should have 7 cups). If you have too much stock, boil to reduce it to 7 cups; if you have too little stock, add enough water to bring it to 7 cups. Add the bouillon cubes to strengthen the stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add the vegetable garnishes with their cooking juices and the shredded chicken. Reheat gently to a boil. Divide among six large bowls or soup plates, and serve immediately."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To make the veloute:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a sturdy saucepan melt the butter. Whisk in the flour and cook for 10 seconds. Add half of the remaining stock (3 1/2 cups) and mix well with a whisk. Bring to a boil, whisking occasionally, to form a smooth mixture. Add the rest of the stock and the pepper and return the mixture to a boil. If any lumps remain, strain the soup and return it to a clean saucepan. Add the cream and bring the mixture to a boil. Remove from heat."}]}], "link": "https://cooking.nytimes.com/recipes/11565-potage-a-la-reine"}