{"@context": "http://schema.org", "@type": "Recipe", "name": "Vietnamese Summer Rolls", "description": "If you have ever considered making a Vietnamese summer roll, you may have been intimidated by the process. But these delicious rolls are not at all difficult. I learned my summer roll technique from a native of France. I learned three things: Rice paper is very forgiving; don’t overstuff; and the more you make, the easier it gets. The rolls include rice vermicelli, lettuce, shredded carrots, a variety of herbs (the best combination is basil, mint and cilantro), and pork or shrimp or both. I would consider only the herbs truly sacred, but substitutions would work elsewhere: hard-cooked egg or tofu for the pork or shrimp, shredded daikon or anything else crunchy for the carrots, chopped greens for the lettuce, any pasta for the noodles.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/Vietnamese/Vietnamese-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "16 rolls", "recipeCuisine": "vietnamese", "recipeCategory": "", "keywords": "appetizer, side dish, gluten-free, rice noodles, rice paper, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 303}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 367, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "861 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["16 6-inch rounds rice paper", "8 leaves lettuce, washed, dried and torn or chopped", "2 cups cooked rice vermicelli, rinsed and drained", "1 cup shredded peeled carrots", "1/2 cup fresh mint leaves", "1/2 cup fresh Thai basil leaves", "1/2 cup fresh cilantro leaves", "32 slices cooked pork or 32 poached or grilled shrimp, split lengthwise in half, or use half pork and half shrimp", "1/2 cup fish sauce", "1 tablespoon sugar, or to taste", "1 tablespoon peeled and minced fresh ginger", "1 teaspoon Vietnamese chili-garlic paste, or to taste, or chopped fresh chilies to taste", "Salt and black pepper to taste", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip a sheet of rice paper a third of the way into a bowl of hot water for about 2 seconds. Turn it and dip remaining section, then lay on a damp towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on bottom third of rice paper, spread a bit of lettuce, noodles, carrots, herbs and pork and/or shrimp. Fold up bottom edge to cover, then fold in the sides. Roll tightly. Continue with remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine fish sauce, sugar, ginger, chili-garlic paste and about 1/4 cup water. Taste and adjust seasoning, adding salt and pepper if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve rolls right away, or refrigerate, lightly covered, up to 2 hours. Cut each roll into 2 or 3 pieces, then serve with dipping sauce and lime wedges."}], "link": "https://cooking.nytimes.com/recipes/11573-vietnamese-summer-rolls"}