{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised And Grilled Breast Of Lamb", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H", "recipeYield": "3 - 4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "lamb, main course", "aggregateRating": null, "recipeIngredient": ["1 breast of lamb", "5 tablespoons olive oil", "1 carrot, peeled and chopped", "1 rib celery, chopped", "1 small onion, chopped", "2 cloves garlic, crushed", "3 sprigs parsley", "1 sprig thyme", "1 bay leaf", "6 peppercorns", "1/2 cup dry white wine", "5 to 6 cups chicken stock or white veal stock", "2 tablespoons white wine vinegar", "1 tablespoon finely chopped Nicoise black olives", "1 tablespoon minced red onion", "1 teaspoon minced fresh chives", "1 tablespoon minced sweet red pepper", "1 bunch mache, rinsed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before you are planning to serve the lamb, trim all surface fat from it. Select a heavy oven-proof skillet large enough to hold it. Preheat the oven to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat three tablespoons of the oil in the skillet. Add the carrot, celery, onion, garlic and parsley and saute until the vegetables begin to brown. Remove the vegetables from the pan, add the lamb and cook on both sides until it is lightly browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the vegetables to the pan along with the thyme, bay leaf, peppercorns, wine and stock. Cover and place in the oven for about two-and-a-half hours, until the meat is very tender when pierced with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lamb from the skillet and immediately pull out the bones. They should slip out easily. Place the lamb on a baking sheet lined with parchment paper, cover with another piece of parchment paper and weight with a board or a dish topped with a few tin cans. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the cooking liquid down until it is reduced to about two cups, then strain and degrease it. You will need a third of a cup of this liquid; the rest can be frozen for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the one-third cup of lamb liquid with the remaining ingredients except for the mache to make a sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut the lamb into squares, strips or triangles. Broil or grill the pieces of lamb on each side until warmed and lightly seared. Serve with some of the leaves of mache on the side and drizzle the sauce on top."}]}