{"@context": "http://schema.org", "@type": "Recipe", "name": "Baklava of Banana", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT55M", "recipeYield": "8 servings", "recipeCuisine": "greek", "recipeCategory": "", "keywords": "banana, phyllo, dessert", "aggregateRating": null, "recipeIngredient": ["10 sheets phyllo", "1/4 pound unsalted butter, melted", "1 cup sugar", "<a href=\"http://cooking.nytimes.com/recipes/11580-banana-filling\">Banana filling</a>", "<a href=\"http://cooking.nytimes.com/recipes/11581-caramel-sauce\">Caramel sauce</a>", "Confectioners' sugar for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Open package of phyllo and cover with damp cloth to keep the sheets from drying out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange one sheet of phyllo on wax-paper- or parchment-lined cookie sheet. Brush with butter, using a small paint brush and sprinkle with 2 to 3 tablespoons of sugar. Repeat with two more sheets of phyllo and repeat buttering and sugaring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a 3-inch circle (cup, glass, cookie-cutter) and a knife, cut out 15 circles from the three layers. Remove the excess dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat steps 3 and 4 so that you have 24 three-layered circles in all. Discard the excess circles and dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tops, cut four sheets of phyllo in half and butter lightly. Crunch up into a ball, but do not squeeze or press. Sprinkle with sugar and arrange on wax-paper or parchment-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the circles and the tops at 350 degrees for about 8 to 10 minutes. But watch the circles very carefully; the sugar can burn quickly. After 5 minutes check and turn if oven does not bake evenly. The sugar must melt and the dough turn brown. Allow to cool before removing from cookie sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "These may be made a day ahead and let sit at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, combine banana filling with caramel sauce and stir to mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all the circles in a row and cover each one with a heaping tablespoon of the banana filling. Even out the filling slightly before stacking the circles, three for each dessert, covered with one of the tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For each serving, on a large dessert plate spoon three tablespoons of warm caramel sauce. Arrange one of the baklava in the center and dust with confectioners' sugar."}], "link": "https://cooking.nytimes.com/recipes/11579-baklava-of-banana"}