{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Puttanesca", "description": "There are almost as many explanations for the origins of pasta puttanesca as there are ways to make it. Ostensibly a sauce invented and made by prostitutes, it was designed to lure customers with its powerful aroma. Whatever the origin, no better cold-weather pasta sauce has come down to us. Puttanesca can be made completely with ingredients from the larder; in fact, it can be prepared entirely without ingredients that require refrigeration, though a bit of a fresh herb at the end does help. The basis is a garlicky tomato sauce; canned tomatoes are preferable here. This is brought to a high level of flavor by the addition of anchovies, capers and olives. Red pepper flakes make things even better. The whole process is ridiculously easy.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/08/15/dining/15COOKING-PASTA/15COOKING-PASTA-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "3 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "appetizer, main course, pasta, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1920}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 384, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "539 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["Salt to taste", "3 tablespoons olive oil", "3 or more cloves garlic, lightly smashed and peeled", "3 or more anchovy fillets", "1 28-ounce can whole plum tomatoes", "Freshly ground black pepper to taste", "1/2 cup pitted black olives, preferably oil-cured", "2 tablespoons capers", "Crushed red pepper flakes to taste", "1 pound linguine or other long pasta", "Chopped fresh parsley, oregano, marjoram or basil leaves for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring pot of water to boil and salt it. Warm 2 tablespoons oil with garlic and anchovies in skillet over medium-low heat. Cook, stirring occasionally, until garlic is lightly golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain tomatoes and crush with fork or hands. Add to skillet, with some salt and pepper. Raise heat to medium-high and cook, stirring occasionally, until tomatoes break down and mixture becomes saucy, about 10 minutes. Stir in olives, capers and red pepper flakes, and continue to simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook pasta, stirring occasionally, until it is tender but not mushy. Drain quickly and toss with sauce and remaining tablespoon of oil. Taste and adjust seasonings as necessary, garnish with herbs if you like, and serve."}]}