{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled-Zucchini Terrine With Niçoise Olives and Herbs", "description": "", "author": {"@type": "Person", "name": "Daniel Patterson"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/Terrine/Terrine-articleLarge.jpg", "totalTime": "PT6H30M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, olives, zucchini, summer, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 176, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "457 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["3 pounds zucchini (each about 6 inches long)", "Olive oil, for grilling", "Salt and freshly ground black pepper", "3 tablespoons finely chopped niçoise olives", "1/4 cup chopped basil", "2 tablespoons minced chives", "2 tablespoons chopped parsley", "2 tablespoons chopped tarragon", "1/2 cup mayonnaise", "1/2 teaspoon sherry vinegar", "1 tablespoon extra-virgin olive oil", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the terrines: Using a mandoline or chef's knife, slice the zucchini lengthwise into â-inch-thick strips, discarding the outside pieces that are mostly skin. Lay the zucchini slices side by side on 2 large baking pans, and drizzle with olive oil. Season with salt and black pepper, and cook each directly on a grill, griddle or cast-iron pan, over high heat, for about 1 minute per side, browning them but taking care not to overcook. Transfer to the baking sheets and let cool side by side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix the olives and herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 (5 ¾ by-3 ¼ by-2 ¼ -inch) loaf pans with plastic wrap, letting some plastic hang over the sides. Lay the zucchini slices side by side to form the bottom layer. (The zucchini will vary in width; you may need 2 or 3.) Overlap zucchini as necessary and trim long pieces to fit the mold. Sprinkle lightly with the olive-herb mixture, then put another layer of zucchini down. Repeat until the terrine is four-fifths full. No need to be perfect; every so often press the zucchini down to level it. Fold the extra plastic over the top of the terrine. Repeat with the second loaf pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the terrines on top of a rimmed baking pan (to catch any excess liquid), and put an empty loaf pan of the same size on top of each terrine. Put another baking pan of the same size on top, and then a weight (about as heavy as a gallon of milk) on top of that. Refrigerate for at least 6 hours, or preferably overnight, so that the flavors meld."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: Remove the terrines from the pans, drain and reserve the excess liquid and unmold onto a cutting board. In a small bowl, combine the mayonnaise, 1 1/2 tablespoons reserved zucchini liquid and the vinegar. Whisk in the olive oil. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the terrines into 3/4-inch-thick slices and serve with the sauce."}], "link": "https://cooking.nytimes.com/recipes/11592-grilled-zucchini-terrine-with-nicoise-olives-and-herbs"}