{"@context": "http://schema.org", "@type": "Recipe", "name": "Fig Brochettes With Tapioca Cream", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, eggs, figs, tapioca, gluten-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "5 grams", "sodiumContent": "82 milligrams", "sugarContent": "32 grams", "transFatContent": null}, "recipeIngredient": ["8 cups milk", "5 cinnamon sticks, broken into pieces", "13 large egg yolks", "6 tablespoons lightly packed light brown sugar, plus more for dusting the figs", "1/4 cup quick-cooking tapioca", "24 black mission figs, halved", "24 whole cinnamon sticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, combine 4 cups of the milk and the cinnamon-stick pieces. Over medium-high heat, bring the milk just to a boil, remove from the heat, cover and allow to infuse for 10 minutes. Strain the mixture through a fine sieve, discard the cinnamon and return the milk to the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the yolks and the sugar until thick and light-colored. Gradually whisk the hot milk into the yolk mixture. Return to the pan and cook over medium heat, stirring constantly with a wooden spoon until the mixture is slightly thickened and just coats the back of the spoon, about 15 to 20 minutes. (Do not allow it to boil.) Immediately remove from the heat and strain into a large, clean bowl. Cover with plastic wrap and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan over medium-high heat, bring the remaining 4 cups of milk just to a boil. (If a skin forms on the milk, remove it with a spoon.) Sprinkle the tapioca over the milk and cook, stirring, until the mixture is thick and the tapioca pearls are translucent, about 15 to 20 minutes. Remove from the heat, cover and refrigerate. When chilled, combine with the custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Skewer 2 fig halves on each cinnamon stick and place on a baking sheet. Sprinkle them with brown sugar and broil until the sugar is caramelized. Spoon the tapioca cream into serving dishes and top each with two warm brochettes."}]}