{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato ‘Tostones’", "description": "As enjoyable as pounding the lights out of an innocent garlic clove or olive may be, probably the most satisfying flat food to prepare is Susan Spungen’s potato “tostones.” You steam baby potatoes until they’re just tender, let them cool enough to be handled, then press them between your palms until they flatten a bit and you hear their skins begin to snap. Next, you heat up some oil in a skillet and fry the potatoes until they’re nice and brown on their flat sides. Each potato is then crisp and caramelized but still moist inside.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2015/03/18/dining/potato-tostones/potato-tostones-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "gluten-free, vegan, vegetarian, potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 487}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 135, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "356 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 pounds small potatoes (about 20), like Yukon gold", "1 teaspoon kosher salt", "Olive oil", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a steamer basket in a large pot filled with an inch of water and add the potatoes and salt. Cover and bring to a boil over medium heat. Steam until the potatoes are just tender when pierced with a paring knife, about 25 minutes. (Don't overcook: they won't hold together when flattened.) Remove the basket and let the potatoes cool enough to be handled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently squeeze the potatoes, one at a time, between your palms so that they flatten slightly but remain in one piece (some will break, but they can still be used). Pour 1/4 inch of oil into a medium frying pan set over medium-high heat. Add the potatoes in batches to avoid crowding, and fry on both sides until crisp and browned, 2 to 3 minutes per side. Drain on a plate lined with paper towels. Arrange on a platter and sprinkle with sea salt."}], "link": "https://cooking.nytimes.com/recipes/11656-potato-tostones"}