{"@context": "http://schema.org", "@type": "Recipe", "name": "Tarte au Sucre", "description": "More than 75 percent of the world’s maple-syrup supply is produced in Quebec. In Canada the sap doesn’t start running until early March, when the nights are still freezing but the days are bright. Locals process the syrup in a cabane à sucre, or sugar shack, and harvest brings with it celebration, often with a multicourse meal that puts the maple syrup front and center in dishes like this tarte au sucre, or maple syrup pie.", "author": {"@type": "Person", "name": "Oliver Schwaner-Albright"}, "image": null, "totalTime": "PT45M", "recipeYield": "12 servings", "recipeCuisine": "canadian, french", "recipeCategory": "pies and tarts", "keywords": "butter, flour, maple syrup, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 197, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "6 grams", "sodiumContent": "67 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup flour", "1/4 teaspoon salt", "1 teaspoon sugar", "5 tablespoons butter, cubed", "3 tablespoons ice water", "2 eggs", "1 tablespoon flour", "1/2 cup heavy cream", "1 cup maple syrup, preferably medium dark", "Crème fraîche, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Make the crust by combining the flour, salt and sugar in a large bowl. Cut the butter into the flour with a fork or pastry blender until the mixture is the texture of coarse meal. Sprinkle a tablespoon of ice water at a time over the dough, lifting and tossing it with the fork. When it begins to come together, gather the dough, press it into a ball and then pull it apart. If it crumbles in your hands, it needs more water. Add a teaspoon or two more water, as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flatten the ball of dough and roll between two sheets of plastic wrap into a circle 10 inches in diameter. Remove the plastic and lay the dough into a 9-inch tart pan, press into place and remove excess dough. Place in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling by beating the eggs in a bowl. Gradually whisk in the flour. Add the cream and maple syrup and whisk until combined. Pour into the crust-lined pan. Cook until the middle still jiggles but is solid, 25 to 30 minutes. Serve with créme fraîche."}], "link": "https://cooking.nytimes.com/recipes/11668-tarte-au-sucre"}