{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple-Roasted Rack of Venison", "description": "At a cabane à sucre, or sugar shack, a rough-hewn cabin for making syrup in Quebec, the syrup harvest is accompanied by a feast. The hourlong parade usually includes split-pea soup, pancakes, bacon and ham, pork rinds, omelets, eggs poached in syrup, baked beans, bread and pan drippings, pickled carrots and beets, maple-syrup pie and taffy — all washed down with an optional beer. This recipe comes from a feast held at the painter Marc Séguin's farm in Hemmingford, Quebec.", "author": {"@type": "Person", "name": "Oliver Schwaner-Albright"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "canadian, french", "recipeCategory": "dinner, one pot, roasts", "keywords": "fall, gluten-free, main course, maple syrup, venison", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 774, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "8 grams", "proteinContent": "77 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1715 milligrams", "sugarContent": "52 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 4-pound rack of venison, trimmed (see note)", "Salt and freshly ground black pepper", "Olive oil", "1 1/2 cups maple syrup", "2 1/2 cups veal stock (see note)", "6 sprigs thyme", "1 bay leaf", "8 peppercorns", "2 cloves garlic, peeled", "2 tablespoons butter", "5 large carrots, peeled and chopped", "20 small boiler onions, peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Season venison generously with salt and pepper, rub with a little olive oil and let rest at room temperature. Meanwhile, in a medium saucepan, combine the maple syrup, veal stock, thyme, bay leaf, peppercorns and garlic. Gently boil until reduced by half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a roasting pan over medium-high heat and add the butter. When hot, brown the rack on all sides, then transfer to a plate. Pour the maple-stock reduction into the roasting pan, scraping the brown bits on the bottom of the pan with a wooden spoon. Return the rack to the pan, meat-side up. Add the carrots and onions and season them with salt. Cook in the oven for 10 minutes, basting venison with sauce every 5 minutes. Flip venison and continue roasting until a thermometer inserted in the center registers 130 degrees, 10 to 20 minutes more (start checking the internal temperature after 10 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer rack to a cutting board and let rest for 10 minutes. If vegetables are fork-tender, transfer them to a serving platter. If not, put them in a saucepan. Strain the sauce into the saucepan and simmer until reduced to desired thickness or until the vegetables are tender. Season sauce to taste with salt and pepper. Slice the venison and serve with vegetables and sauce."}], "link": "https://cooking.nytimes.com/recipes/11667-maple-roasted-rack-of-venison"}