{"@context": "http://schema.org", "@type": "Recipe", "name": "Buche de Noel", "description": "", "author": {"@type": "Person", "name": "Corby Kummer"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, espresso, hazelnut, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 480, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "14 grams", "sodiumContent": "114 milligrams", "sugarContent": "18 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Butter for greasing pan", "3/4 cup flour, sifted, plus enough for flouring pan", "1 cup (nearly 3 ounces) hazelnuts", "1/4 cup sugar, plus 1/3 cup", "6 extra-large eggs, separated, plus one egg white (total of 7 whites)", "Pinch of salt", "2 tablespoons melted unsalted butter", "5 yolks from extra-large eggs", "1/3 cup sugar", "1/4 cup water", "8 ounces (2 sticks) unsalted butter, at room temperature and cut into roughly half-inch cubes", "1 tablespoon instant espresso or instant coffee, dissolved in 1 tablespoon lukewarm water", "10 ounces marrons glaces or chestnuts in syrup", "Confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Lightly grease a 12-by-15-inch sheetcake or jelly-roll pan and line it with aluminum foil or baking parchment, leaving an overhang of about an inch on each end. Grease and lightly flour the foil or paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast hazelnuts in oven until they turn dark brown, about 7 minutes. If nuts are unblanched rub in a towel to remove skin. Let nuts cool; then grind until fine in a processor with 1/4 cup sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In bowl of an electric mixer, beat 6 egg yolks with remaining 1/3 cup sugar until pale and stiff, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean, dry copper bowl or the bowl of an electric mixer - or using a hand-held electric beater -whip 7 egg whites slowly until they start to foam. Increase speed to medium. When they are opaque white, add salt and beat at medium speed until stiff white peaks form, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Alternately fold the sifted flour, nuts and half the whites into yolks. The batter will be thick. When all components are incorporated, fold in remaining whites. Remove 1 cup of the mixture and stir the melted butter into it. Fold into the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread batter on prepared sheetcake or jelly-roll pan with a spatula, spreading evenly to corners and along sides; try not to deflate batter. Bake 5 to 6 minutes, until cake just springs back when pressed. It is better to underbake it slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cake from pan using the overhanging piece of foil or paper. Set on a counter or rack. Turn over onto another baking sheet and carefully peel off foil or paper. Turn over again onto a clean sheet of foil, and cover with towel. With an electric mixer whip the yolks at medium speed until pale, thick and creamy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, stir together sugar and water. Boil until you can form a soft ball with a bit of syrup dropped from a spoon into a bowl of cold water; it should register 242 degrees on a candy thermometer. This takes 3 to 4 minutes after the syrup comes to a boil. With mixer running, slowly pour the syrup in a thin stream into the center of the yolks. Beat at slow to medium speed until mixture is cool, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With mixer still running, slowly add the softened butter to the yolks and beat at low speed until completely smooth, about 5 minutes. If even after 5 minutes the cream still has small lumps, remove about a half-cup to a bowl and beat it over hot water until it is smooth; return to the mixer bowl and all of the cream should become smooth, with the consistency of creamed butter. (You can repeat this process several times.) Increase speed to medium and continue beating 10 minutes, until butter cream billows like whipped cream and shows large air holes when a spoon is run through it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat in dissolved coffee."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble buche, use a spatula to spread butter cream over the cake. The cream layer should be less than 1/4 inch thick. Crumble all but 3 marrons glaces over the butter cream. Using the foil as a support, roll up the cake by the long end to form a log shape. Trim ends."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To decorate, place a ruler over length of the log and sift confectioners' sugar over log. Remove ruler and arrange slices of reserved marrons glaces down the length. Transfer to a serving platter. Buche is best left at room temperature and served within 3 to 4 hours, but it can be refrigerated for a day."}], "link": "https://cooking.nytimes.com/recipes/1168-buche-de-noel"}