{"@context": "http://schema.org", "@type": "Recipe", "name": "Pamela Sherrid's Summer Pasta", "description": "Pamela Sherrid’s summer pasta, which The Times ran a recipe for in 1996, is a quintessential crossover dish: part tomatoes and warm pasta, part pasta salad and the best of both. It includes ripe summer tomatoes, garlic, olive oil, basil and cubes of fresh mozzarella. Ms. Sherrid’s recipe relies on prudent technique and a slacker’s sense of pace. First you combine the garlic, basil and oil and let the mixture macerate. A few hours later you add tomatoes and let it sit some more. Next, you pour the cooked rigatoni over the tomatoes, and cubes of mozzarella over the rigatoni. Then you gently mix the cheese into the pasta, coating it with a buttery veil of fat, before tossing it with the tomatoes at the bottom. If you have great tomatoes and mozzarella and you don’t overcook the pasta, it is a remarkably good dish. A puddle of sweet and salty tomato broth will form at the bottom of your bowl, so make sure you have some bread on hand to soak it up.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2017/08/22/dining/22COOKING-SHERRIDSUMMERPASTA1/22COOKING-SHERRIDSUMMERPASTA1-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "easy, lunch, pastas, salads and dressings", "keywords": "mozzarella, pasta, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 338}, "recipeIngredient": ["5 large cloves garlic, finely chopped", "1/2 to 1 cup of your favorite olive oil", "12 basil leaves", "7 large ripe tomatoes", "Salt", "1 pound dried rigatoni", "1 pound fresh, lightly salted mozzarella", "Country bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take out your largest bowl. Add the garlic. Pour in 1/2 cup olive oil. With scissors, snip the basil leaves into shreds over the garlic mixture. Let sit all day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 2 hours before serving, chop the tomatoes and add them to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you're ready to eat, bring a large pot of generously salted water to a boil. Add the pasta and cook until al dente. Meanwhile, cut the mozzarella into small cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta and pour it on top of the tomato mixture. Do not stir. Spread the mozzarella on top of the pasta and toss only the pasta and cheese; the cheese will soften slightly, and the pasta will get coated with fat. Then stir up from the bottom, incorporating the tomato mixture. Season with salt and add the remaining olive oil, if desired. Serve with bread."}], "link": "https://cooking.nytimes.com/recipes/11718-pamela-sherrids-summer-pasta"}