{"@context": "http://schema.org", "@type": "Recipe", "name": "Rustica", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H", "recipeYield": "4 small loaves", "recipeCuisine": "", "recipeCategory": "project", "keywords": "flour, poolish, side dish", "aggregateRating": null, "recipeIngredient": ["1 cup plus 6 tablespoons water just slightly warmer than room temperature", "3/4 cup poolish (<a href=\"http://cooking.nytimes.com/recipes/11720-poolish\">see recipe</a>)", "3/4 teaspoon cake yeast", "3 cups minus 2 tablespoons unbleached all-purpose flour", "2 tablespoons raw wheat germ", "1 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the water in a large mixing bowl. Break the poolish into small pieces with your hands or a wooden spoon and add it to the bowl along with the yeast. Stir until fairly dissolved. Stir in the flour, wheat germ and salt and stir until combined. Continue stirring for 5 minutes. Cover the bowl and let sit for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a lightly floured surface. Gently fold the dough in half lengthwise and then fold it in half again crosswise. Return the dough to the bowl with its smooth side up. Repeat the folding process 2 more times over the next 40 minutes. After the last turning, let the dough rest for 20 to 30 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently turn the dough out onto a lightly floured surface. Loosely form it into a square on the table, taking care not to deflate it. Using a knife or bench scraper, cut the dough into 4 equal squares. Gently move the pieces to a sheet pan lined with a well-floured heavy tea towel, and cover loosely with plastic wrap. Let rest until the dough just holds the imprint of your finger when you press it gently, 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees and have a plant sprayer full of fresh water ready. Very gently transfer the dough pieces to 2 sheet pans lined with parchment paper, putting the side of the dough that came in contact with the floured tea towel up and leaving plenty of space between the pieces. When the oven is hot, spray it thoroughly with water and immediately put the bread in and close the door. Spray the oven (not the bread) again 3 more times during the first 5 minutes of baking. Bake until the bread is golden brown and sounds hollow in the center when tapped, 15 to 20 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the loaves from the oven and cool them on a wire rack."}], "link": "https://cooking.nytimes.com/recipes/11722-rustica"}