{"@context": "http://schema.org", "@type": "Recipe", "name": "Baguettes", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H30M", "recipeYield": "3 loaves", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "flour, poolish, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 11}, "recipeIngredient": ["1 cup plus 1 tablespoon water at 85 degrees (just a little warmer than room temperature)", "2/3 cup poolish (see <a href='http://cooking.nytimes.com/recipes/11720'>recipe</a>)", "3/4 teaspoon crumbled cake yeast", "3 cups minus 2 tablespoons all-purpose flour", "1 3/4 teaspoons fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the water in a large mixing bowl. Break the poolish into small pieces with your hands or a wooden spoon and add it to the bowl along with the yeast. Stir until fairly dissolved. Add the flour and salt and stir until combined. Cover the bowl with a tea towel and set aside 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin kneading the bread; the dough will be sticky, but keep the surface and your hands only lightly floured and incorporate as little excess flour as possible. Knead for 10 minutes. Rinse out and dry the bowl and return dough to the bowl. Cover with the tea towel and leave at room temperature for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently turn the dough out onto a very lightly floured surface. Fold the dough in half and return it gently to the bowl. (Don't deflate it by punching or pressing on it.) Cover. Allow dough to rise 1 more hour, or until it holds the impression of your finger when lightly pressed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently turn the dough out again on a lightly floured surface. Cut dough into thirds. Gently shape each into a loose, fat log. Place on a lightly floured sheet pan, cover loosely and let rest for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape one piece of dough into a long snake by folding the long sides of the dough into the center 4 times, and then rolling it with your palms, applying pressure until it is approximately 13 inches long. Transfer the dough to a large sheet pan covered with parchment paper. Allow to rise until it just holds a fingerprint when lightly pressed but the dough still springs back slightly, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, preheat the oven to 450 degrees and have a plant sprayer full of fresh water ready. Using a single-sided razor held at a 30-degree angle, slash the surface of the loaves vertically with 4 3-inch slashes. When the oven is hot, spray it 2 to 3 times with water and immediately put the bread in and close the door. Spray the oven (not the bread) again 2 more times during the first 6 minutes of baking. Bake until the bread is a deep, golden brown and sounds hollow in the center when it is tapped, about 14 to 16 minutes. Remove from the oven and cool the loaves on a wire rack."}], "link": "https://cooking.nytimes.com/recipes/11721-baguettes"}