{"@context": "http://schema.org", "@type": "Recipe", "name": "Raisin-Pecan Bread", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "3 loaves", "recipeCuisine": "", "recipeCategory": "project", "keywords": "pecans, raisins, side dish", "aggregateRating": null, "recipeIngredient": ["2 cups raisins", "2 cups boiling water", "3 cups lightly toasted pecan halves", "2 tablespoons turbinado (raw) sugar", "1 1/2 cups water just slightly warmer than room temperature", "1 tablespoon fresh cake yeast", "1/2 cup poolish (<a href=\"http://cooking.nytimes.com/recipes/11720-poolish\">see recipe</a>)", "4 1/4 cups unbleached all-purpose flour", "2 teaspoons finely ground sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the raisins and boiling water in a bowl and set aside for 10 minutes. In the container of a food processor, combine 1/2cup of the pecan halves and sugar and pulse until the pecans are very finely ground. Set aside. Thoroughly drain the raisins and set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the warm water and yeast in a large bowl. Break the poolish into small pieces with your hands or a wooden spoon and add it to the bowl. Stir until fairly dissolved. Stir in the flour, ground pecans and sugar and salt. Stir until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the mixture out onto a lightly floured surface and knead for 10 minutes. Slowly begin to fold in the raisins and the remaining pecan halves a little at a time. Return the dough to the bowl, cover with a tea towel and let rise until doubled in bulk, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently turn the dough out onto a lightly floured surface and cut into 3 equal pieces. Leave the pieces on your work surface and cover them with a tea towel. Let them rest for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently shape each piece into a short log and place the logs on a sheet pan lined with parchment paper. Cover with the tea towel and let rise until the loaves just hold a fingerprint when lightly pressed, 30 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, preheat oven to 375 degrees and have a plant sprayer full of fresh water ready. Using a single-sided razor at a 30-degree angle, slash the loaves diagonally with 2 3-inch slashes each. When the oven is hot, spray it thoroughly with water and immediately put the bread in and close the door. Spray the oven (not the bread) again 2 more times during the first 5 minutes of baking. Bake until bread is very brown and sounds hollow when the bottom is tapped, 25 to 30 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the loaves from the oven and cool them on a wire rack."}]}