{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Grillades and Grits", "description": "Before Hurricane Katrina came to New Orleans, John Besh was simply a good chef with a fancy restaurant that had a habit of making top 10 lists around the country. After the storm, he became known as the ex-Marine who rode into the flooded city with a gun, a boat and a bag of beans and fed New Orleans until it could feed itself. This is his take on a classic New Orleans dish of long-simmered medallions of meat in a thick gravy, served over grits, and it is totally and completely delicious. (Sam Sifton)", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/06/02/dining/grillades-still/grillades-still-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "cajun, southern", "recipeCategory": "brunch, dinner", "keywords": "grits, pork, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "recipeIngredient": ["1 4-pound pork shoulder, in 1/2-inch slices", "Kosher salt and freshly ground pepper", "Creole seasoning mix, to taste", "3 cups all-purpose flour plus more for dusting pork", "2 cups canola oil", "1 cup chicken fat or butter", "4 each yellow onions, cut into medium dice", "2 bell peppers, cut into medium dice", "1 bunch celery, cut into medium dice", "4 cloves garlic, minced", "2 tablespoons Herbs de Provence", "4 bay leaves", "2 tomatoes, crushed (or 2 cups canned)", "1 tablespoon tomato paste", "4 quarts pork or chicken stock", "1 quart grits"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly pound pork slices with a mallet. Season with salt, pepper, and Creole seasoning, and then dust in flour. Heat oil over high heat in a large Dutch oven and brown pork on both sides, in batches, for about 2 minutes per side. After browning, reserve. When pork has all been browned, discard excess oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat chicken fat or butter over medium heat in Dutch oven and slowly whisk in 3 cups flour to make a roux the consistency of wet sand. Brown roux, stirring constantly for about 10 minutes. Add onions, peppers, celery, garlic, Herbs de Provence, bay leaves and crushed tomatoes, and cook, stirring, for 2 minutes. Add tomato paste and cook for 10 minutes, stirring constantly. Add stock and salt, stir, and cook over medium heat until thickened, about 30 minutes. Return pork to Dutch oven and simmer over medium low heat for 2 hours, until meat is very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pork is cooking, bring a gallon of water to boil in a large pot and whisk in grits. Reduce heat to medium and cook for 30 minutes, whisking often to prevent sticking. Reduce heat to low and cook grits for 1 1/2 hours more, stirring occasionally. Remove from heat, fold in butter, and season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pork to taste and serve over grits."}]}