{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuscan Kale Salad", "description": "Kale salad may someday go the way of other clichéd salads of yore — the bean salad, the chef’s salad, the beet salad with goat cheese. But like all those other venerable mixtures, its ubiquity is due in large part to how good it can be. Take a bunch of raw Tuscan kale (also called lacinato or black kale), which is more delicate than other varieties, and slice it into ribbons. Toss those ribbons with a thick bright dressing of garlic paste, pecorino, lemon juice, olive oil and a pinch of red pepper flakes. Top with freshly toasted bread crumbs and a flurry of pecorino. The leaves are sturdy enough to stand up to the bold flavors and varying textures, but tender when you take a bite.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/02/20/dining/recipes-kalewithpecorino/recipes-kalewithpecorino-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 to 4 servings", "recipeCuisine": "italian", "recipeCategory": "easy, quick, salads and dressings", "keywords": "kale, pecorino, low-carb, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 825}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 40, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "156 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bunch Tuscan kale (also known as black or lacinato kale)", "1 thin slice country bread (part whole-wheat or rye is nice), or 1/4 cup homemade bread crumbs (coarse)", "1/2 garlic clove, finely chopped", "1/4 cup finely grated pecorino cheese, more for garnish", "3 tablespoons extra virgin olive oil, more for garnish", "Freshly squeezed juice of 1 lemon", "1/4 teaspoon kosher salt", "1/8 teaspoon red pepper flakes", "Freshly ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim bottom 2 inches off kale stems and discard. Slice kale, including ribs, into 3/4-inch-wide ribbons. You should have 4 to 5 cups. Place kale in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using bread, toast it until golden on both sides. Tear it into small pieces and grind in a food processor until mixture forms coarse crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mortar and pestle, or with the back of a knife, pound garlic into a paste. Transfer garlic to a small bowl. Add 1/4 cup cheese, 3 tablespoons oil, lemon juice, salt, pepper flakes and black pepper, and whisk to combine. Pour dressing over kale and toss very well to thoroughly combine (dressing will be thick and need lots of tossing to coat leaves)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let salad sit for 5 minutes, then serve topped with bread crumbs, additional cheese and a drizzle of oil."}], "link": "https://cooking.nytimes.com/recipes/11746-tuscan-kale-salad"}