{"@context": "http://schema.org", "@type": "Recipe", "name": "Griddled Venison With Pink Gin Applesauce", "description": "", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "apple, venison, fall, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 768, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "6 grams", "proteinContent": "52 grams", "saturatedFatContent": "11 grams", "sodiumContent": "301 milligrams", "sugarContent": "21 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 pounds venison loin (available from Bonnie Brae Farms, 603-536-3880, or Atlantic Game Meats, 800-567-4217)", "1/2 cup gin", "2 teaspoon Worcestershire sauce", "1/4 cup extra virgin olive oil", "2 teaspoons black peppercorns", "1 onion, peeled and quartered", "2 star anise", "2 garlic cloves, peeled and lightly crushed", "2 tablespoons butter", "1 small onion, peeled and finely chopped", "Pinch of salt", "3 Red Delicious apples", "2 tablespoons plus 1 teaspoon gin", "Juice of 1 lemon", "1 long red chili, left whole", "2 heads radicchio di Treviso or other radicchio, quartered lengthwise", "2 tablespoons extra virgin olive oil", "2 teaspoons balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut venison into two equal pieces so it will fit in a 1-gallon freezer bag. Place in bag with gin, Worcestershire sauce, olive oil, peppercorns, onion, star anise and garlic. Seal bag securely and refrigerate for at least 2 hours at room temperature, or up to 3 days in the refrigerator. (If refrigerated, allow to rest at room temperature for 30 to 40 minutes before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While venison is marinating, prepare applesauce: In a wide saucepan with a lid, melt butter over low heat. Add onion and salt, and saut&#233; until softened but not browned. Cut apples in half, then without coring cut each half into four wedges. Add to pan with 2 tablespoons of the gin, lemon juice and chili. Stir well. Cover and simmer over medium-low heat until the apples are very soft, about 30 minutes. Remove chili, and work sauce through a food mill. Apple peels will color sauce. Stir in remaining teaspoon gin. Cover and refrigerate for up to three days; bring to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large griddle or heavy skillet until almost smoking hot. Remove venison pieces from marinade, and shake off any spices. Slap venison onto hot griddle and sear well on all sides, turning frequently to obtain even scorch marks, about 15 minutes for rare meat. (To test for doneness, press tops of loins lightly with a finger. Springy resistance indicates rare meat; firm indicates medium to well done.) Transfer to a carving board to rest for a few minutes before slicing thinly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While venison is resting, preheat a broiler. Drizzle radicchio with oil and vinegar and broil, turning, until leaves are wilted and charred slightly on all sides. To serve, line a large serving plate with heat-darkened leaves, and arrange the sliced venison on top. Serve applesauce in a decorative bowl to pass at table."}], "link": "https://cooking.nytimes.com/recipes/11786-griddled-venison-with-pink-gin-applesauce"}