{"@context": "http://schema.org", "@type": "Recipe", "name": "Terrine of Pork Chez Panisse", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "12 - 14 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, pork fatback, pork liver, pork shoulder, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 390, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "21 grams", "saturatedFatContent": "9 grams", "sodiumContent": "403 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces fresh pork fatback", "2 1/2 pounds pork shoulder", "7 ounces fresh pork liver, trimmed of all veins", "1 tablespoon olive oil", "4 shallots (4 ounces), finely diced", "1 cup white bread crumbs", "1/2 cup dry white wine", "4 cloves garlic (1 ounce), peeled and pounded in a mortar", "2 tablespoons chopped fresh parsley", "1/3 cup shelled pistachio nuts, parboiled 1 minute, skins removed", "1/2 teaspoon finely ground allspice", "1/2 teaspoon finely ground bay leaf", "1/2 teaspoon finely ground dried oregano", "1/2 teaspoon finely ground dried thyme", "1 1/2 teaspoons black pepper", "3 teaspoons salt", "1/4 teaspoon cayenne pepper", "8 to 10 large red or green chard leaves, parboiled 2 minutes, until limp"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice fatback into thin strips and dice into uniform pieces, about 1/8 inch thick. Cut pork into thin strips and dice. Distribute fatback pieces on top of pork. Divide mixture in half on a chopping block and chop in two batches; chop until you have a varied forcemeat of fine and coarse bits of pork. When chopping, go over mixture with cleaver or knife several times, turning mixture with the blade, until you achieve the right consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice liver; dice it; chop as finely as possible to a near-liquid consistency. Combine chopped meat and fat with liver in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a small saute pan, add shallots and saute gently 5 minutes without browning until they are soft. Meanwhile, in a separate bowl, combine bread crumbs and white wine and stir until crumbs are soaked. Add wine-soaked bread crumbs, softened shallots, garlic, parsley, pistachio nuts and all spices to the pork forcemeat and mix thoroughly by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 1 1/2-quart terrine or loaf mold with chard leaves: cover the bottom with a large leaf and overlap the other leaves around the sides, allowing them to drape over the edge about 2 inches, trimming them if necessary. Pack forcemeat mixture into mold, mounding slightly, and fold leaves over top to enclose it. Rap bottom of mold against table to settle contents and place in a baking pan with enough water to come two-thirds of the way up the sides of the mold. Bake 1 1/2 to 1 3/4 hours, or until a meat thermometer, inserted only as far as the center, reads 130 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let cool 20 minutes. On the terrine, place a dish or flat board and, on top of that, a weight (a 2- or 3-pound can will do). Continue cooling at room temperature several hours. When cool and quite firm, remove weight, wrap terrine well and place in refrigerator to ripen a day or longer before serving."}], "link": "https://cooking.nytimes.com/recipes/1179-terrine-of-pork-chez-panisse"}