{"@context": "http://schema.org", "@type": "Recipe", "name": "Terrine de Caneton a l'Ancienne", "description": "“It is true, as has often been observed, that a terrine is nothing more than a meatloaf with a French accent,” wrote Nancy Harmon Jenkins in 1987, part of a piece that brought this recipe to The Times. Terrine isn’t a weeknight dish, but a true indulgence for a special occasion. Whether it’s for a holiday or a dinner party, terrine is, in fact, fortunately a lot like meatloaf: It improves with age, so it’s great the next day, tucked into a sandwich, or spread onto a baguette. Don’t forget the cornichons, or, as Ms. Harmon suggests, the bread-and-butter pickles. They’re a briny contrast to the terrine’s creaminess.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT4H", "recipeYield": "10 to 12 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, duckling, pork liver, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 678, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "3 grams", "proteinContent": "21 grams", "saturatedFatContent": "23 grams", "sodiumContent": "617 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (4 1/2-pound) duckling", "8 ounces pork liver", "1 medium carrot, scraped and coarsely chopped", "1 medium turnip, peeled and coarsely chopped", "1 medium onion, peeled and coarsely chopped", "1 medium tomato, coarsely chopped", "2 cups water", "Herb bouquet (13 sprigs parsley, 2 sprigs thyme, 1 bay leaf and 1 leaf of fresh celery tied in cheesecloth)", "2 1/2 teaspoons salt, or to taste", "10 or more dashes freshly ground black pepper, or to taste", "4 eggs, lightly beaten", "2 tablespoons heavy cream", "2 garlic cloves, peeled and finely chopped", "4 shallots, finely chopped", "1 tablespoon chopped parsley", "1/4 teaspoon or more quatre epices, made from 10 ground cloves, 1 ground cinnamon stick, 2/3 teaspoon ground ginger and 3/4 teaspoon freshly grated nutmeg", "1 teaspoon freshly ground white pepper", "1/4 cup Armagnac (2 ounces)", "4 ounces clarified butter or rendered chicken fat"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bone duck, or have butcher do it, scraping away meat and ligaments. Save bones, liver and skin. Discard sinews. In workbowl of a food processor fitted with a metal blade, puree all fat and a 4-by-5-inch piece of skin. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut pork liver into small pieces. Process liver and duck meat briefly, using pulse button (you need not rinse bowl of food processor). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack duck bones into small pieces and brown lightly in bits of duck fat in a medium-size skillet. Drain off any fat. Add carrot, turnip, onion, tomato, 2 cups water and the herb bouquet, bring to a boil and skim carefully. Lower heat and reduce liquid to 2 tablespoons of duck glaze; this will take about 45 minutes. Scrape glaze into a small bowl to cool. Discard solids in skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl combine ground pork liver and duck meat, pureed skin and fat, 2 1/2 teaspoons salt, freshly ground pepper, eggs, cream, garlic, shallots, parsley, quatre epices and freshly ground white pepper. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in reserved duck glaze. Pat mixture into a bowl and spread Armagnac on top. Let stand, uncovered, 2 to 3 hours at room temperature, or, covered, overnight in the refrigerator. (Mixture should come to room temperature before proceeding with next step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir mixture to loosen. Pack into a 1 3/4-quart terrine or loaf pan. Smooth it down, cover with foil and set in a larger pan of hot water. Place on oven's middle shelf and bake 1 1/2 hours. Remove foil covering, lower oven temperature to 225 degrees and bake 1 hour longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove terrine from oven and let cool 30 minutes. Cover with foil, a dish or flat board and, on top of this, a weight (a 2- or 3-pound can will do). Let cool. When completely cold, refrigerate. Remove weight the following day. Cover with melted butter or chicken fat to seal completely. Serve after 3 to 4 days. If well covered with fat, this will keep in refrigerator 2 weeks or more. Allow to come to room temperature before serving."}], "link": "https://cooking.nytimes.com/recipes/1180-terrine-de-caneton-a-lancienne"}