{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Sweetbreads With Beets and Molasses Sauce", "description": "", "author": {"@type": "Person", "name": "Michael Ruhlman"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, red beets, veal sweetbreads", "aggregateRating": null, "recipeIngredient": ["1 1/2 pounds fresh veal sweetbreads", "1 1/2 cups white wine", "1 carrot, peeled and chopped", "1 rib of celery, chopped", "1 small onion, chopped", "1 bay leaf", "5 black peppercorns", "1 sprig parsley", "1 sprig thyme", "Salt", "8 (golf ball-size) golden beets", "1 shallot, minced", "Apple cider vinegar", "Extra-virgin olive oil", "Salt and freshly ground black pepper", "4 tablespoons unsalted butter", "1/3 cup molasses", "1/2 cup Champagne vinegar", "8 tablespoons cold unsalted butter, cubed", "Salt and freshly ground black pepper", "Grapeseed oil", "Salt and freshly ground black pepper", "1/2 cup rice flour", "2 teaspoons celery leaves, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Several hours or the night before, prepare the sweetbreads. Soak sweetbreads in cold water for 2 hours, changing the water every 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot combine the remaining ingredients with 3 quarts of water. Bring to a boil, then reduce heat to medium-low and simmer for 30 minutes. Add the sweetbreads, bring back to a boil and simmer until medium-rare, for about 10 minutes. They should still be squishy to the touch and glassy inside. Transfer sweetbreads to an ice bath. When cool, drain and press them between two plates covered with plastic wrap. Weight down the plates with a gallon of milk and refrigerate for at least 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the outer membrane off the sweetbreads. Pull them apart at natural seams to make 8 portions. Cover and refrigerate until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the molasses sauce by melting 4 tablespoons butter in a small sauté pan. Whisk in the molasses and bring to a boil. Whisk in the champagne vinegar and bring back to a boil. Lower heat to a simmer and reduce by half, or until mixture becomes a light syrup. Whisk in the cold cubes butter, a few cubes at a time. (Avoid boiling; it will break the sauce.) Season to taste with salt and pepper. The sauce should nicely coat a spoon. If too thick, thin with a little water. Set aside in a warm spot until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Set a large oven-proof skillet over high heat. Pour in 1/8-inch of oil. Meanwhile, season sweetbreads lightly with salt and pepper. In a small bowl, dredge sweetbreads in rice flour, shaking off excess. When the oil just starts to smoke, add the sweetbreads, and cook until deep golden brown for about 2 to 3 minutes, flip and place skillet in oven for 2 minutes more, or until just cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide beets among 8 plates and top each with sweetbreads, about 1 1/2 tablespoons sauce and a few threads celery."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare the beets:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "place beets in a large pot and cover with water. Bring to a boil and simmer until a knife inserted into a beet pulls out easily. Using a slotted spoon, transfer beets to a sheet tray. While still warm, slip off the skins and cut them into quarters. In a medium bowl, dress beets with the shallots, a splash of vinegar and enough oil to lightly coat them. Season with salt and pepper and hold them covered, at room temperature."}]}]}