{"@context": "http://schema.org", "@type": "Recipe", "name": "Rabbit and Vegetable Pot Pie", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, winter, main course, puff pastry, rabbit", "aggregateRating": null, "recipeIngredient": ["1/2 cup extra-virgin olive oil", "Flour for dredging", "3 rabbits, cut into serving pieces", "5 large shallots, minced", "3 cloves garlic, minced", "16 pearl onions", "1 pound mixed fresh wild mushrooms such as shiitake and chanterelle, julienned", "1/2 pound fresh domestic mushrooms, sliced", "1 cup carrot, julienned", "1 cup peeled turnip, julienned", "1 cup sliced celery", "1/4 cup tomato paste", "3 tablespoons chopped fresh tarragon", "4 cups dry white wine", "1/2 cup brandy", "8 cups chicken stock", "Bouquet garni (parsley, thyme, bay leaf, peppercorns and cloves tied in a cheesecloth)", "4 tomatoes, peeled, quartered and seeded", "1 1/2 cups raw peas", "2 tablespoons cornstarch dissolved in 1/4 cup water", "Coarse salt and freshly ground pepper to taste", "2 pounds puff pastry", "2 eggs, beaten with a pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Heat oil in a large saute pan. Lightly flour rabbit pieces and brown in batches in the oil. Remove rabbit and set aside. In the same pan, lightly brown the shallots, garlic and onions in oil remaining in the pan. Add mushrooms, carrot, turnip and celery and cook for a minute more. Stir in tomato paste and tarragon. Add the wine and brandy and simmer for five minutes to reduce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to an ovenproof 10-quart stock pot. Add the stock, bouquet garni, tomatoes and browned rabbit and bring to a boil. Cover and cook in a preheated oven for 45 minutes. Remove from oven and cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove rabbit and vegetables to a platter, reserving all liquid in pot; discard the bouquet garni. Debone rabbit, keeping pieces of meat as large as possible. Divide the meat among eight individual two-cup casseroles. Distribute cooked vegetables and raw peas evenly among the casseroles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the cooking liquid through a fine sieve into a pot. Reduce it over high heat to about four cups. Strain the liquid again, return to pot and whisk in the cornstarch mixture, a teaspoon at a time. Cook it until the sauce is very thick. Season with salt and pepper to taste. Divide the sauce among the casseroles. (Casseroles can be prepared up to this point and refrigerated overnight.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the pot pies, preheat oven to 425 degrees. Roll out the puff pastry an eighth of an inch thick. Cut into rounds an inch larger in diameter than the casseroles. Place pastry rounds on top of casseroles and crimp to sides; brush pastry with beaten eggs. Bake until pastry is golden brown, about 30 minutes."}], "link": "https://cooking.nytimes.com/recipes/11815-rabbit-and-vegetable-pot-pie"}