{"@context": "http://schema.org", "@type": "Recipe", "name": "Cornish Hen Pot Pie", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "cornish hen, puff pastry, fall, winter, main course", "aggregateRating": null, "recipeIngredient": ["4 Cornish hens", "Flour for dredging", "6 tablespoons safflower oil", "4 stalks celery, chopped", "1 medium onion, quartered", "4 carrots, chopped", "Cornish hen backs, wing tips and necks", "Coarse salt and freshly ground pepper", "Bouquet garni (parsley, thyme and bay leaf tied in cheesecloth)", "25 pearl onions, peeled", "2 tablespoons olive oil", "10 strips bacon, chopped", "4 tablespoons unsalted butter", "1 head savoy cabbage (about 1 1/2 pounds), sliced thinly", "4 tablespoons sherry vinegar", "4 tablespoons creme fraiche", "4 shallots, minced", "1/2 pound medium white mushrooms, sliced", "8 shiitake mushrooms, sliced", "1/2 pound cooked tongue, sliced in strips", "3 cups fresh peas", "10 baby carrots, parboiled", "1 egg yolk", "1 1/2 to 2 pounds puff pastry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the Cornish hens into eight pieces, reserving the wing tips, necks and backs for stock. Pat pieces dry with paper towels and dredge them lightly with flour. Fry them until golden in the oil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the stock, combine the celery, onion, carrots, hen backs, wing tips and necks in a stockpot. Add eight cups cold water, salt, pepper and bouquet garni. Bring to a boil, turn down and let simmer while you prepare the remaining ingredients for the pies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Roast the pearl onions in a pan with the olive oil until tender (about 20 minutes). Meanwhile, in a large, heavy frying pan, brown the bacon, remove with a slotted spoon and set aside. Pour the fat from the pan. Add two tablespoons of the butter and when it is melted saute the cabbage for a minute or two. Remove from the pan and set aside. Stir in the sherry vinegar and the creme fraiche."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining butter in the saucepan and gently saute the shallots and the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two eight-cup pie dishes or eight two-cup pie dishes with the cabbage. Add hen pieces, tongue, mushrooms, onions, peas and carrots. Season with salt and pepper. Add a quarter-inch of stock. Brush the rims of the pie dishes with the egg yolk. Roll out pastry one-eighth inch thick and place on top, brushing egg yolk. Bake 35 to 40 minutes."}]}