{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Shortcake", "description": "There's a kind of magic in a summer recipe that you can make wherever you are, provided that wherever you are has, say, flour, butter, an oven and whatever fruit is most glorious is at that very moment. This is one such recipe, so simple that you can decide that you're having shortcake for dessert and make it so within the hour, and so satisfying that it may become your go-to for summer, the recipe you keep in your back pocket. Strawberries are the classic choice, but this would also be heavenly in high summer with very ripe peaches or any other juicy, macerated fruit.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": "https://static01.nyt.com/images/2015/06/05/dining/05STRAWSHORTCAKE/05STRAWSHORTCAKE-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 generous servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, flour, strawberry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1646}, "recipeIngredient": ["2 pints ripe, well-rinsed strawberries", "1/2 cup sugar, or more to taste", "4 cups flour", "3 tablespoons sugar", "1/4 teaspoon salt", "5 teaspoons baking powder", "1 1/4 cups butter", "3 cups whipping cream", "1/4 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over and hull strawberries. Cut in half or slice, depending on size. Gently crush about a quarter of the berries with a fork to release their juices. Mix with remaining berries and the 1/2 cup of sugar, adding more sugar if necessary. Set aside, covered, for about half an hour to develop flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Into a large mixing bowl, sift together flour, 3 tablespoons sugar, salt and baking powder. Add 3/4 cup of softened butter, and rub into dry ingredients as for pastry. Add 1 1/4 cups cream, and mix to a soft dough. Knead the dough for one minute on a lightly floured pastry board, then roll it out to about 1/2-inch thickness. Using a 3-inch biscuit cutter, cut an even number of rounds - 2 rounds per serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a little of the butter to grease a baking sheet. Place half the rounds on it. Melt remaining butter and brush a little on the rounds; place remaining rounds on top. Bake for 10 to 15 minutes, or until golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven, and pull shortcakes apart. Brush the insides with some of the remaining melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat remaining cream until it thickens. Add vanilla. Beat again just until thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a bottom half of a shortcake on each plate. Top with a generous spoonful of berries. Cover with a top half, add a few more berries, and top with whipped cream. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/11823-strawberry-shortcake"}