{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Party Paella", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "20 to 24 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, project", "keywords": "chicken wings, chorizo, shrimp, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 752, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "46 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1419 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 pounds chicken wings (30 to 40 wings)", "8 tablespoons olive oil", "Juice of 2 lemons", "1 teaspoon ground cumin", "Salt and freshly ground black pepper", "40 mussels, scrubbed and debearded", "1 cup dry white wine", "3 pounds chorizo sausage", "2 large onions, chopped", "2 large sweet red peppers, cored, seeded and chopped", "1 large green pepper, cored, seeded and chopped", "6 cloves garlic, minced", "2 teaspoons oregano", "5 cups long grain rice", "1 28-ounce can whole plum tomatoes", "6 cups well-flavored chicken stock", "1/2 teaspoon powdered saffron", "3 pounds cooked shelled shrimp", "1/2 cup drained capers", "3 tablespoons minced fresh parsley", "Lemon wedges for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Disjoint the chicken wings, discarding the wing tips or reserving them for making stock. Place the remaining wing pieces in a large bowl. Mix three tablespoons of the olive oil with the lemon juice and cumin. Season this mixture to taste with salt and pepper. Pour over the chicken wings, cover and allow to marinate one to four hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Up to two hours before serving time, steam the mussels. Bring the wine to a simmer in a large pot, add the mussels, cover tightly and cook over medium heat until they open, about 10 minutes. Leave the mussels in the covered pan until shortly before serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Saute the chorizos over medium heat in a six-quart casserole until they are cooked through, 15 to 20 minutes. Remove them from the casserole, draining them well, and set them aside on a plate covered with a paper towel. Leave the fat in the casserole. Add the remaining olive oil to the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions and peppers to the casserole and cook over low heat, stirring, until the vegetables are soft but not brown. Stir in the garlic, cook briefly, then add the oregano. Stir in the rice and cook for several minutes, stirring, until the rice is well coated with the other ingredients. Remove the casserole from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the canned tomatoes, pricking them to drain the liquid inside. Reserve all the tomato liquid and chop the tomatoes fine. Stir the chopped tomatoes in with the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure the reserved tomato liquid. You should have about a cup and a half. Add a little water if necessary to make this amount. Place the tomato liquid in a saucepan along with the chicken stock and bring to a simmer. Stir in the saffron, remove from the heat and allow to steep for 10 minutes. Meanwhile, slice the cooled chorizo into rounds a half-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the casserole over medium-low heat and bring to a simmer. Stir in the pieces of chorizo, then stir in the tomato and chicken stock seasoned with the saffron. Bring to a simmer and add salt and pepper, if necessary. Cover and cook over low heat until all of the liquid is absorbed and the rice is done, which should take about 20 minutes. Set aside, covered for at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rice is cooking, remove the shrimps from the refrigerator so they can come to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a broiler. Place the marinated chicken wings on a broiling pan and broil until they are browned and cooked through, about 25 minutes. Turn them once during the cooking. Transfer them to a large platter or bowl, cover with foil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon the rice gently into one or more large mixing bowls to fluff it. Do not fill the bowls more than half full or you will have rice all over the floor. Taste the rice for seasoning and add more salt and pepper, if necessary, so that the seasoning will need no further adjusting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently fold the capers, parsley, shrimp and chicken wings in with the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm a large serving platter or shallow bowl. Even a big paella pan can be used as a serving dish. Transfer some or all of the paella to the platter or bowl. If there is not enough room for all the paella on one platter, you can use two platters or keep some of the paella reserved in the kitchen for refilling the platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Briefly reheat the mussels in their broth, then arrange them, in their shells, around the edge of the platter, alternating them with the lemon wedges. Place the platter on the buffet table along with serving spoons. After all the guests have served themselves, rearrange the paella on the platter, refilling the platter, if necessary, or transferring the remaining paella to a smaller platter so it continues to look attractive."}], "link": "https://cooking.nytimes.com/recipes/1185-easy-party-paella"}