{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken-Stuffed Figs, Onions And Eggplants In Tamarind Sauce", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": null, "totalTime": "PT2H", "recipeYield": "10 servings", "recipeCuisine": "african, middle eastern", "recipeCategory": "", "keywords": "appetizer, chicken, figs", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 344, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "21 grams", "proteinContent": "15 grams", "saturatedFatContent": "2 grams", "sodiumContent": "273 milligrams", "sugarContent": "38 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 medium onions, peeled", "3 tablespoons olive oil", "2 skinless, boneless chicken breasts", "1/2 teaspoon ground cardamom", "1/4 teaspoon ground cloves", "1 teaspoon salt", "1/2 teaspoon white pepper", "3 teaspoons tamarind concentrate (see note)", "2 dried or fresh figs, diced, plus 10 fresh whole figs for stuffing", "3 tablespoons brown sugar", "10 small Italian eggplants"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice 2 onions, and place them in a large skillet with 2 tablespoons olive oil. Sauté over medium-high heat for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a meat grinder or a food processor fitted with a steel blade, grind or pulse chicken until finely diced. Add chicken, cardamom, cloves and salt and pepper to skillet, and continue cooking over low heat until chicken is lightly browned. Adjust seasonings, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix tamarind concentrate with 4 cups hot water in a large saucepan, and bring to boil. Add 2 diced figs along with brown sugar. Reduce heat, cover, and simmer for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Core remaining onions from bottoms up, leaving tops intact, removing all but a few inside layers. Stuff them 3/4 of the way full with chicken mixture. Close hole at bottom of onion with a small piece of onion from core. Place stuffed onions in pot with tamarind sauce. Cover pot, and bring to boil. Reduce heat, and simmer for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet, brown eggplants on all sides in remaining tablespoon olive oil. Remove from heat, and allow to cool for 5 minutes. Make a slit in one side of each eggplant about 1 inch deep and 2 inches long. Carefully open, and scoop out seeds, making a pocket large enough to hold about 1/4 cup chicken mixture. Stuff eggplants, and add them to onions in pot. Cook covered for 30 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open whole figs from bottoms up, and remove seeds. Stuff with 1 tablespoon chicken filling. Add figs to pot with onions and eggplants, and simmer for 10 minutes. Serve one stuffed fig, one eggplant and one onion to each person, with sauce drizzled over all three."}]}