{"@context": "http://schema.org", "@type": "Recipe", "name": "Crab Cakes With Crystal Beurre Blanc", "description": "This recipe came to The Times in 2006 from the Upperline restaurant in New Orleans in the aftermath of Hurricanes Katrina and Rita. One bright light after the storms was an unexpected windfall in crab. The storms stirred up the marshes and shook up lots of food, so these crab cakes are made with an ice cream scoop and not a spoon. The real gem of the dish is the Crystal beurre blanc, an idea that mixes high French culinary canon with down-and-dirty New Orleans heat. Crystal Hot Sauce has long adorned many a table in New Orleans. It is more vinegary than Tabasco, which is too hot for this recipe. Baumer Foods had been making Crystal Hot Sauce for more than eight decades when the storms hit. Its New Orleans plant was flooded so badly that it was not reopened, but other bottlers kept Crystal on the shelves until the company could move into its new home, about a half hour’s drive from its damaged factory.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/05/30/crosswords/Crab-Cakes-With-Crystal-Beurre-Blanc/Crab-Cakes-With-Crystal-Beurre-Blanc-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "brunch, project", "keywords": "crab, seafood, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "recipeIngredient": ["1 pound jumbo lump crab meat", "1/2 cup chopped scallion", "2 tablespoons fresh lemon juice", "1/8 teaspoon cayenne pepper", "1/4 teaspoon black pepper", "1/2 teaspoon kosher salt", "1/4 cup mashed potatoes", "6 tablespoons Crystal or other Louisiana-style hot sauce (do not use Tabasco)", "1 large lemon, peeled, pith removed, and halved", "2 tablespoons white wine", "1/4 cup heavy cream", "3/4 pound butter, chilled and cut into small pieces", "Salt", "1 tablespoon butter", "1 tablespoon olive oil", "1 large onion, peeled and chopped", "16-ounce bag baby spinach", "Salt and freshly ground black pepper", "2 cups all-purpose flour", "Salt and freshly ground black pepper", "3 large eggs", "2/3 cup milk", "2 cups fine dry bread crumbs", "Vegetable oil, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the crab cakes: In a large bowl, combine all ingredients for crab cakes. Gently mix to combine. Using an ice cream scoop, make 8 balls and place on a baking sheet or large plate. Cover and refrigerate for at least 30 minutes. (If crab is very fresh, this may be done a day ahead of time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the Crystal beurre blanc: In a small saucepan, combine hot sauce, lemon and wine. Bring to boil over high heat, then simmer until reduced by a third, 3 to 4 minutes. Add cream and again reduce by a third, about 5 minutes. Lower heat and whisk in butter a few pieces at a time, making sure each addition is incorporated before adding next. Pour sauce through a fine-mesh strainer and add salt to taste. If desired, keep warm over a double-boiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the spinach base: For the spinach base: Place a large skillet over medium heat, and heat butter and olive oil in it. Add onion and sauté until soft, about 5 minutes. Add spinach in batches, stirring and adding more until it all cooks down. Season to taste with salt and pepper, set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For frying: Line up three shallow bowls. Place flour in one and season to taste with salt and pepper. Place eggs and milk in the second bowl; beat until mixed. Put bread crumbs in the third. Pat crab cakes into thick disks, like oversize scallops. Dip each into flour mixture, then egg mixture, then roll in bread crumbs. Set on a plate and chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large sauté pan or skillet over medium-high heat. Pour in enough oil to come 1/2 inch up side of pan. When oil shimmers, add crab cakes. Cook, turning once, until light golden brown on both sides, about 2 minutes a side. Transfer to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a mound of spinach on each of four serving plates. Place 2 crab cakes next to spinach and pour sauce around them. If desired, serve with more hot sauce."}], "link": "https://cooking.nytimes.com/recipes/11860-crab-cakes-with-crystal-beurre-blanc"}