{"@context": "http://schema.org", "@type": "Recipe", "name": "Lidia's Veal and Eggplant Gratinate (for One)", "description": "", "author": {"@type": "Person", "name": "Lidia Bastianich"}, "image": null, "totalTime": "PT30M", "recipeYield": "1 serving", "recipeCuisine": "italian", "recipeCategory": "dinner, for one", "keywords": "eggplant, veal, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 818, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "16 grams", "proteinContent": "46 grams", "saturatedFatContent": "19 grams", "sodiumContent": "1873 milligrams", "sugarContent": "23 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 small eggplant or zucchini, about 6 inches long", "Salt and ground black pepper", "Flour for dredging", "Light olive oil (not extra virgin) or vegetable oil for browning", "4 ounces thinly sliced veal scaloppine or chicken breast", "1 tablespoon butter", "1 shallot, minced", "Splash of white wine or dry vermouth", "6 basil leaves, or 1 tablespoon freshly chopped parsley, more for garnish", "1/4 cup good quality tomato sauce, preferably homemade", "3 tablespoons freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. If using eggplant, cut off ends and slice off two long strips of skin, one on each side. With 1 skin side up, so that each slice will have skin on both sides, slice eggplant lengthwise, 1/4inch thick. Sprinkle with salt and pepper, and dredge lightly in flour. If using zucchini, slice on diagonal, 1/4 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 6- to 8-inch ovenproof skillet (see Note), heat 1 tablespoon oil. Brown vegetable slices lightly on both sides, working in batches if necessary to avoid crowding pan. Add more oil as needed to keep pan lightly oiled. Remove and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle veal or chicken with salt and pepper, and dredge lightly in flour. Melt butter in same pan until it bubbles, then brown meat lightly on both sides. Remove and drain on paper towels. Add shallot to pan and cook, stirring, until slightly softened, about 2 minutes. Pour in wine and simmer until syrupy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off heat and place pieces of meat in skillet. Lay basil leaves or parsley over them, then arrange vegetable slices on top. Spoon tomato sauce over, sprinkle cheese on top, and pour about 2 tablespoons water (more or less, depending on thickness of tomato sauce) around edges of pan. Bake 8 to 10 minutes, until meat is cooked through and liquid in bottom of pan is thickened. Sprinkle with torn basil or chopped parsley; serve with crusty bread."}], "link": "https://cooking.nytimes.com/recipes/11878-lidias-veal-and-eggplant-gratinate-for-one"}