{"@context": "http://schema.org", "@type": "Recipe", "name": "James Beard’s Boston Baked Beans", "description": "The trick to good baked beans is cooking them very slowly with indirect heat. This recipe calls for baking them in a tightly sealed casserole in an oven barely hot enough to toast bread. As the hours pass, the beans drink up a broth flavored with brown sugar (or molasses), mustard and pepper. The gentle cooking prevents the beans from breaking up and becoming mushy. By the time they're done, the pork is falling off its bones and the beans are the classic rusty brown. Be sure to season them amply with salt so the sweetness has a sturdy counterpart.\n\nBeard's recipe calls for dark brown sugar. The alternative is to use molasses, which will render a final flavor and color more familiar to canned-bean devotees. The recipe itself requires no great cooking skills — if you can peel an onion and boil water, you're all set — but it will easily take up an afternoon. Plan it for a day when you're at home.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/30/dining/Baked-Beans/Baked-Beans-articleLarge.jpg", "totalTime": "PT13H", "recipeYield": "6 servings", "recipeCuisine": "new england", "recipeCategory": "", "keywords": "beans, james beard, pork, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 122}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "12 grams", "saturatedFatContent": "5 grams", "sodiumContent": "309 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups of white pea beans (navy beans)", "1 scant teaspoon salt, plus more to taste", "1 medium onion, peeled", "4 pork spareribs, or 8 baby-back ribs", "1/3 cup dark brown sugar or molasses", "2 teaspoons dry mustard", "1 teaspoon ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, soak the beans in 2 quarts of water for 6 hours. Drain the beans and put them in a large pot. Add the salt and enough cool water to cover 2 inches above the beans. Bring to a boil, then lower the heat and simmer gently, stirring occasionally, until the beans are just barely tender, 30 to 40 minutes. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring another pot of water to a boil. Preheat the oven to 250 degrees. In the bottom of a large casserole with a tight-fitting lid, place the peeled onion -- yes, whole -- and spareribs (or baby-back ribs). Spread the beans on top. In a small bowl, mix together the brown sugar (or molasses), mustard and black pepper and add this to the beans and pork. Pour in just enough boiling water to cover the beans, put the lid on and bake, occasionally adding more boiling water to keep the beans covered, until they are tender but not falling apart, 4 to 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the casserole from the oven. Season the beans with salt. Pull the meat from the ribs. Discard the bones and excess fat and stir the meat back into the beans. With the lid off, return the casserole to the oven and let the beans finish cooking, uncovered and without additional water, until the sauce has thickened and is nicely caramelized on top, about 45 minutes more."}], "link": "https://cooking.nytimes.com/recipes/11877-james-beards-boston-baked-beans"}