{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Cabbage With Pork", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Eight or more servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "appetizer, cabbage, pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 339, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "8 grams", "proteinContent": "26 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1252 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3-pound head cabbage", "4 tomatoes, about 1 pound", "1 tablespoon corn, peanut or vegetable oil", "2 cups finely chopped onions", "2 1/2 teaspoons finely minced garlic", "1 teaspoon dried thyme", "1/4 teaspoon ground cloves", "1 1/2 pounds ground lean pork", "1/2 cup finely chopped parsley", "1 cup fine, fresh bread crumbs", "2 eggs, lightly beaten", "Salt to taste, if desired", "Freshly ground pepper to taste", "2 tablespoons butter", "1 1/2 cups coarsely chopped onions", "1 cup finely chopped celery", "1 bay leaf", "2 whole allspice", "1/2 cup dry white wine", "3 cups fresh or canned chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully cut away the bottom center core of the cabbage. Pull off and discard any tough or blemished outer leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring enough water to the boil to cover the cabbage when it is added. Drop the cabbage into the water and cook, turning occasionally, about 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the cabbage and run it briefly under cold water. Place the cabbage cored side down to drain further."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut away the cores of the tomatoes. Cut the tomatoes into one-half-inch cubes. There should be about three cups. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a heavy skillet and add the two cups of finely chopped onions and two teaspoons of the garlic. Cook, stirring, until the onions are wilted. Sprinkle with one-half teaspoon of the thyme and add the cloves. Cook, stirring occasionally, about five minutes. Scrape the mixture onto a plate and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pork in a large mixing bowl and add the parsley, bread crumbs, eggs, salt and pepper. Add the cooled onion and garlic mixture and blend thoroughly with the hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay out a rectangle of cheesecloth of double thickness measuring about 17 by 24 inches (folded measure)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one of the large outer leaves, rounded side up, just off center with the stem pointing outside. Add a second leaf, the leaf ends slightly overlapping. Add a total of eight leaves, the leaf edges overlapping to form a circle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add two cups of the pork mixture to the center of the leaves and spread it out slightly. Cover with a second layer of six fairly large leaves, stem point outside and with the leaf edges overlapping. Add two more cups of the pork mixture to the center and spread it out slightly. Add a third layer of leaves, edges overlapping, and the remaining pork mixture. Bring up the edges of the cloth rectangle and pull tightly to reassemble the mass into a large cabbage shape. Twist the ends of the cheesecloth bag tightly and tie tightly with string. Cut off the excess cheesecloth ends."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a heavy casserole large enough to hold the stuffed cabbage comfortably without crowding. Add the one and one-half cups of coarsely chopped onions, celery, bay leaf and remaining one-half teaspoons of garlic and thyme and cook briefly until the mixture is wilted. Add the tomatoes and allspice, salt and pepper. Bring to the boil and cook about one minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine and broth. Put in the stuffed cabbage, tied side down, and cover closely. Bring to the boil and simmer one and one-half hours or until the internal temperature reads 170 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cabbage from the casserole. Cut away and remove the cheesecloth bag. Line a mixing bowl with a sieve and pour the liquid and solids from the casserole into it. Strain, pressing the solids to extract as much liquid as possible. Reheat this sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cabbage into pie-shaped wedges and serve with the hot sauce."}]}