{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Striped Bass With Mango Salsa", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "fish, mango, sea bass, gluten-free, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["2 not-overly-ripe mangoes, or 3 peaches, skin removed and cut into 1/2-inch dice", "Salt and pepper", "Dried red chili flakes or cayenne", "2 limes, juiced", "1 tablespoon olive or peanut oil, plus more as needed", "2 pounds striped bass, red snapper, sea bass or grouper, in one or two fillets, preferably with skin", "1/2 cup (about) chopped cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a grill or preheat a broiler. Combine fruit with a sprinkle of salt, chili flakes or cayenne, lime juice and a tablespoon of olive oil. Rub both sides of fish lightly with oil and sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill or broil fish, skin side down. If grill has a cover, use it, and grill 8 to 12 minutes, or until fish is done. Remove carefully with a large spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If grill does not have a cover, brush top of fish with oil after 4 or 5 minutes and turn it carefully with a large spatula. Continue to cook, skin side up, until fish is done; remove carefully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To broil, put fish in a nonstick broiling pan and adjust the oven rack so top of fillet is no more than 4 inches from the heat source. Broil without turning, until top is nicely browned and fish is done. If fish appears to be browning too quickly, move the rack a couple of inches farther from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush fish once more with oil; garnish salsa with cilantro, then serve fish and salsa together."}]}