{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp in Spicy Lime Sauce", "description": "Few people I know have gone food hunting in Cambodia, so I was curious when Deb Winson, a New York-based food stylist, came back with an ecstatic report. ''Everything was so fresh and beautiful, and everything was so simple,'' she said. When I asked her to describe her favorite dish, she told me about a great preparation for shrimp cooked in lime. The ingredients were much as I expected: limes, sugar, salt, chiles and garlic, all common in Southeast Asian cooking. But the technique sounded unusual. The shrimp were not stir-fried, as you might expect, but instead were simmered in a very pungent sauce so that they took on strong flavor and still stayed juicy. This is my version.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/11/01/dining/01COOKING-SHRIMP-SPICY-LIME-SAUCE/01COOKING-SHRIMP-SPICY-LIME-SAUCE-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "easy, quick, seafood", "keywords": "appetizer, main course, side dish, gluten-free, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 273}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 240, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "0 grams", "proteinContent": "23 grams", "saturatedFatContent": "1 gram", "sodiumContent": "964 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 1/2 cup lime juice (4 to 6 limes)", "1/4 cup sugar", "1 1/2 teaspoons salt, more to taste", "2 tablespoons neutral oil, like canola or grape seed", "1 teaspoon minced garlic", "1/2 teaspoon crushed red chile flakes, or to taste", "1 1/2 pounds peeled shrimp, or 3 pounds head-on shrimp, left unpeeled", "Minced cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the lime juice, sugar and salt. Place oil in a 10- or 12-inch skillet, and turn the heat to high. A minute later, add the garlic and chile flakes and cook the garlic until it just begins to brown. Immediately add the lime juice mixture all at once, and cook until it reduces by half, or even more, 3 to 5 minutes. There should be only about 1/4 cup of liquid in the skillet, and it should be syrupy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shrimp, and cook over high heat. The shrimp will give off liquid of their own and begin to turn pink almost immediately. After about 2 minutes, stir contents of pan. Continue cooking, stirring occasionally until all the shrimp are pink, about 4 minutes total. Taste, adjust seasoning, garnish with cilantro and serve with rice."}], "link": "https://cooking.nytimes.com/recipes/11891-shrimp-in-spicy-lime-sauce"}