{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Cales", "description": "These sweet little numbers came to The Times in 2006 courtesy of the pastry chef Nicole Kaplan, who was then at Eleven Madison Park, and the reporter Christine Muhlke, who wrote about them for the Sunday Times Magazine. They act as a foil to her rich, velvety <a href=\"http://www.nytimes.com/recipes/11926/recipe.html\">salted caramel ice cream</a>. The technique of making them is not particularly difficult, but it can be dangerous. Boiling caramel must be handled with care. When adding liquids to it, roll down your sleeves and stand back.", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/22/dining/Caramel-Coulant/Caramel-Coulant-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 5", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "cake flour, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 483, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "12 grams", "sodiumContent": "62 milligrams", "sugarContent": "57 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup plus 2 tablespoons sugar", "1/3 cup cream", "1 1/2 tablespoons butter", "1/4 cup milk", "4 tablespoons unsalted butter", "Pinch of fleur de sel", "1/4 cup plus 1 1/2 teaspoons sugar", "2/3 cup cake flour", "2 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Combine the sugar and 1/4 cup water in a pot. Do not stir. Cook over medium-high heat to a dark caramel, swirling as it begins to brown to distribute the sugar. Reduce the heat to low and deglaze with the cream, standing back to avoid bubbling caramel. Add the butter and milk. It will bubble again. Stir until well incorporated. Let cool. The sauce can be made ahead and refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spray 5, 4-ounce ramekins with cooking spray; cover the inside of the ramekin with sugar and remove excess. Place on a sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the coulant by warming 1/3 cup caramel sauce in a medium saucepan; then stir in the butter and fleur de sel. Off the heat, stir in the sugar, then flour, then eggs, adding the next just after the prior has been combined. Pour the mixture two-thirds of the way into each ramekin. Bake 8 to 10 minutes, turning the sheet pan halfway through, until the shell is cakelike but the center is flowing. Let cool. When ready to serve, rewarm the cakes in the ramekins for a few minutes. Place a serving plate over the ramekin and flip it to release the coulant. Serve with salted caramel ice cream."}]}