{"@context": "http://schema.org", "@type": "Recipe", "name": "Cornes de Gazelles", "description": "Cornes de gazelles are crumbly, crescent-shaped cookies filled with cinnamon, almonds and an intoxicating dose of orange blossom water.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/16/dining/Hazelnut-Baklava/Hazelnut-Baklava-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "About 3 dozen pastries", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 97, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "2 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups (10 ounces) blanched, slivered almonds", "3/4 cup confectioners' sugar", "2 tablespoons orange blossom water", "2 tablespoons clarified butter, melted", "1 egg white", "1/2 teaspoon ground cinnamon", "1 teaspoon finely grated orange zest", "2 cups all-purpose flour", "2 tablespoons clarified butter, melted", "1 egg yolk", "2 tablespoons orange blossom water", "Butter for greasing baking sheets", "1/4 cup orange blossom water", "1 1/2 cups confectioners' sugar, sifted, more for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: In a food processor, pulse together almonds and confectioners' sugar until powdery. Add remaining filling ingredients and continue to pulse until mixture forms a stiff paste. Mold paste into a ball, wrap well and refrigerate for at least 1 hour (and up to two days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pastry: Using an electric mixer, mix flour, 2 tablespoons melted butter, egg yolk, orange blossom water and 2 tablespoons cold water until combined. With mixer running, add 2 to 4 tablespoons more water, as needed, until dough just comes together. Continue to beat until dough becomes smooth and elastic, about 2 minutes. Cover bowl with a damp towel or plastic wrap and leave at room temperature for at least 15 minutes and up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, preheat oven to 325 degrees. Grease 2 baking sheets. Place orange blossom water in a small, shallow bowl. Place confectioners' sugar in another shallow bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in half and cover one half with damp cloth. Transfer other half to a lightly floured surface and roll it to 1/8-inch thick. Cut dough into 3-inch rounds with a cookie cutter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, roll two teaspoons of filling into a ball and place in center of round. Repeat, filling all dough circles. Using a pastry brush, lightly brush border of each with water. Fold bottom of dough over filling, forming a half-circle, and press edges to seal. With tip of a sharp knife, make three small diagonal slits on top of each pastry. Bend pastries into a crescent shape and transfer them to baking sheets, about 1 1/2 inches apart. Roll out remaining dough, and repeat. Transfer pastries to oven and bake until pale golden, 20 to 25 minutes. Let cool for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, dip each hot pastry one at a time first in orange blossom water, then in confectioners' sugar, completely covering pastry with sugar. Transfer to a wire rack to cool. Dust pastries with additional confectioners' sugar, and serve."}]}