{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Halibut With Olive Oil Potatoes", "description": "", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fish, halibut, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1124, "unsaturatedFatContent": "43 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "89 grams", "fiberContent": "6 grams", "proteinContent": "40 grams", "saturatedFatContent": "40 grams", "sodiumContent": "1522 milligrams", "sugarContent": "9 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 1/2 pounds (3 medium) Yukon Gold potatoes, peeled", "Sea salt", "6 tablespoons extra virgin olive oil", "5 1/2 cloves garlic, thinly sliced", "Half a small anchovy fillet", "1/4 teaspoon fresh thyme leaves plus 2 whole sprigs", "1/2 cup pitted Kalamata olives", "White pepper", "1/4 cup milk", "1/2 pound plus 3 1/2 tablespoons butter", "1 small shallot, thinly sliced", "2 large red bell peppers, cored and seeded, cut into 1-inch pieces", "1 teaspoon sugar", "1 1/2 cups chicken stock or canned broth", "1 teaspoon saffron threads", "2 pinches cayenne pepper", "1 1/2 pounds halibut fillet, skin removed, cut into 4 equal pieces", "2 tablespoons grapeseed oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in a large pot and cover with lightly salted water. Bring to a boil and cook until tender when pierced with a knife. Meanwhile, in a small skillet, combine 1 tablespoon olive oil and 1/2 clove sliced garlic. Sauté over low heat until lightly golden, then add anchovy and 1/4 teaspoon thyme leaves. Transfer to a small food processor and add olives, 1 tablespoon olive oil and 1 teaspoon cold water. Purée until smooth and season to taste with white pepper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes are tender, drain and put through a food mill or mash them. Return to pot and place over low heat. Stir with a wooden spoon until potatoes start to stick to pot, then slowly add milk, 2 tablespoons olive oil and 1/2 pound butter. Stir until very smooth, then season to taste with salt and pepper. Set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine remaining 2 tablespoons olive oil with 3 cloves sliced garlic. Sauté over medium heat until garlic is aromatic. Add shallot and sauté until translucent. Stir in peppers, 1 teaspoon salt and sugar. Reduce heat to low, cover and cook for 2 minutes. Add chicken stock and saffron; simmer, partially covered, until peppers are tender, about 8 minutes. Purée in a food processor, blender or with an immersion blender, and pass through a fine sieve. Transfer to a small pan and season with cayenne and salt to taste. Add 2 tablespoons butter and whisk or blend until frothy. Set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Season halibut fillets with salt and pepper to taste. Place a large ovenproof skillet over medium-high heat and add grapeseed oil. When oil is hot, add fillets presentation-side down. Cook for 1 minute on stove top, then place in oven for 5 minutes. Remove pan from oven and return to stove top on medium heat. Add remaining 1 1/2 tablespoons butter to pan. When it starts to foam, add remaining 2 cloves garlic and sprigs of thyme. Baste fish with butter for 1 minute. Remove fillets from pan when undersides are golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a large spoonful of potatoes in middle of four wide-rimmed plates or shallow soup bowls. Top with a halibut fillet, seared-side up. Place a spoonful of olive mixture on each fillet. Bring bell pepper emulsion to a boil and whisk until foamy, then pour around potatoes."}], "link": "https://cooking.nytimes.com/recipes/11966-pan-seared-halibut-with-olive-oil-potatoes"}