{"@context": "http://schema.org", "@type": "Recipe", "name": "Rawia Bishara's Vegetarian Musaqa", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, project", "keywords": "eggplant, squash, gluten-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 679, "unsaturatedFatContent": "43 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "13 grams", "proteinContent": "10 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1456 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 hefty eggplants, peeled, sliced lengthwise about 1/4-inch thick", "3 tablespoons plus 1 teaspoon salt", "4 or 5 large yellow onions, cubed or thinly sliced", "1 1/2 cups extra virgin olive oil (see note below)", "1/2 cup slivered blanched almonds", "1/2 cup pine nuts", "1 large bunch fresh cilantro, coarsely chopped", "1 tablespoon garlic, very finely minced 1 teaspoon ground cumin", "1 teaspoon ground coriander", "1 tablespoon ground black pepper", "1/2 teaspoon ground allspice", "1/4 teaspoon ground nutmeg", "1/2 cup lemon juice plus 2 more lemons", "2 or 3 large yellow potatoes, peeled, very thinly sliced", "4 Arab squash (kousa) or zucchini, sliced lengthwise 1/4-inch thick", "2 fresh ripe tomatoes, thinly sliced", "2 large red or yellow sweet peppers, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine eggplant with 3 tablespoons of salt in bowl and cover with cool water. Set plate on top and weight to keep eggplant submerged. Set aside for 30 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside a half-cup of onion for topping. Combine remainder with a quarter-cup of oil in a heavy skillet and set over low heat. Cook, stirring occasionally, until onions are pale caramel and very soft, almost melted into oil, 20 to 30 minutes (watch carefully to prevent burning). Transfer to a bowl, leaving as much oil in the skillet as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast almonds in 1 tablespoon of oil in small skillet over medium-low heat until golden and crisp. Remove and add to onions. Add pine nuts to the skillet, with a little more oil if necessary, and toast until golden. Remove and add to onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In same skillet, add another tablespoon of oil and toss the cilantro with garlic until wilted. Add to onion and nut mixture, with a heaping tablespoon of the spice mixture (cumin, coriander, black pepper, allspice and nutmeg) and lemon juice. Stir to mix well. Taste, adding more spices or lemon juice, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another half-cup of oil to skillet in which onions were cooked and set over medium-low heat. When oil is hot, add potato slices. Cook on both sides until they are lightly golden and start to soften. Transfer to 9-x-12-inch oven dish. Line bottom of dish. Distribute a fourth of the onion mixture over the top; it will not cover the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes are cooking, drain eggplant and dry with paper towels. Add more oil to skillet, if necessary, and cook eggplant slices on both sides until lightly golden. Use half the slices to cover the bottom layer, setting aside the other half. Distribute another quarter of onion mixture over eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In skillet cook squash or zucchini slices on both sides until lightly golden (add more oil if needed). Arrange over eggplant and distribute some of remaining onion mixture on top. Top with reserved eggplant slices and remaining onion mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange tomato slices on top, then sprinkle with peppers. Distribute reserved half onion over the top. Sprinkle with salt, and squeeze the juice of one lemon over it. Add about a half-cup boiling water, dribbling down around edges of pan. Transfer to oven and bake 20 to 30 minutes, or until top is starting to crisp and juices are bubbling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and serve immediately; or set aside to cool to slightly above room temperature before serving."}], "link": "https://cooking.nytimes.com/recipes/11963-rawia-bisharas-vegetarian-musaqa"}