{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Amoy Popia", "description": "", "author": {"@type": "Person", "name": "Nina Simonds"}, "image": null, "totalTime": "PT1H", "recipeYield": "six servings", "recipeCuisine": "asian", "recipeCategory": "dinner, project", "keywords": "appetizer, main course, shrimp, spring roll wrappers", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 376, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1039 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds medium-size raw, shelled shrimp", "2 slices gingerroot, smashed lightly with the flat side of a cleaver", "1/2 teaspoon sesame oil", "1 1/2 tablespoons rice wine", "1 teaspoon salt", "1 teaspoon sesame oil", "1/2 teaspoon sugar", "1/2 teaspoon freshly ground white pepper", "3 tablespoons chicken broth", "1 teaspoon cornstarch", "18 spring roll wrappers or lumpia skins", "1/2 cup coarsely chopped dry, roasted peanuts", "1/2 cup hoisin sauce", "1/4 cup safflower or corn oil", "2 teaspoons minced gingerroot", "3 cups thinly sliced water chestnuts, blanched briefly in boiling water, rinsed in cold water and drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Devein shrimp by scoring the back deeply. The scoring allows the shrimp to spread, or ''butterfly,'' when cooked. Rinse shrimp and drain thoroughly. Place them in a linen dishtowel and squeeze out as much moisture as possible. Place them in a bowl. Prepare the marinade by squeezing the gingerroot slices repeatedly for several minutes to impart the flavor. Add the marinade to the shrimp, tossing lightly to coat, and let stand 20 minutes. Combine the sauce ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate the spring roll wrappers and fan them out slightly on a heatproof plate. Cover with a damp cloth until 10 minutes before serving. Place the chopped peanuts and hoisin sauce in separate serving bowls. Place the wrappers in a steamer and steam 5 minutes over high heat. Turn off the heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a well-seasoned wok, add the oil and heat until very hot. Add the shrimp and toss lightly until they curl and change color. Remove and drain. Remove all but 3 tablespoons of oil from the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the oil and add the minced gingerroot. Stir-fry for 10 seconds until fragrant. Add the sliced water chestnuts and stir-fry 15 seconds. Add the sauce and toss lightly until the mixture thickens. Add the shrimp and toss lightly to coat with the sauce, then transfer to a serving plate. To serve, take a pancake and spoon some hoisin sauce in the center. Sprinkle some chopped peanuts on top. Spoon some of the shrimp mixture into the center, roll up the pancake and eat."}], "link": "https://cooking.nytimes.com/recipes/11975-shrimp-amoy-popia"}