{"@context": "http://schema.org", "@type": "Recipe", "name": "Traditional Spring Rolls", "description": "", "author": {"@type": "Person", "name": "Nina Simonds"}, "image": null, "totalTime": "PT30M", "recipeYield": "16 spring rolls", "recipeCuisine": "asian, chinese", "recipeCategory": "project", "keywords": "appetizer, pork, spring roll wrappers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "recipeIngredient": ["1 pound boneless center-cut pork loin", "1 tablespoon soy sauce", "1 tablespoon rice wine", "1 teaspoon sesame oil", "1 teaspoon cornstarch", "1 teaspoon water", "1 tablespoon soy sauce", "1 tablespoon rice wine", "1/2 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1 teaspoon cornstarch", "1/4 cup flour", "6 tablespoons water", "1/2 cup safflower or corn oil", "4 cups shredded Chinese or Napa cabbage", "3 cups Chinese chives or scallion greens, cut into 1-inch sections", "4 cups fresh bean sprouts, rinsed lightly and drained", "2 tablespoons rice wine", "6 dried Chinese black mushrooms, softened in hot water, stems removed and caps shredded", "5 1/2 cups safflower or corn oil", "16 spring roll wrappers, or lumpia skins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove any fat or gristle from the pork loin. Going across the grain, make paper-thin slices and cut them into matchstick-size shreds. Place the shreds in a bowl, add the marinade, toss lightly to coat, and let stand 15 minutes. Combine the sauce ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the paste, combine the flour and water with a whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a well-seasoned wok, add 3 tablespoons oil, and heat until very hot. Add the Chinese cabbage and stir until just wilted, about 1 1/2 minutes. Add the Chinese chives or scallions, the bean sprouts and the two tablespoons of rice wine. Stir-fry another minute over high heat and remove with a strainer. Drain off any liquid and spread the mixture out on a tray to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the wok, add 3 tablespoons of oil and heat until very hot. Add the pork shreds and fry over high heat, stirring constantly, until they separate and change color. Remove and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pan, add 2 tablespoons of oil and heat until very hot. Add the shredded black mushrooms and toss lightly over high heat 30 seconds, until fragrant. Add the cooked pork and the sauce. Stir-fry briefly until sauce thickens and remove. Spread on a platter and cool. Once cool, mix with the cabbage-bean sprout mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange one spring roll wrapper flat on a counter. (Cover the others with a damp cloth to keep them them from drying out.) Grab a portion of filling - about 1/4 cup - and squeeze out any excess liquid. Place the filling across the lower third of the skin and, using your finger, spread some paste on the opposite edge. Starting at the edge near the filling, roll up the skin a little to enclose it. Fold in the two side ends and continue rolling over so that the skin forms a tight little package. Repeat for remaining skins and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok, add remaining oil and heat to 375 degrees. Add five or six spring rolls and fry, turning constantly, until golden brown and crisp. Remove with a slotted spoon; drain until cool on absorbent paper. Fry remaining rolls. Serve with hot mustard and plum sauce."}]}