{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Cure Soup", "description": "This soup started life as quite a different thing. I'd made a traditional Persian chicken, cinnamon and Seville-orange stew and realized that it was the scented broth I loved the most. So I cut to the chase. A supermarket packet of chicken wings, a stick of cinnamon, a carrot, an onion, a knob of ginger and the juice and zest of an orange left to simmer on the stove make a restorative broth that delights, soothes and helps fight off winter blues. I like it sprinkled with chopped cilantro and chilies, but you could make more of a meal of it by adding shredded chicken and noodles. \n\n(This recipe originally called for a Seville orange, but we've modified it so it can be made with a combination of orange and lime juice. If you have access to Seville oranges, all the better!)", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2015/12/10/dining/10COOKING-COLDCURESOUP1/10COOKING-COLDCURESOUP1-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "4 servings (about 6 cups)", "recipeCuisine": "", "recipeCategory": "one pot, soups and stews", "keywords": "chicken, orange, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 835}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 685, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "2 grams", "proteinContent": "60 grams", "saturatedFatContent": "14 grams", "sodiumContent": "971 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds chicken wings", "1 carrot, peeled and halved", "1 onion, peeled and halved", "1 cinnamon stick", "1 3-inch knob of ginger, peeled", "1 tablespoon Maldon salt or 1 1/2 teaspoons table salt", "1/4 cup fresh citrus juice (2 parts orange juice to 1 part lime juice), plus zest in strips", "Chopped cilantro, for garnish", "1 small red chili pepper, seeded and cut into fine rings, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stockpot, combine chicken, carrot, onion, cinnamon, ginger and salt. Add 3 quarts water, orange zest and juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place over high heat, and bring to a boil, then reduce heat to low. Simmer, uncovered, until liquid has reduced to about half and chicken flavor is strong, 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour through a fine mesh strainer into a bowl, and discard solids. Allow broth to cool, then refrigerate overnight. When ready to serve, remove layer of solidified fat from surface, and wipe surface of congealed soup with a paper towel to remove traces of grease. Soup may be covered and refrigerated for up to three days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm soup, ladle into mugs or bowls, and garnish."}]}