{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai Orange Duck", "description": "The Thai-style version of duck à l'orange here requires only a little more work. It does not take much time to begin with, but if it makes life easier, prepare the curry base in advance, then cook the duck breasts when guests arrive. Reheat the curry sauce, carve the meat and combine. The fragmenting segments of orange and the deep sourness of the juice perfectly complement the oily richness of the coconut and the fat sweetness of the meat.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2015/02/25/dining/orangeduck/orangeduck-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, one pot", "keywords": "duck, orange, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 497, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "4 grams", "proteinContent": "41 grams", "saturatedFatContent": "21 grams", "sodiumContent": "977 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["4 duck breasts, 2 1/2 to 3 pounds", "2 Seville oranges", "1 13 1/2-ounce can coconut milk", "1 1/2 tablespoons masaman or red Thai curry paste", "1 1/2 cups chicken broth", "3 kaffir lime leaves, cut into thin strips", "5 cardamom pods, bruised", "1 1/2 cups small green Thai eggplants, trimmed, or 1 cup sugar snap peas", "1 cup bamboo shoots", "2 tablespoons fish sauce", "Chopped fresh Thai basil or cilantro, for garnis"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler. Broil duck breasts until skin is crisp and meat is pink, about 5 minutes a side. Allow to rest, then slice diagonally. Alternatively, pan-fry breasts until just pink in center. Slice, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a fine microplane grater, grate zest of oranges, and set aside. In a wide saucepan, combine creamy top of coconut milk with curry paste. Place over medium-low heat, and whisk to make a smooth paste. Add rest of can of coconut milk, chicken broth, kaffir lime leaves and cardamom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using eggplants, add them to pan with duck pieces. Bring to a boil, then reduce heat to low, and simmer until eggplants are tender, about 15 minutes. Add bamboo shoots, fish sauce and orange zest. Cut one orange into peeled segments. Cut each segment in two, discarding any seeds, and add to curry. Juice remaining orange, and add juice to curry. If using sugar snaps, add them to curry, and cook 1 to 2 minutes. Pour mixture into bowls, garnish, and serve."}], "link": "https://cooking.nytimes.com/recipes/11993-thai-orange-duck"}