{"@context": "http://schema.org", "@type": "Recipe", "name": "Cornbread Tamale Pie", "description": "This recipe came to The Times in a 2006 magazine article about the 75th anniversary edition of The Joy of Cooking, the soup-to-nuts cookbook found on practically every home cook's shelf since its first publication in 1931. Like many of the book's beloved recipes, this dish is a crowd-pleasing, homespun classic that is incredibly simple to put together. First, make a quick chili of beef, black beans, corn, green pepper and onion seasoned with chile power and cumin. Spread that in a baking dish, top with a simple cornbread batter and pop it into the oven. In about a half hour: tamale pie. Serve with hot sauce, a dollop of sour cream and a few slices of avocado. If you're trying to eat less red meat, ground turkey or chicken would make a fine substitute for the beef.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2017/07/13/dining/13COOKING-CORNBREAD-TAMALEPIE1/13COOKING-CORNBREAD-TAMALEPIE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef, cornmeal, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1125}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 445, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "5 grams", "proteinContent": "21 grams", "saturatedFatContent": "7 grams", "sodiumContent": "678 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound ground beef", "1 medium onion, finely chopped", "1 cup rinsed and drained canned black beans", "1 cup corn, drained, canned or frozen (thawed if frozen)", "1 cup tomato sauce", "1 cup beef or chicken broth", "1/2 cup diced green bell pepper, optional", "1 tablespoon chile powder", "1/2 teaspoon ground cumin", "1 1/2 teaspoons salt, plus more to taste", "1/4 teaspoon black pepper, plus more to taste", "3/4 cup cornmeal", "1 tablespoon flour", "1 tablespoon sugar", "1 1/2 teaspoons baking powder", "1 egg", "1/3 cup milk", "1 tablespoon vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Grease a 3-quart high-sided casserole dish with cooking spray. In a large skillet, saute the beef and onion over medium-high heat until the meat is brown and the onion translucent, about 10 minutes. Then add the beans, corn, tomato sauce, broth, bell pepper (if using), chili powder, cumin, 1 teaspoon salt and 1/4 teaspoon black pepper. Simmer for 15 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the cornmeal, flour, sugar, baking powder and teaspoon salt. In a small bowl whisk together the egg, milk and oil until combined. Whisk the milk mixture into the flour mixture until combined. Spread the meat mixture into the casserole dish and cover with the corn bread topping. The topping will disappear into the meat mixture but will rise during baking and form a layer of corn bread. Bake until the corn bread is brown, 20 to 25 minutes."}], "link": "https://cooking.nytimes.com/recipes/12015-cornbread-tamale-pie"}