{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Stew With Tomato, Allspice and Fried Potatoes", "description": "After the first two festive days, typical Sukkot meals are casseroles and stews — like sofrito batatas, a spiced veal stew with fried potatoes mixed in — that can be easily transported to the sukkah, and are warming on cold fall nights.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, one pot", "keywords": "gluten-free, main course, potato, veal", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 630, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "3 grams", "proteinContent": "25 grams", "saturatedFatContent": "6 grams", "sodiumContent": "661 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons vegetable oil", "2 pounds boneless veal, from shoulder or other fatty cut, cut into 3- to 4- inch chunks", "Salt and pepper", "1 large onion, chopped", "1 tablespoon allspice", "1/2 teaspoon cinnamon", "1/2 cup tomato paste", "2 large Idaho potatoes", "Oil for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy pot with a lid, heat oil over high heat. Sprinkle meat with salt and pepper and lightly brown on all sides, working in batches if necessary to avoid crowding pan. Remove meat as it is browned. To empty pot, add onion and cook, stirring, until soft and golden. Add spices and cook, stirring, a few seconds, then stir in tomato paste. Pour in 1 cup water and bring to a simmer, scraping up browned bits from bottom of pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle meat into liquid, cover and cook at a bare simmer for at least 2 hours, turning meat every 20 minutes or so, until very soft and tender. Liquid will thicken to a sauce, but if it becomes too thick, add more water a little at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat has cooked for 2 hours, peel potatoes and cut in half first lengthwise and then crosswise into 1/2-inch- thick half-moons. Heat 2 inches oil in another pot to about 375 degrees. Working in batches if necessary to avoid crowding pan, fry potatoes until just golden and cooked through but not soft, about 5 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When sauce is thick and meat is falling apart, stew is done; this may take up to 3 hours. If needed, break meat up with a wooden spoon. Stir in potatoes and mix gently but thoroughly, so that potatoes absorb sauce. Serve hot."}]}