{"@context": "http://schema.org", "@type": "Recipe", "name": "Moqueca (Bahian fish stew)", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT4H20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "caribbean", "recipeCategory": "project", "keywords": "fish, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "recipeIngredient": ["1 1/2 pounds medium-size shrimp, peeled and deveined (save shells for broth)", "4 to 5 pounds fish heads, fish racks (bones left from fillets) or other scraps like shrimp shells", "1 medium-size onion, peeled and quartered", "8 cloves garlic", "8 scallions, green tops included, trimmed and cut into 4-inch-long pieces", "1 bay leaf", "3 sprigs parsley", "5 cups of water", "6 large or 12 small fish steaks, 2 to 3 pounds in all (kingfish, mackerel or bluefish preferred)", "12 large sea scallops", "Juice of 1 lemon", "Juice of 1 lime", "1/2 teaspoon salt", "Freshly ground black pepper to taste", "12 mussels", "1/2 pound fresh crab meat", "1 1/2 cups chopped onion", "1 medium-size green bell pepper, cored, seeded and coarsely chopped", "1 medium-size red bell pepper, cored, seeded and coarsely chopped", "1/4 cup olive oil", "4 ripe fresh tomatoes, or 1 14-ounce can imported plum tomatoes, liquid discarded, peeled and coarsely chopped", "1 bunch fresh coriander, coarsely chopped", "1 cup unsweetened coconut milk", "2 tablespoons palm oil", "Cayenne pepper to taste, if desired", "Pepper sauce (<a href=\"http://cooking.nytimes.com/recipes/12101-molho-de-pimenta-pepper-sauce\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "First make the fish stock. In a stockpot, combine the shrimp shells; fish heads and scraps; the quartered onion; 1 of the garlic cloves, peeled and lightly crushed; 4 of the scallions; the bay leaf, and parsley. Add the water, and bring to a boil. Skim off any foam that rises to the surface. Reduce the heat, and just barely simmer for about 2 hours or until the stock is well flavored. Strain, discarding the solids, and reserve. You should have about 5 cups of stock. The stock can be made well ahead of time and refrigerated or frozen until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shrimp, fish steaks and scallops on a deep platter, and sprinkle with lemon juice; lime juice; 1 clove of the garlic, finely chopped; salt, and pepper. Cover and set aside to marinate not less than 1 nor more than 2 hours. Turn the seafood at least once during this time. Rinse and debeard the mussels. Pick over the crab, discarding any bits of shell and cartilage. Reserve the mussels and crab until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stockpot over medium heat, saute the chopped onion; the remaining 6 cloves of garlic, chopped; the remaining scallions, and the bell peppers in olive oil, stirring frequently, until the vegetables are thoroughly wilted, about 10 minutes. Add 2 cups of the strained fish stock, the tomatoes and coriander, and bring to a simmer. Cover and simmer very gently for about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sauce has finished cooking, puree in a food processor or pass through a food mill. For a more elegant presentation, strain the resulting puree through a sieve. Return the puree to the stove over very low heat. Stir in the coconut milk, and let cook gently for 2 or 3 minutes, then add the palm oil and stir it in. Taste, and add a little cayenne pepper. Add the marinated seafood along with any juices that may have accumulated. Add the mussels. Cover and simmer until the shellfish have opened and the fish steaks are thoroughly cooked, 10 to 15 minutes. Add the crab meat, stir in, and serve immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pass the pepper sauce with the stew. A little spoonful (or more, depending on taste) should be drizzled over each serving."}], "link": "https://cooking.nytimes.com/recipes/12100-moqueca-bahian-fish-stew"}