{"@context": "http://schema.org", "@type": "Recipe", "name": "Riz au Lait", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, hazelnut, rice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 745, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "25 grams", "sodiumContent": "616 milligrams", "sugarContent": "64 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 14-ounce can Nestle Carnation sweetened condensed milk", "Sea salt", "1/2 vanilla bean", "1 cup heavy cream", "1/3 cup whole milk", "6 tablespoons sugar", "3 large egg yolks", "Butter for greasing pan", "2/3 cup hazelnuts or pistachios, toasted and roughly chopped", "1 dried apricot, finely chopped", "Salt", "2/3 cup sugar", "1/2 vanilla bean", "2 cups plus 2 tablespoons whole milk", "1/3 cup carnaroli, arborio or short-grain rice", "2 1/2 tablespoons sugar", "1 2/3 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the confiture de lait:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Bring a kettle of water to a boil. Pour the condensed milk into a glass pie pan or shallow baking dish. Stir in a few grains of sea salt and cover tightly with foil. Set in a roasting pan and add enough hot water to the pan so that the water rises halfway up the sides of the pie pan. Bake until the milk turns caramel-brown, 1 to 1 1/4 hours, checking the water level several times and adding water as needed. Cool in the roasting pan. If the caramel is lumpy, whisk or strain through a fine-mesh sieve. Keep refrigerated. To serve, warm gently in a hot-water bath."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the creme anglaise:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Split the vanilla bean, scrape out the seeds and place the seeds and pod in a small pot. Add the cream, milk and 3 tablespoons sugar and heat until just before it reaches a boil. In a medium bowl, whisk the egg yolks and remaining sugar until fluffy. Whisk just enough of the scalded cream mixture into the eggs to warm them, then pour into the cream mixture. Stir with a wooden spoon in a figure-eight motion over low heat until it coats the back of the spoon and the bubbles along the edge disappear. Pass through a fine-mesh sieve into a bowl set over an ice bath. Cool completely, then refrigerate."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the brittle:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a sheet pan. In a small bowl, mix the hazelnuts, apricot and a dash of salt. In a medium pot set over high heat, cook the sugar without stirring. As it starts to turn deep caramel, swirl the pan to distribute the sugar. Once the sugar has dissolved, remove from the heat and fold in the hazelnuts and apricot. Pour onto the sheet pan and let cool. Chop into small pieces."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare the riz au lait:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Split the vanilla bean, scrape out the seeds and place the seeds and pod in a medium saucepan. Add the milk and bring to a simmer. Stir in the rice and simmer, stirring occasionally, until it reaches the consistency of oatmeal, 25 to 30 minutes. Stir in the sugar. Cool to room temperature, then chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chilled rice to a large bowl. Whip the cream to stiff peaks. Fold the whipped cream into the rice, little by little, to desired thickness. It should be light and creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the confiture de lait, the creme anglaise and the brittle in separate bowls alongside the riz au lait, to be stirred in as desired."}]}], "link": "https://cooking.nytimes.com/recipes/12114-riz-au-lait"}