{"@context": "http://schema.org", "@type": "Recipe", "name": "Tartelettes Au Citron (Individual Lemon Tarts)", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Six to eight servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, lemon juice, pastry dough", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 185, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "222 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 recipe flaky sweet pastry dough (see below)", "2/3 cup freshly squeezed lemon juice (the juice of about 4 lemons)", "1/2 cup sugar", "3 tablespoons creme fraiche or heavy cream", "5 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry shells. On a lightly floured surface, carefully roll out the dough to a thickness of one-eighth inch. Fit the pastry into six to eight four-inch tart tins. With your fingertips, carefully press the pastry into the pan and up the side, trying not to stretch it. Trim the overhang, leaving about a half-inch edge. Tuck this overhang inside the pan, pressing gently against the side to create a sturdy, double-sided shell. If you build the pastry a bit higher than the height of the pan, you have less problem with shrinkage. Chill for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the shells carefully with heavy-duty foil, pressing well into the edges so the pastry does not shrink while baking. Tuck the foil into the bottom of the tart shells. Prick the pastry through the foil with the tines of a fork. Fill with weights of rice or beans - making sure you get all the way into the edges - to prevent shrinkage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the filled tins on a baking sheet and bake just until the pastry begins to brown around the edges and seems firm enough to stand up by itself, about 15 minutes. Carefully remove the foil and weights and continue baking until evenly light brown, about 10 to 15 more minutes. Watch the pastry carefully, for ovens vary and pastry can brown very quickly. Cool completely, for at least 15 minutes, before filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling. In a large mixing bowl, combine the lemon juice, sugar and cream and whisk until well blended. Add the eggs, one by one, mixing well after each addition. Strain the lemon cream through a sieve to remove any portions of yolk or impurities."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the lemon cream into the prepared tartlet shells, place them on a baking sheet and bake just until the lemon cream is firm in the center, about five more minutes. (Alternatively, to form a single large tart, the dough can be rolled into a 12-inch circle to fit a 10 1/2-inch tart shell. Continue as directed for the individual tarts, but increase baking time by 5 to 10 minutes.)"}], "link": "https://cooking.nytimes.com/recipes/12135-tartelettes-au-citron-individual-lemon-tarts"}