{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Clams, Roasted Tomatoes and Caramelized Garlic", "description": "Here is a very cool recipe that calls for roasting cherry tomatoes with garlic and oil, then using that mixture as the base of a pasta sauce heavy with clams. The juxtaposition of the slick linguine with the roasted, caramelized tomatoes and garlic, as well as the soft, briny clams, is an uncommon delight. Work hard to make sure not to overcook the pasta, so that it may finish in the sauce.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/26/dining/linguine/linguine-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "clams, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 192}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "4 grams", "proteinContent": "29 grams", "saturatedFatContent": "0 grams", "sodiumContent": "787 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["14 garlic cloves", "2 pints cherry tomatoes, a mix of colors is nice", "6 tablespoons extra-virgin olive oil, more for drizzling", "1/4 teaspoon fine sea salt", "1 teaspoon black pepper", "Salt", "1 pound dry linguine", "1/2 teaspoon crushed red pepper flakes", "1/2 cup dry white wine", "4 dozen littleneck clams, scrubbed", "1/4 cup torn mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Smash and peel 8 garlic cloves; peel and finely chop the remaining 6. Toss the smashed garlic with the tomatoes, 2 tablespoons of oil, fine sea salt, and 1/4 teaspoon black pepper. Spread the tomatoes out in a layer in one or two baking pans (make sure they aren't too crowded, so they don't steam) and roast tomatoes, tossing occasionally, until bursting, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot of heavily salted boiling water, cook the pasta until it is 2 minutes from being done to taste. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pasta pot to medium-high heat. Warm 4 tablespoons oil in the pot. Add the chopped garlic and red pepper flakes; cook for 30 seconds. Add the wine and let simmer 2 minutes. Stir in the roasted tomatoes and garlic. Add the clams. Cover the pot and cook until the clams open, 5 to 10 minutes. Use tongs to transfer open clams to a bowl; discard any that do not open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta and 3/4 teaspoon black pepper to the sauce in the pot. Cook, tossing, until pasta is just cooked through. Return the clams to the pot and toss with the pasta. Divide mixture among serving bowls. Garnish with mint and drizzle with more oil."}]}