{"@context": "http://schema.org", "@type": "Recipe", "name": "Leek and Cardamom Fritters", "description": "These leek fritters from Yotam Ottolenghi were featured in a Times Magazine article in 2011, and they are absolutely delicious, an easy answer to anyone asking for a vegetarian main dish. They’re somehow both ultratender and wonderfully crisp, sweet from the caramelized leeks and bright and riotously flavorful thanks to the abundance of herbs. You can substitute onions if leeks are unavailable. But try for leeks.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings (about 8 large fritters)", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 767, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "16 grams", "sodiumContent": "753 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 3/4 cup olive oil ", "3 leeks, thickly sliced ", "5 shallots, finely chopped", "1 teaspoon ground cumin ", "1/2 teaspoon ground coriander ", "1/2 teaspoon ground cardamom ", "1/4 teaspoon ground cinnamon ", "1 fresh red chili (like Thai), seeded and sliced", "1 cup fresh parsley (leaves and fine stems), finely chopped ", "2/3 cup fresh cilantro (leaves and fine stems), finely chopped", "2 to 3 ounces manouri cheese, broken into large chunks (or drained ricotta cheese or young goat cheese) ", "1 teaspoon salt ", "1 egg white ", "1 cup all-purpose flour ", "1 1/2 teaspoons baking powder", "1 whole egg ", "1/2 cup milk ", "4 tablespoons unsalted butter, melted ", "Lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 200. Put 1/3 cup of the oil in a large skillet over medium heat. When it’s hot, add the leeks and shallots and cook, stirring occasionally, until softened, about 10 minutes. Add the cumin, coriander, cardamom and cinnamon and continue to cook for 5 minutes. Transfer the onion mixture to a large bowl and add the chili, parsley, cilantro, manouri and salt. Allow to cool, then stir gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg white until soft peaks form, and fold it into the onions. In a separate bowl, stir together the flour, baking powder, whole egg, milk and butter to form a smooth batter. Gently fold it into the onion mixture. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons of the remaining oil in a large skillet over medium heat. When it's hot, ladle four spoonfuls (about half of the batter) into the pan to make four large fritters. Fry them until golden and crisp, 2 to 3 minutes per side. Drain on paper towels, then transfer to a platter in the oven to keep warm. Repeat with the remaining batter, adding more of the oil as needed. Serve warm or at room temperature, with lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/12159-leek-and-cardamom-fritters"}