{"@context": "http://schema.org", "@type": "Recipe", "name": "Focaccia With Sweet Onion and Caper Topping", "description": "This is much like pissaladière, the Provençal onion tart. It’s a perfect time of year to make it, with sweet spring onions in abundance in the markets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/05/14/science/15recipehealth1/15recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "12 to 15 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, capers, onion, dairy-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 97, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "181 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 recipe Whole-Wheat Focaccia", "2 tablespoons extra virgin olive oil", "2 large spring onions or white onions (1 1/2 pounds)", "Salt to taste", "2 tablespoons capers, rinsed and coarsely chopped", "2 teaspoons fresh thyme leaves", "2 garlic cloves, minced (optional)", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the focaccia dough as directed and set in a warm spot to rise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the onion filling. Heat the olive oil over medium heat in a large, heavy lidded skillet. Add the onions and cook, stirring, until they soften, about 5 minutes. Add a generous pinch of salt, the capers, thyme and garlic, and turn the heat to low. Cover and simmer gently, stirring often, for 30 to 40 minutes, until the onions have cooked down and are very soft and lightly colored but not browned. They should taste sweet. Season to taste with salt and pepper and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the focaccia dough has risen, shape as directed into 1 large focaccia or 2 smaller focacce. Cover with a damp cloth and let rise in a warm spot for 30 minutes while you preheat the oven to 425 degrees, preferably with a baking stone in it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dimple the dough with your fingertips and spread the onion mixture over the top in an even layer. Drizzle with olive oil. Bake, setting the pan on top of the baking stone (if using), for 20 to 25 minutes, until the bread is deep golden brown and bits of the onion topping are browned. Let rest for at least 10 minutes before serving, or allow to cool completely."}]}