{"@context": "http://schema.org", "@type": "Recipe", "name": "Harissa", "description": "Harissa is that fiery paste used in Tunisian cuisine. You can get it in tubes, but the homemade version tastes much fresher. Make a note on the label to top up with olive oil whenever the harissa is used so that it will keep for a long time.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/06/science/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "1 cup", "recipeCuisine": "middle eastern", "recipeCategory": "condiments, dips and spreads", "keywords": "dried chili peppers, garlic, healthy, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 101, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "8 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "74 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 ounces dried guajillo chilies, or a combination of guajillos and other hot dried chilies, like Japanese chilies or chiles de arbol", "2 ounces dried Anaheim or pasilla chilies", "4 garlic cloves, green shoots removed", "3/4 teaspoon caraway seeds, ground", "1/2 teaspoon coriander seeds, ground", "1 1/2 teaspoons salt", "3 tablespoons olive oil, plus additional for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wear rubber gloves to seed the chilies. Take the stems off and remove the seeds. Place in a bowl and cover with hot or boiling water. Place a small plate or a lid over the chilies to keep them submerged in the water. Soak for 1 hour, and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade and drop in the garlic. When it is all chopped and adhering to the sides of the bowl, stop the machine and scrape down. Add the drained chilies, the spices and the salt. Process until everything is chopped. Stop the machine and scrape down the sides. Turn on again, and with the machine running add 2 tablespoons water and the olive oil. Process until the mixture is smooth, stopping to scrape down the sides if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the sauce to a jar. Wipe the inside edges of the jar with a paper towel, then pour on a film of olive oil to cover the harissa. Top with a lid and refrigerate. The harissa will keep for 6 weeks in the refrigerator if you top it up with olive oil after each use."}], "link": "https://cooking.nytimes.com/recipes/12166-harissa"}