{"@context": "http://schema.org", "@type": "Recipe", "name": "Puréed Tomato and Red Pepper Soup", "description": "I noticed that the most popular boxed soup at my supermarket is a tomato and red pepper soup, so I decided to come up with my own version.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/13/science/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, side dish, dairy-free, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegan, vegetarian, red bell pepper, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 403}, "recipeIngredient": ["2 red bell peppers, roasted", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "1/2 cup diced carrot", "1/2 cup diced celery", "Salt to taste", "4 large garlic cloves, minced", "1 28-ounce can chopped tomatoes with juice", "1/4 cup tomato paste", "2 sprigs fresh basil", "Pinch of cinnamon", "1/2 teaspoon sugar (optional)", "1 1/2 quarts vegetable stock or water", "1/4 cup rice, preferably a medium-grain rice like arborio", "Freshly ground pepper", "Garlic croutons (toast thin slices of bread, rub with a cut clove of garlic, and cut into squares)", "Freshly grated Parmesan", "Slivered fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the peppers as directed, allow to cool in a covered bowl, then peel, seed and dice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy soup pot and add the onion. Cook, stirring often, until onion is translucent, about 3 minutes, and add the carrot and celery and a generous pinch of salt. Cook, stirring often, until the vegetables are tender and fragrant, about 5 more minutes. Stir in the garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add the tomatoes with their liquid, the tomato paste, basil sprigs, cinnamon, sugar if using, and salt to taste. Cook over medium heat, stirring occasionally, until the tomatoes have cooked down slightly and smell fragrant, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the diced roasted peppers, the stock or water, rice, and salt to taste. Bring to a boil, reduce the heat, cover and simmer 30 minutes, stirring from time to time. Season with freshly ground pepper, taste and adjust salt. Remove the basil sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, purée the soup, or use a blender and purée in batches, being careful to pull a dish towel down over the top and not to cover tightly with the blender lid, then return to the pot and heat through. Taste and adjust seasonings. Serve topped with croutons, Parmesan cheese, and/or slivered basil."}], "link": "https://cooking.nytimes.com/recipes/12169-pureed-tomato-and-red-pepper-soup"}