{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio Linzer Cookies With Orange Marmalade", "description": "These are linzer cookies — with a twist. Pistachios replace almonds, and orange blossom water accentuates the flavor of the pistachios and orange marmalade. They're much tangier and a bit less sweet than the traditional ones, but just as buttery, rich and compelling.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2011/12/07/dining/07APPE_SPAN/07APPE_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "About 18 large cookies and 9 small cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, orange marmalade, pistachio, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 388, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "11 grams", "sodiumContent": "82 milligrams", "sugarContent": "19 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups raw pistachios (285 grams)", "1 1/2 cups (339 grams) unsalted butter, room temperature", "1 3/4 cups confectioners’ sugar (128 grams)", "1 large egg", "1 teaspoon orange-blossom water", "2 cups all-purpose flour (276 grams)", "1 cup cornstarch (152 grams)", "1 1/2 teaspoons ground cinnamon", "1 teaspoon orange zest", "1/2 teaspoon grated nutmeg", "1/2 teaspoon fine sea salt", "1/8 teaspoon ground clove", "1 cup orange marmalade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, finely grind the pistachios. Add the butter and 1 cup sugar and pulse to combine. Pulse in the egg and orange-blossom water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the flour, cornstarch, cinnamon, orange zest, nutmeg, salt and clove. Add to the food processor and pulse until the mixture forms a moist dough. Divide dough in half and flatten each half into a disk. Wrap tightly with plastic and refrigerate 4 to 6 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place parchment paper on three large baking sheets. (If you don’t have three, roll out the dough in smaller batches and keep the rest refrigerated.) Take one disk of dough and roll it out on a floured surface to 1/4-inch thickness. Cut into 3-inch rounds, and transfer to a prepared baking sheet. Use a 1 1/2-inch cutter to stamp out a hole from the center of half (not all) of the cookies (this will form the “window” for the cookies). Transfer the smaller cookies to a prepared sheet. Repeat with the remaining dough. Gently combine and reroll any scraps. You will have three shapes of cookies on the cookie sheets: rings, large round cookies and small round cookies. Wrap each tray with plastic and refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. Bake cookies until just golden, about 15 minutes for the small rounds, and 18 to 22 minutes for the larger cookies. Transfer to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the marmalade in a microwave-safe bowl; microwave for 20 seconds and stir, until it's warm and easier to spread. Or heat slowly in a small pot over low heat. Spread each large round cookie with marmalade. Top with a large ring-shaped cookie. Spread half the small round cookies with marmalade and top with the remaining small round cookies. Generously dust all cookies with the rest of the confectioners' sugar."}], "link": "https://cooking.nytimes.com/recipes/12170-pistachio-linzer-cookies-with-orange-marmalade"}