{"@context": "http://schema.org", "@type": "Recipe", "name": "Tacos With Turkey Picadillo", "description": "Picadillo is a typical filling for tacos, enchiladas and chilies, traditionally made with ground beef. I lighten the sweet and savory mixture by using ground turkey breast.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/20/science/20recipehealth/20recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "dairy-free, gluten-free, healthy, high fiber, nut-free, main course, tortilla, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 163}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 321, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "8 grams", "proteinContent": "21 grams", "saturatedFatContent": "2 grams", "sodiumContent": "807 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 28-ounce can chopped tomatoes with juice", "1 tablespoon canola oil", "1 medium onion, finely chopped", "2 large garlic cloves, minced", "1 pound ground turkey breast", "1/4 teaspoon ground black pepper", "1 teaspoon medium-hot chili powder (more to taste)", "1 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1/4 cup raisins", "1 tablespoon plus 2 teaspoons cider vinegar or rice vinegar", "Salt to taste", "1 tart apple, peeled, cored and finely chopped", "12 corn tortillas", "2 cups shredded cabbage (about 6 ounces)", "Salsa and crumbled queso fresco as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse the canned tomatoes with juice in a food processor fitted with the steel blade until puréed. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the canola oil in a large, heavy skillet over medium heat and add the onion. Cook, stirring often, until onion is tender, about 5 minutes. Add the garlic and cook, stirring, until it is fragrant, 30 seconds to a minute. Turn the heat up to medium-high and add the ground turkey. Season to taste with salt and pepper and cook, stirring and breaking apart the meat, until it is lightly browned, about 8 minutes.  If the meat has released any liquid into the pan, carefully pour it off, then stir in the pepper, chili powder, cinnamon, cloves and raisins and stir together for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the puréed tomatoes, 1 tablespoon of the vinegar and salt to taste, and bring to a simmer. Simmer 15 minutes over medium-low heat, stirring often. Add the apple and continue to simmer for 10 minutes, or until the mixture is thick and meaty. Taste and adjust the seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the cabbage with cold water and let sit for 5 minutes. Drain and spin dry. Toss with the remaining vinegar. Heat the tortillas and spoon the picadillo onto each one. Top with shredded cabbage, garnish with salsa and crumbled queso fresco if desired, and serve."}]}