{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft Tacos With Mushrooms and Cabbage", "description": "Two nutrient-dense vegetables combine forces in this delicious filling. Mushrooms are an excellent source of vitamins and many minerals, particularly selenium, copper, potassium, phosphorous, zinc, and manganese – and they contain a powerful antioxidant called L-ergothioneine. They're used medicinally throughout Asia for their immunity-boosting properties. They also contain more protein than most other vegetables, and their meaty texture makes them a perfect choice for vegetarians. Cabbage possesses phytochemicals like sulforaphane, which protects the body against cancer-causing free radicals, and indoles, which help metabolize estrogens. It’s also an excellent source of vitamins K and C, and a very good source of  dietary fiber, vitamin B6, folate, manganese and omega-3 fatty acids.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/20/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "4 servings.", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "cabbage, mushroom, tortilla, dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 225}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "10 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "929 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 pound mushrooms, cut in thick slices", "1 bunch scallions, white and light green parts, finely chopped", "2 garlic cloves, minced", "Salt and freshly ground pepper to taste", "1 small head cabbage", "1/4 cup chopped cilantro", "1/4 to 1/2 cup Chipotle Ranchera Salsa", "8 corn tortillas", "Queso fresco to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy skillet over medium-high heat and add the olive oil. When the oil is hot, add the mushrooms and sear, stirring often or tossing in the pan, until they are lightly colored and beginning to sweat, 3 to 5 minutes. Add the scallions and cook, stirring, for about 1 minute, until tender. Add the garlic and cook, stirring, until fragrant, 30 seconds to a minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the mushrooms with salt and pepper and stir in the cabbage. Cook, stirring often, until the cabbage is tender, about 5 minutes. Add salt and pepper to taste and stir in the cilantro and .25 to .5 cup of the salsa (to taste)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the tortillas. Top with the mushroom/cabbage mixture, sprinkle with cheese if desired, and serve."}]}