{"@context": "http://schema.org", "@type": "Recipe", "name": "Albacore Roasted in a Bed of Lettuce", "description": "This is inspired by a traditional Provençal tuna dish. Albacore works just as well. It has a lot going for it as a New Year’s dish, what with all the green leaves and the fish – lots of prosperity. Saffron is optional. I like to serve the lettuce, cut into strips, on the side.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/27/science/28recipehealth/28recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "albacore tuna, fish, dairy-free, gluten-free, healthy, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 332, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "44 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1053 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds albacore steaks, the thicker the better", "4 anchovy fillets, rinsed and cut in 1/4-inch pieces (optional)", "2 tablespoons extra virgin olive oil", "1 large onion, cut in half lengthwise, then sliced thinly across the grain", "4 garlic cloves, minced", "1 14-ounce can chopped tomatoes", "Pinch of saffron (optional)", "Salt and freshly ground pepper to taste", "2 heads soft green lettuce, like bibb or green oak leaf, leaves separated and washed", "1 large or 2 small lemons, sliced very thin", "3/4 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Make small slits in the tuna steaks with the tip of a paring knife and slide the anchovy pieces into the slits. Season the steaks with salt and pepper and set aside. Measure the thickness of the tuna steaks; this will determine the roasting time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy skillet or saucepan and add the onions. Cook, stirring, until onion is tender, about 5 minutes. Add the garlic, stir until it is fragrant, 30 seconds to a minute, and stir in the tomatoes, optional saffron, salt and pepper to taste. Bring to a simmer and cook, stirring often, until the tomatoes have cooked down slightly and smell fragrant, about 10 minutes. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy ovenproof casserole over high heat and add the remaining tablespoon of olive oil. Season the tuna steaks on both sides with salt and pepper and sear for 30 seconds on both sides (make sure the pot is hot when you add them or they will stick). Transfer to a plate. Stir in half the tomato sauce, scraping the bottom of the pan to deglaze, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay half the lettuce leaves over the tomato sauce and place the tuna steaks on top of the lettuce leaves in a single layer. Cover the steaks with the lemon slices, and spoon on the remaining tomato sauce. If there are any more lemon slices, lay them over the tomato sauce. Top with the remaining lettuce leaves. Pour the wine into the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover tightly and place in the oven. Bake 1 1/2-inch thick steaks for 15 minutes, 2-inch thick steaks for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove the lettuce to a cutting board and slice in thin strips. Transfer the tuna to a warm platter. Remove the lemon slices and discard if desired. Bring the sauce in the pan to a simmer over high heat and reduce for about 5 minutes. Stir the sauce, and spoon over the tuna. Garnish with the lettuce, or serve it separately in a bowl. You can also discard it, but I like the taste and texture. Slice the fish across the grain and serve."}]}