{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Worcestershire Sauce, Two Ways", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT5H", "recipeYield": "2 cups thick sauce; 6 cups thin", "recipeCuisine": "", "recipeCategory": "condiments, project", "keywords": "vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 347, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "11 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "2790 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 piece kombu (dried kelp), 4 to 6 inches long", "3 dried shiitake mushrooms", "2 cups vegetable trimmings (stalks, stems and skins from vegetables like tomatoes, onions, celeriac, carrots, ginger, cabbage, broccoli or cauliflower and potatoes)", "3 pounds tomatoes, blanched and peeled", "1 large yellow onion, peeled and roughly chopped", "4 small carrots, peeled and cut into 1/2 inch slices", "1 large celery rib, cut into 1/2 inch slices", "4 inches fresh ginger, peeled and thinly sliced", "1 teaspoon cinnamon", "6 bay leaves", "1/2 teaspoon black peppercorns", "1/2 teaspoon sansho peppercorns, Sichuan peppercorns or green peppercorns", "1 tablespoon ground, dried sage", "1 tablespoon soybean powder (optional)", "1 teaspoon ground cloves", "1 teaspoon ground nutmeg", "1 teaspoon dried thyme", "1/2 small dried hot red chili", "1 cup rice vinegar", "3/4 cup soy sauce (preferably a mixture of tamari and shoyu)", "1/2 cup light brown sugar", "2 tablespoons plus 1 teaspoon salt", "1 cup red wine", "1 large apple, peeled and finely grated", "Shichimi (Japanese seven-spice powder) to taste."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Two days before you want to make the Worcestershire sauce, combine the kombu with 1 cup cold water and refrigerate overnight. Strain and reserve both the kombu and the liquid. Then soak the shiitake mushrooms in the liquid overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the kombu in a large stockpot with 8 cups water. Bring to a boil, then reduce the heat and very gently simmer for 2 hours. Add the vegetable trimmings to the stockpot and cook for another 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the stock is cooking, pure the tomatoes in a blender or food processor; strain with a fine sieve into a large pot over high heat. Drain and thinly slice the reconstituted shiitake mushrooms (discard their soaking liquid). Add the mushrooms, onion, carrots, celery and ginger to the tomato purée. Bring the tomato mixture to a boil, then reduce the heat to low and simmer for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cinnamon, bay leaves, black peppercorns, sansho peppercorns, sage, soybean powder (if you're using it), cloves, nutmeg, thyme and chili to the tomato mixture; cook for 10 minutes. Cool slightly, then blend gently in a blender or food processor; you want all the spices to be finely ground but not liquefied. Return the tomato mixture to the pot and add the rice vinegar, soy sauce, brown sugar and salt. Cook over medium heat for 10 minutes, then turn the heat to medium-high and cook for another 10 minutes; turn the heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the vegetable stock and discard the solids. Put the wine and 3 cups of the vegetable stock in a saucepan over high heat; cook until reduced by .75, about 15 minutes. Strain .5 of the tomato mixture into the reduced wine-stock mixture and keep warm (this is the \"thin\" sauce)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the apple to the remaining tomato mixture; simmer for another 10 minutes, then add a dash of shichimi. Taste and adjust the seasoning. (This is your \"thick” sauce.) Use the sauces immediately or transfer to airtight containers and refrigerate for up to 2 weeks."}]}