{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon-and-Apple Quiche With Flaky Pie Crust", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Bacon-and-Apple-Quiche/Bacon-and-Apple-Quiche-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, project", "keywords": "fall, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 489, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "20 grams", "sodiumContent": "438 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plus 2 tablespoons all-purpose flour, plus more for rolling", "1/2 teaspoon salt", "6 tablespoons cold, unsalted butter, cut into about 8 pieces", "3 tablespoons ice water, plus more if necessary", "8 to 10 slices of good bacon", "2 large apples, peeled, cored and then grated or chopped", "Salt and freshly ground black pepper", "1 teaspoon fresh rosemary, minced", "1/4 cup crumbled blue cheese, like Roquefort", "4 eggs at room temperature", "1 1/3  cup cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 and set the rack in the middle. Combine the flour and salt in a food processor and pulse once or twice. Add the butter and process until the mixture looks like cornmeal. Put the mixture in a bowl and add the ice water; mix with your hands until you can form the dough into a ball, adding another tablespoon of ice water if necessary. Wrap the ball in plastic and freeze for 10 minutes (or refrigerate for at least 30 minutes, or up to a couple days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a countertop with flour and put the dough on it, sprinkling more flour on top. Use a rolling pin to roll with light pressure from the center out. If the dough is hard, let it rest for a few minutes; if it’s sticky, add a little flour. Roll, adding flour and rotating and turning the dough as needed; use ragged edges of dough to repair any tears, adding a drop of water when you press a patch in place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the diameter of the dough is about 2 inches greater than that of a 9-inch tart pan, drape the dough over the rolling pin and transfer it into the pie plate. Press the dough firmly into the plate, all over. Once the dough is in place, trim as necessary; freeze for 10 minutes or refrigerate for 30 or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prick the pie crust with a fork all over, then bake it for 10 to 12 minutes, or until beginning to brown; remove and turn the oven down to 375. Meanwhile, fry the bacon in a large, deep skillet over medium heat, then remove from pan with a slotted spoon; cool and chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour out all but one tablespoon of bacon fat and use the same pan to fry the apples. Add salt, pepper and rosemary. Turn the heat up to medium-high and cook, stirring frequently, until the apple is soft and lightly browned, at least 15 minutes. Adjust the heat so it doesn’t brown too much or crisp up. Turn off the heat and spread apples onto the crust; then sprinkle with bacon and cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, whisk together the eggs and cream. Put the semicooked shell on a baking sheet and pour in the egg mixture. Bake for 30 to 40 minutes, or until almost firm (it should still jiggle just a little in the middle) and lightly browned on top; reduce the oven heat if the shell’s edges are darkening too quickly. Cook on a rack; serve warm."}], "link": "https://cooking.nytimes.com/recipes/12195-bacon-and-apple-quiche-with-flaky-pie-crust"}