{"@context": "http://schema.org", "@type": "Recipe", "name": "Rosemary Candied Orange Peel", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2014/04/18/dining/Candied-Orange-Peel/Candied-Orange-Peel-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "1.5 pounds", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "dessert, orange, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 37}, "recipeIngredient": ["6 thick-skinned oranges, like navels", "4 1/2 cups sugar", "Leaves of 1 rosemary branch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Quarter the oranges, discarding any woody stems, then peel the sections. Save the fruit for another use. (Or halve the oranges and juice them.) In a large saucepan, cover the peels with water and bring to a boil. Reduce the heat and keep at a low boil for 10 minutes, stirring several times. Drain into a colander. Repeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the empty pan, stir 4 cups sugar into 2 cups water. Tie the rosemary leaves in a piece of cheesecloth and add to the pan. Set over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the blanched orange peels into .25 inch-wide strips. (If you juiced the oranges, first scrape away any remaining pulp and membrane with a spoon.) Add to the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the syrup, and when it begins to boil, reduce the heat to very low. Simmer quite gently for 45 minutes, stirring once or twice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set 2 or 3 racks over wax paper. With a slotted spoon, transfer the orange peels to the racks, side by side, with a little space between them. Dry overnight. (Strain the syrup through a fine sieve and keep it in the refrigerator for sweetening punches, cocktails or tea; for macerating fresh fruit; or for soaking poundcakes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, toss the orange peels with the remaining .5 cup sugar. Serve them with chocolate or dates; dip them in melted dark chocolate; or use them in cakes, ice cream or other desserts. The candied orange peels will keep, refrigerated in an airtight container, for several months"}], "link": "https://cooking.nytimes.com/recipes/12204-rosemary-candied-orange-peel"}