{"@context": "http://schema.org", "@type": "Recipe", "name": "Soba With Black-Eyed Peas and Spinach", "description": "I’m bringing together good luck charms from all over the globe in this comforting dish. Soba (buckwheat noodles) is traditional in Japan, black-eyed peas in the American South, and spinach or other greens pretty much everywhere. Buckwheat pasta does exist in Northern Italy; it's called pizzoccheri, and it’s traditionally tossed with a rich cabbage and cheese topping.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/27/science/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, black-eyed peas, soba noodles, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 337, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1145 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 cup (6 ounces) black-eyed peas, rinsed", "1 quart water", "1 onion, cut in half", "3 garlic cloves, minced", "A bouquet garni made with a bay leaf, a Parmesan rind and a sprig each of parsley and thyme", "Salt to taste", "2 tablespoons extra virgin olive oil", "1 red bell pepper, cut in small (1/4-inch) dice", "1 12-ounce bunch spinach, stemmed and washed, or a 6-ounce bag of baby spinach", "Freshly ground pepper", "8 ounces soba", "Freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the black-eyed peas and water in a large saucepan or soup pot and bring to a gentle boil over medium-high heat. Skim off any foam, then add the onion, 2 of the minced garlic cloves, the bouquet garni and salt to taste. Reduce the heat to low, cover and simmer 40 minutes, or until the beans are thoroughly tender but intact. Taste the broth and adjust salt. Remove the onion and bouquet garni and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot two-thirds of the way full with water (soba will bubble up, and if you fill the pot too full the foamy water will overflow) and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the olive oil over medium heat in a large, heavy skillet and add the red pepper. Cook, stirring often, until it is just tender, 3 to 5 minutes. Add the garlic and cook, stirring, until it is fragrant, 30 seconds to a minute. Add the beans with their liquid to the pan and bring to a boil. Boil over medium-high heat until the broth reduces a bit, and stir in the spinach. Stir just until it is wilted, and remove the pan from the heat. Add salt and freshly ground pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the soba water comes to a boil, add salt to taste and the soba. Let the water bubble up until it is just about to reach the top of the pot, then turn the heat down to low so that the water retreats. Turn the heat up again and let the water come back up, then turn the heat back down. Repeat one more time. The soba should be cooked by the end of the third round. If it is not, repeat one more time. Drain and toss with the bean and spinach mixture, either in the pan or in a wide bowl. Serve with freshly grated Parmesan."}]}