{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Short-Rib Adobo", "description": "This hearty recipe is adapted from \"Memories of Philippine Kitchens: Stories and Recipes From Far and Near,\" by Amy Besa and Romy Dorotan. These short ribs are quite simple to prepare, and after about 2 hours of braising, you end up with intensely flavorful, tender meat that falls from the bone.", "author": {"@type": "Person", "name": "Nick Fox"}, "image": "https://static01.nyt.com/images/2017/02/21/dining/21COOKING-SHORT-RIB-ADOBO1/21COOKING-SHORT-RIB-ADOBO1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, one pot", "keywords": "beef, short ribs, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 377}, "recipeIngredient": ["3 pounds short ribs", "1/2 teaspoon kosher salt", "Black pepper", "3 tablespoons oil", "1 cup chicken stock", "1 cup coconut milk", "1 cup cider vinegar", "1/2 cup soy sauce", "1 head garlic, cloves separated and peeled", "3 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 275 degrees. Season the ribs all over with salt and pepper. In a large Dutch oven over medium heat, pour in the oil. When it is warm but not smoking, add the ribs to the pan, in batches if necessary, and brown well on all sides, 4 to 6 minutes. Remove the ribs from the pan and pour out the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining ingredients and 1 teaspoon black pepper, stir well, and add the ribs back in one layer. Use two pans if necessary, distributing the liquid. Bring to a boil over high heat. Turn off heat, cover the pan and put it into the oven. Cook until the meat is tender and falling off the bone, about 1 .5 to 2 hours. The liquid should only simmer very gently. Skim off excess fat when you check on it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer ribs to a broiling pan. Put the braising liquid over high heat; boil for 10 to 15 minutes to thicken it. Meanwhile, put the ribs under the broiler until brown. (You can dispose of the bones if they become loosened.) Put ribs on a platter; pour sauce on them."}]}