{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Nik", "description": "After living in what must have seemed like every neighborhood in three boroughs, my mother’s parents, in their old-ish age, settled in Astoria, which is where I spent almost all the Thanksgivings of my childhood. Thanksgiving was always (in my memory) gray and blustery, and my grandmother’s kitchen, steamy. She produced, almost solo, the traditionally ridiculous abundance of food, including my favorite, the potato “nik,” a huge latke fried in chicken fat until really brown, and as crisp as perfectly done shoestring fries. I still make this, and so can you.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/11/27/dining/27FLEX_SPAN/27FLEX_SPAN-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "eastern european", "recipeCategory": "easy", "keywords": "main course, side dish, onion, potato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 349}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 180, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "440 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 2 pounds baking potatoes, like Idaho or russet, peeled", "1 medium onion, peeled", "2 eggs", "Salt and freshly ground black pepper to taste", "2 tablespoons plain bread crumbs or matzo meal", "Neutral oil, like corn or grape seed."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate potatoes and onion by hand or with grating disk of a food processor; drain in colander or strainer. Combine potatoes and onions in a large bowl with eggs, salt, pepper and bread crumbs or matzo meal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put about 1/8 inch oil in a large, deep skillet, either nonstick or seasoned cast iron; turn heat to medium-high. When oil is hot (it will shimmer) put all the batter in pan, and smooth the top. Cook, shaking pan occasionally; adjust heat so mixture sizzles but does not burn. Continue until bottom is nicely browned, at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To turn, slide cake out onto a large plate, cover with another large plate and invert. Add a little more oil to pan if necessary, and slide pancake back in, cooked side up. Cook 15 minutes or so longer, until nicely browned. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/12207-potato-nik"}