{"@context": "http://schema.org", "@type": "Recipe", "name": "Miso-and-Apple-Glazed Baked Ham", "description": "", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2015/12/09/dining/09COOKING-APPLEBAKEDHAM1/09COOKING-APPLEBAKEDHAM1-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 to 12 servings.", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "ham, miso, pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 40}, "recipeIngredient": ["1 sirloin end ham, spiral-sliced or unsliced, 7 to 8 pounds, preferably without added nitrates or water", "1/2 cup white miso", "2 tablespoons apple butter", "1/2 cup apple cider", "1 Granny Smith apple, peeled and coarsely grated", "1/2 cup light brown sugar", "2 teaspoons coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving the ham in the inner plastic sleeve in which it came, submerge it in a large bowl or sink filled with hot tap water. Let it sit for an hour, changing the water halfway through to assure that the water stays warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 250 degrees with the rack on the lowest shelf. Unwrap the ham and place cut-side down on heavy-duty aluminum foil, wrapping and sealing it securely so it will not leak. Place on the oven shelf cut-side down and bake until the internal temperature reaches about 110 degrees, 8 minutes a pound or about 1 hour for a 7-pound ham. While the ham is baking, prepare the miso-and-apple glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the glaze: In a medium saucepan, combine the miso, apple butter, apple cider, grated apple, sugar and pepper. Place over medium heat and stir until the mixture is thick and bubbly, about 4 minutes. Remove from heat and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the ham reaches 110 degrees, remove it from the oven and put on a baking sheet. Raise the oven temperature to 450 degrees. Pull the foil away from the top of the ham, and brush the ham liberally with the glaze, allowing excess to drip to the bottom of the foil. Return the ham to the oven. Bake until the glaze forms a bubbly, sticky crust (about 10 minutes) or bake for 5 minutes and put it under the broiler for a few minutes until the crust is slightly burnt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven, tent loosely with foil, and let it rest for 10 minutes before carving. Serve doused with the mixture of juices and glaze in the bottom of the foil."}], "link": "https://cooking.nytimes.com/recipes/12211-miso-and-apple-glazed-baked-ham"}