{"@context": "http://schema.org", "@type": "Recipe", "name": "Mortadella Mousse", "description": "With blanc de blancs Champagnes, inspiration comes easily. Pop open a tin of caviar, but also consider fat-rich cured meats and cheeses, like an irresistibly delicate, almost buttery mortadella mousse swirled on toast. I puréed diced mortadella, smoothed it with mascarpone and sharpened it with grated Parmesan. Then I recalled a mortadella spread at Osteria Morini, a SoHo restaurant that specializes in the food of Emilia-Romagna, the home of mortadella. Michael White, the chef and an owner, uses ricotta and heavy cream in his spuma di mortadella. Same idea, but I put my money on my mascarpone. I did add his fragrant touch, a pinch of nutmeg. Canapés can be served as is or, with a dusting of extra Parmesan, lightly browned under the broiler.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/mortadella-still/mortadella-still-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 50 canapés, 8 servings", "recipeCuisine": "", "recipeCategory": "quick, dips and spreads", "keywords": "mascarpone, mortadella, nutmeg, parmigiano-reggiano, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 126, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": null, "proteinContent": "6 grams", "saturatedFatContent": "5 grams", "sodiumContent": "428 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound mortadella in one piece, rind removed", "1/4 cup mascarpone", "1/3 cup grated Parmigiano-Reggiano cheese (about 1 ounce)", "Pinch of nutmeg, preferably freshly grated", "Toast rounds for serving", "Whole shelled, salted pistachios or capers for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice mortadella and place in a food processor; grind to a paste. Add the mascarpone, 1/3 cup grated cheese and the nutmeg. Process until blended. Spread on toast and top each with a pistachio or caper, or refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Alternatively, each canapé without the garnish can be dusted with about a half-teaspoon of grated cheese, arranged on a baking sheet and run under the broiler briefly, about a minute, to lightly brown the top."}], "link": "https://cooking.nytimes.com/recipes/12216-mortadella-mousse"}