{"@context": "http://schema.org", "@type": "Recipe", "name": "Peppered Duck Breast With Red Wine Sauce", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2011/12/28/dining/28KITCH4_SPAN/28KITCH4_SPAN-articleLarge-v2.jpg", "totalTime": "PT11H30M", "recipeYield": "6 servings ", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "duck, peppercorns, red wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 239, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "27 grams", "saturatedFatContent": "4 grams", "sodiumContent": "817 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 Muscovy duck breasts, about 1 pound each", "Salt ", "1 tablespoon freshly crushed black peppercorns ", "4 garlic cloves, sliced", "Thyme sprigs ", "2 tablespoons unsalted butter ", "1 large shallot, sliced ", "1 tablespoon tomato paste", "1/4 cup plus 2 tablespoons medium-bodied red wine", "2 cups unsalted chicken broth", "1 tablespoon Cognac or brandy", "2 teaspoons potato starch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tenderloins, thin strips of meat on undersides of the duck breast, and reserve for the sauce. With a sharp knife, trim away any gristle from the undersides and trim any excess fat from the edges of the breasts. Score the skin in a diamond-shaped pattern, without cutting to the meat. Lightly sprinkle salt on both sides, then rub 1 teaspoon crushed black peppercorns all over. Sprinkle with the garlic and a few thyme sprigs, cover, and leave at room temperature for an hour. (For deeper flavor, refrigerate for several hours or overnight, then return to room temperature to cook.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the unsalted butter in a saucepan over medium heat. Add the shallot and the reserved duck tenderloins; let them brown well, stirring occasionally, 5 to 8 minutes. Stir in the tomato paste and a small thyme sprig and let them fry for a minute, then add\n\n.25 cup wine and the chicken broth. Raise the heat to a brisk simmer and let the liquid reduce to about 1.25 cups, about 10 minutes. Strain the sauce and return to the heat. Add the remaining 2 tablespoons red wine and the Cognac or brandy and cook for 1 minute more. Dissolve potato starch in 2 tablespoons cold water, then stir into sauce. Whisk in the remaining 1 tablespoon butter. Taste and add salt as necessary. (Sauce may be made in advance and reheated, thinned with a little broth.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard the garlic and thyme sprigs from the breasts. Heat a large heavy-bottomed skillet over medium-high heat. When the pan is hot, lay in the duck breasts skin side down and let them sizzle. Lower the heat to medium and cook for a total of 7 minutes, checking to make sure the skin isn&rsquo;t browning too quickly. With tongs, turn the breasts over and let them cook on the bottom side, 3 minutes for rare, 4 to 5 minutes for medium-rare. Transfer to a warm platter and let rest for 10 minutes. Slice crosswise, not too thickly, at a slight angle. Serve with the sauce. "}], "link": "https://cooking.nytimes.com/recipes/12245-peppered-duck-breast-with-red-wine-sauce"}