{"@context": "http://schema.org", "@type": "Recipe", "name": "Couscous With Turnips and Sweet Potatoes", "description": "Turnips store well and are a vegetable you can count on during the winter. They are rich in sulfuric compounds, particularly glucosinolates, that are believed to have antioxidant properties. They’re also a very good source of potassium. When you can get them with the greens attached, they’re a two-in-one crop, like beets, as their greens bring you a whole new set of nutrients – lots of calcium, vitamin K, vitamin A and beta carotene – and culinary possibilities. Turnip greens are similar in flavor to kale, perhaps a little more bitter, and with a more delicate texture. Winter turnips are not sweet and tender like young spring turnips. They stand up to longer cooking times, so they’re perfect for soups, stews and gratins. But I found them equally welcome in a frittata and a stir-fry. This spicy, comforting couscous demands little in the way of prep time. It’s the long simmer on the stove that results in the tasty broth. As it simmers, the sweet potato falls apart into small bits that tint the broth.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/01/03/science/02recipehealth/02recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings.", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chickpea, couscous, turnip, dairy-free, healthy, high fiber, low cholesterol, low-fat, nut-free, vegan, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 406, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "13 grams", "proteinContent": "16 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1430 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 onion, chopped", "1 leek, white and light green parts only, cut in thick slices and cleaned", "4 large garlic cloves, minced", "Salt, preferably kosher salt, to taste", "2 teaspoons cumin seeds, lightly toasted and ground", "1 teaspoon coriander seeds, lightly toasted and ground", "1 teaspoon caraway seeds, lightly toasted and ground", "1/2 teaspoon cayenne (more to taste)", "A bouquet garni consisting of 8 sprigs each parsley and cilantro", "1 tablespoon tomato paste", "1 tablespoon harissa (more to taste), plus additional for serving", "1 large sweet potato (about 10 ounces), peeled and cut in large dice", "1 pound turnips, cut in wedges", "1 large carrot, peeled and cut in thick slices", "6 cups water", "Salt to taste", "1 can chickpeas, drained and rinsed, or 1.5 cups cooked chickpeas", "1/2 chopped fresh parsley or cilantro, or a combination", "1 1/2 to 2 cups couscous, preferably whole-wheat couscous (1/4 to 1/3 cup unreconstituted couscous per person)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all the ingredients except the chickpeas and chopped parsley or cilantro and bring to a boil. Reduce the heat to low, cover and simmer for 1 hour. Taste and adjust salt. The stew should be spicy and flavorful. Stir in the chickpeas and parsley or cilantro and heat through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reconstitute and steam the couscous. Serve the couscous in wide bowls or mound onto plates and top with the stew and a generous amount of broth. Pass more harissa at the table."}]}