{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Pojarski", "description": "This retro indulgence, called Pojarski de veau (veal Pojarski), was supposedly a favorite of Czar Nicholas I. It gained popularity in Montreal after the city hosted Expo in 1967. It is made with diced veal, mushrooms and butter, formed into a plump, flat-topped meatball and then stuck with a roasted bone, so that the dish looks like a chop but tastes richer and more tender. On any given day in the Joe Beef kitchen, the dish might also include ends of charcuterie, bacon, ham and seared duck livers; its essence is the succulent combination of cured and cooked meat.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/vealpojarski-still/vealpojarski-still-articleLarge-v3.jpg", "totalTime": "PT1H", "recipeYield": "2 servings", "recipeCuisine": "canadian, russian", "recipeCategory": "dinner", "keywords": "ground veal, veal, veal bones, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1281, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "100 grams", "fiberContent": "4 grams", "proteinContent": "70 grams", "saturatedFatContent": "46 grams", "sodiumContent": "1178 milligrams", "sugarContent": "5 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1/4 cup dried porcini mushrooms", "4 tablespoons unsalted butter", "1 shallot, finely chopped", "1 clove garlic, minced", "1/4 cup torn, day-old white-bread pieces (no crusts)", "1/4 cup of milk", "8 ounces diced roasted veal, pork or beef", "8 ounces ground veal", "Leaves of 1 thyme sprig", "1 egg, lightly beaten", "1 teaspoon salt", "pepper", "2 clean veal or lamb chop bones (optional; available at butcher shops)", "4 thin slices bacon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the mushrooms in warm water to cover until soft (about 30 minutes), then drain and coarsely chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt 1/2 the butter over medium heat. Add the mushrooms, shallot and garlic. Cook, stirring, until shallot is translucent and soft, about 5 minutes. (Do not brown.) Transfer to a plate and set aside to cool for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak bread in milk for 15 minutes, then lightly squeeze dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine porcini mixture, soaked bread, roasted meat, ground veal, thyme, egg and salt. To taste for seasoning, heat a small skillet and fry a chunk of the mixture until browned. Add salt and pepper to mixture, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the mixture in half and shape each half into a ball, with a slightly flattened top and bottom. If using bones, poke a hole in one side of each ball and stick a bone into the hole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the remaining 2 tablespoons butter in a heavy baking dish and gently lay the balls side by side. Lay 2 pieces of bacon on each and roast for 30 to 40 minutes, basting every 4 or 5 minutes, until sizzling and fragrant. Remove bacon for last 5 minutes of cooking. Serve hot."}]}