{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Braised With White Beans and Turnips", "description": "Bordeaux is more distinctive for wines than food, though its vinously sauced dishes are famous, as is its lamb from Pauillac. Indeed, while tasting, it struck me that succulent lamb, with slightly gamy fat, would best unpin the tight embrace of the 2008 vintage from the Médoc. I braised chunks of lamb shoulder in wine, gave the dish an edge with lemon zest and white turnips, and added buttery white beans, a classic partner for lamb. If you like canned beans, rinse and drain them, and add in place of the cooked beans, with the turnips, during final simmering.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/01/04/dining/04PAIR_SPAN/04PAIR_SPAN-articleLarge-v2.jpg", "totalTime": "PT2H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, dry white wine, lamb, turnip, white beans, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1179, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "6 grams", "proteinContent": "64 grams", "saturatedFatContent": "33 grams", "sodiumContent": "1813 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["2/3 cup dried white cannellini, Tarbais or great northern beans", "2 tablespoons extra virgin olive oil", "3 pounds lamb shoulder in 2-inch chunks, with bone", "Salt and black pepper", "8 medium white turnips (about 1 1/2 pounds), peeled and quartered", "1 cup (about 2) finely chopped leeks", "4 large cloves garlic, sliced", "Grated zest of 1 lemon", "1 tablespoon fresh rosemary leaves, plus sprigs for garnish", "1 1/2 cups dry white wine", "1 1/2 cups veal or chicken stock (a bit more if reheating; see Step 5)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beans in a bowl, cover with water to a depth of 2 inches and soak 8 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil on medium-high in a 4-quart stovetop casserole or deep sauté pan. Season lamb with salt and pepper, add to pan and brown. Remove to a platter. Add turnips and brown lightly. Remove to a bowl. Reduce heat to low. Add leeks and garlic, and sauté until softened. Stir in lemon zest, rosemary and wine. Return lamb to pan, cover and simmer on low 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While meat cooks, drain beans, place in a saucepan with 3 cups water, bring to a simmer, cover and cook 1 hour. Beans should be tender; if not, cook another 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 1 hour, lamb should also be tender. Remove it, leaving all liquid in the pot. Drain beans and add to the pot. Add turnips and 1.5 cups stock. Season with salt and pepper. Bring to a simmer. Tuck lamb back in, cover and cook on low 30 to 45 minutes, until all is very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a deep platter and serve, garnished with rosemary. Or set aside, reheat (you may need a little stock) and serve."}], "link": "https://cooking.nytimes.com/recipes/12258-lamb-braised-with-white-beans-and-turnips"}