{"@context": "http://schema.org", "@type": "Recipe", "name": "Noodle and Apple Kugel", "description": "This comforting kugel tastes much richer than it is, and it is certainly lighter than a traditional kugel (though it is not a low-calorie dessert). I’ve made this with Golden Delicious apples and with tarter varieties like Pink Lady; I liked it both ways.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/01/10/science/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings.", "recipeCuisine": "german", "recipeCategory": "breakfast", "keywords": "apple, noodles, yogurt, dessert, healthy, low-sodium, nut-free, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 218}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 325, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "564 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons unsalted butter", "4 apples, cored and cut in small (1/4- to 1/2-inch) dice", "6 ounces flat egg noodles, preferably whole-grain", "Salt to taste", "1/4 cup raisins, plumped for 5 minutes in warm water and drained (optional)", "4 eggs", "1/4 cup raw brown sugar or dark brown sugar", "1 cup drained yogurt", "1 teaspoon vanilla extract", "2 tablespoons rum", "1/2 teaspoon freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Butter a 2-quart baking dish. Begin heating a large pot of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon of the butter over medium-high heat in a large, heavy skillet and add the apples. Cook, stirring or tossing in the pan, until they begin to color and are slightly tender, about 5 minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, add salt to taste and the noodles. Cook al dente, a little firmer than you would want them if you were eating them right away. Drain through a colander and add to the pan with the apples (if using long flat noodles, cut them first with a scissors into shorter lengths). Add the remaining tablespoon of butter and toss together until the butter melts. Stir in the optional raisins. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Add the sugar and beat together until the mixture is thick. Beat in the yogurt, vanilla, rum, nutmeg and about 1/4 teaspoon salt, or to taste. Add the noodles and apples and fold everything together. Scrape into the prepared baking dish. Push the pasta down into the egg and yogurt mixture (it will not be completely submerged, but try to cover as much as you can). Place in the oven and bake 40 to 45 minutes, until the kugel is set and the sides are browned. There will always be some noodles on top that brown and become quite hard. You can remove these from the baked dish if you wish. Allow to sit for at least 10 minutes before serving. Serve hot, warm or at room temperature."}]}