{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Lentil and Smoked Pork Belly Salad", "description": "For this recipe, you really do need to use French lentils. Ordinary brown supermarket lentils can be fine for soup, but for a good lentil salad, you want those beautiful little imported gray-green lentilles du Puy. If you must, reasonable substitutes include: the black so-called Beluga lentils or the tiny Castelluccio lentils from Umbria in Italy. These lentils keep their shape when cooked and have a firm, nutty texture that holds up in a vinaigrette. They cost more, but their superior flavor makes them worth it. Indulge.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/10/dining/10lentils/10lentils-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "dairy-free, lentils, pork belly, potato, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 508, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "6 grams", "proteinContent": "17 grams", "saturatedFatContent": "9 grams", "sodiumContent": "489 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound smoked pork belly, or good-quality slab bacon, cut 1 1/2 to 2 inches thick", "1 large onion, halved, each half stuck with a clove", "4 thyme branches", "1 small carrot, peeled", "1 cup small green French lentils, cleaned and rinsed", "1 small bay leaf", "Salt and pepper", "1 pound fingerling potatoes", "1 large shallot, finely diced", "2 tablespoons red wine vinegar", "2 garlic cloves, smashed to a paste", "1 tablespoon Dijon mustard", "1/4 cup fruity olive oil", "2 teaspoons capers, rinsed and roughly chopped", "2 tablespoons cornichons or other sour gherkins, roughly chopped", "1/4 cup chopped scallions, plus 1 tablespoon for garnish", "1/2 cup chopped flat leaf parsley, plus 1 tablespoon for garnish."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pork belly or bacon in a pot with one of the onion halves stuck with a clove, 2 small thyme branches and the carrot. Cover with a quart of water and simmer gently until tender, 30 to 40 minutes. Turn off heat and keep warm in liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the lentils in a pan. Add the other .5 onion stuck with a clove, 2 small thyme branches and the bay leaf. Add 4 cups water and a little salt. Simmer gently over medium heat until firm-tender, 25 to 30 minutes. Drain (discard onion, thyme and bay leaf) and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, boil the potatoes in their skins in well-salted water until done, about 15 minutes. Drain and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: Macerate the shallot in the red wine vinegar for 5 minutes in a small bowl. Add the garlic, Dijon mustard and a pinch of salt and pepper. Whisk in the olive oil to make a thick sauce. Stir in the chopped capers and cornichons. Just before serving, stir in .25 cup scallions and .5 cup parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, dress the lentils with half the vinaigrette, then transfer to a platter or serving bowl. Slice the pork belly crosswise into .25-inch slices (save the broth for soup) and arrange over the lentils. Cut the potatoes lengthwise and arrange, cut-side up, around the platter. Spoon the remaining vinaigrette over the sliced meat and potatoes. Sprinkle with 1 tablespoon each scallions and parsley."}], "link": "https://cooking.nytimes.com/recipes/12269-warm-lentil-and-smoked-pork-belly-salad"}