{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet-and-Sour Sardines", "description": "Name your quaff. White, red, still, sparkling, sweet or dry? We sampled them all in our tasting of wines from the Canary Islands. And as food-friendly as these well-balanced wines were, deciding exactly what food would work best with them was the challenge. Some sort of marinated fish seemed to be the best idea, especially one that delivered bold swagger to welcome a red wine. Mackerel, sardines, wahoo or tuna were possible draft choices; a dozen fresh sardines on ice in the market made the team. And dressed in a bright, lemony wine sauce enriched with honey, like a Venetian in saor preparation, they also flattered the wines, whether white, red or sparkling. Sweet would not have been off base either, but deserved to be saved for a cheese course or dessert.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/01/18/dining/18PAIR_SPAN/18PAIR_SPAN-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 first-course servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, dairy-free, gluten-free, dry white wine, olives, potato, sardines", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 309, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "660 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["12 ounces small potatoes (10 to 12), peeled and halved", "Salt and pepper", "12 fresh sardines, gutted, heads removed, boned and split in half", "Juice of 2 lemons", "3 tablespoons extra virgin olive oil", "1 large red onion, peeled and sliced thin", "1/2 fennel bulb, stems removed, cored and sliced thin", "4 cloves garlic, peeled and sliced", "1 cup dry white wine", "1 1/2 tablespoons honey", "1/3 cup pitted green or black olives", "1 tablespoon capers", "1 tablespoon minced fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in a small saucepan of boiling salted water and cook until tender, about 10 minutes. Drain and set aside. Meanwhile, season sardines with salt and pepper and drizzle with juice of 1/2 lemon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a large skillet over medium heat. Add the onion, fennel and garlic and sauté until soft and lightly browned, about 5 minutes. Add the wine and juice of 1 lemon and bring to a simmer. Place sardines in pan skin side up and cook just until they firm up and the edges turn whitish, a minute or two. Remove sardines to a platter, draining well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add honey, olives and capers to the pan and bring to a simmer. Add the potatoes. Cook about 5 minutes, until sauce is slightly reduced. Check seasoning. Remove from heat and spread in a rimmed platter. Arrange the sardines skin side up, like spokes of a wheel, on top of the vegetables, drizzle with the remaining lemon juice and olive oil, scatter mint on top, cover and refrigerate about 3 hours."}], "link": "https://cooking.nytimes.com/recipes/12265-sweet-and-sour-sardines"}