{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Parsnips and Greens", "description": "Risotto is a fine option for brunch, lunch or dinner. With a minimum of ingredients and fuss, it is ready in about a half-hour, and always appreciated.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/01/11/dining/11KITCH5/11KITCH5-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "6 generous servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "arborio rice, greens, parsnip, side dish, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 326, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "754 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound parsnips, not too large", "Salt and black pepper", "Olive oil", "1/2 pound kale, broccoli rabe or mustard greens", "1 large onion, finely diced", "1 1/2 cups arborio rice", "1/4 cup dry white wine or vermouth", "4 cups unsalted chicken or vegetable broth, or more if necessary", "2 tablespoons butter", "3 garlic cloves, minced", "8 sage leaves, roughly chopped", "Pecorino Romano or Parmesan cheese, for grating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Peel the parsnips, quarter them lengthwise, and remove the tough core with a paring knife. Cut into 1/2-inch random shapes, put in a roasting pan, season with salt and coat with 2 teaspoons of olive oil. Roast until tender and lightly browned, about 15 to 20 minutes. Remove from the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the stems from the greens and cut them into 1/2-inch-wide ribbons. Bring a pot of water to a boil over high heat, add salt and cook very briefly. Drain, cool and squeeze dry. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons olive oil to a heavy bottomed soup pot or large saucepan over medium-high heat, then add the onion, season with salt and pepper, and cook till softened, about 5 minutes. Add the rice and stir together with the onions until the onions are barely brown, about 2 minutes. Add the white wine or vermouth and cook until it evaporates. Add 2 cups broth and adjust the heat to a brisk simmer. Cook for 5 to 6 minutes, stirring well with a wooden spoon every minute or so. When the broth is absorbed, add 1 cup more and continue to cook for another 5 minutes. Stir in the last cup of broth and cook for another 5 minutes, until the rice is cooked, but the grains are still firm. Taste and adjust the seasoning, adding another splash of broth if necessary. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil and the butter in a wide, deep skillet over medium-high heat. Add the garlic and sage and let sizzle without browning, about 1 minute. Add the roasted parsnips and chopped greens, season lightly with salt and pepper, and stir to coat and heat through, about 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the risotto to a warm serving dish. Spoon the vegetables over and fold them gently into the rice. Serve with grated pecorino or Parmesan cheese."}]}