{"@context": "http://schema.org", "@type": "Recipe", "name": "Mediterranean Fish Chowder With Potatoes and Kale", "description": "This brothy fish stew gets extra body and heft from the kale and potatoes, and a hint of the Mediterranean from thyme, parsley and bay leaf. The method is straightforward. First make a mirepoix of onion, celery and carrot. Add garlic, anchovies and parsley, followed by the tomatoes and paste, and finally the potatoes and bouquet garni. Simmer for 30 minutes while the kale is cooked separately, then add the fish. Take care not to overcook the fish — it’s done as soon as it flakes easily when you nudge it with a fork.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/07/dining/07chowder/07chowder-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, soups and stews", "keywords": "dairy-free, healthy, high fiber, nut-free, fish, kale, potato, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 204}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "6 grams", "proteinContent": "25 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1365 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, chopped", "1 celery rib, chopped", "1 medium carrot, chopped", "Salt to taste", "2 to 4 garlic cloves, minced", "4 anchovy fillets, soaked in water for 4 minutes, drained and chopped", "2 tablespoons chopped fresh parsley", "1 (28-ounce) can chopped tomatoes, with liquid", "1 tablespoon tomato paste", "1 quart water", "1 pound fingerling or Yukon gold potatoes, scrubbed and sliced", "A bouquet garni made with a bay leaf, a strip of orange zest, a couple of sprigs each thyme and parsley, and a dried red chili if desired, tied together with a string", "Generous pinch of saffron (optional)", "Freshly ground pepper", "1 bunch (10 to 12 ounces) black kale, stemmed and washed thoroughly in 2 changes of water", "1 1/2 pounds firm, white-fleshed fish, like halibut, tilapia, Pacific cod or black cod, cut in 2- or 3-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven and add the onion, celery and carrot. Cook, stirring, until the onion softens, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a generous pinch of salt and stir in the garlic, anchovies and chopped parsley. Cook, stirring, until the mixture is very fragrant, another minute or two, and add the tomatoes and tomato paste. Cook, stirring often, until the tomatoes have cooked down a bit and the mixture smells aromatic, about 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the water, potatoes, salt to taste and the bouquet garni, and bring to a simmer. Add the saffron, turn the heat to low, cover and simmer 30 minutes. Taste, adjust salt and add pepper to taste. Remove the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup is simmering, bring a medium pot of water to a boil, salt generously and add the kale. Cook 2 to 3 minutes, until tender but still colorful. Transfer to a bowl of cold water, then drain and squeeze out excess water. Chop coarsely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, season the fish with salt and pepper and stir into the soup, along with the kale. The soup should not be boiling vigorously. Simmer 5 minutes (depending on the thickness of the fillets), or just until the fish flakes easily when poked. Remove from the heat, taste once more and adjust seasonings, and serve."}], "link": "https://cooking.nytimes.com/recipes/12278-mediterranean-fish-chowder-with-potatoes-and-kale"}