{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli, Cabbage and Kohlrabi Coleslaw With Quinoa", "description": "When I have any kind of slaw on hand I usually make a lunch of it, with cottage cheese mounded on top; all the better if I have some cooked quinoa to add to the mix. I noticed recently that shredded broccoli stems were a main ingredient in a packaged coleslaw at my local supermarket – a great idea for using up the stems cut away from broccoli sold by the crown or floret. It’s much more economical to buy broccoli on the stem, which gives you the fixings for this salad. It takes minutes to peel and then shred them in a food processor. Don’t use the food processor for shredding cabbage, though — that’s better done by hand if you don’t want mush.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/01/24/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "3 generous servings.", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "broccoli, cabbage, quinoa, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 247, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "12 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1055 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 cups mixed shredded broccoli stems, green cabbage and kohlrabi  (peel broccoli stems and kohlrabi before shredding) (about 3/4 pound)", "Salt to taste", "1/2 cup cooked quinoa", "2 tablespoons chopped fresh dill", "1/2 teaspoons nigella seeds (optional)", "3 tablespoons fresh lemon juice", "1 tablespoon seasoned rice vinegar", "2 teaspoons Dijon mustard", "2 tablespoons grapeseed or canola oil", "1/4 cup plain low-fat yogurt", "Freshly ground pepper", "1/2 cup low-fat cottage cheese (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the shredded vegetables with salt to taste and place in a strainer set over a bowl. Refrigerate and let sit for 45 minutes to an hour. Discard the water that accumulates in the bowl and squeeze the shredded vegetables to extract more water. (Note: If you are on a no-sodium diet, omit this step). Transfer to a bowl and toss with the quinoa, dill and nigella seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, mix together the lemon juice, rice vinegar, salt, pepper, Dijon mustard, oil and yogurt. Toss with the shredded vegetables. Add the cottage cheese to the salad and toss, or serve with the cottage cheese spooned on top. Refrigerate in a bowl or in containers until ready to take to work."}], "link": "https://cooking.nytimes.com/recipes/12276-broccoli-cabbage-and-kohlrabi-coleslaw-with-quinoa"}