{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Squash With Honey and Lemongrass", "description": "This caramelized delicata squash purée, adapted from Nathan Myhrvold's multivolume “Modernist Cuisine: The Art and Science of Cooking,” is prepared in a pressure cooker. Normally, a pressure cooker wouldn’t get hot enough to caramelize anything. But, Mr. Myhrvold explained, if you create an alkaline environment with a sprinkle of baking soda, you can caramelize at a lower temperature. And the pressurized environment helps ingredients caramelize through and through, not just around the outside. This gives the squash an intense, nutty flavor, which is enhanced here with buckwheat honey and lemongrass.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/01/18/dining/video-myhrvoldsquash/video-myhrvoldsquash-mediumThreeByTwo440.jpg", "totalTime": "PT35M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "gluten-free, vegetarian, side dish, squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "recipeIngredient": ["4 tablespoons unsalted butter", "1 1/2 pounds delicata squash, peeled, seeded and cut into 1/2-inch cubes (4 cups)", "1/2 lemongrass stalk", "1 teaspoon kosher salt", "1/2 teaspoon baking soda", "Buckwheat honey or other honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a pressure cooker. Stir in squash, lemongrass, salt and baking soda. Cover tightly with pressure cooker lid and cook at a gauge pressure of 1 bar (15 p.s.i.) for 20 minutes. Begin the timing after the pressure has been reached."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Depressurize the cooker according to the manufacturer’s instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lemongrass. Blend the squash to a smooth purée. Season with honey to taste. Serve, or refrigerate and then reheat gently before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pressure-Cooked Butternut Squash", "description": "Nathan Myhrvold, co-author of “Modernist Cuisine,” and Melissa Clark demonstrate how to make butternut squash purée using a pressure cooker.", "thumbnailUrl": "https://static01.nyt.com/images/2012/01/18/dining/video-myhrvoldsquash/video-myhrvoldsquash-mediumThreeByTwo440.jpg", "uploadDate": "2012-01-17T21:55:22.000Z", "duration": "PT2M41S"}}