{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Fish With Lime Salsa Verde", "description": "Think of roasting a whole fish the same way you might think of roasting a whole chicken: an easy and delicious preparation that all cooks should have in their arsenal, and one that takes well to whatever ingredients you want to introduce. Here, those extra flavors are electric. The fish is stuffed with slices of lime and jalapeño, cilantro and scallion bottoms. An accompanying salsa is composed of more jalapeño, scallion tops, cilantro, lime juice and zest, as well as a dose of capers and garlic. The fish itself is simply oiled and seasoned, then roasted at 450 degrees for 15 to 20 minutes, until it is opaque and flakes when pressed gently with a fork. (Each person you’re feeding should get his or her own fish, weighing about one or one and a half pounds apiece.) Spoon the salsa on top, a streak of bright, spicy flavor for the delicate, moist fish. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/01/25/dining/25appe-span/25appe-span-mediumThreeByTwo440-v3.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner, weekday", "keywords": "capers, cilantro, fish, dairy-free, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 78}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 918, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "4 grams", "proteinContent": "107 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1738 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 bunches cilantro", "2 bunches scallions", "2 jalapeño peppers", "1/4 cup drained capers, chopped", "2 garlic cloves, minced", "3 limes", "1/2 cup plus 8 teaspoons extra-virgin olive oil", "Black pepper", "4 whole fish, like sea bass or black bass, 1 to 1 1/2 pounds each", "3 teaspoons coarse kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salsa: Coarsely chop 2/3 cup of cilantro leaves and transfer to a bowl. Thinly slice 2/3 cup of the dark green scallion tops and add to the bowl, reserving the bottoms. Seed and finely chop one of the jalapeños and add it to the bowl. Stir in the capers and garlic. Finely grate in the zest of 1 lime and squeeze in its juice. Stir in 1/2 cup oil. Season with black pepper. Cover and let stand until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Line a baking sheet with foil. Pat each fish dry and coat with 2 teaspoons oil. Generously season the outside and cavity of each fish with the salt and black pepper. Transfer fish to the prepared baking sheet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the remaining 2 limes and seed and slice the other jalapeño pepper. Divide the lime slices, jalapeño slices, remaining cilantro sprigs and scallion bottoms among each fish cavity. Bake until fish is just opaque and flakes when pressed gently with a fork, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve fish with salsa verde on top or alongside."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "How to Roast a Whole Fish", "description": "Melissa Clark demonstrates how to roast a flavorful whole fish in a home oven.", "thumbnailUrl": "https://static01.nyt.com/images/2012/01/25/dining/25appe-span/25appe-span-mediumThreeByTwo440-v3.jpg", "uploadDate": "2011-02-22T21:20:41.000Z", "duration": "PT6M4S"}, "link": "https://cooking.nytimes.com/recipes/12286-whole-fish-with-lime-salsa-verde"}