{"@context": "http://schema.org", "@type": "Recipe", "name": "Party Picadillo", "description": "With some Douros as cheap as a pizza, and just as bold, I'd think of them as party wines, to serve to a crowd fortified with big sandwiches, wings and meaty casseroles. Even at the high end, most are not wines to contemplate but to quaff with slabs of seared red meat. But if you choose budget bottles, here's a dish that will not break the bank, either. Well-seasoned picadillo, a versatile, richly seasoned ground-meat dish from Latin America, is typically served with rice and beans, but it can also be ladled over pasta, used to fill tortillas or sloppy Joes or baked in a casserole with a potato topping. Since it will be in the company of bland carbs, you can spice it generously. The wines won't balk at that.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/02/01/dining/01PAIR/01PAIR-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "10 to 12 servings", "recipeCuisine": "latin american", "recipeCategory": "dinner", "keywords": "black olives, blanched almonds, dry red wine, ground beef, raisin, dairy-free, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 457, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "3 grams", "proteinContent": "22 grams", "saturatedFatContent": "10 grams", "sodiumContent": "540 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 pounds lean ground beef", "1 cup dry red wine", "1/4 cup extra virgin olive oil", "2 cups chopped red onion", "2 cups chopped green bell peppers", "2 jalapeños, seeded and minced", "4 large cloves garlic, minced", "1 cup pitted brine-cured black olives, sliced", "1 cup raisins", "1 tablespoon dried oregano, preferably Mexican", "1 teaspoon ground cumin", "1/2 cup tomato paste", "Salt", "Cayenne pepper, to taste", "1/2 cup toasted slivered blanched almonds", "Rice and beans, pasta or tortillas for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, break up the meat with a fork, mix it with the wine and set aside. Heat oil in a large pan over low heat. Add onions, peppers, jalapeños and garlic and sauté until tender and barely beginning to brown. Stir in olives and raisins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium. Add meat and any liquid, and cook, breaking up meat with a fork, until it loses its color and is uniformly crumbly, about 10 minutes. Stir in oregano, cumin, tomato paste, and salt and cayenne pepper to taste. Cover and cook on low 30 minutes. Dish can be prepared in advance to this point and reheated later. It should be moist, so it might need a little water added. Top with almonds, serve with rice and beans, pasta or tortillas."}]}