{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Lemon", "description": "", "author": {"@type": "Person", "name": "Alissa J. Rubin"}, "image": "https://static01.nyt.com/images/2014/04/18/dining/Roast-Chicken/Roast-Chicken-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, fresh herbs, lemon, dairy-free, gluten-free, halal, kosher, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 92}, "recipeIngredient": ["1 chicken, 2 1/2 to 3 1/2 pounds", "Fleur de sel or other medium-grained sea salt", "About 1 ounce fresh mixed herbs (sage, thyme, rosemary, oregano or other), coarsely chopped", "1 large or 2 small lemons, pierced all over with a fork", "Olive oil", "Carrots, onions, leeks, turnips or other vegetables for roasting, as desired", "1/2 cup chicken stock, or as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working carefully to prevent tearing, loosen the skin over as much of the chicken as possible by slipping your hand under it. Rub the chicken flesh lightly with salt, and slide the herbs under the skin. (You should be able to see them through the skin.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all the lemon in the chicken’s cavity, and cover the chicken in plastic wrap or foil. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Lightly coat the bottom of a roasting pan with olive oil. Unwrap the chicken and place it breast side up in the pan, surrounded by any vegetables to be roasted. Drizzle the vegetables with oil, turning them to coat well. Roast for 20 minutes, then baste the chicken and vegetables with pan juices. If there are no juices, add 1/4 cup water to the pan, scraping the bottom, and baste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce temperature to 325 degrees. Continue basting every 10 to 15 minutes until the juices run clear when the chicken is pierced at the thigh, about 20 minutes to a pound. Roast vegetables until browned and caramelized, removing when cooked to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a platter and keep warm. Remove the lemon from the cavity and place in the roasting pan, mashing it a bit to release the juices. Place pan on low heat and add the chicken stock, scraping the bottom of the pan. Carve the chicken, adding any juices to the pan. Pour the hot juices into a pitcher or gravy boat. Serve the chicken and vegetables, passing the juices separately."}], "link": "https://cooking.nytimes.com/recipes/12297-roast-chicken-with-lemon"}