{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Mushrooms and Chard With Barley or Brown Rice", "description": "Mushrooms and barley are a classic combination, but brown rice is also very nice with this dish, and it cooks faster. Whichever you use, simmer the grain in abundant water and used the drained water to moisten the mushrooms and chard.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/02/07/world/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "barley, mushroom, swiss chard, dairy-free, healthy, high fiber, low cholesterol, nut-free, vegan, vegetarian, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 286, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1288 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 cup barley or brown rice", "1 quart water", "Salt to taste", "1 generous bunch Swiss chard or rainbow chard", "2 tablespoons extra virgin olive oil, or 1 tablespoon extra virgin olive oil and 1 tablespoon lemon- or mushroom-scented olive oil", "1 pound mushrooms, trimmed and cut in thick slices", "2 garlic cloves, minced", "1 teaspoon roughly chopped fresh thyme leaves", "Freshly ground pepper", "1/2 cup barley water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the barley or rice and water in a medium saucepan and bring to a boil. Add salt to taste, reduce the heat and simmer the barley for 1 hour, brown rice for 35 to 40 minutes, or until tender. Set a strainer over a bowl and drain the grains. Retain the cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the grains are cooking, stem the chard and wash thoroughly in two changes of water. Chop coarsely. If the stalks are merely thick, dice them; if they are stringy, discard them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil over medium-high heat in a large, wide skillet or wok. Add the mushrooms and chard stems, if using, and cook, stirring often, until the mushrooms sear and begin to soften, about 3 minutes. Add the garlic, thyme and a generous pinch of salt and cook, stirring, until fragrant, about 30 seconds. Stir in the chard and raise the heat to high. Cook, stirring, until the chard wilts, which shouldn’t take more than 3 minutes (you may have to add the chard in batches, depending on the size of your pan). Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the chard has wilted, add .75 cup of the cooking water from the rice or barley. Cover and simmer over low heat for 3 minutes, or until the chard is tender. Uncover, stir and if you wish to have more sauce with the vegetables, add more cooking water from the grains and stir until it reduces to the desired consistency. Taste and adjust seasoning. Drizzle on the remaining oil and serve with the grains."}]}