{"@context": "http://schema.org", "@type": "Recipe", "name": "Simmered Beet Greens With Roasted Beets, Lemon and Yogurt", "description": "The Greeks serve this dish as a salad, and it’s one that I never failed to order at lunch when I spent 10 days on the Greek island of Ikaria, known for the longevity of its population.  If you want to make a meal of this, serve the greens and beets with a whole grain, like barley or quinoa. The authentic dish includes much more olive oil than this one. If the beets you find at the farmers' market or the store don’t have a generous bunch of greens attached, ask the vendor or the head of the produce department for greens they have cut away for other customers. They’ve probably got a box full of them in the back. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/02/07/world/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "salads and dressings", "keywords": "beet, beet greens, yogurt, gluten-free, healthy, high fiber, low cholesterol, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "746 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["2 bunches of beets with greens ", "2 tablespoons extra virgin olive oil ", "Salt and freshly ground pepper ", "Juice of 1 lemon (more or less to taste) ", "1 to 2 garlic cloves (optional) ", "1 cup drained yogurt ", "3 tablespoons chopped walnuts (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Cut the greens away from the beets, leaving about 1/4 inch of stems. Scrub the beets and place in a baking dish or lidded ovenproof casserole. Add 1/4 inch water to the dish. Cover tightly. Place in the oven and roast small beets (3 ounces or less) for 30 to 40 minutes, medium beets (4 to 6 ounces) 40 to 45 minutes, and large beets (8 ounces) 50 to 60 minutes, until easily penetrated with the tip of a knife. Remove from the oven and allow to cool in the covered baking dish. Cut away the ends and slip off the skins. Slice or cut in wedges and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beets are in the oven, stem the greens and wash in at least 2 changes of water. Place in a bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, wide skillet over high heat and add the greens by the handful, stirring each handful until the greens wilt in the water left on the leaves after washing. Once one batch has wilted, add another until all of the greens are wilted. Add 1 tablespoon of the olive oil, turn the heat down to low, season with salt and pepper, cover and simmer for 5 minutes. The greens should be tender but still bright. Add 1 tablespoon lemon juice, toss the greens in the pan, taste and adjust seasoning. (Note: if you are not serving this right away, don’t add the lemon juice, as it will change the bright color of the greens; instead, add shortly before serving). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point you have the option of transferring the greens to a platter or serving the dish right from the pan. Whether in the pan or on a platter, arrange the beets on top of the greens. Drizzle on the remaining olive oil and squeeze on more lemon juice to taste. Mash the garlic to a purée with a pinch of salt in a mortar and pestle and stir into the yogurt. Place spoonfuls of yogurt over the top of the beets and beet greens, sprinkle on the walnuts and serve, with grains if desired. "}]}