{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Chicken Stew With Cauliflower and Olives", "description": "Chicken, cauliflower, olives, tomatoes, feta — this is a stew of extraordinary flavor and complexity, down to its hints of cinnamon and garlic. The recipe uses skinless chicken legs or thighs; you could substitute ones with the skin if you like. (But don’t use chicken breasts, which will dry out.) You can use more or less chicken depending on your needs. And, important to note, you can freeze the finished dish, making it an excellent delivery to new parents or anyone in need of a home-cooked meal.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/20/dining/chickenstew/chickenstew-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "cauliflower, chicken, tomato, dairy-free, gluten-free, healthy, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2182}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 498, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "6 grams", "proteinContent": "33 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1127 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large red onion, chopped", "2 to 4 garlic cloves (to taste), minced", "6 to 8 chicken legs and/or thighs, skinned", "2 tablespoons red wine vinegar", "1 28-ounce can chopped tomatoes, with juice, pulsed in a food processor", "1/2 teaspoon cinnamon", "Salt and freshly ground pepper", "1/2 teaspoon dried thyme, or 1 teaspoon fresh thyme leaves", "1 small or 1/2 large cauliflower, cored, broken into florets, and sliced about 1/2 inch thick", "12 kalamata olives (about 45 grams), rinsed, pitted and cut in half (optional)", "1 to 2 tablespoons chopped flat-leaf parsley", "1 to 2 ounces feta cheese, crumbled (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil over medium-high heat in a large, deep, heavy lidded skillet or casserole and brown the chicken, in batches if necessary, about 5 minutes on each side. Remove the pieces to a plate or bowl as they’re browned. Pour off the fat from the pan. Add the vinegar to the pan and scrape up all the bits from the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining tablespoon of the olive oil to the pan, and turn the heat down to medium. Add the onion and a generous pinch of salt and cook, stirring often and scraping the bottom of the pan, until it begins to soften, about 5 minutes. Turn the heat to low, cover and let the onion cook for 10 minutes, stirring from time to time, until it is lightly browned and very soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic and stir together for a minute or two more, until the garlic is fragrant, then add the tomatoes and their juice, the cinnamon, thyme, and salt and pepper to taste. Bring to a simmer and simmer 10 minutes, stirring from time to time, until the mixture is reduced slightly and fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken pieces to the pot, along with any juices that have accumulated in the bowl. If necessary, add enough water to barely cover the chicken. Bring to a simmer, reduce the heat, cover and simmer 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cauliflower and kalamata olives and simmer for another 20 minutes, or until the cauliflower is tender and the chicken is just about falling off the bone. Stir in the parsley, taste and adjust seasonings. Serve with grains, with the feta sprinkled on top if desired."}], "link": "https://cooking.nytimes.com/recipes/12308-greek-chicken-stew-with-cauliflower-and-olives"}