{"@context": "http://schema.org", "@type": "Recipe", "name": "Crown Roast Of Pork With Grain-Mustard Jus", "description": "", "author": {"@type": "Person", "name": "R. W. Apple Jr."}, "image": null, "totalTime": "PT3M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "crown roast of pork, italian sausage, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["1 8- to 9-pound crown roast of pork (20 chops), prepared by a butcher from two center rib roasts and tied to form a circle", "Salt and freshly ground black pepper", "2 tablespoons butter", "1 medium onion, diced", "1 1/2 pounds Italian hot sausage meat", "1 cup bread crumbs", "4 tablespoons chopped Italian parsley", "4 tablespoons fennel seeds", "5 tablespoons grated orange zest", "1 1/2 tablespoons kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the roast, bone end up, in a large roasting pan. Season with salt and pepper, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, melt the butter and add onion. Cook until onion is translucent, about 3 minutes. In a large mixing bowl, combine the meat, bread crumbs, parsley and cooked onion. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pack one-quarter of the sausage mixture around the base of the roast and the remaining into the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. In a small bowl, combine fennel seeds, orange zest, kosher salt, cracked pepper and garlic. Spread the fennel mixture around the top of stuffing inside the roast and over the interior of the chops. Cover the tip of each bone with foil, and cover the sausage at the base of the roast with a band of foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast for 2 1/2 hours, or until the temperature taken in the center of a chop reads 150 degrees. (Once the crust browns, cover it with foil for remainder of baking time.) Remove from oven, and allow to rest for 10 minutes. Place on platter. Serve two chops per person, with stuffing and jus."}]}