{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel al Forno", "description": "The mildly licorice-scented fennel bulb is delicious raw or cooked, so it has many uses, from salad to soup to side dish. Here it is briefly blanched, then baked with mozzarella, Parmesan and bread crumbs. The flavor is amplified with fennel seed, garlic, red pepper flakes and rosemary, and a little olive oil. It’s an excellent vegetarian main dish paired with leafy greens. But you can also send it to the table alongside a roast chicken,  pork loin or Italian sausages. Expect raves.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11fennel/11fennel-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "cheese, fennel, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 297}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "7 grams", "sodiumContent": "580 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium fennel bulbs, about 2 1/2 pounds, topped, a few green fronds reserved", "Salt and pepper", "3 tablespoons extra virgin olive oil, plus more to oil the baking pan", "1/2 teaspoon fennel seed, crushed or roughly powdered in a mortar or spice mill", "3 garlic cloves", "1/8 teaspoon red pepper flakes", "1/2 teaspoon chopped rosemary", "1/2 pound fresh mozzarella, sliced or shredded", "2 teaspoons rosemary leaves", "1/4 cup coarse dry homemade bread crumbs from an Italian or French loaf", "1/2 cup grated Parmesan (about 1 1/2 ounces)", "2 tablespoons chopped parsley, or a mixture of parsley and fennel fronds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Remove a thin layer of the fennel bulbs’ tough exterior with a paring knife or sharp vegetable peeler. Cut the fennel crosswise into half-inch-thick slices. Bring a large pot of salted water to boil. Boil the fennel for 1 minute, then put it in a bowl of cold water, drain and pat dry. Season with salt and pepper. Lightly oil an oven-proof baking dish. Layer in the fennel to a depth of 1 1/2 inches (pushing down, if necessary)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together 3 tablespoons olive oil, the fennel seed and the garlic, smashed to a paste with a little salt, the pepper flakes and the chopped rosemary. Drizzle 2 tablespoons of this mixture over the fennel. Sprinkle with the rosemary leaves. Cover with a layer of sliced or shredded mozzarella, then sprinkle with bread crumbs. Drizzle the remaining oil mixture, then sprinkle with Parmesan. (The dish may be prepared to this point several hours before baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, uncovered, for 20 to 25 minutes, until nicely browned. Garnish with the chopped parsley or a mixture of the parsley and fennel fronds."}], "link": "https://cooking.nytimes.com/recipes/12301-fennel-al-forno"}