{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower, Brussels Sprouts and Red Beans With Lemon and Mustard", "description": "When you have lots of leftover vegetables in your fridge, a simple and delicious vegetarian skillet supper might be just the thing. Two things to remember: 1) A wok should not be limited to Asian stir-fries. 2) The cooking water drained off from cooked barley or brown rice can be added to cooked vegetables the way pasta cooking water is sometimes used to moisten and add texture to an accompaniment. The starch in the nutrient-dense water enriches the vegetables like a sauce. Just add more water than the usual proportion that you’d use – say a quart for a cup of brown rice or barley, and drain the grains through a strainer set over a bowl when they’re tender. You can cook this beautiful, lemony skillet dinner in a well-seasoned wok or a heavy nonstick pan. You’ll get the best seared flavor in a wok. Serve with quinoa.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/02/07/world/06recipehealth/06recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "brussels sprouts, cauliflower, red beans, dairy-free, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegan, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "recipeIngredient": ["1 medium cauliflower", "2 teaspoons Dijon mustard", "2 tablespoons fresh lemon juice", "1/4 cup water, stock or drained cooking liquid from the accompanying grain (optional)", "2 tablespoons extra virgin olive oil", "3/4 pound brussels sprouts, trimmed and quartered", "Salt and freshly ground pepper to taste", "1 can red beans, drained and rinsed", "2 1/2 tablespoons chopped fresh dill", "Suggested grain for serving: quinoa (1/2 to 3/4 cup per person)", "Optional: Lemon-flavored olive oil for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Quarter and core the cauliflower, then slice thin so that it falls apart into small, thin pieces. Whisk together the Dijon mustard, lemon juice, 1 tablespoon of the olive oil, and water or stock in a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a well-seasoned wok or in a large, heavy nonstick skillet. Add the cauliflower and brussels sprouts and cook, stirring often, for 5 minutes, until the vegetables are seared and beginning to soften. Add salt and pepper and continue to cook, stirring or tossing (as you would a stir-fry), for another 5 minutes, or until the cauliflower and the brussels sprouts are just tender and flavorful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, dill and lemon-mustard mixture and stir together for another minute or two. Taste, adjust seasonings, and remove from the heat. Serve with quinoa or another grain of your choice. If desired, add a drizzle of lemon-flavored olive oil to each serving."}], "link": "https://cooking.nytimes.com/recipes/12303-cauliflower-brussels-sprouts-and-red-beans-with-lemon-and-mustard"}