{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Tenderloin With Shallots and Prunes", "description": "Porc aux pruneaux, which is a classic, is by no means fancy, and it is always much more old-fashioned bistro or grandmotherly than high end. Simply put, it is a pork roast with red-wine-soused prunes. Hardly elegant, although it doesn’t have to be heavy either. In France, countless versions of the dish are made in neighborhood joints and at home. Sometimes a large loin or shoulder roast is used, sometimes pan-fried chops. Here we use a lightly brined pork tenderloin, adding stewed shallots to the sauce for depth and texture, and a touch of ginger for brightness. While the roast is in the oven, the shallots simmer with the wine and prunes for the sauce. The dark red sauce (rather unctuous really) is both sweet and tart, with a boozy hint of Madeira. It strikes a Middle European chord somewhere deep within. Serve with sweet potatoes or garnet yams roasted in their skins.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/03/07/dining/07KITCH_SPAN/07KITCH_SPAN-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, pork tenderloin, prune, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 168}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 396, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "27 grams", "saturatedFatContent": "4 grams", "sodiumContent": "809 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons kosher salt", "3 tablespoons brown sugar", "1/4 teaspoon allspice berries, crushed", "1/4 teaspoon black peppercorns, crushed", "2 bay leaves", "Few thyme branches", "1 pork tenderloin, trimmed, about 1 pound", "4 ounces pitted prunes, about 16 large", "1/2 cup dry red wine", "1/2 teaspoon grated ginger", "1/2 teaspoon grated orange zest", "1 tablespoon olive oil", "1 tablespoon butter", "3 to 4 large shallots, finely diced, about 1/3 cup", "1/2 teaspoon chopped fresh thyme", "Salt and pepper", "1 1/2 cups chicken broth", "1 tablespoon Madeira or port, optional", "2 teaspoons potato starch dissolved in 2 tablespoons cold water."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To brine the pork: Dissolve the salt and brown sugar in 2 cups cold water in a glass or stainless steel bowl large enough to hold the tenderloin. Add the allspice, peppercorns, bay leaves and thyme. Submerge the meat, cover and refrigerate at least 8 hours (overnight is better). Before cooking, remove the tenderloin, pat dry and bring to room temperature. Heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce and roast: Simmer the prunes in the red wine until slightly softened, about 5 minutes. Turn off the heat, stir in the ginger and orange zest, and steep for 10 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a heavy stainless steel skillet over medium-high heat. Lightly brown the tenderloin, about 3 minutes per side. (Turn off heat and use the same pan to make the sauce.) Transfer the tenderloin to a small roasting pan. Roast uncovered for about 15 minutes, until an instant-read thermometer registers 140 degrees. Let rest for 10 minutes before slicing. (Residual heat will cause the meat to continue to cook a bit while resting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the sauce, melt the butter in the reserved skillet over medium heat. Add shallots and thyme, and season lightly with salt and pepper. Cook for about 5 minutes, until softened, stirring with a wooden spoon. Scrape up any browned bits to enrich the sauce. Add chicken broth, turn up the heat, and simmer 2 minutes. Stir in the prunes and wine, and simmer for another 2 minutes. Add the Madeira if using. Taste and correct the seasoning, then add the potato starch mixture and cook for another minute to thicken. Spoon sauce and prunes over the sliced tenderloin."}], "link": "https://cooking.nytimes.com/recipes/12325-pork-tenderloin-with-shallots-and-prunes"}