{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Fritos", "description": "The beauty of a Frito is in its simplicity: a little cornmeal, lots of salt, not much else.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2012/03/07/dining/07JPJUNK4/07JPJUNK4-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 4 snack-size servings", "recipeCuisine": "american", "recipeCategory": "quick", "keywords": "cornmeal, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 112, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "66 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["80 grams (about 1/2 cup) stone-ground or other fine cornmeal (do not use whole grain)", "1/2 teaspoon salt, plus more as needed", "1 teaspoon olive oil or vegetable oil", "Vegetable oil for frying, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Cut 2 pieces of parchment the same size as a baking sheet and set aside. Bring about 3/4 cup water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the cornmeal and salt. Add 1/3 cup boiling water and mix with a fork until smooth. Add 1 teaspoon oil and mix again. The batter should be thick and slightly runny; if necessary, add more boiling water 1 teaspoon at a time for the desired consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one sheet of parchment on a work surface, and scrape the batter into the center. Top with the second sheet of parchment and gently roll out the batter to about .33-inch thick. Transfer the parchment and rolled batter to the baking sheet. Remove the top sheet of parchment and score the batter into small rectangles. Bake until golden brown, 12 to 15 minutes. Allow to cool and break apart. Sprinkle with additional salt, if desired, and serve. Or, fry the chips as described below."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside a plate lined with a paper towel. Fill a small skillet with about 1.5 inches vegetable oil. Place over medium heat and allow to heat for 1 to 2 minutes. Test with a small piece of a chip; it should sink to the bottom of the pan, sizzle, float to the top and turn pale golden brown in about 30 seconds. Fry half the chips, using a metal strainer to transfer to the paper towel to drain. Repeat with remaining chips. Sprinkle with salt, if desired, and serve."}], "link": "https://cooking.nytimes.com/recipes/12326-homemade-fritos"}