{"@context": "http://schema.org", "@type": "Recipe", "name": "Tournedos Rossini", "description": "If you want a phrase that summons all the voluptuous pleasure of haute cuisine in its heyday, “tournedos Rossini” does the trick. As a culinary undertaking, they are simultaneously simple and sybaritic. Toast two buttered spheres of bread. Top them with warm-from-the-pan filets mignons. Crown them with a slice of hot foie gras. Then anoint these little monuments of luxury with a sliced truffle or two and a small waterfall of sauce.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2012/02/29/dining/29TOURNEDOS_SPAN/29TOURNEDOS_SPAN-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "french", "recipeCategory": "dinner, quick", "keywords": "filet mignon, foie gras, truffle, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 96}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1239, "unsaturatedFatContent": "51 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "100 grams", "fiberContent": "3 grams", "proteinContent": "70 grams", "saturatedFatContent": "39 grams", "sodiumContent": "1040 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["2 filets mignons, about 5 ounces each", "Salt and black pepper", "1/4 cup fond de veau (veal stock) or 1 tablespoon veal demi-glace (available in fine food markets) mixed with 3 tablespoons water", "1 tablespoon truffle juice", "1 teaspoon chopped black truffles", "2 tablespoons butter", "1 tablespoon vegetable oil", "2 slices French bread, trimmed to the shape of the filets mignons", "2 slices fresh foie gras, about 2 ounces each", "2 tablespoons Madeira", "2 thin slices black truffle"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the filets mignons with salt and pepper; set aside. In a small bowl, combine the veal stock or demi-glace, truffle juice and chopped truffles; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, melt a third of the butter with the oil and quickly fry the slices of bread until lightly browned on both sides; remove and set aside. Add another third of the butter to the skillet, and sauté the filets mignons over high heat for 4 minutes a side for rare or 5 minutes a side for medium-rare. Remove the filets from the skillet, set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the same skillet and high heat, sauté the foie gras slices 90 seconds on each side and put 1 slice on each of the filets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard all fat from the skillet. While the skillet is still hot, add the Madeira, scraping the bottom of the pan. Add the veal stock mixture, bring to a quick boil, then remove from heat and stir in the remaining butter to make a silky sauce. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On each of two plates, place the croutons in the center and top with the filet mignon and foie gras. Garnish with a slice of truffle on the top. Spoon the sauce over and around. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/12323-tournedos-rossini"}