{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Oreos", "description": "This recipe for homemade Oreos came to The Times from the pastry chef Stella Parks, whose trick of rolling out the dough onto cocoa powder gives the cookie a chocolatey boost. Using shortening for the cookie cream will lend it a tacky texture, perfect for a cookie-aisle authenticity.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/fauxreos-still/fauxreos-still-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "24 two-inch sandwich cookies.", "recipeCuisine": "american", "recipeCategory": "", "keywords": "dessert, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 106, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "57 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons unsalted butter, at room temperature", "105 grams (1/2 cup) sugar", "45 grams (3 tablespoons) brown sugar", "1 1/2  teaspoons salt", "1/4  teaspoon plus 1/8 teaspoon baking powder", "1/4 teaspoon baking soda", "1 teaspoon instant coffee powder", "1 1/2 teaspoons vanilla extract", "2 large egg yolks", "15 grams (3/4 cup) sifted all-purpose flour or rice flour", "85 grams (1 cup) sifted cocoa powder, plus more as needed", "4 tablespoons shortening or unsalted butter, at room temperature", "145 grams (1 1/4 cups) sifted confectioner’s sugar", "1 teaspoon vanilla extract", "1/8 teaspoon salt."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cookies: Using a mixer, cream together butter, sugar, brown sugar, salt, baking powder, baking soda, coffee powder and vanilla extract. With mixer still running, add egg yolks one at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stop mixer and scrape bowl with a rubber spatula. Add flour and 1 cup cocoa, and resume mixing at low speed until the mixture is crumbly and uniformly blended. Scrape the bowl and knead the dough lightly to form a smooth ball. Transfer to a work surface and flatten into a disk. The dough may be rolled right away or wrapped in plastic and refrigerated for up to a week; bring to room temperature before rolling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Lightly sift some cocoa powder onto a work surface, and roll the dough to .125-inch thickness. Slide a metal spatula under the dough to prevent it from sticking. Using a 2-inch round cookie cutter, cut out cookies and transfer to an ungreased baking sheet. The cookies will not spread during baking so may be placed close together. Knead and reroll the dough scraps to make more cookies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To add texture to the cookies, place any remaining dough in a mixing bowl. Mix with enough hot water until the dough has thinned into a paste. Transfer to a piping bag fitted with a very small tip, or a heavy duty Ziploc bag with a tiny hole poked in the corner. Pipe a design on each cookie; a tight cornelli lace design gives the impression of an Oreo."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cookies until firm, about 12 minutes. Remove from heat and cool completely on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: Using a mixer, cream together shortening or butter, confectioner’s sugar, vanilla and salt. Beat on medium speed for 5 minutes, scraping the bowl periodically. The long mixing time smoothes, whitens and aerates the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For assembly: Using a pastry bag fitted with a plain tip or a spoon, place 1 teaspoon (or more if desired) of filling directly onto the center of the undersides of half the cookies. To finish, top with remaining wafers and press down with your fingers, applying very even pressure so the filling will spread uniformly across the cookie. Place cookies in an airtight container and refrigerate for several hours before serving."}], "link": "https://cooking.nytimes.com/recipes/12327-homemade-oreos"}