{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Stock and Confit", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "P1D", "recipeYield": "About 8 cups stock, and 1 cup fat", "recipeCuisine": "french", "recipeCategory": "dinner, project, soups and stews", "keywords": "side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 356, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "11 grams", "sodiumContent": "310 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 whole duck, 5 to 7 pounds", "Salt", "10 garlic cloves, smashed", "10 sprigs fresh thyme", "1 shallot, peeled and sliced", "1 large onion, cut in half (don’t peel)", "1 large carrot, cut in big chunks", "2 celery ribs, cut in big chunks", "1 bay leaf", "Several sprigs fresh parsley", "Black pepper", "Reserved duck fat from stock", "Olive oil as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the duck breast-side up on a cutting board. Using a boning knife, cut along one side of the breastbone; keep the back of your knife flush against that bone and follow the curve, cutting with the tip of your knife and pulling the meat back as you go. (It’s actually a kind of natural movement; trust yourself.) When you meet up with the skin from the legs, cut through the skin and detach the breast. Repeat with the second breast. The legs are now easy to see."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One leg at a time, cut through the skin, pulling the leg back as you go. Bend the leg backward to crack the joint, then cut through the joint (it’s easy to see once you’ve cracked it); detach the leg. Repeat with the second leg. Remove the skin from the legs with your fingers, loosening it with your knife as necessary; reserve. Remove and reserve any fat you encounter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly score the skin of the duck breasts to make a diamond pattern; be careful not to cut all the way through to the meat. Sprinkle with salt, cover and refrigerate until ready to use in the cassoulet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the duck legs with the garlic (use more if your cloves are small), thyme, shallot and a few pinches of salt. Refrigerate and marinate the duck legs overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350. Put the duck carcass, onion, carrot and celery in a roasting pan. Roast, turning every now and then until quite well browned. Take your time; it’ll take at least an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the contents of the roasting pan to a large pot; pour off the rendered fat and reserve it. Add the bay leaf, parsley and about 10 cups of water to the pot, and turn the heat to high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring just to a boil, then lower the heat so the mixture sends up a few bubbles at a time. Cook, skimming and discarding any foam that accumulates, for at least 60 minutes and up to 2 hours. Cool slightly, then strain. Season with salt and pepper. Refrigerate the stock overnight. The next day, take the stock out of the refrigerator and remove the duck fat from the top; it will have solidified, and you’ll be able to scoop it right off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the fat in a medium saucepan over medium heat. When the fat melts and reaches about 190 degrees, add the duck legs along with the garlic and as much olive oil (or duck fat) as necessary to submerge the legs. Discard the thyme and shallot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, never letting the heat exceed 200 degrees, until the meat is tender and easily pierced with a fork, about 1.5 hours. Let cool, then store the duck in the fat in the refrigerator until you’re ready to use it in the cassoulet."}], "link": "https://cooking.nytimes.com/recipes/12321-duck-stock-and-confit"}