{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Twinkies", "description": "Dispirited by the possible demise in 2012 of Hostess, the company that makes Twinkies, Ho Hos, and Hostess cupcakes, Jennifer Steinhauer began to wonder if she could make Hostess snack cakes, as well as other much-loved junk food from the past, in her own kitchen. She started with this classic, the Twinkie, by buying a canoe pan, which conveniently came with a cream injector. This recipe is a traditional sponge cake-style recipe, with whipped egg whites and sugar forming the base, then filled by cream injector with seven-minute frosting. Neighbors were delighted when she shared the results, but it was short lived. By the next day, the cake had absorbed the cream -- so make sure to eat them fast.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/twinkies-still/twinkies-still-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "12 homemade Twinkies.", "recipeCuisine": "american", "recipeCategory": "", "keywords": "dessert, eggs, flour, marshmallow fluff, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "115 milligrams", "sugarContent": "28 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Nonstick cooking spray or vegetable oil", "60 grams (1/2 cup) cake flour", "30 grams (1/4 cup) all-purpose flour", "1 teaspoon baking powder", "1/4 teaspoon salt", "2 tablespoons milk", "4 tablespoons unsalted butter", "1/2 teaspoon vanilla extract", "5 large eggs at room temperature, separated", "12 tablespoons sugar", "1/4 teaspoon cream of tartar", "6 tablespoons unsalted butter, at room temperature", "165 grams (1 1/2 cups) confectioners’ sugar", "3/4 cup Marshmallow Fluff", "2 tablespoons heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cakes: Heat the oven to 350 degrees and adjust the oven rack to the lower-middle position."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make single-use Twinkie molds, cut 12 pieces of aluminum foil 12 inches wide by 14 inches long. Fold each piece of foil in half lengthwise, then fold it in half again to create a rectangle that’s about 6 inches long and 7 inches wide. Repeat to make a dozen rectangles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one sheet of folded foil on a work surface with a standard-size spice jar on its side in the center of the foil. Bring the long sides of the foil up around the jar, folding the sides and ends as necessary to make a tight trough-shape from which the jar can be removed. Repeat to make 12 foil molds. Spray generously with nonstick spray or coat with vegetable oil. Place the molds on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, whisk together the cake flour, all-purpose flour, baking powder and salt. In a small saucepan over low heat, heat the milk and butter until the butter melts. Remove from the heat and add the vanilla. Cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a standing mixer, beat the egg whites on high speed until foamy. Gradually add 6 tablespoons of the sugar and the cream of tartar and continue to beat until the whites reach soft peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the beaten egg whites to a large bowl and add the egg yolks to the standing mixer bowl (there’s no need to clean the bowl). Beat the egg yolks with the remaining 6 tablespoons sugar on medium-high speed until the mixture is very thick and a pale lemon color, about 5 minutes. Add the beaten egg whites to the yolks, but do not mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the flour mixture over the egg whites and then mix everything on low speed for just 10 seconds. Remove the bowl from the mixer, make a well in one side of the batter, and pour the melted butter mixture into the bowl. Fold gently with a large rubber spatula until the batter shows no trace of flour and the whites and yolks are evenly mixed, about 8 strokes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately scrape the batter into the prepared molds, filling each with about .75 inch of batter. Bake until the cake tops are light brown and feel firm and spring back when touched, 13 to 15 minutes. Transfer the pan containing the molds to a wire rack and allow the cakes to cool in the molds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: Using a mixer, beat together the butter, confectioners’ sugar and Marshmallow Fluff. Add the cream and beat just until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before filling the cakes, remove them from the foil. Using the end of a chopstick, poke three holes in the bottom of each cake. Wiggle the tip of the chopstick to make room for the filling. Transfer the frosting to a pastry bag fitted with a 1/4-inch round tip. Pipe frosting into the holes in each cake, taking care not to overfill, until it gently expands. Unlike real Twinkies, these won’t last indefinitely. They’re best served still slightly warm."}], "link": "https://cooking.nytimes.com/recipes/12328-homemade-twinkies"}