{"@context": "http://schema.org", "@type": "Recipe", "name": "Kohlrabi Risotto", "description": "Kohlrabi, the nutritionist Jonny Bowden writes in his book “The 150 Healthiest Foods on Earth,” “looks like a cross between an octopus and a space capsule.” That’s true, especially if the greens are still attached. (If they’re not, it just looks like a space capsule.) But inside its thick skin lies a crisp, juicy vegetable that takes beautifully to risotto. An important note: Peel the kohlrabi thoroughly. Beneath the thick, hard skin is another fibrous layer, which should also be peeled away because it does not soften when cooked.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/20/dining/kohlrabirisotto/kohlrabirisotto-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings.", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "arborio rice, cheese, kohlrabi, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegetarian, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 381, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "5 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1097 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 pound kohlrabi, preferably with some greens attached", "7 to 8 cups well-seasoned chicken or vegetable stock", "1 tablespoon extra virgin olive oil", "1/2 cup minced onion", "1 1/2 cups arborio rice", "1 to 2 garlic cloves (to taste), minced", "Salt and freshly ground pepper to taste", "1/2 cup dry white wine, like pinot grigio or sauvignon blanc", "1/4 to 1/2 cup freshly grated Parmesan cheese (1 to 2 ounces)", "2 to 3 tablespoons chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the kohlrabi, making sure to remove the fibrous layer just under the skin, and cut into .5-inch dice. If there are greens attached, wash, stem and blanch them for 1 minute in salted boiling water. Transfer to a bowl of cold water, drain, squeeze out water and chop coarsely. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan and bring it to a simmer over medium heat, with a ladle nearby or in the pot. Make sure that it is well seasoned. Turn the heat down to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet or a wide, heavy saucepan. Add the onion and a pinch of salt, and cook gently until it is just tender, about 3 minutes. Do not brown. Add the diced kohlrabi and the garlic and cook, stirring, until the kohlrabi is crisp-tender, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice and stir until the grains separate and begin to crackle. Add the wine and stir until it has evaporated and been absorbed by the rice. Begin adding the simmering stock, a couple of ladlefuls (about .5 cup) at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, adding more stock and stirring when the rice is almost dry. You do not have to stir constantly, but stir often. After 15 minutes, stir in the greens from the kohlrabi. When the rice is just tender all the way through but still chewy, in 20 to 25 minutes, it is done. Taste now, add pepper and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to the rice. Stir in the Parmesan and the parsley and remove from the heat. The mixture should be creamy (add more stock if it isn’t). Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}]}