{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Tostadas With Dark Chili-Garlic Sauce", "description": "You can find dried ancho chilies, sometimes called pasilla chilies, in supermarkets where Mexican foods are sold. They have a rich, sweet flavor. The chipotle adds heat to the mix. You can use other vegetables in season. This is the winter version.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/03/13/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings.", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "chilies, tortilla, winter vegetables, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegetarian, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 275, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "9 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "771 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ancho chilies, stemmed, seeded and deveined (wear rubber gloves to do this)", "4 garlic cloves, peels on", "1 canned chipotle chili in adobo, rinsed, stemmed and seeded (wear rubber gloves to do this)", "1 cup water, more as needed", "1 tablespoon canola oil", "1 tablespoon cider vinegar or rice vinegar", "1 teaspoon sugar", "Salt to taste", "1 small sweet potato (about 6 ounces), baked", "1 large carrot (about 6 ounces), peeled and cut in 1/2-inch dice", "1 medium turnip (about 5 ounces), peeled and cut in 1/2-inch dice", "1/4 pound green beans, cut in 1/2-inch pieces", "2/3 cup fresh or thawed frozen corn kernels", "6 corn tortillas, cut in half and toasted in the microwave", "2 ounces feta cheese or queso fresco, crumbled", "1 cup thinly shredded cabbage (green or red) or romaine lettuce", "1/2 small red or white onion, thinly sliced across the grain (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa. Place the ancho chilies in a bowl and cover with boiling water. Place a plate on top so that chilies stay submerged. Soak for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast the garlic cloves in their skins in a dry skillet, stirring, until there are black spots here and there on the skin, the flesh has softened somewhat, and your kitchen smells like toasted garlic. Remove from the heat, allow to cool and remove the skins. Cut away the root end of each clove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the soaked chili. Transfer to a blender and add the garlic and chipotle, along with .5 cup of the water. Blend until smooth. Place a strainer over a bowl and strain the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy medium saucepan or skillet over medium-high heat and add the oil. Add a spoonful of the purée to see if the pan is hot enough. If it sizzles loudly on contact, pour all of the purée into the pan; if it doesn't, wait a couple of minutes and try again. Cook, stirring, until the sauce thickens and begins to stick to the pan. Add the remaining water, the vinegar, sugar, and salt to taste, and bring to a simmer. Cook, stirring, until the sauce has the consistency of ketchup. Add more water if necessary. Taste, adjust salt, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the carrots, turnips and green beans until tender, about 5 minutes. Add to the sauce along with the sweet potatoes and corn, and stir gently until the vegetables are coated. Heat through in the saucepan and spoon onto the toasted tortillas. Sprinkle with the cheese, cabbage or lettuce, and optional onions, and serve."}], "link": "https://cooking.nytimes.com/recipes/12336-vegetable-tostadas-with-dark-chili-garlic-sauce"}