{"@context": "http://schema.org", "@type": "Recipe", "name": "Tostadas With Sweet and Hot Peppers and Eggs", "description": "This comforting topping is a kind of Mexican piperade.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/03/13/science/16recipehealth/16recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, weekday", "keywords": "appetizer, bell pepper, eggs, tortilla, gluten-free, healthy, high fiber, low-sodium, nut-free, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "3 grams", "sodiumContent": "680 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small white onion or 1 bunch scallions, chopped", "2 large red bell peppers, chopped", "1 serrano or jalapeño pepper, seeded and minced (more to taste)", "1 large garlic clove, minced", "1/2 pound tomatoes, cut into small dice, or 1 cup canned diced tomatoes, drained", "3 to 4 tablespoons chopped cilantro", "Salt to taste", "6 to 8 eggs", "6 to 8 corn tortillas, cut in half and toasted in the microwave", "1 cup thinly shredded cabbage (green or red) or romaine lettuce", "Crumbled queso fresco or feta (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large nonstick skillet and add the onion or scallions. Cook, stirring, until tender, about 5 minutes for onion, 2 to 3 for scallions, and add the peppers, chili and garlic. Stir together until the garlic begins to smell fragrant, about 30 seconds, and add salt to taste. Continue to cook, stirring often, until the peppers are quite soft, about 8 minutes. Add the tomatoes and cook, stirring often, until the tomatoes have cooked down and are no longer watery, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a bowl, season with salt and pepper, and add to the pepper mixture. Stir in the cilantro and cook, stirring over low heat, until the eggs are just set but still creamy. Remove from the heat and spoon onto the toasted tortillas. Top with shredded cabbage or lettuce, sprinkle with cheese if desired and serve."}]}