{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Cupcakes With Cream Filling", "description": "Here is a homemade take on the Hostess Cupcake, the sweet, well-preserved treat that was lost, for a while, to the wilds of bankruptcy. They take a little time to make, but are well worth it. (Don’t skimp on the Marshmallow Fluff!) Wrapping the finished items individually in cellophane allow eaters to experience the twinkly crinkle of childhood afternoons spent carefully removing the chocolate frosting from the cupcake’s top. But these are decidedly not the original. Whatever you do, make sure they’re stored in something airtight. They will dry out quickly.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Homemade-Junk-Food/Homemade-Junk-Food-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "1 dozen.", "recipeCuisine": "american", "recipeCategory": "", "keywords": "cake flour, cocoa, marshmallow fluff, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 289}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 410, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "9 grams", "sodiumContent": "86 milligrams", "sugarContent": "32 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Nonstick vegetable oil spray", "80 grams (1/2 cup plus 2 tablespoons) cake flour", "30 grams (1/3 cup) Dutch process cocoa", "1/2 teaspoon baking powder", "1/4 teaspoon baking soda", "Pinch of salt", "2 large eggs, separated", "3/4 cup canola oil", "110 grams (1/2 cup) plus 2 tablespoons sugar", "6 tablespoons unsalted butter, at room temperature", "165 grams (1 1/2 cups) confectioners’ sugar", "3/4 cup Marshmallow Fluff", "2 tablespoons heavy cream", "1/4 cup heavy cream", "4 ounces bittersweet chocolate, chopped", "1 tablespoon unsalted butter, at room temperature."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cakes: Heat oven to 350 degrees. Coat the interior of a 12-cup muffin pan with nonstick spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, sift together the cake flour, cocoa, baking powder, baking soda and salt. Using a mixer, beat the egg yolks with the oil, .5 cup of the sugar and 2 tablespoons water. With the mixer at low speed, add the cake flour mixture and beat until smooth; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean bowl, beat the egg whites until soft peaks form. Add the remaining 2 tablespoons sugar and beat until stiff and glossy. Mix .25 of the whites into the batter, then fold in the remaining whites until no streaks remain. Divide the batter among the muffin cups, filling them halfway. Bake until risen and lightly firm, about 15 minutes. Allow to cool for 5 minutes, then turn out onto a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: Using a mixer, beat together the butter, confectioners' sugar and Marshmallow Fluff. Add cream and beat just until smooth. Fit a pastry bag with a round .25-inch tip, and fill bag with all but .25 cup of the filling. (Put the extra .25 cup in a pastry bag fitted with a .125-inch round tip, or in a small Ziplock bag, and reserve.) Plunge the tip into the side of a cupcake, filling just until you feel the cupcake swell. Repeat with remaining cupcakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the frosting: Heat the cream just until bubbles begin to form on the edges of the pan, add the chocolate and remove from heat. Stir until melted and smooth. Add the butter, stirring to combine. Dip the top of a cupcake into the frosting, flip and set aside. Repeat with remaining cupcakes. Allow frosting to set, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the small pastry bag of filling, or snipping a tiny corner off the Ziplock bag, pipe a tiny squiggle across the top of each cupcake. Place in an airtight container until serving."}], "link": "https://cooking.nytimes.com/recipes/12340-chocolate-cupcakes-with-cream-filling"}