{"@context": "http://schema.org", "@type": "Recipe", "name": "Onion Tart With Bacon or Olives", "description": "A recipe for onion tart with bacon or olives.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/03/28/dining/28KITCH3_SPAN/28KITCH3_SPAN-articleLarge-v2.jpg", "totalTime": "PT2H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "bacon, dough, onion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 485, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "8 grams", "proteinContent": "13 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1195 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon active dry yeast", "180 grams (about 1 1/2 cups) all-purpose flour ", "1/2 teaspoon kosher salt", "1 1/2 tablespoons melted butter or olive oil", "2 tablespoons butter or olive oil", "3 large onions (about 11/2 pounds), sliced 1/8-inch thick", "Salt and pepper", "1/2 teaspoon caraway seeds (for bacon version only)", "2 garlic cloves, minced (olive version only)", "2 teaspoons fresh thyme, finely chopped (olive version only)", "4 ounces (1/4 pound) fresh ricotta (or goat cheese for olive version)", "4 ounces (1/4 pound) smoked bacon, cut in thick lardons (or pitted green olives for olive version)", "4 ounces creme fraiche. "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dough: In a mixing bowl, dissolve the yeast in 1/2 cup lukewarm water. Stir in 1/4 cup flour and let the mixture get bubbly, about 10 to 15 minutes. Add the kosher salt, butter or oil and remaining flour and mix to form a rough ball. Knead the dough (with hands or stand mixer) for about 5 minutes. Let rise, covered with a damp towel or plastic wrap, until doubled in size, about 1 hour. (Or refrigerate in a zippered plastic bag and let rise several hours or overnight.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the topping: Heat 2 tablespoons butter or olive oil in large skillet over medium-high burner. Add the onions and cook, stirring occasionally, until wilted and lightly browned, about 5 minutes. Season generously with salt and pepper. Stir in the caraway seeds (for the bacon version) or the garlic and thyme (for the olive version). Let cool to room temperature. Put the bacon, if using, in a small pan and cover with 1 inch water. Simmer for 2 minutes, then drain and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set oven to 375 degrees. Punch down the dough and knead into a smooth ball, then let it relax for a few minutes. Roll to a circle about 12 inches in diameter. Transfer to a 12- by 17-inch baking sheet lined with parchment. Stretch the dough to an elongated oval shape about 11 inches by 15 inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the ricotta (or goat cheese) with half the creme fraiche and dab spoonfuls of the mixture evenly over the dough. Spread the cooked onions over the dough, leaving a half-inch border. Top with the reserved bacon (or olives), scattered evenly. Drizzle the tart with the remaining creme fraiche."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 to 35 minutes, turning the baking sheet if necessary, until well browned. Cool on a rack for a few minutes. Serve warm or at room temperature."}]}