{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek-Style Kohlrabi Pie or Gratin With Dill and Feta", "description": "If you don’t want to bother with the phyllo dough or you want to cut down on carbs or calories, make this as a gratin (see below). It’s delicious either way. Because of the moisture in the kohlrabi, your phyllo will need to be recrisped in a low oven if the pie sits for any length of time.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/03/06/science/06recipehealth/06recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "dill, kohlrabi, phyllo, healthy, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "479 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds kohlrabi, with greens if possible", "3 tablespoons extra virgin olive oil", "1 medium or large onion, finely chopped", "2 large garlic cloves, minced", "Salt and freshly ground pepper to taste", "1/3 cup chopped fresh dill", "1/4 cup chopped fresh Italian parsley", "3 large eggs, beaten", "5 ounces feta cheese, crumbled", "12 sheets phyllo dough (1/2 pound)", "1 tablespoon unsalted butter, melted (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If the kohlrabi still has greens attached, stem and wash the greens and blanch in a pot of salted boiling water for 1 minute, or steam. Refresh with cold water, squeeze out excess water and chop coarsely. Set aside. Peel the kohlrabi, making sure to remove the fibrous layer right under the skin, and grate using a food processor fitted with the grater attachment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, heavy skillet over medium heat and add the onion. Cook, stirring often, until it is tender, about 5 minutes. Add a generous pinch of salt, stir together, and stir in the garlic. Cook, stirring, until fragrant, about 30 seconds, and stir in the kohlrabi. Add another tablespoon of olive oil if necessary. Cook, stirring often, until the mixture is very tender and beginning to color, about 10 minutes. If there is a lot of liquid in the pan from the kohlrabi, turn up the heat and cook, stirring, until it boils off. Add salt and pepper to taste. Stir in the kohlrabi greens, dill and parsley, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Brush a 10-inch tart pan or cake pan with olive oil. Beat the eggs in a large bowl, and beat in the crumbled feta. Stir in the kohlrabi mixture and combine well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the pan with 7 pieces of phyllo, brushing each piece with olive oil, or a combination of olive oil and melted butter, and turning the dish after each addition so that the edges of the phyllo drape evenly over the pan. Fill with the kohlrabi mixture. Fold the draped edges in over the filling, then layer the remaining 5 pieces on top, brushing each piece with olive oil. Tuck the edges into the sides of the pan. Make a few slashes in the top crust so that steam can escape as the pie bakes. Note: If making a gratin, use a 2-quart baking dish, brush with olive oil and fill with the kohlrabi mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie for 50 minutes (40 for the gratin), until the crust is crisp and dark golden brown. Serve hot, warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/12341-greek-style-kohlrabi-pie-or-gratin-with-dill-and-feta"}