{"@context": "http://schema.org", "@type": "Recipe", "name": "Home-Cured Bacon", "description": "Pink salt, also known as curing salt No. 1, is a nitrate, a combination of sodium chloride — table salt — and nitrite, a preserving agent used to deter the growth of bacteria in cured meats. Bacon is cured in the refrigerator, then slow roasted, and finally cooked again before serving. It is not being consumed as a raw, cured meat, so the use of a nitrate is a personal decision. A small amount of pink salt in your cure provides that familiar pink color and bacon-y flavor, or what we have come to know as bacon-y. It is absolutely possible to cure bacon without nitrates; but be aware that the end product will be more the color of cooked pork and that the flavor will be akin to that of a pork roast. With or without the pink salt, homemade bacon is worth the effort.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/curedbacon-still/curedbacon-still-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 2 pounds", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 341, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "0 grams", "proteinContent": "6 grams", "saturatedFatContent": "12 grams", "sodiumContent": "163 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 pounds pork belly, squared off, rind removed", "2 1/2 tablespoons kosher salt", "1/2 teaspoon pink salt, optional", "1/4 cup maple syrup, or honey, brown sugar, white sugar or molasses", "2 tablespoons cold strong black coffee, bourbon or apple cider", "2 garlic cloves, smashed", "1 tablespoon black peppercorns, crushed", "2 teaspoons fresh thyme", "1 teaspoon fennel seed, toasted", "1 teaspoon coriander seed, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pork belly in a large Ziploc bag. Add the salt (and pink salt if using) and the cure additions. Rub the cure into the pork belly, turning the bag over and over and pressing the cure into the flesh. Close the bag, squeezing out all the air and refrigerate for seven days. Each day, flip the bag over. Some liquid will begin to gather in the bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After seven days, wash the cure off the meat, rinsing thoroughly. Pat the bacon dry with paper towels and set it on a rack over a baking sheet. Allow the bacon to air-dry in the refrigerator for 6 to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 225 degrees. Roast the pork belly in the oven to an internal temperature of 150 degrees for about 90 minutes. Chill the bacon well, then slice thick or thin, to preference. Any bacon that doesn't easily slice may be cut into chunks, for starting a pot of beans or soup. Wrapped in parchment paper, then wrapped in plastic wrap or foil and placed in a Ziploc bag, the bacon will keep for three weeks in the refrigerator and three months in the freezer."}], "link": "https://cooking.nytimes.com/recipes/12349-home-cured-bacon"}