{"@context": "http://schema.org", "@type": "Recipe", "name": "Kohlrabi Home Fries", "description": "Kohlrabi can be cut into thick sticks like home fries, browned in a small amount of oil, and seasoned with chili powder (my favorite), curry powder, cumin or paprika. It’s a very satisfying and healthy fry.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/03/06/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "chili powder, kohlrabi, rice flour, dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegan, vegetarian, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 211}, "recipeIngredient": ["1 1/2 to 2 pounds kohlrabi", "1 tablespoon rice flour, chickpea flour or semolina (more as needed)", "Salt to taste", "2 to 4 tablespoons canola oil or grapeseed oil, as needed", "Chili powder, ground cumin, curry powder or paprika to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the kohlrabi and cut into thick sticks, about 1/3 to 1/2 inch wide and about 2 inches long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium-high heat in a heavy skillet (cast iron is good). Meanwhile, place the flour in a large bowl, season with salt if desired and quickly toss the kohlrabi sticks in the flour so that they are lightly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil is rippling, carefully add the kohlrabi to the pan in batches so that the pan isn't crowded. Cook on one side until browned, about 2 to 3 minutes. Then, using tongs, turn the pieces over to brown on the other side for another 2 to 3 minutes. The procedure should take only about 5 minutes if there is enough oil in the pan. Drain on paper towels, then sprinkle right away with the seasoning of your choice. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/12350-kohlrabi-home-fries"}