{"@context": "http://schema.org", "@type": "Recipe", "name": "Egg Lemon Soup with Matzos", "description": "Rather than making matzo balls for this comforting soup, I crumble matzos into the broth -- no schmaltz required. In Greece the chicken that is later served as part of the main course for Passover is simmered in water with aromatic vegetables to create the broth. You can make a very tasty vegetarian version using garlic broth (my favorite) or vegetable broth. I like to add steamed Swiss chard when I stir in the egg-lemon mixture, but you could add another green spring vegetable, like fresh peas, spinach or asparagus. Steam them first until tender and add to the soup just before serving.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/04/04/health/nutrition/04recipehealth/04recipehealth-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, soups and stews", "keywords": "dairy-free, healthy, kosher, low-sodium, nut-free, vegetarian, eggs, matzo, swiss chard, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 133, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1205 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 quarts well-seasoned chicken stock, garlic broth or vegetable stock", "2 cups chopped Swiss chard leaves (about half of a generous bunch)", "1 tablespoon extra virgin olive oil", "2 whole matzos, broken into small pieces", "3 egg yolks", "1/4 cup freshly squeezed lemon juice (more to taste)", "2 tablespoons chopped fresh parsley", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer. Meanwhile, steam the Swiss chard for 2 to 3 minutes above an inch of boiling water, just until tender. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the broth comes to a simmer, add the olive oil and the matzos and turn off the heat. Cover and let sit for 15 minutes, until the matzo is very soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the egg yolks until creamy. Whisk in the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the soup over medium-low heat, just to the simmer. Carefully whisk a couple of ladles of the hot soup into the egg yolks. It should not be boiling-- you don't want the egg yolks to curdle. Turn off the heat under the soup and stir in the egg-lemon mixture. Stir in the steamed chard and the parsley. Taste, adjust salt and pepper and serve."}]}