{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Fava Bean and Vegetable Soup", "description": "When I am planning a Passover menu I look to the Sephardic traditions of the Mediterranean. The Sephardim were the Jews of the Iberian Peninsula; they had a rich culture and lived in harmony with Christians and Muslims until the Spanish and Portuguese Inquisitions at the end of the 15th century, when all non-Christians were expelled from Spain and Portugal. The Sephardim were welcomed in Turkey, and many went to Greece, North Africa and the Middle East as well. Throughout the Mediterranean, springtime is the season for spinach and other greens, artichokes and fava beans, and these vegetables make delicious appearances at Passover meals. This dish is inspired by the fresh fava bean soup that Rivka Levy-Mellul, author of “La Cuisine Juive Marocaine,” remembers as the first course of her childhood Seders in Morocco. The authentic dish is a substantial soup made with quite a lot of meat, but I’ve made a vegetarian version. I expected the fava beans to color this soup a pale green, but the other vegetables  — the carrots, leeks, turnips and onion — and especially the turmeric contribute just as much, and the color of the soup is more of a burnt orange.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/04/02/health/nutrition/02recipehealth/02recipehealth-articleLarge-v3.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, soups and stews", "keywords": "appetizer, dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fava beans, leek, turnip, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 194}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 105, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "885 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds fresh fava beans or 1/2 pound frozen double-peeled (2 cups)", "2 tablespoons extra virgin olive oil", "2 leeks, white and light green parts only, cleaned and sliced", "1 large onion, chopped", "2 medium or large carrots, peeled and diced", "1 stalk celery, chopped", "2 medium turnips, peeled and diced", "1 small potato (about 4 ounces), peeled and diced", "2 quarts water, vegetable stock or chicken stock", "Salt to taste", "A bouquet garni made with a couple of sprigs of parsley, a bay leaf and several sprigs of cilantro", "1/2 teaspoon ground white pepper", "1/2 teaspoon turmeric"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin the fresh favas: bring a medium pot of salted water to a boil. Fill a bowl with ice water. Drop the shelled fava beans into the boiling water and boil 5 minutes. Drain and transfer immediately to the cold water. Allow the beans to cool for several minutes, then slip off their skins by pinching off the eye of the skin and squeezing gently. Hold several beans in one hand and use your other thumb and forefinger to pinch off the eyes, have a bowl for the shelled favas close at hand and this will not take very long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy soup pot or Dutch oven and add the leeks, onion, carrots and celery. Cook, stirring, until vegetables are just tender, about 5 minutes, and add the turnips, potatoes, favas, water or stock, salt and bouquet garni. Bring to a boil, reduce the heat, cover and simmer for 45 minutes, or until the vegetables are very tender. Remove and discard the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée the soup using a hand blender or a food mill, or working in batches, in a blender, making sure that you place a towel over the top of the blender and remove the inner part of the lid to avoid hot splashes. Return to the pot, add the pepper, turmeric and chopped cilantro and bring to a simmer over medium-low heat. Turn the heat to low, cover and simmer, stirring often, for 30 minutes. Taste and adjust salt and pepper. Serve in wide soup bowls, garnished with cilantro leaves and with a drizzle of olive oil over each serving."}]}