{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft-Boiled Eggs With Watercress and Walnut-Ricotta Crostini", "description": "You don’t need your own hen to make this egg-based dish from the food writer Ian Knauer, whose family has always kept chickens. In his book, “The Farm,” he shared recipes from a year of cooking with largely farm-grown ingredients. Among them was this dish, which is as good as a simple dinner as it is for breakfast or lunch.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday", "keywords": "appetizer, eggs, walnut, watercress", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1143, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "150 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "7 grams", "proteinContent": "49 grams", "saturatedFatContent": "17 grams", "sodiumContent": "2017 milligrams", "sugarContent": "15 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 tablespoons unsalted butter", "4 slices sourdough or other chewy bread", "1/2 cup walnut pieces", "1/2 cup fresh ricotta or farmer cheese", "2 tablespoons lemon juice", "Salt and freshly ground black pepper", "4 cold eggs", "2 cups watercress", "Extra-virgin olive oil or walnut oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy skillet, melt two tablespoons of the butter over medium heat. Add the bread slices and toast, turning occasionally, until both sides are well browned, 3 to 4 minutes. (Reduce heat as needed to prevent scorching.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bread and add the remaining tablespoon butter to the skillet. Add the walnuts and toast them, stirring, until lightly browned, about 3 minutes. Transfer walnuts to a food processor and let cool. Add ricotta, 1 tablespoon lemon juice and .5 teaspoon each salt and pepper. Pulse just until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the eggs in a small saucepan and cover with lukewarm water. (Hot water on cold eggs will crack the shells.) Over high heat, bring the water just to a boil. Immediately turn off the heat, cover the pan and let stand for 2 minutes. Transfer the pot to the sink and run cold water over the eggs for about 30 seconds. Peel the eggs under cold running water"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, toss watercress with the remaining tablespoon lemon juice and salt and pepper to taste. Spread walnut ricotta evenly over the toasts, then top with watercress. Place 1 egg on each toast and grind pepper on top. Using a small, sharp knife, gently cut each egg open to break the yolk, letting it run down to dress the watercress. Drizzle with oil, if using, and serve."}], "link": "https://cooking.nytimes.com/recipes/12365-soft-boiled-eggs-with-watercress-and-walnut-ricotta-crostini"}