{"@context": "http://schema.org", "@type": "Recipe", "name": "Vermouth-Braised Short Ribs", "description": "When it comes to short ribs, you have choices. Boneless short ribs are easier to serve to a crowd and can be substituted pound for pound in your grandmother’s time-honored brisket recipe.\n\nBone-in short ribs require a very large pot and are somewhat more awkward to plate. The upside is that they have even more flavor because the marrow that seeps out of the bones seasons the sauce.\n\nYou can buy them either cut across the bone, called flanken, or along the bones, often called English style — the way it is done in fancy restaurants. You’ll need about three-quarters of a pound of bone-in short ribs per person. If you cook the beef the day before and chill it overnight, you’ll be able to lift off much of the fat that hardens on top of the sauce.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/04/04/dining/04APPE/04APPE_SPAN-articleLarge-v5.jpg", "totalTime": "PT1H", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef, short ribs, white wine, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 470}, "recipeIngredient": ["8 pounds bone-in short ribs, rinsed and patted dry", "Coarse salt and freshly ground black pepper", "4 to 5 tablespoons olive oil, more as needed", "8 shallots, 6 finely chopped, 2 thinly sliced", "6 garlic cloves, finely chopped", "3 medium leeks, white and light green parts only, chopped", "2 celery ribs, finely chopped (save leaves for garnish)", "1 (750-milliliter) bottle white wine, not too dry", "2 cups chicken broth, preferably homemade", "1 cup dry vermouth", "6 fresh thyme sprigs", "1 small bunch fresh parsley, stems separated (save leaves for garnish)", "1 fresh rosemary sprig", "3 medium carrots, diced", "1/4 cup white wine vinegar", "2 tablespoons honey", "Flaky sea salt, for garnish (optional)", "1 small bunch chives, roughly chopped", "1 small bunch fresh mint, leaves roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have time, the night before or several hours before cooking, season the meat generously with the salt and pepper (you will need at least a tablespoon salt and 1 1/2 teaspoons pepper). Wrap and refrigerate until needed. (You could do this just before cooking, if necessary.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. In a very large Dutch oven over medium-high heat, warm 2 tablespoons of the olive oil. Working in batches, arrange as many of the short ribs as fit comfortably in a single layer and brown on all sides. Take your time with this and let them get good and brown, and don’t crowd the pot or else they will steam and never develop a tasty, caramelized crust. Transfer the ribs to a bowl once they have browned, and add more oil to the pot as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another 2 tablespoons of the oil to the pot if it looks dry, and stir in the chopped shallots, garlic, leeks, celery and a large pinch of salt and pepper. Cook the vegetables until softened, about 7 minutes, stirring constantly and scraping up the browned bits on the bottom. Add the wine, chicken broth and vermouth, and simmer until the liquid is reduced by half, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the short ribs in the liquid in the pot. Using kitchen twine, tie together the thyme, parsley stems and rosemary, and drop into the pot. Bring the liquid to a simmer on the stove, then cover and transfer the pot to the oven. Cook, turning the ribs every 45 minutes or so, until the meat is tender but not yet falling off the bone, about 2 hours. Add the carrots and let cook until tender, about 30 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a slotted spoon to remove the short ribs and most of the carrots. Discard the herb bunch. Bring the liquid to a simmer, reducing it until it thickens slightly. If serving right away, spoon off some of the fat from the surface of the sauce. Or pour the sauce back over the meat and chill overnight in the pot, then spoon off the fat. Reheat if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, combine the sliced shallots, vinegar and honey in a bowl. Place short ribs on a platter and top with some of the sauce. Sprinkle with the flaky salt, chives, mint, parsley leaves and celery leaves, and scatter the shallots and vinegar mixture over the top."}], "link": "https://cooking.nytimes.com/recipes/12367-vermouth-braised-short-ribs"}