{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Greek Artichoke Bottoms with Lemon and Olive Oil", "description": "Because artichokes appear in early spring in Greece, they were traditionally part of the Passover meal. The recipe that inspired this, from Nicholas Stavroulakis’ delightful “Cookbook of the Jews of Greece,” also included honey (2 tablespoons), but I prefer the dish without. I don’t like throwing away the leaves that I break off, especially with large, meaty artichokes, so I steam them separately and serve them as an appetizer, with vinaigrette.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/04/06/health/nutrition/06recipehealth/06recipehealth-articleLarge-v6.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 296, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "15 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "772 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["8 medium artichokes, or 4 large", "Juice of 4 lemons", "1/3 cup extra virgin olive oil", "Salt to taste", "2 tablespoons chopped fresh dill, plus additional for garnish if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with water and add the juice of 1 lemon. Cut away the end of the stems of the artichokes, leaving about an inch. Break off the tough leaves around the bottom, and using a large, sharp chef's knife, cut away the tops about an inch above the widest part of the artichoke. Then trim the base by holding a paring knife at a 45-degree angle and turning the artichoke against the knife. You should end up with bare artichoke bottoms with no leaves and smooth sides. Peel the stems. Cut the artichoke bottom in half, scoop out the spiny inner leaves and the choke, and immediately plunge it into the bowl of acidulated water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a large casserole. Drain the artichokes, take two halves and press them together to make a single artichoke, and place in the casserole, stem up. Repeat with the remaining artichokes, squeezing them into the pot with their stems facing up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough water to the casserole to come a third of the way up the sides of the artichoke bottoms. Drizzle in the remaining lemon juice and the olive oil. Add salt to taste and sprinkle on the dill. Bring to a simmer, cover tightly and simmer over low heat for about 30 minutes, or until the artichokes are tender. Remove from the heat and allow to cool, then transfer to a platter. Discard the liquid in the pot. Serve cold or room temperature, garnished, if desired, with fresh dill."}], "link": "https://cooking.nytimes.com/recipes/12362-braised-greek-artichoke-bottoms-with-lemon-and-olive-oil"}