{"@context": "http://schema.org", "@type": "Recipe", "name": "Parmesan Lamb Chops", "description": "Though you can buy individual rib chops, it is easy to cut a rack into eight chops yourself, which is more economical. (You will want to have it Frenched, that is, trimmed to expose the bones and rib-eye. Most butchers sell lamb racks that are already prepared this way.) How many chops make a portion? Two make a moderate serving, but you may need three or four for heartier appetites.\n\nA wonderful way to prepare rib chops is to coat them in a mixture of bread crumbs and Parmesan cheese, then fry them gently in olive oil to give them a crisp, golden, savory crust. Served with lemon wedges and a pile of garlicky greens like broccoli rabe or spinach, they make a lovely treat.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/04/04/dining/04KITCH5_SPAN/04KITCH5_SPAN-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "2 to 3 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "lamb chops, parmesan, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 85}, "recipeIngredient": ["1 small rack of lamb, Frenched by a butcher, about 11/2 pounds, or 8 3-ounce rib chops", "Salt and pepper", "1/2 cup bread crumbs, preferably homemade", "1/2 ounce grated Parmesan (about 1/2 cup)", "1/2 teaspoon powdered fennel seed (use an electric spice mill or mortar and pestle)", "1 teaspoon finely chopped rosemary", "1/2 cup flour seasoned with 1/2 teaspoon salt, 1/4 teaspoon black pepper and a pinch cayenne", "2 small eggs, lightly beaten", "Olive oil for frying (or substitute clarified butter or vegetable oil)", "Parsley sprigs for serving", "Lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp knife, cut between bones to divide the rack of lamb into 8 chops. Trim chops of any excess fat. Season with salt and pepper on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the bread crumbs, Parmesan, fennel seed and rosemary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip each chop into the seasoned flour, then into the beaten eggs. Lay the chops on a baking sheet and sprinkle both sides of each liberally with the crumb mixture. Press any remaining mixture evenly over the chops to coat well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet, pour the olive oil to a depth of 1/2 inch. Heat over a medium-high burner until the oil looks wavy. Add the chops without crowding. They should begin to sizzle, but not brown too quickly. Adjust the heat so they fry gently for about 21/2 minutes, until crisp and golden. Turn with tongs and fry on the other side for about 2 minutes. (The interiors should be pink and juicy, but not rare.) Blot on paper towels. Serve with parsley sprigs and lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/12368-parmesan-lamb-chops"}