{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish Spinach with Tomatoes and Rice", "description": "Not every tradition allows rice during Passover; in this fragrant dish there’s just enough of it to add substance to the vegetables. Some Sephardic Jews have traditionally allowed rice during Passover, whereas many Ashkenazi Jews do not. There isn’t much of it in this Turkish spinach dish, adapted from a recipe in Clifford A. Wright’s “A Mediterranean Feast,” just enough to add substance to the vegetables.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/04/05/health/nutrition/05recipehealth/05recipehealth-articleLarge-v3.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 side-dish servings", "recipeCuisine": "turkish", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "appetizer, dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, nut-free, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 109, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "557 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds spinach, stemmed and washed in 2 changes water, or 1 pound baby spinach", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1 can diced tomatoes in juice or, in season, 1 1/4 pound tomatoes, peeled, seeded and chopped", "1 cup chicken stock, vegetable stock, garlic broth or water", "2 to 3 tablespoons freshly squeezed lemon juice (to taste)", "3 tablespoons long grain or basmati rice, rinsed in several changes of water, or 1/2 cup cooked brown rice", "Salt to taste", "2 teaspoons paprika", "1/2 teaspoon cinnamon", "3/4 to 1 teaspoon sugar (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the spinach and, working in batches if necessary, steam for about 2 minutes above an inch of boiling water, just until wilted. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, lidded skillet or casserole and add the garlic. Cook, stirring, until it begins to sizzle and smell fragrant, about 30 seconds, and stir in the tomatoes. Cook, stirring often, for 5 to 10 minutes, until the tomatoes have cooked down slightly. Add the stock or water, the lemon juice, rice, salt, paprika, cinnamon, sugar and steamed spinach and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover, turn the heat to low and simmer 15 minutes. Uncover and continue to cook until the mixture has the consistency of a thick stew, about 15 minutes. Taste and adjust seasonings. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/12361-turkish-spinach-with-tomatoes-and-rice"}