{"@context": "http://schema.org", "@type": "Recipe", "name": "Saag Tofu (Tofu With Spinach, Ginger, Coriander and Turmeric)", "description": "Raghavan Iyer, author of “660 Curries,” describes the Indian cheese paneer as “fresh, firm and chewy” and “not unlike a block of extra-firm tofu,” which you could substitute for paneer in a pinch. Tofu takes the place of paneer in this lighter version of saag paneer, a classic Indian dish made with fresh spinach sautéed in plenty of ginger, cumin, fennel seeds, chiles, coriander and turmeric. Here, seared tofu and yogurt are stirred in at the end, making it a creamy, satisfying, almost-vegan meal that's wonderful served with naan or over rice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/19/dining/tofuspinach/tofuspinach-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, easy, quick", "keywords": "gluten-free, healthy, high fiber, low cholesterol, nut-free, vegetarian, main course, spices, spinach, tofu, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1193}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 274, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "7 grams", "proteinContent": "22 grams", "saturatedFatContent": "3 grams", "sodiumContent": "751 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound firm tofu, cut into 1-inch cubes", "2 tablespoons canola oil", "1/2 cup coarsely chopped shallot or red onion", "4 lengthwise slices peeled fresh ginger (2 inches long, 1 inch wide, 1/8 inch thick), coarsely chopped", "1 teaspoon cumin seeds", "1/2 teaspoon fennel seeds", "2 whole dried red chilies, like Thai, cayenne or arbol", "1 tablespoon coriander seeds, ground", "Salt to taste", "1/4 teaspoon cayenne", "1/4 teaspoon ground turmeric", "1 1/2 pounds fresh spinach, stems trimmed at the end and washed in 2 changes of water, or 12 ounces baby spinach, rinsed", "1/2 cup drained yogurt", "1/4 teaspoon cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the tofu on paper towels. Heat 1 tablespoon of the oil over medium-high heat in a wok or a large, heavy lidded skillet and add the tofu. Stir-fry until golden brown and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the shallot or onion and the ginger in a food processor or mini-chop and blend until finely minced, almost a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil over medium-high heat in a wok or skillet and add the cumin seeds, fennel seeds and whole chiles. Cook, stirring, for about 15 seconds, or until the spices are fragrant and reddish-brown. Add the onion and ginger and stir-fry until it is lightly browned, about 3 minutes. Add the coriander, salt, cayenne and turmeric, stir for about 10 seconds and add the spinach in batches, adding the next batch after the first batch wilts and stirring and scraping the bottom of the pan to deglaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tofu, cover, reduce the heat to medium-low and simmer, stirring occasionally, for 2 to 3 minutes, until the spinach is uniformly wilted and the tofu is warmed through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the cornstarch into the yogurt. Remove the pan from the heat, remove the chilies, and stir in the yogurt. Taste, adjust salt and serve with rice or other grains."}]}