{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Pork Stew With Hominy and Collard Greens", "description": "I’ve long adored hominy, the earthy dried corn kernels you find in pozole, the chile-laced Mexican stew. When I saw dried heirloom hominy for sale online, I bought some. I knew that having it in the cupboard when a hominy craving struck was the best insurance against cheating and buying the canned version.\n\nLike dried beans, dried hominy needs a good long soak and a lengthy cooking. But there’s nothing difficult about the process.\n\nMany pozole recipes call for the finished stew to be garnished with shredded cabbage. But after bingeing on cabbage recently, I decided to take a different route, and stirred slivered collard greens into the pot at the end of cooking. They turned silky and soft and offered a nice contrast to the chewy hominy, the brawny pork and the spicy thick broth.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/03/21/dining/21APPE_SPAN/21APPE_SPAN-articleLarge-v3.jpg", "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "collard greens, hominy, pork, dairy-free, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 256}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 606, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "2 grams", "proteinContent": "39 grams", "saturatedFatContent": "13 grams", "sodiumContent": "803 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound dried hominy", "3 pounds boneless pork butt, cut into 2-inch-square chunks", "1 tablespoon kosher salt, plus more to taste", "1 teaspoon black pepper", "3 tablespoons peanut or safflower oil", "2 yellow onions, finely chopped", "4 garlic cloves, finely chopped", "1 tablespoon New Mexican chile powder (or less, to taste)", "1 teaspoon ground cumin", "1 teaspoon Mexican oregano", "1 bay leaf", "1 cinnamon stick", "1 chipotle in adobo sauce", "1 (12-ounce) bottle lager-style beer", "2 pounds collard greens (about 2 bunches), center rib removed, leaves chopped", "Lime wedges, for serving", "Cilantro leaves, for serving", "Diced avocado, for serving", "Diced radish for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the hominy in plenty of water overnight. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pork all over with 1 teaspoon salt and the black pepper. Heat the oil in a large pot over medium-high heat. Sear the meat in batches until well browned on all sides. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion to the pot and cook until soft, 5 to 7 minutes. Add the garlic, chile powder, cumin, oregano, bay leaf and cinnamon. Cook 1 minute. Return pork to pot. Stir in the chipotle, hominy, beer, 6 cups water and 2 teaspoons salt. Simmer, covered, for 1 hour. Uncover and simmer for about 1 to 1 1/2 hours more till meat and hominy are tender, adding water as needed if too thick. Stir in collards for last 20 minutes. Discard bay leaf and cinnamon. Taste and adjust seasonings. Ladle into bowls; garnish with lime, cilantro, avocado and radish."}], "link": "https://cooking.nytimes.com/recipes/12376-spicy-pork-stew-with-hominy-and-collard-greens"}