{"@context": "http://schema.org", "@type": "Recipe", "name": "Crisp Lamb Chops With Aromatic Wine Sauce", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/04/11/dining/11PAIR_SPAN/11PAIR_SPAN-articleLarge-v2.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "lamb, potato, red wine, main course", "aggregateRating": null, "recipeIngredient": ["2 lamb shanks, cut in thirds", "1 large onion, peeled and quartered", "1 large tomato, coarsely chopped", "6 garlic cloves, half  of them unpeeled, half minced ", "5 sprigs flat-leaf parsley", "3 bay leaves", "6 sprigs rosemary", "3 cups dry red wine", "Salt", "5 tablespoons extra virgin olive oil", "1 pound baking potatoes, peeled and sliced thin", "1/4 cup oil-packed sun-dried tomatoes, slivered", "8 loin lamb chops, 1-inch thick, well-trimmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place lamb shank pieces, the onion, tomato and unpeeled garlic in a roasting pan and bake, turning once, for 45 minutes. Transfer meat, bones and vegetables to a 4-quart pot. Leave as much fat as possible in the pan and discard. Add parsley, bay leaves, 1 sprig rosemary and wine to pot. Add enough water, 2 cups or more, just to cover ingredients. Bring to a boil, reduce heat to very low and simmer, about 3 hours, until liquid is reduced to less than 2 cups. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat and bones. Discard bones and save meat for another use, such as pasta sauce. Strain vegetables and liquid through a fine sieve into a saucepan. Skim off as much fat as possible. Bring liquid to a simmer and cook until reduced to a scant cup, about 20 minutes. Season with salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a large skillet on medium-high. Add half the potatoes and saut&eacute; until lightly browned. Remove and repeat with remaining potatoes. Remove. Add 2 tablespoons oil to skillet. Add sun-dried tomatoes, remaining garlic and 1 sprig rosemary and saut&eacute; briefly on low. Return potatoes to skillet, cover and cook 5 minutes. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chops with salt. Heat remaining oil in a large cast-iron skillet. Cook chops on high about 3 minutes a side for medium-rare. Reheat sauce. Divide potatoes among four warm dinner plates. Place two chops on each. Spoon sauce over chops, garnish with remaining rosemary and serve. "}], "link": "https://cooking.nytimes.com/recipes/12384-crisp-lamb-chops-with-aromatic-wine-sauce"}