{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek-Style Dinner Pie With Leftover Greens", "description": "Leftovers often die an ignoble death in the back of the refrigerator, a waste of money and time. They can, however, be an opportunity to improvise, even to elevate. Here, some leftover cooked greens are combined with raw ones in a show-stopping Greek-style treatment that uses boxed phyllo dough to its best advantages. Pie for dinner!", "author": {"@type": "Person", "name": "Andrew Scrivani"}, "image": "https://static01.nyt.com/images/2014/03/13/dining/13greekpie/13greekpie-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "eggs, greens, phyllo, healthy, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 118}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 255, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "8 grams", "sodiumContent": "352 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon extra-virgin olive oil, plus additional as needed", "1 medium to large red onion, finely chopped", "salt", "2 large garlic cloves, minced", "8 ounces raw greens (such as spinach, chard, collard or kale), cut into ribbons, or 2 cups cooked greens", "1/4 cup finely chopped flat-leaf parsley", "1/3 cup finely chopped fresh dill", "Freshly ground black pepper", "3 large eggs", "5 ounces feta cheese, crumbled", "12 sheets (about 8 ounces) phyllo dough", "4 to 6 tablespoons unsalted butter, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy skillet over medium heat, heat 1 tablespoon oil. Add the onion and sauté until tender, about 5 minutes. Add a generous pinch of salt and the garlic, stirring until fragrant, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using raw greens, add, stirring until wilted, 2 to 4 minutes depending on which greens are used. If using cooked greens, add, stirring just until heated. Add parsley and dill, and season with salt and pepper to taste"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Brush a 10-inch tart or pie pan with oil. In a large bowl, beat the eggs until foamy. Add the feta and the greens mixture, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a sheet of phyllo across the pan, so that the edges of it drape evenly over the pan. Gently fit the center of it into the base of the pan. Quickly and lightly, brush the phyllo with butter. Repeat with seven more sheets of phyllo, stacking them one on top of the other so that they form an asterisk pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill with the greens mixture, and fold the draped edges over to enclose the filling. Top with the remaining four sheets of phyllo, buttering each one, and again stacking in an asterisk pattern. Fold the edges under so that the dough extends about an inch beyond the rim of the pan, and then tuck the dough slightly into the pan, while rolling and twisting the edge under to shape a crust. Using a sharp knife, make several slashes through the top of the pie into the filling to allow steam to escape as the pie bakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie until the crust is crisp and golden brown, about 50 minutes. Serve hot, warm, or at room temperature. For a crispy crust, this is best served the same day baked."}], "link": "https://cooking.nytimes.com/recipes/12388-greek-style-dinner-pie-with-leftover-greens"}