{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli Rabe, Olive and Parmesan Calzone", "description": "A calzone has many of the perks of pizza. Easy and crowd pleasing, it’s a good vehicle for using up odds and ends in the fridge.\n\nIt also has some happy benefits of its own. For one, you can get away with adding a lot more cheese. In fact, it’s practically mandatory. You need to stuff enough ricotta and mozzarella into the dough so that it ripples attractively, rising as it bakes. Unlike an apple turnover, which wants to stay flat, a calzone should peak and singe at the top. (True, you could cram the dough full of vegetables and the like, but if you love cheese, calzones are the place to indulge.)\n\nAnother calzone advantage is the element of surprise. Pizza gives it all up as soon as it lands on the table; serve a calzone to a group and let them anticipate the moment when they find out what’s inside.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/04/13/dining/video-clarkcalzone/video-clarkcalzone-mediumThreeByTwo440.jpg", "totalTime": "PT40M", "recipeYield": "2 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pizza and calzones", "keywords": "broccoli rabe, pizza dough, ricotta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 914, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "10 grams", "proteinContent": "47 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1398 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil, more as needed", "3 garlic cloves, finely chopped", "1 bunch broccoli rabe, tough stems removed", "Kosher salt, as needed", "Black pepper, as needed", "All-purpose flour, as needed", "1 8-ounce ball pizza dough, homemade or purchased", "1 cup fresh ricotta", "1/4 cup finely grated Parmesan cheese", "3 ounces fresh mozzarella, sliced", "2 tablespoons pitted good black olives, thinly sliced", "Pinch red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 500 degrees. Lightly oil a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium heat. Add 2 tablespoons oil and 2/3 of the garlic. Cook until fragrant but not brown, about 20 seconds. Add the broccoli rabe and 3 tablespoons water. Cook over medium-high heat for 3 minutes. Reduce heat, cover, and cook until stems are tender, 2 to 3 minutes more. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface, and stretch or roll the dough into a 12-inch round. Spoon ricotta on half the dough, leaving a half-inch border. Top with Parmesan, remaining garlic and mozzarella. Mound broccoli rabe over the cheese, and sprinkle with olives and pepper flakes. Brush the edges of the dough with water, and fold dough in half, over filling; pinch the edges of the dough together to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer calzone to baking sheet. Brush the top with olive oil. Bake until crust is golden  and firm, 15 to 20 minutes. Let cool 5 minutes before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "How to Make Calzones", "description": "Pizza dough might just have a higher calling: calzones. Melissa Clark demonstrates how to make them at home.", "thumbnailUrl": "https://static01.nyt.com/images/2012/04/13/dining/video-clarkcalzone/video-clarkcalzone-mediumThreeByTwo440.jpg", "uploadDate": "2012-04-13T22:24:07.000Z", "duration": "PT3M31S"}, "link": "https://cooking.nytimes.com/recipes/12393-broccoli-rabe-olive-and-parmesan-calzone"}