{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Roasted Salmon, Quinoa and Asparagus With Wasabi Oil", "description": "Seasoned oils like the wasabi oil I buy at my local specialty grocery can embellish a simply cooked piece of fish, a bowl of grains or steamed vegetables. Here the salmon is cooked in the oven, and the wasabi seasoned oil (mine is canola oil-based) is drizzled on just before serving. It’s served with quinoa, which you can also dress with the oil, and vegetables in season.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/04/20/health/nutrition/20recipehealth/20recipehealth-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "asparagus, quinoa, salmon, dairy-free, gluten-free, healthy, high fiber, nut-free, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 645, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "9 grams", "proteinContent": "45 grams", "saturatedFatContent": "6 grams", "sodiumContent": "995 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds salmon fillets", "Coarse sea salt and freshly ground pepper to taste", "3 cups cooked quinoa ", "1 pound asparagus or any other green vegetable", "4 teaspoons wasabi oil (available at gourmet markets) (more to taste) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Cover a baking sheet with foil and lightly oil the foil. Place the salmon on top, skin side down. Season with coarse salt and pepper. Fill a roasting or baking pan with boiling water and place it on the oven floor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the salmon in the oven and bake until the fish flakes and white bubbles of protein appear on the surface, 10 to 20 minutes, depending on the size of the fillets. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, snap off the woody ends of the asparagus and steam for 5 minutes, until tender. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a serving of quinoa on each plate, or place a mound of it on a platter. Top with the salmon fillets and arrange the asparagus on the side. Drizzle about a teaspoon wasabi oil over the fish and the asparagus, and serve."}]}