{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Red Rice With Spinach, Mushrooms, Carrot and Egg", "description": "Rice bran oil has a very high smoke point, so it's a perfect oil for searing and stir-fries where that high-heat seared flavor is desired. You can make this dish with any type of rice, but I love the red rice I’ve been finding in whole-foods stores, whether from Thailand or Bhutan.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/04/17/blogs/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, high fiber, low-sodium, nut-free, vegetarian, main course, red rice, spinach, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "recipeIngredient": ["2 tablespoons rice bran oil", "1 small or medium onion, sliced", "1 large carrot, peeled and cut in 2-inch-long julienne", "4 ounces tofu, patted dry and cut in 1/2-inch dice", "6 white or cremini mushrooms, cut in thick slices", "4 large garlic cloves, minced ", "2 serrano chilies, minced", "1 generous bunch spinach (3/4 to 1 pound), ends trimmed, rinsed thoroughly in 2 changes of water", "Salt and freshly ground pepper to taste", "2 eggs, beaten and seasoned with salt and pepper", "5 cups cooked red rice", "1 tablespoon fish sauce or soy sauce (more to taste, optional)", "1 bunch scallions, both white and green parts, chopped (optional)", "Chopped cilantro", "Thinly sliced cucumber", "Lime wedges", "Scallions", "Fish sauce with hot chilies (nam pla prik)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch wok or large, heavy skillet over high heat until a drop of water evaporates upon contact. Swirl in the oil and add the onion, carrot, tofu and mushrooms. Stir-fry until the vegetables are crisp-tender and the tofu is lightly colored, about 2 minutes. Add the garlic and chili, stir-fry for no more than 10 seconds, and add the spinach. Stir-fry until the spinach wilts, season to taste with salt and pepper, and pour in the beaten egg. Stir-fry until the egg is scrambled, and add the rice. Cook, scooping up the rice with your paddle, then pressing it into the pan and scooping it up again, for about 2 minutes, until the mixture has a nice seared aroma. Add the fish sauce or soy sauce and chopped scallions, stir together for about half a minute, and serve, passing the optional garnishes. "}]}