{"@context": "http://schema.org", "@type": "Recipe", "name": "Mark Bittman's Basic Pizza Dough", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/01/dining/Basic-Pizza-Dough/Basic-Pizza-Dough-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "2 pies, 4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "flour, yeast, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 565}, "recipeIngredient": ["3 cups all-purpose or bread flour, or more as needed, plus more for kneading", "2 teaspoons instant yeast", "2 teaspoons salt, plus more for sprinkling", "2 tablespoons olive oil, plus more as necessary", "Rosemary, optional."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the 3 cups flour, yeast, 2 teaspoons salt and 2 tablespoons of the olive oil in a food processor. Turn the machine on and add 1 cup water through the feed tube. Process until the mixture forms a slightly sticky ball, about 30 seconds. If the mixture is too dry, add more water 1 tablespoon at a time and process for 5 to 10 seconds after each addition. If the mixture refuses to come together, add more flour 1 tablespoon at a time and process until it does."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub a little olive oil or sprinkle a little flour onto your hands and shape the dough into a ball; wrap in plastic. Let rest at room temperature until the dough doubles in size, 1 to 2 hours. Or, if time is tight, let it rest at least 20 minutes before proceeding. Or refrigerate for several hours, deflating if necessary if it threatens to burst the plastic. (Or divide in half, wrap each ball in plastic, slip into a plastic bag and freeze.) Let it return to room temperature before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reshape the dough into a ball and cut in half, forming 2 balls. (From here on, use olive oil if you're cooking on baking sheets, flour if on a pizza stone.) Put them on a lightly floured surface (a pizza peel is ideal), sprinkle with flour and cover with plastic wrap; or brush then with a bit of oil and place on a lightly oiled sheet. Let rest for about 20 minutes, while you heat the oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press a dough ball into a 1/2-inch-thick flat round, adding flour or oil to the work surface as necessary. Press or roll the dough until it's as thin as you can make it; let it rest a bit if it becomes too elastic. (Patience is your friend here.) You can do two baking sheets at once, or one after another, as you'll have to if using a peel. If doing the latter, slide the dough from the peel onto the stone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the pizzas with olive oil (just a little), salt and rosemary. Bake for at least 10 minutes, perhaps rotating once, until the crust is crisp. Serve hot, warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/12399-mark-bittmans-basic-pizza-dough"}