{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Coconut Mussels With Lemongrass", "description": "Mussels are cheap, delicious and relatively fun to eat: saline, mild and plump little bites. They are also extremely easy to cook, especially if they’ve been farmed (most mussels you find in markets have been). Just give them a good rinse, and they are ready to go. Here the treatment heads in the general direction of Thailand, offering a sauce of coconut milk, lemongrass, garlic and chiles that perfectly frames the sweetness of the meat.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/07/dining/07mussels/07mussels-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, weekday", "keywords": "cilantro, coconut milk, mussels, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 186}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 869, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "2 grams", "proteinContent": "60 grams", "saturatedFatContent": "27 grams", "sodiumContent": "1536 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons coconut or safflower oil", "1 shallot, finely chopped", "3 garlic cloves, finely chopped", "1 stalk lemongrass, trimmed (outer layers removed) and finely chopped", "1/2 to 1 small hot chile (like Thai bird, Serrano, Scotch bonnet or jalapeño), seeded and finely chopped", "1 cup unsweetened coconut milk", "2 pounds fresh mussels, rinsed well", "Zest of 1/2 lemon", "1 teaspoon lemon juice, or to taste", "1/2 teaspoon Asian fish sauce, or to taste", "1/2 cup whole cilantro leaves", "1 or 2 croissants, split in half."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in the bottom of a large pot until hot. Add the shallot, garlic, lemongrass and chile. Cook over medium heat until soft, about 3 minutes. Add the coconut milk and mussels. Cover with a tight-fitting lid and cook until the mussels have opened, 5 to 7 minutes (discard any mussels that remained closed). Remove from heat, and use a slotted spoon to transfer the mussels to a large bowl, leaving the liquid in the pot. Stir the lemon zest and juice, fish sauce and cilantro into the pot. Taste and add more fish sauce and/or lemon juice if needed (fish sauce provides the salt)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the mussels cook, heat the broiler. Place the croissants, cut side up, on a small baking sheet. Run under the broiler until just golden. Put the mussels in two wide, shallow bowls. Ladle the broth over them and serve with the croissants."}], "link": "https://cooking.nytimes.com/recipes/12406-spicy-coconut-mussels-with-lemongrass"}