{"@context": "http://schema.org", "@type": "Recipe", "name": "Mussel Risotto", "description": "I usually keep a good supply of arborio rice on hand for risotto, but on the day I first decided to make this I had just about run out. So I cooked up some short-grain brown rice and stirred it in toward the end of cooking, and what resulted was a wholesome mixed-grains risotto. You won’t get the creaminess if you use all brown rice (and it will take forever), but if you want some whole grain, use the combination option.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/04/health/nutrition/04recipehealth/04recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, low cholesterol, nut-free, main course, mussels, rice, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 620, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "94 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "28 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1251 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds black mussels", "1 1/2 cups dry white wine", "3 cups water", "Additional water or chicken stock as needed", "1 medium onion, half sliced, half finely chopped", "4 garlic cloves, 2 crushed, 2 minced", "1 sprig thyme", "1 sprig parsley", "6 peppercorns", "2 tablespoons extra virgin olive oil", "1 stalk celery, finely chopped", "1 1/2 cups arborio rice, or 1 cup arborio rice and 1 1/2 cups cooked short-grain brown rice", "3/4 pound tomatoes, peeled, seeded and finely chopped, or 1 cup canned crushed tomatoes", "Generous pinch saffron", "1 cup cooked fresh or thawed frozen peas", "Salt and freshly ground pepper", "2 tablespoons chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the mussels. Inspect each one carefully and discard any that have opened (if some are partly open, tap them with your finger, and if they close back up they are O.K.) or have cracked shells. Place in a large bowl, fill the bowl with cold water and rinse several times, swishing the mussels around in the water, pouring out the water and refilling. Clean the shells, if necessary, with a brush or the end of one of the mussels, and pull out the beards – the hairy attachments emerging from the shells. Do not do this until just before cooking, or the mussels will die and spoil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1 cup of the wine and the 3 cups of water in a large pot or Dutch oven. Add the sliced onion, the crushed garlic cloves, the thyme and parsley sprigs, and the peppercorns and bring to a boil. Add the mussels, cover the pan and cook until the mussels have opened, about 4 minutes. Stir the mussels halfway through.  Using tongs, transfer the mussels to a bowl, holding them over the pot first so any liquid in the shells will drain into the pot. Discard any that have not opened. When they are cool enough to handle, remove the mussels from their shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a strainer with a double thickness of dampened cheesecloth, place over a saucepan and strain the broth from the mussels.  Add more water or stock to make 6 cups if using 1 1/2 cups arborio rice. (You will have enough if using 1 cup arborio.) Bring to a simmer over medium-low heat. Taste and season as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet or a wide, heavy saucepan. Add the finely chopped onion and the celery and a generous pinch of salt, and cook gently until the onion is just tender, about 3 minutes. Do not brown. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the arborio rice and the minced garlic and stir until the grains separate and begin to crackle. Add the remaining 1/2 cup wine and stir until it is no longer visible in the pan. Add the tomatoes and saffron and cook, stirring, until the tomatoes have cooked down slightly and smell fragrant, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, adding more and stirring when the rice is almost dry. You do not have to stir constantly, but stir often. When the rice is just tender all the way through but still chewy, stir in the mussels and any juice that has accumulated in the bowl, the cooked brown rice, if using, and the peas. Taste now and adjust seasoning. Stir in another ladleful of stock and remove from the heat. The mixture should be creamy (add more stock if it isn’t). Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}], "link": "https://cooking.nytimes.com/recipes/12416-mussel-risotto"}