{"@context": "http://schema.org", "@type": "Recipe", "name": "Curry-Laced Moules à la Marinière With Fresh Peas", "description": "It’s important to buy mussels from a reputable fishmonger. If mussels are not properly stored, they die, and a dead mussel can make you very sick. Look for mussels that are shiny and black, and somewhat heavy. Once home, take them out of the wrapping immediately, give them a quick rinse and put them in a big bowl. Cover the bowl with a damp cloth and refrigerate until you’re ready to clean and cook them. The main work that goes into cooking mussels is the careful picking over that must be done first, to make sure there are no dead mussels. Rinse the mussels in several times in cold water and examine each one. If there are cracks in the shell, or if a mussel is open and doesn’t close back up when you tap the shell, throw it away. If the shells have lots of algae, seaweed or barnacles on them, you can brush them or scrape them with the edge of the shell of another mussel. Finally, pull out the beards. This should not be done until shortly before cooking as mussels can die once the beards have been pulled. Discard any that remain closed after cooking.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/04/30/health/nutrition/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 main-course servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "dry white wine, mussels, peas, gluten-free, healthy, nut-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 542, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "4 grams", "proteinContent": "51 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1149 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 pounds black mussels", "1 to 1 1/2 cups freshly shelled peas", "2 tablespoons unsalted butter", "1 small onion or 2 to 4 shallots, minced", "1 1/2 teaspoons curry powder (more to taste)", "2 cups dry white wine", "2 to 3 garlic cloves, peeled and crushed", "4 sprigs fresh parsley", "2 sprigs fresh thyme", "1 small bay leaf", "6 whole peppercorns", "3 tablespoons finely chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the mussels. Inspect each one carefully and discard any that have opened (if some are partly open, tap them with your finger, and if they close back up they are O.K.) or have cracked shells. Place in a large bowl, fill the bowl with cold water and rinse several times, swishing the mussels around in the water, pouring out the water and refilling. Clean the shells, if necessary, with a brush or the end of one of the mussels, and pull out the beards – the hairy attachments emerging from the shells. Do not do this until just before cooking, or the mussels will die and spoil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the peas or cook them in lightly salted boiling water until tender, 4 to 10 minutes, depending on the size and age of the peas. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the butter over medium heat in a large Dutch oven or pot and add the onion or shallots. Cook, stirring occasionally, until they begin to soften, 2 to 3 minutes, and add the curry powder. Stir together for a minute, until fragrant, and add the wine, garlic, bay leaf, sprigs of parsley and thyme, and the peppercorns. Bring to a boil over high heat, reduce the heat to medium and boil for 2 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mussels and cover tightly. Cook 2 minutes, shake the pot vigorously and cook another 2 minutes. Uncover and use tongs to transfer all of the mussels that have opened to wide soup bowls. Cover the pot and cook for another minute, or until all of the mussels have opened. Transfer them to the bowls with the other mussels. Discard any mussels that have not opened. Cover the mussels to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a strainer with a few thicknesses of damp cheesecloth and place over a bowl. Strain the liquid from the pot into the bowl, return to the pot and bring to a boil. Stir in the remaining tablespoon of butter and simmer until it melts. Stir in the peas. Taste and adjust seasoning. You may want to add more pepper or curry powder. Spoon the broth and peas over the mussels, sprinkle with parsley and serve."}], "link": "https://cooking.nytimes.com/recipes/12412-curry-laced-moules-a-la-mariniere-with-fresh-peas"}