{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Spanish Mussels", "description": "Of all of the mussel recipes I tested this week, this was the hands-down favorite. Inspired by a spicy mussel dish I enjoyed at Bar Pilar, a tapas bar in Valencia, years ago, this dish is made special by the crunchy almond and hazelnut picada added after the mussels are steamed. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/01/health/nutrition/01recipehealth/01recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings. ", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, main course, mussels, nuts, tomato, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 65}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 543, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "51 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1405 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 pounds black mussels", "2 tablespoons extra virgin olive oil", "10 toasted, skinned hazelnuts", "10 toasted, skinned almonds", "4 large garlic cloves, minced", "1 medium onion, finely chopped", "1/2 dried red chili, crumbled, or 1/4 teaspoon dried red pepper flakes", "1 14-ounce can crushed tomatoes or chopped tomatoes with juice (if using chopped tomatoes, pulse them to a purée in a food processor)", "Pinch of sugar", "Salt and freshly ground pepper to taste", "1 cup dry white wine", "Pinch of saffron (optional)", "1/4 cup chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the mussels. Inspect each one carefully and discard any that have opened (if some are partly open, tap them with your finger and if they close back up they are O.K.) or have cracked shells. Place in a large bowl, fill the bowl with cold water and rinse several times, swishing the mussels around in the water, pouring out the water and refilling. Clean the shells, if necessary, with a brush or the end of one of the mussels, and pull out the beards – the hairy attachments emerging from the shells. Do not do this until just before cooking, or the mussels will die and spoil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large Dutch oven, soup pot or lidded frying pan and add the hazelnuts and almonds. Cook, stirring, until the nuts are golden brown and smell toasty, and add half the garlic. Cook, stirring, until the garlic is fragrant, taking care not to let it color and burn, about 30 to 60 seconds. Remove from the heat and transfer to a mortar and pestle or a mini food processor. Allow to cool, then mash or pulse until the mixture is just short of pasty; the nuts should retain some finely chopped texture. Work in 1 tablespoon of the parsley and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining tablespoon of olive oil over medium heat and add the onion. Cook, stirring often, until it is tender and translucent, about 5 minutes. Add a generous pinch of salt, the remaining garlic and the chili and cook, stirring, for another minute, until the garlic is translucent. Add the tomatoes, a pinch of sugar and salt and pepper to taste, and turn the heat to medium-high. Bring to a boil, reduce the heat, cover and simmer 20 to 30 minutes, stirring often, until the mixture has cooked down and is very fragrant. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the white wine and saffron and bring to a boil. Add the mussels, cover and steam 4 to 5 minutes, until they open. Stir the mussels halfway through to make sure they are evenly exposed to the heat. As they open, remove to a bowl with tongs. Discard any that have not opened. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the nut and garlic mixture and the remaining parsley into the tomato sauce. Taste and adjust seasoning. Distribute the mussels among 4 wide soup bowls and spoon the sauce over. Serve with bread for sopping up the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To skin hazelnuts, toast in a 300-degree oven for 20 minutes, until they begin to smell toasty. Remove from the heat and wrap in a clean dish towel. Rub the nuts in the towel and the skins will slip off. Turn the oven up to 350 degrees and roast for another 5 to 10 minutes, until light brown and toasty."}], "link": "https://cooking.nytimes.com/recipes/12413-spicy-spanish-mussels"}