{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Roasted Mussels With Fresh Spinach", "description": "Mussels don’t have to be steamed. They will pop open in a hot, dry cast iron skillet on a grill or in the oven. In this dish they are first tossed with garlic, olive oil and wine, then roasted along with the marinade in a pan in a hot oven. You may have to do this in batches, depending on the size of your skillet or baking dish. I like to use cast iron or enameled cast iron. This particular recipe is inspired by one in \"The Mozza Cookbook,\" by Nancy Silverton. Served over a generous bed of steamed spinach, this is a beautiful dish. If you have leftovers, remove the mussels from the shells, chop the spinach and toss with pasta.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/02/health/nutrition/02recipehealth/02recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, nut-free, main course, mussels, spinach, tomato, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 491, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "6 grams", "proteinContent": "53 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1650 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["3 1/2 pounds black mussels", "2 tablespoons extra virgin olive oil", "2 to 4 garlic cloves (to taste), minced", "1/2 cup dry white wine", "1 pound roma tomatoes, seeded and finely chopped", "1/4 to 1/2 teaspoon red pepper flakes", "1/4 cup minced flat-leaf parsley", "Salt and freshly ground pepper to taste", "2 generous bunches fresh spinach (about 1 1/4 to 1 1/2 pounds), stem ends trimmed away, washed well in 2 rinses of water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Clean the mussels. Inspect each one carefully and discard any that have opened (if some are partly open, tap them with your finger, and if they close back up they are O.K.) or have cracked shells. Place in a large bowl, fill the bowl with cold water and rinse several times, swishing the mussels around in the water, pouring out the water and refilling. Clean the shells, if necessary, with a brush or the end of one of the mussels, and pull out the beards -- the hairy attachments emerging from the shells. Do not do this until just before cooking, or the mussels will die and spoil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all of the ingredients in a large bowl and toss with the mussels. Refrigerate for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the mussels, pointed ends up, in a single layer in a cast iron skillet and/or a heavy baking dish. Spoon the marinade left in the bowl over the mussels and place in the preheated oven. Bake for about 10 minutes, until most of the mussels have opened. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, steam the spinach in a large pot above 1 inch of boiling water until tender, about 5 minutes. Remove from the heat, arrange on a large round platter, and season with a little bit of coarse sea salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the mussels that have opened on top of the spinach and return the pan to the oven for another 5 minutes. Remove from the heat and discard any mussels that have not opened. Arrange all of the mussels on top of the spinach, pour the juices in the pan over the mussels and spinach, sprinkle on the parsley and serve over a bed of steamed spinach, with crusty bread."}], "link": "https://cooking.nytimes.com/recipes/12414-oven-roasted-mussels-with-fresh-spinach"}