{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro Pasta with Nettles and Sausage", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/05/09/dining/09KITCH_SPAN/09KITCH_SPAN-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4 to 6. ", "recipeCuisine": "italian", "recipeCategory": "dinner, quick, pastas", "keywords": "greens, italian sausage, pasta, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "recipeIngredient": ["3 tablespoons olive oil", "1 large onion, diced small", "Salt and pepper", "1 pound hot Italian fennel sausage, casings removed (see recipe for homemade sausage)", "4 garlic cloves, minced", "1 tablespoon tomato paste", "1 pound farro pasta (or another type of dried pasta)", "1 pound rinsed nettle leaves (or other greens, like bok choy or mustard, roughly chopped)", "Ricotta salata cheese for grating (or Romano or Parmesan)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with water for pasta and bring it to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, deep skillet, heat the olive oil over a medium-high burner. Add the onion and a little salt, and let the onion begin to soften. Add the sausage meat, breaking it into rough pieces with a wooden spoon,  and cook, stirring frequently, until the onions are lightly browned and the sausage is done, about 5 to 6 minutes. Add the garlic and tomato paste and stir well to coat. Turn off the heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the pasta water and begin cooking the pasta. When the pasta is nearly ready, reheat the onion and sausage mixture over a high burner. Add the nettles or greens to the pan along with 1/4 cup pasta water and stir until wilted and tender, about 2 minutes. Check the seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta when al dente and mix with the skillet ingredients in a large warmed bowl. Serve with coarsely grated ricotta salata."}], "link": "https://cooking.nytimes.com/recipes/12426-farro-pasta-with-nettles-and-sausage"}