{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Lettuce With Seared Tofu and Red Pepper", "description": "Stir-frying is a great way to use up your overabundance of lettuce. This recipe calls for romaine, but you can try it with whatever you have on hand, as long as it’s sturdy enough to stand up to some heat. In China, where lettuce symbolizes prosperity and wealth, a simpler dish made with the lettuce only is served at New Year’s.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/08/health/nutrition/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, weekday", "keywords": "dairy-free, gluten-free, healthy, low cholesterol, low-sodium, vegan, vegetarian, lettuce, tofu, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "16 grams", "saturatedFatContent": "2 grams", "sodiumContent": "592 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons Shao Hsing rice wine or dry sherry", "1 tablespoon chicken broth, vegetable broth or water", "1 tablespoon soy sauce", "2 tablespoons peanut oil, rice bran oil or canola oil", "12 ounces firm tofu, drained on paper towels and cut into dominoes or diced", "2 teaspoons minced ginger", "2 garlic cloves, minced", "1 teaspoon minced serrano or jalapeño chili", "1 red bell pepper, cut in 2-inch-long julienne", "1 pound romaine lettuce (1 generous head or 2 hearts), cut crosswise into 1-inch-wide pieces", "Salt to taste", "2 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the rice wine or sherry, the broth or water and 2 teaspoons of the soy sauce and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil by adding it to the sides of the pan and swirling the pan, then add the tofu and stir-fry until golden brown. Add the remaining soy sauce, toss together and transfer the tofu to a plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in the remaining oil and add the ginger, garlic and chili pepper and stir-fry for no more than 10 seconds. Add the red pepper and stir-fry for 1 minute, then add the lettuce and sprinkle on the salt. Stir-fry for 1 minute, until the lettuce has begun to wilt. Add the rice wine mixture, cook 15 to 30 seconds, until the lettuce is bright and crisp tender, stir in the cilantro and remove from the heat. Serve with rice or noodles.  "}], "link": "https://cooking.nytimes.com/recipes/12422-stir-fried-lettuce-with-seared-tofu-and-red-pepper"}