{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Mole With Chicken", "description": "Green mole is one of the best destinations I can think of for the tough outer leaves from a head of romaine or leaf lettuce. If you don’t eat meat, you can make the mole with vegetable broth and enjoy it over rice and vegetables.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/09/health/nutrition/09recipehealth/09recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "chicken, lettuce, tomatillo, dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1093 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 quarts water", "1/2 medium onion, sliced", "2 large garlic cloves, roughly chopped", "1 large carrot, sliced", "2 bay leaves", "1/4 teaspoon dried thyme, or 1 sprig fresh", "1/4 teaspoon dried marjoram, or 1 sprig fresh", "Salt", "2 whole chicken breasts on the bone, split, then cut in half crosswise for 8 pieces total", "2/3 cup hulled pumpkin seeds", "1 pound tomatillos, husked and rinsed, or 1 13-ounce can, drained", "2 to 4 serrano or jalapeño chilies, to taste, seeded", "1/2 medium onion, sliced, soaked in cold water for 5 minutes, drained and rinsed", "2 garlic cloves, roughly chopped", "6 large, dark romaine or leaf lettuce leaves, washed and dried, roughly chopped", "12 large cilantro sprigs, plus additional for garnish", "3 cups chicken stock (above) or vegetable stock", "2 tablespoons rice bran oil or canola oil", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To poach the chicken, combine all of the ingredients except the chicken in a large pot and bring to a simmer. Simmer 20 minutes. Add the chicken breasts and skim off any foam when the liquid comes back to a simmer. Partly cover and simmer 15 minutes. Remove from the heat and allow to cool for 5 to 10 minutes, or longer if possible. Then, using tongs, remove the chicken breasts to a sheet tray or bowl. When they are cool enough to handle, remove the skin. Cover and set aside. Strain the stock through a cheesecloth-lined strainer and measure out 3 cups. Skim off the fat from the top. (If you do this step the day before, chill the stock first, then skim off the fat from the top. Chill any remaining stock, skim off the fat and freeze.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mole, heat a heavy Dutch oven or saucepan over medium heat and add the pumpkin seeds. Wait until you hear one pop, then stir constantly until they have puffed and popped, and smell toasty. They should not get any darker than golden, or they will taste bitter. Transfer to a bowl or a baking sheet and allow to cool. Set aside  2 tablespoons of the seeds for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re using fresh tomatillos, bring a medium pot of water to a simmer, add the tomatillos, and simmer for 10 minutes, flipping them over in the water halfway through, until soft. Drain and place in a blender. If using canned tomatillos, drain and place them in a blender. Add the cooled pumpkin seeds, the chilies, lettuce, onion, garlic, cilantro, and 1/2 cup of the stock. Cover the blender and blend the mixture until smooth, stopping the blender to stir if necessary. If necessary, do this in 2 batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the Dutch oven or heavy saucepan over medium-high heat until a drop of water evaporates immediately on contact. Add the oil, wait for a minute, then drizzle in a bit of the pumpkin seed mixture; if it sizzles loudly, add the rest, holding the lid above the pan, as the mixture will spatter. Cook, stirring, until the mixture darkens and thickens, about 5 minutes. It will splutter, so be careful. Hold the lid of the pot above the pot to shield you and your stove from the splutters. Stir or whisk in the remaining stock, bring to a simmer, reduce the heat to medium-low and simmer uncovered, stirring often, until the sauce is thick and creamy, 15 to 20 minutes. Season to taste with salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place the chicken breasts in the pot with the mole and warm on top of the stove, then remove the chicken pieces to a platter and nap with the warm sauce; or place in a large, attractive baking dish, pour on the sauce, cover and warm in a low oven (275 degrees) for 20 minutes. Garnish with cilantro sprigs and pumpkin seeds. Serve with rice."}], "link": "https://cooking.nytimes.com/recipes/12423-green-mole-with-chicken"}