{"@context": "http://schema.org", "@type": "Recipe", "name": "Lettuce and Green Garlic Soup", "description": "Use a flavorful broth — chicken or vegetable — to enhance the subtle flavors in this thick, comforting soup, which uses lettuce as a main ingredient. Rice thickens the soup and it’s all puréed with an immersion blender. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/07/health/nutrition/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "appetizer, dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "1 bulb green garlic, stalks and papery layers removed, roughly chopped", "1/2 cup rice", "7 cups chicken or vegetable stock", "1/2 cup parsley leaves", "A bouquet garni made with a bay leaf and a few sprigs each parsley and thyme, tied together", "Salt to taste", "3/4 pound lettuce leaves, washed and coarsely chopped (8 cups)", "A generous amount of freshly ground pepper", "2 tablespoons chopped flat-leaf parsley or chives for garnish", "Freshly grated Parmesan for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy soup pot over medium heat and add the onion. Cook, stirring, until it is tender, about 5 minutes. Add a generous pinch of salt and the garlic and cook, stirring, until the garlic is fragrant, about 1 minute. Add the rice, stock, parsley leaves and bouquet garni, and bring to a boil. Add the lettuce and salt to taste, reduce the heat, cover and simmer over low heat for 30 minutes. The tough ribs of the lettuce leaves should be thoroughly tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender or a regular blender (working in batches and covering the blender with a kitchen towel to prevent the hot soup from splashing), blend the soup until smooth. If using a regular blender, return the soup to the heat. Add lots of freshly ground pepper, taste and adjust salt. Heat through and serve, garnishing each bowl with chopped fresh parsley or chives and freshly grated Parmesan."}], "link": "https://cooking.nytimes.com/recipes/12421-lettuce-and-green-garlic-soup"}