{"@context": "http://schema.org", "@type": "Recipe", "name": "White Beans With Chicory", "description": "This is inspired by a classic dish from Apulia, the heel of the Italian boot. The authentic dish is a warm purée of skinned dried fava beans, served with cooked greens, usually chicory, a bitter green that is in the same family as escarole. If you are getting big heads of escarole or another hearty bitter lettuce called Batavia in your C.S.A. baskets, use the tough outer leaves for this and save the tender hearts for salads.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/10/health/nutrition/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 4 as a main dish, 6 as a starter", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "cannellini beans, chicory, garlic, dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 500, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "19 grams", "proteinContent": "29 grams", "saturatedFatContent": "2 grams", "sodiumContent": "626 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried cannellini beans, washed and picked over, soaked for 4 to 6 hours in 2 quarts water and drained", "1 medium onion, peeled, cut in half", "4 garlic cloves, crushed", "1 bay leaf", "Salt to taste ", "1 pound escarole, chicory or Batavia lettuce, leaves separated and washed", "3 tablespoons olive oil", "2 garlic cloves, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the beans with 2 quarts water in a 4-quart pot and bring to a boil. Skim any foam, then add the onion, crushed garlic, bay leaf and salt to taste. Reduce the heat, cover and simmer for 2 hours, until the beans are very tender. Taste and adjust seasoning. Remove and discard the onion, garlic cloves if desired, and bay leaf. Drain through a colander or strainer set over a bowl. Mash the beans with a potato masher and moisten with some of the cooking liquid. Stir in 2 tablespoons of the olive oil. The purée should be loose. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil and add the lettuce. Cook until just tender, about 2 minutes. Transfer to a bowl of cold water and drain. Squeeze out water and chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil in a large, heavy skillet over medium heat. Add the garlic, cook for 30 seconds, and stir in the lettuce. Cook for about 1 minute, stirring, until the lettuce is nicely coated. Season with salt and pepper. Serve with the mashed beans."}]}