{"@context": "http://schema.org", "@type": "Recipe", "name": "Splayed Roast Chicken With Caramelized Ramps", "description": "It may not seem possible to improve on roast chicken cooked in a very hot cast-iron skillet, an easy method that yields a moist, evenly cooked bird. (The thighs, which needs more cooking time, are pressed against the pan, which allows them to cook as quickly as the breast meat.) But here’s a recipe with a clever tweak on that method, one that’s easier than spatchcocking (or butterflying) the chicken, and that makes for a even faster-cooked, juicier bird. Preheat the skillet in a 500-degree oven for about 45 minutes, letting it get blisteringly hot. Meanwhile, take the chicken and snip the skin that connects the legs to the body, splaying the legs open until you feel the joints pop on both sides. Very carefully transfer the chicken to the pan, pressing the legs down into the surface. Ramps, garlic and capers tossed into the pan juices toward the end of the roasting time make for a bright, sweet and salty sauce. A cast-iron skillet is a must here, and if you don’t have one, it’s a worthwhile, and inexpensive, investment. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/05/03/dining/video-clarkchicken/video-clarkchicken-mediumThreeByTwo440-v2.jpg", "totalTime": "PT1H35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, ramps, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 400}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 800, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "2 grams", "proteinContent": "66 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1242 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1  4 1/2-pound whole chicken, patted dry", "2 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "1 bunch fresh ramps (6 ounces)", "1 lemon, quartered", "1 tablespoon extra virgin olive oil", "5 garlic cloves, smashed and peeled", "1 tablespoon capers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the chicken inside and out with salt and pepper. If you have time, do this 2 to 3 hours ahead and refrigerate the bird uncovered. Otherwise, let it rest uncovered at room temperature while oven heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large cast-iron or other heavy skillet in the oven and heat to 500 degrees for 45 minutes. If you salted the chicken in advance, take it out of the fridge so it can warm to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prep the ramps: trim the hairy bottoms and remove the outer layer of skin. Separate the leaves from the bulbs, rinse both gently, and pat dry. Cut any fat bulbs (wider than a pencil) in half lengthwise. Tear the leaves into large pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a cutting board. Using a sharp knife, cut the skin connecting the legs to the body.  Splay the thighs open until you feel the joint pop on each side. Place 2  lemon wedges inside the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer chicken, breast-side up, to the hot skillet. Press down on the legs so they rest flat on the bottom of the pan. Drizzle the bird with the oil. Roast for 30 minutes. Toss ramp bulbs (not leaves), garlic and capers into the skillet. Stir to coat them with pan juices. Roast for 5 minutes more, then stir again. Continue cooking until ramps are tender and chicken is no longer pink, 5 to 15 minutes more (for a total cooking time of 40 to 50 minutes). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from  oven and stir ramp leaves into the pan until just wilted. Let chicken rest for 5 minutes, then serve with the pan juices and ramps, garlic and capers, seasoning everything with juice from the remaining lemon wedges, if desired."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Splayed Roast Chicken With Ramps", "description": "Melissa Clark demonstrates a different way to roast a chicken.", "thumbnailUrl": "https://static01.nyt.com/images/2012/05/03/dining/video-clarkchicken/video-clarkchicken-mediumThreeByTwo440-v2.jpg", "uploadDate": "2012-05-04T19:35:25.000Z", "duration": "PT3M16S"}, "link": "https://cooking.nytimes.com/recipes/12428-splayed-roast-chicken-with-caramelized-ramps"}