{"@context": "http://schema.org", "@type": "Recipe", "name": "Twice-Cooked Duck With Pea Shoots", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/05/16/dining/16KITCH1_SPAN/16KITCH1_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, duck, pea shoots, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "recipeIngredient": ["4 Muscovy duck legs, about 1 pound each (or 4 pounds smaller Pekin legs)\n\n", "Salt ", "1 teaspoon Chinese 5-spice powder", "4 thick slices ginger", "1 large onion, halved", "4 tablespoons rice wine", "1 1/2 tablespoons soy sauce\n\n", "4 tablespoons brown sugar ", "1 teaspoon grated orange zest", "1 teaspoon spicy black bean paste (available at Chinese grocers)", "1 teaspoon sesame oil", "2-inch chunk ginger, peeled and cut in fine julienne", "6 garlic cloves, roughly chopped", "8 to 10 small dried red chile peppers", "1 teaspoon cumin seed", "1 cup reserved defatted duck broth", "2 teaspoons cornstarch dissolved in 1 tablespoon cold water", "2 tablespoons vegetable oil", "6 ounces pea shoots, leaves and tendrils (or use baby spinach or mizuna leaves)", "3 tablespoons slivered scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp knife, trim any excess fat from the duck legs, leaving the skin intact. Trim the skin a bit, too, if it seems quite thick. Reserve duck fat for another purpose. Season each leg generously with salt, then sprinkle with the 5-spice powder, rubbing the seasoning into the meat. Place the duck legs in a heavy-bottomed pan along with the ginger slices and onion. Cover with 4 cups water and bring to a boil. Reduce heat and simmer gently, covered, until the meat is fairly tender when probed with a paring knife, about 45 minutes (if using Pekin duck legs, cooking time will probably be less). Take the duck legs from the pot and let them cool. Remove the meat from the bones and chop into rough 1/2-inch pieces. Strain and cool the cooking broth and skim any fat from surface. This step may be done up to 2 days ahead  of finishing the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the rice wine, soy sauce, brown sugar, orange zest, black bean paste and sesame oil. Put the julienned ginger, chopped garlic, red chile peppers and cumin seed on a small plate. Measure 1 cup of defatted duck broth. Mix the cornstarch and water in a small container. Have all these ingredients in easy reach of the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok or large cast-iron skillet, heat the vegetable oil over high heat. Add the chopped duck meat and let it sizzle, stirring well, until crisp and lightly browned, about 2 minutes. Season lightly with salt. Lower the heat to medium high and add the ginger, garlic, red chile peppers and cumin seed. Stirring frequently, cook for one minute more, taking care not to burn the garlic. Add the rice wine mixture and duck broth and bring to a brisk simmer. Stir in the cornstarch mixture and cook until lightly thickened, 30 seconds or so. Turn off the heat and add the pea shoots, mixing them into the sauce until barely wilted. Transfer to a serving platter and sprinkle with scallions."}]}