{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa Pilaf With Sweet Peas and Green Garlic", "description": "Quinoa’s grassy flavor is beautifully complemented here by the sweet vegetables that are appearing in farmers’ markets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/15/health/nutrition/15recipehealth/15recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, green garlic, peas, quinoa, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 141, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "147 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2/3 cup quinoa", "3/4 cup shelled fresh peas (1 pound unshelled)", "Salt to taste", "2 tablespoons extra virgin olive oil", "1 leek, white and light green part only, halved, cleaned of sand and sliced thin", "1 bulb green garlic, tough stalk cut away and papery shells removed, sliced thin", "1 tablespoon chopped fresh mint", "1 tablespoon chopped chives", "2 tablespoons chopped fresh parsley, or a combination of parsley and tarragon", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of lightly salted water to a boil and add the peas. Turn the heat down to medium and simmer until tender, 4 to 10 minutes, depending on the size and freshness. Place a strainer over a bowl and drain the peas. Measure out 2 cups of the cooking water (add fresh water if necessary), return to the pot, add salt to taste, bring to a boil and add the quinoa. When the water comes back to a boil, cover, reduce the heat and simmer 15 minutes, or until the quinoa is tender and, in the case of white quinoa, displays a thread. Remove from the heat, drain through a strainer and return to the pot. Cover the pot with a clean dish towel and return the lid. Let sit 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium-low heat in a wide, heavy skillet and add the leek and sliced green garlic. Add a generous pinch of salt and cook, stirring, until tender, fragrant and translucent, 3 to 5 minutes. Add the quinoa and peas to the pan and toss together with the remaining olive oil for about 2 minutes, taking care not to mash the peas. Add the fresh herbs, grind in some pepper, taste and adjust seasoning, and serve."}], "link": "https://cooking.nytimes.com/recipes/12448-quinoa-pilaf-with-sweet-peas-and-green-garlic"}