{"@context": "http://schema.org", "@type": "Recipe", "name": "Soba With Green Garlic, Spinach, Edamame and Crispy Tofu", "description": "Green garlic and luscious spinach are both in abundance in the markets right now. If you can’t find soba (buckwheat noodles), you can serve the stir-fry with brown rice or other grains.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/18/health/nutrition/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "dairy-free, healthy, high fiber, low cholesterol, nut-free, vegan, vegetarian, main course, noodles, spinach, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 301, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "18 grams", "saturatedFatContent": "1 gram", "sodiumContent": "592 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound firm tofu, cut in dominoes", "2 bulbs green garlic, trimmed of stalk", "3/4 cup fresh or frozen edamame", "1 tablespoon rice bran oil, grapeseed oil or canola oil", "Soy sauce to taste", "1 tablespoon extra virgin olive oil", "Salt to taste", "6 fresh shiitake mushrooms, stems cut away, sliced", "2 generous bunches (about 1 1/4 to 1 1/2 pounds)  spinach stems trimmed, washed in 2 changes of water", "Freshly ground black pepper ", "2 tablespoons chopped cilantro", "1/2 pound soba"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blot the tofu dry on paper towels. If the garlic has formed cloves, separate them and remove the thick shells from the tender cloves. If it has not formed cloves, just remove the outside layers and mince. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, add salt to taste and add the edamame. Cook 4 minutes, then remove from the water with a slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat a wok or a wide skillet over medium-high heat until a drop of water evaporates upon contact. Swirl in the rice bran, grapeseed or canola oil and add the tofu. Stir-fry until golden brown, and remove from the pan. Season to taste with soy sauce and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to medium and add the olive oil and the shiitakes. Cook until they begin to soften, stirring occasionally, 1 to 2 minutes, and add the green garlic along with a generous pinch of salt. Cook, stirring, until it is fragrant, about 1 minute. Add the spinach and cook, stirring, until it wilts. Season to taste with salt and pepper, and stir in the tofu and edamame. Turn the heat to low and keep warm while you cook the noodles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water to a boil in the large pot, and add the noodles gradually, so that the water remains at a boil. Stir once with a long-handled spoon or pasta fork so that the noodles don’t stick together. Wait for the water to come back up to a rolling boil – it will bubble up, so don’t fill the pot all the way – and add 1 cup of cold water. Allow the water to come back to a rolling boil and add another cup of cold water. Allow the water to come to a boil one more time and add a third cup of water. When the water comes to a boil again, the noodles should be cooked through. Allow them to boil for a few minutes if they are not. Drain in a colander. Place in a large bowl, top with the vegetables and tofu, and serve."}], "link": "https://cooking.nytimes.com/recipes/12451-soba-with-green-garlic-spinach-edamame-and-crispy-tofu"}