{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Burgers With Green Garlic and Parsley", "description": "I’m even adding green garlic to my son’s turkey burgers. The grated onion and abundance of green garlic add moisture as well as flavor to these burgers. Make sure not to press on them when you cook them, as turkey burgers can be dry – they need all the juice they’ve got.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/17/health/nutrition/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weekday, burgers", "keywords": "green garlic, hamburger buns, turkey, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "recipeIngredient": ["1/2 medium onion", "1 bulb green garlic (about 4 ounces)", "1 tablespoon extra virgin olive oil", "1/4 cup finely chopped flat-leaf parsley", "1 1/4 pounds lean ground turkey  ", "2 tablespoons ketchup", "3/4 teaspoon salt", "Freshly ground pepper to taste", "4 hamburger buns, preferably whole-wheat (optional)", "1 tablespoon canola, grapeseed or rice bran oil", "Sliced tomato", "sliced onion", "Iceberg lettuce", "pickles", "sliced red pepper", "ketchup and mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate the onion on the medium holes of a grater. You should have about 2 tablespoons grated onion (and a lot of juice, which you can discard). Place in a bowl with the ground turkey, ketchup, salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim away the stalk from the garlic and remove the papery outer layers. Chop fine. Heat the olive oil over medium heat in a small skillet and add the garlic and a generous pinch of salt. Cook, stirring, until it is tender and fragrant, about 3 minutes. Stir in the parsley, remove from the heat and add to the turkey mixture. Using a fork, mix ingredients well. Shape into 4 patties without packing too hard. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the canola, grapeseed or rice bran oil on a nonstick griddle or in a large nonstick frying pan over medium-high heat. When you can feel the heat when you hold your hand above it, cook the patties for 5 to 7 minutes on each side. Serve with the condiments of your choice."}], "link": "https://cooking.nytimes.com/recipes/12450-turkey-burgers-with-green-garlic-and-parsley"}