{"@context": "http://schema.org", "@type": "Recipe", "name": "Jonathan Waxman’s Roast Chicken", "description": "This  unadorned but deeply flavorful roasted chicken is served with a vibrant salsa verde of capers, anchovies, garlic, parsley, arugula, basil, tarragon and sage. The chef Jonathan Waxman created the dish at Barbuto, an Italian restaurant in the West Village, where it became a diner favorite. (Daniel Boulud was a fan.) Serve it with a side of creamy mashed potatoes or a hunk of good bread to soak up the juices.", "author": {"@type": "Person", "name": "Glenn Collins"}, "image": "https://static01.nyt.com/images/2014/04/18/dining/Roast-ChickenWax/Roast-ChickenWax-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "anchovy, chicken, fresh herbs, dairy-free, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 438}, "recipeIngredient": ["Free-range organic chicken, 3 1/2 pounds", "Sea salt", "black pepper", "2 tablespoons extra-virgin olive oil", "1 lemon (preferably Meyer)", "1 tablespoon capers", "2 anchovy fillets", "3 cloves garlic (peeled, green germ removed)", "1 cup plus 2 tablespoons extra-virgin olive oil", "1/4 cup fresh parsley, chopped", "1/4 cup arugula, chopped", "1/4 cup basil leaves, chopped", "1/4 cup fresh cilantro, chopped", "1 tablespoon tarragon leaves", "1 tablespoon fresh chives", "1 tablespoon  fresh sage, chopped", "1 tablespoon fresh rosemary, chopped", "1/4 teaspoon sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Wash the chicken in hot water and dry with paper towels. Using kitchen shears, cut out the backbone of the chicken and remove any fat. Then, using a heavy chef's knife, cut out the breastbone. Season the two halves with sea salt and fresh black pepper. Dab an earthenware or metal baking dish with 1 tablespoon of olive oil and place the chicken halves inside it, skin side up. Sprinkle with the remaining tablespoon of olive oil. Cut the lemon in half and place the halves, cut side down, next to the chicken in the baking dish. Roast for 35 minutes, basting every 8 minutes. Rotate the pan during basting to allow for even cooking. The chicken is done when the juices from the thigh run clear (about 165 degrees)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the salsa verde. Rinse capers in cold water, then drain. Soak anchovies in cold water for 5 minutes, then pat dry and remove the bones. Using a mortar and pestle (or a small mixer if you are in a hurry), smash the capers, anchovies and garlic with 2 tablespoons of the olive oil until smooth. Transfer to a large bowl. Add all the herbs and remaining olive oil. (The mixture should be chunky, not oily.) Season with sea salt. Serve the chicken topped with the salsa verde, and garnish with the roasted lemon."}], "link": "https://cooking.nytimes.com/recipes/12467-jonathan-waxmans-roast-chicken"}