{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Collard Greens", "description": "Collard greens are great leaves to stuff. They remind me a bit of grape leaves, though they don’t need to be brined before you stuff them. Just remove the stems, blanch them, fill and cook like cabbage leaves. I used medium-grain Cal-Rose rice that I bought at my local Iranian market for these; this type of rice is perfect for stuffing grape leaves and vegetables, the package told me, because it doesn’t swell when cooking and won’t break the leaf. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/23/science/24recipehealth/24recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "appetizer, collard greens, fresh herbs, rice, healthy, vegan, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "518 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 large bunch collard greens (about 1 1/2 pounds), stemmed", "1/4 cup olive oil", "1 large red or white onion, finely chopped", "Salt to taste", "1 1/4 cups medium-grain rice, rinsed and drained", "3 tablespoons pine nuts", "2 to 3 garlic cloves (to taste), minced", "1/3 cup chopped fresh dill", "1/3 cup finely chopped mint", "1/2 cup finely chopped flat-leaf parsley", "Freshly ground pepper to taste", "1/3 to 1/2 cup strained freshly squeezed lemon juice", "2 tablespoons tomato paste", "1 lemon, sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you carefully stem the collard greens, trying to keep the leaves intact. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the collard leaves, in batches. Blanch for 2 minutes and transfer to the ice water. Drain, gently squeeze out excess water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil over medium-low heat in a large nonstick skillet and add the onions and a pinch of salt. Cook, stirring, until the onion is tender but not browned, 5 to 8 minutes. Add the pine nuts and garlic, stir together and add the drained rinsed rice. Stir for a minute or two, until you hear the rice begin to crackle, then remove from the heat. Toss with the herbs, salt and pepper, and 1 tablespoon olive oil. To gauge how much salt you will need, use the amount that you would use when cooking 1 1/4 cups of rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a wide, deep lidded sauté pan or saucepan with olive oil. To fill the leaves, place one on your work surface, vein side up and with the stem end facing you. The leaf may have a big space in the middle where you stemmed it; if it does, pull the two sides of the leaf in toward each other and overlap them slightly.  Place about 1 level tablespoon of filling on the bottom center of each leaf. Fold the sides over, then roll up tightly, tucking in the sides as you go. Place in the pan, seam side down, fitting the stuffed leaves in snug layers. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the lemon juice, remaining oil, and tomato paste with 2 tablespoons water. Season to taste with salt. Pour over the rolls. Add enough water to barely cover the rolls and top with a layer of lemon slices if desired. They will add some bitterness to the dish because of the bitter oils in the lemon skin. Invert a plate over the  rolls to keep them wrapped and in position, and bring to a simmer over medium heat. Cover the pan, turn the heat to low and simmer for 1 hour, at which point the leaves will be tender and the rice cooked. Remove from the heat and carefully remove the stuffed leaves from the water to a platter or to plates with a slotted spoon or tongs. Allow to cool for at least 15 minutes. Taste the liquid left in the pot and adjust seasonings. Serve the rolls warm or at room temperature with the liquid from the pot as a sauce."}]}