{"@context": "http://schema.org", "@type": "Recipe", "name": "Lasagna With Collard Greens", "description": "Collard greens are so big and flat that they fill in for a layer of noodles in this easy, satisfying lasagna. When you make lasagna, be careful not to use up your ingredients on the first layers. You should have enough for three layers here.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/23/science/23recipehealth/23recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles", "keywords": "collard greens, marinara sauce, no-boil lasagna noodles, healthy, high fiber, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 223}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 331, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "18 grams", "saturatedFatContent": "7 grams", "sodiumContent": "500 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound collard greens, preferably large leaves, stemmed and washed, leaves left intact", "Salt to taste", "Extra virgin olive oil for the pan", "2 cups marinara sauce, preferably homemade from fresh \nor canned tomatoes", "1/2 pound no-boil lasagna noodles", "1/2 pound ricotta", "4 ounces freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the collard greens for 5 minutes above an inch of boiling water, or blanch in boiling salted water for 2 minutes. Transfer to a bowl of cold water, drain and pat dry with paper towels. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a 2- or 3-quart rectangular baking dish with olive oil. Spread a small amount of tomato sauce over the bottom and top with a layer of lasagna noodles. Top the noodles with a thin layer of ricotta. Lay collard green leaves over the ricotta in a single layer. Top the leaves with a layer of tomato sauce, followed by a thin layer of Parmesan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside enough tomato sauce and Parmesan to top the lasagna and repeat the layers until all of the ingredients are used up. Spread the tomato sauce you set aside over the top, and sprinkle on the Parmesan. Make sure the noodles are covered, and cover the baking dish tightly with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 30 minutes. Remove from the oven and uncover. Check to be sure that the noodles are soft and the mixture is bubbly. Return to the oven for another 5 to 10 minutes if desired, to brown the top. Allow to sit for 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/12463-lasagna-with-collard-greens"}