{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhubarb Ice Cream With a Caramel Swirl", "description": "This ice cream is chock-full of sweet bits, but with enough satiny frozen custard to savor between the chunks. To keep the rhubarb from freezing into tooth-breaking fruity ice cubes, stew it with plenty of sugar, which keeps the fruit soft. The technique works with any summer fruit, though it’s especially nice with rhubarb, or gooseberries for that matter, both of which need a lot of sugar to tame their squint-inducing acid content. But you can substitute strawberries, apricots, cherries, peaches or plums as the summer fruit season progresses, adjusting the sugar depending upon the sweetness of the fruit.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/05/15/dining/rhubarb-icecream/rhubarb-icecream-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "One scant quart", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, milk, rhubarb, sugar, nut-free, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 88}, "recipeIngredient": ["1 and 1/2 cups whole milk", "1 and 3/4 cup plus 6 tablespoons granulated sugar", "Pinch fine sea salt", "1 vanilla bean, split and scraped", "4 large egg yolks, lightly beaten", "1 and 1/2 cups sour cream", "3/4 pound rhubarb, cut into 1/2-inch dice", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy-bottomed pot over medium heat, whisk together the milk, 3/4 cup sugar, the salt, the vanilla bean seeds and its pod. Simmer gently until sugar dissolves, about 5 minutes. Remove from heat, cover, and steep 30 minutes. Discard the vanilla pod and return mixture to a bare simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the yolks in a large bowl. Slowly whisk in hot milk mixture. Scrape the custard back into the pot and cook over medium-low heat, stirring constantly, until mixture is thick enough to coat the back of a spoon, about 5 minutes. Strain through a fine-mesh sieve into a bowl. Whisk in sour cream. Chill at least 3 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine the rhubarb with 1 cup sugar. Simmer until rhubarb is just tender and has begun releasing its juices, but has not started to fall apart, 4 to 5 minutes. Using a slotted spoon, transfer rhubarb to a bowl. Continue to simmer the juices until syrupy, 5 to 10 minutes more. Pour the syrup over the rhubarb. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean, dry and preferably nonstick skillet, sprinkle 2 tablespoons sugar over medium heat. When it begins to melt and lightly color, sprinkle in 2 more tablespoons and start swirling pan to help evenly distribute sugar. Add the final 2 tablespoons and cook, swirling pan until all the sugar has melted. Let cook, swirling occasionally, until the sugar syrup caramelizes and turns dark brown. Pour in the heavy cream and 2 tablespoons water (stand back; it may splatter). Simmer, stirring with a heatproof rubber spatula until smooth. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the custard base into an ice cream machine and churn. Add rhubarb compote for the last minute of churning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape a quarter of the caramel into the bottom of a freezer-proof quart container. Top with a quarter of the ice cream. Repeat layering until all of the caramel and ice cream has been used, ending with the ice cream. Freeze until firm for at least 2 hours and up to 1 week."}], "link": "https://cooking.nytimes.com/recipes/12469-rhubarb-ice-cream-with-a-caramel-swirl"}