{"@context": "http://schema.org", "@type": "Recipe", "name": "Too Hot to Hoot Punch", "description": "This splendidly summery concoction is proof that punch, often associated with fall and winter holidays, can be made seasonal with the delicate spring sweetness of strawberries, and summery with the tropical tang of limes. Sure, you could settle for a vodka base, but bourbon adds a marvelous backbone of vanilla richness. Or make it without alcohol and serve at a children’s party.", "author": {"@type": "Person", "name": "Eric Asimov"}, "image": "https://static01.nyt.com/images/2012/05/23/dining/23POUR1_SPAN-copy/23POUR1_SPAN-copy-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "12 servings", "recipeCuisine": "southern", "recipeCategory": "cocktails", "keywords": "bourbon, lime, tea, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["9 or so strawberries, plus 3 for garnish", "1 cup sugar", "5 elderberry tea bags, or 5 heaping teaspoons of loose elderberry tea (if you can't find elderberry, use any herbal berry tea)", "9 or so limes", "12 ounces bourbon", "1 tablespoon Angostura bitters", "Large chunk of ice, or ice mold"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Several hours ahead, prepare strawberry syrup and the elderberry tea. For the syrup, cut the green tops off the strawberries and discard. Dice the berries until you have 1 cup. Reserve extras for garnish. In a saucepan, add the berries along with 1 cup water and the sugar. Bring to a simmer, stirring, and continue simmering until the sugar dissolves. Allow syrup to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tea. Pour 12 ounces of hot water over the tea bags or the loose tea. Allow to steep until cool. Discard bags or strain loose tea."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Juice enough limes to produce 9 ounces of juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a punch bowl stir together the lime juice, bourbon, bitters, 6 ounces cold water, the strawberry syrup and the tea. (If you have extra tea, juice and syrup, combine without bourbon for a pleasant soft drink for children.) Gently slide the ice, or an ice mold, into the bowl. Garnish with sliced strawberries. Serve in ceramic punch cups or glasses."}], "link": "https://cooking.nytimes.com/recipes/12468-too-hot-to-hoot-punch"}