{"@context": "http://schema.org", "@type": "Recipe", "name": "Lasagna With Roasted Beets and Herb Béchamel", "description": "I also call this “pink lasagna,” as the beets will bleed into the béchamel and onto the pasta when it bakes. Roast the beets ahead so that they will be cool enough to handle easily when you’re ready to assemble the lasagna.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/30/science/01recipehealth/01recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles", "keywords": "bechamel, beet, no-boil lasagna noodles, healthy, low cholesterol, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 289, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "486 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["6 medium-size red beets", "3 tablespoons extra virgin olive oil", "3 tablespoons minced shallot or onion", "3 tablespoons sifted all-purpose flour", "3 cups low-fat (1 percent) milk", "Salt and freshly ground pepper", "Pinch of freshly grated nutmeg", "1/4 cup finely chopped fresh herbs, like parsley, tarragon and chives", "1/2 pound no-boil lasagna noodles", "4 ounces (1 cup) freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Cut the greens away from the beets, leaving about 1/4 inch of stems. Scrub the beets and place in a baking dish or lidded ovenproof casserole. Add 1/4 inch water to the dish. Cover tightly. Place in the oven and roast 40 to 45 minutes, until the beets are easily penetrated with the tip of a knife. Remove from the oven and allow to cool in the dish. Cut away the ends and slip off the skins. Slice crosswise into 1/4-inch-thick rounds and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the béchamel. Heat the oil over medium heat in a heavy medium saucepan. Add the shallot or onion and cook, stirring, until softened, about 3 minutes. Stir in the flour and cook, stirring, for about 3 minutes, until the mixture is smooth and bubbling, but not browned. It should have the texture of wet sand. Whisk in the milk all at once and bring to a simmer, whisking all the while, until the mixture begins to thicken. Turn the heat to very low and simmer, stirring often with a whisk and scraping the bottom and edges of the pan with a rubber spatula, for 10 to 15 minutes, until the sauce is thick and has lost its raw flour taste. Season with salt, pepper and nutmeg. Strain while hot into a large measuring cup or a medium bowl and stir in the chopped herbs and 1/4 cup of the Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a rectangular baking dish. Spread a spoonful of béchamel over the bottom. Top with a layer of lasagna noodles. Spoon a thin layer of the béchamel over the noodles. Top with a layer of beets and sprinkle with Parmesan. Repeat the layers, ending with a layer of lasagna noodles topped with béchamel and Parmesan. Make sure the noodles are well coated with béchamel so they will be sure to soften during baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the baking dish tightly with foil and place in the oven. Bake 40 minutes, until the noodles are tender and the mixture is bubbling. Uncover and, if you wish, bake another 5 to 10 minutes, until the top begins to brown. Remove from the heat and allow to sit for 5 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/12478-lasagna-with-roasted-beets-and-herb-bechamel"}