{"@context": "http://schema.org", "@type": "Recipe", "name": "Lasagna With Roasted Broccoli", "description": "The broccoli part of this recipe is adapted from Molly Stevens’ Blasted Broccoli in her wonderful book “All About Roasting.”", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/30/science/29recipehealth/29recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles", "keywords": "broccoli, marinara sauce, no-boil lasagna noodles, healthy, high fiber, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 375, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "6 grams", "proteinContent": "20 grams", "saturatedFatContent": "7 grams", "sodiumContent": "754 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds broccoli, crowns only", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper", "8 ounces ricotta cheese", "1 egg ", "2 tablespoons water", "Pinch of cinnamon", "2 anchovy fillets, rinsed (optional)", "3 cups marinara sauce, preferably homemade from fresh or canned tomatoes", "7 to 8 ounces no-boil lasagna", "4 ounces (1 cup) freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Line a baking sheet with parchment paper. Slice the broccoli crowns 1/3 inch thick, letting the florets on the edges fall off. Peel any large pieces of stem by gently pulling away the thick skin, then toss the slices and the unattached florets with the olive oil, salt and pepper. Place on the baking sheet in an even layer. Roast, stirring and flipping the large slices over (tongs are a good tool for this) after 8 minutes, until the broccoli is tender when pierced with a knife and the tops are nicely browned, about 15 minutes total. Remove from the oven and set aside. Turn the oven down to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the ricotta cheese with the egg, water, cinnamon, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the anchovies and stir into the tomato sauce. Oil a rectangular baking dish and spread a spoonful of tomato sauce over the bottom. Top with a layer of lasagna noodles. Spoon a thin layer of the ricotta mixture over the noodles. Top with a layer of broccoli, then a layer of tomato sauce and a layer of Parmesan. Repeat the layers until the ingredients are used up, ending with a layer of lasagna noodles topped with tomato sauce and Parmesan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the baking dish tightly with foil and place in the oven. Bake 40 minutes, until the noodles are tender and the mixture is bubbling. Uncover and, if you wish, bake another 10 minutes, until the top begins to brown. Remove from the heat and allow to sit for 5 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/12475-lasagna-with-roasted-broccoli"}