{"@context": "http://schema.org", "@type": "Recipe", "name": "Cha Ca La Wong", "description": "Up a flight of rickety stairs in Hanoi is a 100-year-old restaurant that is often a must-not-miss in guidebooks. It serves one iconic, delicious dish, called cha ca la Vong, which also happens to be the name of the restaurant. In the bright, noisy dining room, packed with communal tables set with little charcoal burners, a skillet of fish and other components arrives, and you submit to a brusque ceremony of tabletop cooking and do-it-yourself assembly. This version, from the chef Simpson Wong, omits shrimp paste and utilizes fresh turmeric.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/05/30/dining/30CHACA_SPAN/30CHACA_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "vietnamese", "recipeCategory": "dinner", "keywords": "fish sauce, hake, rice noodles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 160}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 551, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "5 grams", "proteinContent": "39 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1647 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 two-inch pieces fresh turmeric, peeled and chopped (see note)", "1 teaspoon ground turmeric", "1 inch fresh peeled ginger, chopped", "2 inches fresh peeled galangal, chopped (or substitute ginger)", "1 and 1/2 pounds skinless hake fillets, cut in 2-inch squares", "1/4 cup Vietnamese fish sauce (nuoc mam)", "3 tablespoons minced garlic", "2 teaspoons chile flakes", "1/3 cup lime juice", "2 tablespoons sugar", "4 ounces dried Vietnamese or Thai rice noodles (also called rice stick)", "1 head Bibb lettuce, rinsed, trimmed, core removed, sliced thinly", "1/4 cup canola oil", "1 teaspoon salt", "1 medium-large onion, sliced thin vertically", "1 and 1/2 bunches scallions, trimmed and chopped", "1 bunch dill, stems discarded, fronds coarsely chopped", "1/2 cup each cilantro leaves, mint leaves and Thai basil", "1/4 cup chopped roasted salted peanuts", "1/4 cup crisp fried shallots (sold in jars in Southeast Asian stores), or canned fried onions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the fresh turmeric, ground turmeric, ginger and galangal in a food processor or mini-chopper. Process until very fine, almost a paste. Transfer to a stainless-steel dish. Wash food processor immediately to prevent staining. Place the fish in a bowl. Rub mixture all over fish, remembering to wear gloves or plastic bags on your hands to avoid turmeric stains. Set aside at room temperature for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine fish sauce, 2 tablespoons of the garlic, half the chile flakes, the lime juice, sugar and 1/2 cup cold water in a small bowl. Stir well. Refrigerate. Place noodles in another bowl, cover with warm water and set aside 10 minutes until softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 3 quarts of water to a boil, drain noodles and add to boiling water. Cook 1 minute, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread lettuce on a serving platter. Spread noodles over lettuce. Cover lightly with a sheet of foil or plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oil in a large nonstick or well-seasoned cast-iron skillet and heat to a high temperature. Add fish pieces. When seared on one side, 1 minute or so, turn to sear other side, sprinkle with salt and remaining chile flakes and cook through, another minute or two. Remove to another platter. Add onions to pan and reduce heat to medium. When onions start to brown, add remaining garlic, stir, and add scallions. Stir again. Tuck fish pieces back into the pan and add the dill. Cook about 1 minute, just enough to warm fish. Remove pan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread contents of the pan, including all the oil, on noodles. Scatter herbs on top, then toss on peanuts and fried shallots. Serve with sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/12473-cha-ca-la-wong"}