{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Gnocchi With Peas and Fresh Sage Butter", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/06/06/dining/06KITCH_SPAN/06KITCH_SPAN-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "flour, peas, potato, main course, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 410, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "7 grams", "proteinContent": "11 grams", "saturatedFatContent": "13 grams", "sodiumContent": "438 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 pounds floury potatoes, preferably Yukon Gold or small Russets", "1 cup regular all-purpose flour (or Italian 00-type flour, or fine semolina flour), plus more for dusting", "1/2 cup chopped parsley, plus 2 tablespoons for garnish", "1 ounce grated pecorino Romano", "1/4 teaspoon freshly grated nutmeg", "1/8 teaspoon freshly ground black pepper", "1/2 teaspoon kosher salt", "2 cups small English peas (from about 2 pounds in the pod)", "6 tablespoons unsalted butter", "2 or 3 garlic cloves, thinly sliced", "16 to 24 fresh sage leaves", "Salt and pepper, to taste", "3 or 4 scallions thinly sliced, for garnish", "Parmesan cheese, for grating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the potatoes in their skins until tender when probed with a paring knife, about 40 minutes. (Potatoes may also be boiled in their skins, then removed from the pot and slashed to release steam.) Peel the potatoes while still warm, discard the peels and weigh the flesh;  you want exactly 1 pound. Force the potatoes through a ricer, food mill or medium-meshed sieve into a mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3/4 cup flour, 1/2 cup parsley, pecorino, nutmeg, pepper and salt. Mix with fingers to form a mass, then knead very briefly to make a smooth ball, just one minute or so. Be careful not to overwork the dough or the gnocchi will be tough. Make a couple of preliminary half-inch ovals and boil in well-salted water to check the texture. Let them bob to the surface and cook for about 1 minute. If they hold their shape, proceed to the next step, otherwise add a little more flour to the dough. It may require a full cup of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 4 pieces. On a clean counter or cutting board, roll the dough pieces into footlong logs, approximately 1 inch thick, dusting with additional flour as necessary. Cut each log into 18 to 20 gnocchi. If desired, roll each of the gnocchi over the tines of a fork to make the traditional ridged oval shape (otherwise, random small pillow shapes are fine)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a baking sheet liberally with flour and line up the gnocchi in one layer, making sure they don't touch. Now sprinkle flour lightly over the top of the gnocchi and leave at room temperature, uncovered, until ready to cook. Fill a large, wide pasta pot with water. Add salt liberally and bring to a rapid boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 cups of water in a small saucepan for cooking the peas and bring to a brisk simmer. Cook the peas briefly until just done, then drain. Melt the butter in a wide deep skillet over medium heat. Add the garlic and sage leaves and let them sizzle without browning, then turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the gnocchi one by one to the boiling water. Carefully stir as the gnocchi begin to bob to the surface. You may do this in batches if your burner is not strong enough to maintain a rapid simmer. Cook for 60 to 90 seconds, until tender (semolina gnocchi will take about 2 minutes), then transfer cooked gnocchi to the butter sauce using a wide skimmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked peas and a little salt and pepper and gently toss everything together with a large spoon. Pour into a warm low-sided ovenproof serving vessel. If desired, sprinkle with 2 tablespoons Parmesan and run under the broiler till lightly browned. Garnish with the chopped parsley and scallions. Serve with plenty of grated Parmesan, and spoon some of the sage butter over each portion. Pass the pepper mill."}], "link": "https://cooking.nytimes.com/recipes/12492-green-gnocchi-with-peas-and-fresh-sage-butter"}