{"@context": "http://schema.org", "@type": "Recipe", "name": "Rainbow Quinoa Salad With Fava Beans and Herbs", "description": "Each of the three varieties of quinoa in rainbow quinoa -- red, black and blond – has a different texture, which is one of the things I like about the blend. The black grains are the hardest and never splay, and the red grains are harder than the white grains. The mixture takes about 5 minutes longer to cook than blond quinoa alone. I like to toast the grains in a hot pan first, for a richer flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/06/12/health/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fava beans, parsley, quinoa, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 324, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "14 grams", "proteinContent": "16 grams", "saturatedFatContent": "1 gram", "sodiumContent": "663 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1 cup rainbow quinoa", "2 cups water", "Salt to taste", "2 pounds fava beans", "1/2 cup finely chopped flat-leaf parsley", "2 tablespoons finely chopped fresh dill", "2 tablespoons chopped chives", "3 tablespoons fresh lemon juice", "1 tablespoon sherry vinegar or Champagne vinegar", "1 small garlic clove, puréed", "1 teaspoon Dijon mustard (optional)", "Freshly ground pepper", "2 tablespoons extra virgin olive oil", "2 tablespoons grapeseed oil", "Small leaves romaine lettuce, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the quinoa in a strainer and rinse several times with cold water. Heat a heavy medium-size saucepan over medium-high heat and add the quinoa. Stir until the water on the grains has evaporated and the quinoa begins to crackle and smell toasty. Add the water and salt to taste. Bring to a boil, cover and reduce the heat to low. Simmer 20 minutes, until the blond quinoa grains display little white spirals and the water has been absorbed. Place a dish towel over the top of the pot and return the lid. Let sit for 15 minutes. Fluff the quinoa with a fork or with spoons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, shell and skin the fava beans. Bring a medium pot of salted water to a boil. Fill a bowl with ice water. Drop the shelled fava beans into the boiling water and boil 5 minutes. Drain and transfer immediately to the cold water. Allow the beans to cool for several minutes, then slip off their skins by pinching off the eye of the skin and squeezing gently. Hold several beans in one hand and use your other thumb and forefinger to pinch off the eyes; have a bowl for the shelled favas close at hand, and this will not take a very long time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the quinoa to a large bowl. Add the favas and the herbs. In a small bowl, whisk together the lemon juice, vinegar, salt to taste, garlic, optional mustard, pepper and the oils. Toss with the quinoa and fava bean mixture. Taste and adjust seasoning. Serve on a large platter or in a wide salad bowl, garnished with the lettuce if desired."}]}