{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa and Asparagus Salad", "description": "I had been cooking quinoa sort of like pasta, in 3 parts water, then draining it and letting it dry in a towel-covered pan. This is a good way to obtain very fluffy grains, but  sometimes my quinoa is soggy when I cook it this way, even after it rests under the towel. So, I decided to change the grain-to-water ratio and followed the directions on my Alter Eco quinoa packages (Alter Eco imports red, rainbow and pearl quinoas). I cooked the pearl and the red quinoas in 1 1/2 parts water and the rainbow in 2 parts water. The black quinoa in the rainbow mix takes a little longer to soften and requires a little more liquid. The grains were tighter and less moist than quinoa cooked in abundant water, and the yield was not as great because the grains don’t swell as much. But I liked the results, especially for salads like this one. For this salad, I cook 1 cup of quinoa in 1 1/2 cups water to get a slightly tighter, drier grain. The dressing is a lemony buttermilk dressing.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/06/11/health/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "asparagus, buttermilk, quinoa, gluten-free, healthy, high fiber, low cholesterol, low-sodium, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 137}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 186, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "480 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 cup quinoa", "1 1/2 cups water", "Salt to taste", "1 pound asparagus, ends trimmed", "6 radishes, sliced", "2 tablespoons toasted pine nuts", "3 tablespoons finely chopped chives", "2 teaspoons finely chopped tarragon", "1 ounce feta cheese, crumbled (about 1/4 cup)", "2 tablespoons freshly squeezed lemon juice", "1 small garlic clove, puréed", "Salt to taste", "1 tablespoon extra virgin olive oil", "5 tablespoons buttermilk", "Freshly ground pepper", "Lemon-scented olive oil for drizzling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the quinoa in a strainer and rinse several times with cold water. Place in a medium saucepan with 1 1/2 cups water and salt to taste. Bring to a boil, cover and simmer 15 minutes, until the grains display a threadlike spiral and the water is absorbed. Remove from the heat, remove the lid and place a dish towel over the pan, then return the lid to the pan and let sit for 10 minutes or longer undisturbed. Transfer to a salad bowl and fluff with forks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the asparagus for 3 to 4 minutes, until just tender. Rinse with cold water, pat dry and cut on the diagonal into 1-inch pieces. Add to the quinoa, along with the radishes, pine nuts, chives and tarragon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the lemon juice, garlic, salt, olive oil, buttermilk and pepper. Shortly before serving, toss with the quinoa and asparagus mixture. Sprinkle the feta over the top and serve. If desired, drizzle a teaspoon of the lemon-scented olive oil over each serving."}]}