{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Lamb Kebabs With Smoky Peaches", "description": "Taking a cue from the hot-weather regions of the world, John Willoughby and Chris Schlesinger go heavy with the seasoning here, but the key is when that happens. Instead of a marinade, or a spice rub, they grill the lamb and season it after with garlic, basil, vinegar and Tabasco sauce. It’s a great way to add big flavor without spending all day in the kitchen.", "author": {"@type": "Person", "name": "John Willoughby And Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2014/06/09/dining/lambkebabs/lambkebabs-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "lamb, peach, yogurt, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 173}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 692, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "3 grams", "proteinContent": "46 grams", "saturatedFatContent": "17 grams", "sodiumContent": "968 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1 cup yogurt", "1/2 cup minced fresh mint", "2 pounds boneless lamb leg", "1/4 cup extra-virgin olive oil", "1 tablespoon curry powder", "Salt and freshly cracked pepper", "2 peaches, pitted and halved (not peeled)", "1 tablespoon roughly chopped garlic", "1/4 cup roughly chopped fresh basil", "1/4 cup balsamic vinegar", "4 to 8 shots Tabasco, depending on your desire for heat"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in your grill; when the coals are all covered with gray ash and the temperature is medium-hot (you can hold your hand 5 inches above the grill for 3 to 4 seconds), you are ready to cook. (For a gas grill, turn all burners to high, lower cover, and heat for 15 minutes, then turn burners to medium-high.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the yogurt and mint together in a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the lamb of most but not all fat and cut it into 32 large chunks, about 1 inch square. Add them to a large bowl with the olive oil, curry powder, salt and pepper, and toss well to coat, then thread onto 4 skewers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the skewers on the grill directly over the coals. Also put the peaches on the grill, cut side down, and cook until just slightly charred and softened, about 6 minutes. Take off the grill and cut into large wedges (about 6 per peach)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the same time, cook the lamb, turning to expose all 4 sides to the direct heat of the coals, until done to your liking, about 2 to 3 minutes per side (8 to 12 minutes total) for medium rare. (To check for doneness, cut into one of the chunks and check to see if it is cooked to your liking — remove from the heat when it is slightly less done than you want it to be when you eat it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the peaches and lamb into a large bowl. Add the garlic, basil, vinegar and Tabasco, toss to coat, season with more salt and pepper if needed, and serve (over rice if you wish), accompanied by the yogurt and mint."}]}