{"@context": "http://schema.org", "@type": "Recipe", "name": "Three-Bean Soup", "description": "Inspired by some beautiful heirloom cannellini beans I had in my pantry, I decided to combine them with the favas that are just about to disappear from markets and the green beans that will be around into the fall. I cook the favas and green beans separately and stir them into the soup a few minutes before serving so they’ll retain their bright green color.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/06/19/science/20recipehealth/20recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fava beans, green beans, white beans, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 81}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 409, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "21 grams", "proteinContent": "24 grams", "saturatedFatContent": "1 gram", "sodiumContent": "766 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound (1 heaped cup) white beans, like navy beans or cannellini, washed, picked over and soaked overnight or for 6 hours", "1 bay leaf", "Salt and freshly ground pepper", "2 tablespoons olive oil", "1 medium onion, cut in half, half finely chopped", "6 garlic cloves, 2 peeled, 4 minced", "1 large carrot, diced", "1 celery stalk, diced", "1 red bell pepper, diced", "A bouquet garni made with a few sprigs each parsley and mint, and, if desired, a Parmesan rind", "1/2 pound green beans, ends trimmed", "1 pound fava beans, <a href=\"http://www.nytimes.com/2011/06/13/health/nutrition/13recipehealth.html?_r=3&ref=favabeans\">shelled and skinned</a>", "2 tablespoons chopped flat-leaf parsley", "2 tablespoons chopped fresh mint", "Freshly grated Parmesan for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the white beans and combine with 7 cups water, the intact half of the onion, the 2 peeled garlic cloves and the bay leaf in a large saucepan. Bring to a boil, skim off any foam that rises and reduce the heat. Cover and simmer 1 hour, until the beans are just tender. Add salt to taste and freshly ground pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy soup pot or Dutch oven, heat the olive oil over medium heat and add the chopped onion, carrot and celery. Cook, stirring, until vegetables are tender, about 5 minutes, and add the garlic and the red bell pepper. Cook, stirring, until the garlic is fragrant, about 1 minute. Add the beans with their liquid and the bouquet garni, and bring back to a boil. Reduce the heat, cover and simmer 1 hour, until the beans and vegetables are tender and the broth is aromatic. Taste and adjust salt. Add freshly ground pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, rinse out the saucepan you started the beans in, fill halfway with water and bring to a boil. Fill a bowl with ice water. When the water in the saucepan comes to a boil, add salt to taste and drop in the green beans. Boil 4 minutes, and then transfer the beans to the ice water without draining the pot, using a slotted spoon or strainer. Drain the beans and cut in 1-inch pieces. Bring the water in the saucepan back to a boil and shell and skin the favas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving the soup, stir in the chopped parsley and mint, add the green beans and skinned favas and simmer for a few minutes. Serve, topped with Parmesan cheese if desired."}]}