{"@context": "http://schema.org", "@type": "Recipe", "name": "Swiss Chard and Rice Soup", "description": "In the late spring and early summer we are surrounded by great big bunches of chard with wide stems and lush leaves, tender leeks, the last of the fava beans, first of the green beans and the first of the summer squash, still small and delicate. In not a lot of time, you can do what the French do: make soup. Rice will bulk up the soup. Though a starchy medium-grain rice like Arborio works, this recipe uses white basmati, which swells to four times its original size when cooked. You could try using brown basmati rice, but the color of the soup will be duller. If you’re looking for an easy way to reduce your calorie intake, these soups will help. They’re filling and light, and make great low-calorie meals. This is a simple and comforting soup that is especially delicious in the spring, when Swiss chard is at its sweetest and most tender.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/06/19/science/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, side dish, dairy-free, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegan, vegetarian, rice, swiss chard, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 138}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 236, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1219 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds Swiss chard (2 generous bunches)", "1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "2 stalks celery, finely diced", "Salt to taste", "4 garlic cloves, minced", "2 quarts chicken stock, vegetable stock or water", "A bouquet garni made with a bay leaf and a couple of sprigs each parsley and thyme", "1/2 cup basmati rice", "Freshly ground pepper", "Freshly squeezed lemon juice (optional)", "Freshly grated Parmesan for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the bottoms of the chard stems. If the stems are thin and fibrous, separate the leaves and discard the stems. If they are wide, separate the leaves and cut the stems into 1/4-inch dice. Set aside with the celery and onion. Wash the leaves in 2 changes of water and chop medium-fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy soup pot and add the onion, celery and chard stalks. Cook, stirring often, until the vegetables begin to soften, about 3 minutes, and add a generous pinch of salt. Continue to cook, stirring often, until the vegetables are tender, another 3 minutes. Add the garlic and stir until fragrant, about 1 minute. Add the stock or water, bouquet garni and rice. Bring to a boil, add salt to taste, reduce the heat, cover and simmer 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the chard into the soup, cover and simmer another 10 minutes. Add freshly ground pepper, taste and adjust the salt. Serve with fresh lemon wedges for people to squeeze into their servings if desired and Parmesan for sprinkling."}], "link": "https://cooking.nytimes.com/recipes/12546-swiss-chard-and-rice-soup"}