{"@context": "http://schema.org", "@type": "Recipe", "name": "Coq au Vin", "description": "This dish can be prepared ahead and frozen for two weeks or refrigerated for two days.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "chicken, dry red wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 129}, "recipeIngredient": ["5 pounds skinless chicken breasts and thighs", "1 to 2 cups unbleached flour", "Salt and freshly ground black pepper to taste", "1/4 cup olive oil", "1/4 cup Cognac or brandy, plus 3 to 4 tablespoons", "2 tablespoons chopped fresh thyme or 1 teaspoon dried thyme", "1 bay leaf", "3 tablespoons minced parsley, plus additional for garnish", "2 tablespoons tomato paste", "1 pound small white mushrooms, cleaned, and stems removed", "24 pearl onions, peeled", "1 bottle (750 milliliters) good quality dry red wine", "1 or 2 tablespoons Madeira or Marsala"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and dry the chicken pieces thoroughly. Season 1 cup of flour with salt and pepper, and flour the chicken lightly, using additional seasoned flour, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy-bottomed pot over high heat. Add 2 tablespoons of olive oil, and continue to heat until the oil is very hot but before it begins to smoke. Quickly brown the chicken on all sides, cooking thighs and then breasts in batches to avoid overcrowding and to assure even cooking. Add the remaining oil as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the browned chicken to the pot. Add 1/4 cup Cognac, heat briefly and then flame. When the flame dies out, stir in the thyme, bay leaf, parsley, tomato paste, mushrooms, onions and wine. Cover the pot, and bring to a boil; reduce heat to a simmer. Cook about 15 or 20 minutes, or until just tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate or freeze. (This is one of those dishes that taste better reheated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, defrost, if the chicken has been frozen. Reheat slowly. Just before serving, add the remaining Cognac, the Madeira, the remaining parsley for garnish, and salt and pepper. Remove the bay leaf before serving."}], "link": "https://cooking.nytimes.com/recipes/1255-coq-au-vin"}