{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Leek Soup", "description": "I usually pair leeks with potatoes to make a creamy puree, but this time I used basmati rice, and the results are comforting and delicious. You could add something creamy to this if you wanted to – yogurt or milk or creme fraiche. But I found it utterly satisfying with no further enrichment.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/06/19/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, side dish, dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, leek, rice, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 224}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "4 large leeks, white and light green parts only, cleaned and sliced", "4 garlic cloves, minced", "7 cups chicken stock, vegetable stock or water", "1/2 cup basmati rice", "1 bay leaf", "Salt and freshly ground pepper", "Pinch of cayenne (optional)", "1/2 cup milk, plain yogurt or a combination of milk and creme fraiche", "Chopped chives and/or croutons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot and add the leeks and a generous pinch of salt. Cook, stirring, until leeks are tender, about 5 minutes. Add the garlic and stir for about a minute, until the garlic smells fragrant. Add the stock or water, the rice, bay leaf and salt to taste. Bring to a boil, reduce the heat, cover and simmer 30 minutes. Taste and adjust salt. Remove the bay leaf and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the soup with an immersion blender or a food mill, or in batches in a blender, taking care to remove the lid or take out the center insert and to cover with a towel to avoid hot splashes. Return to the pot, heat through, and add pepper to taste and a pinch of cayenne if desired. Serve hot or cold. If you wish you can thin out with milk, plain yogurt or a combination of milk and creme fraiche. Garnish with chopped chives or croutons."}]}