{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Squash Bread Pudding With Feta", "description": "This savory whole-wheat bread pudding has Greek overtones, with the dill or mint and feta cheese. Make sure to squeeze as much water as you can out of the grated squash, or the dish will be too watery.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/06/26/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, casseroles", "keywords": "bread, cheese, summer squash, healthy, nut-free, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 250, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "5 grams", "sodiumContent": "369 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces whole-wheat bread or baguette, crusts removed (weigh after removing crusts)", "2 garlic cloves", "1 1/2 cups low-fat milk (1 percent or 2 percent)", "1 1/2 pounds mixed green and yellow summer squash, grated", "2 tablespoons extra virgin olive oil", "1 small or 1/2 medium onion, chopped", "1 tablespoon chopped fresh dill or mint", "1 tablespoon chopped fresh parsley", "4 eggs", "2 ounces feta, crumbled (1/2 cup)", "1 ounce Parmesan, grated (1/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the bread about 3/4 inch thick. If the bread is not stale, toast it lightly. Cut 1 of the garlic cloves in half and rub each slice of bread with the cut side of the garlic. Then cut the bread into 1-inch dice, place in a bowl and toss with 1 cup of the milk. Refrigerate for 1 hour, tossing every once in a while. Mince the remaining garlic and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the bread is soaking, place the grated squash in a colander and salt generously. Toss and let sit in the colander in the sink for 15 minutes, then squeeze out water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a 2-quart baking dish or a 10-inch ceramic tart pan. Heat the olive oil over medium heat in a large, heavy skillet and add the onion. Cook, stirring often, until it begins to soften, about 3 minutes, and add a generous pinch of salt, the garlic and grated squash. Stir together until the garlic is fragrant and the squash limp, about 2 minutes. Stir in the chopped mint or dill and the parsley, and remove from the heat. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl with the soaked bread from the refrigerator. Using your  hands, a whisk or an immersion blender, mash or beat the soaked bread so that the mixture turns to mush. Add the squash mixture and the feta to the bowl and stir together. Scrape into the oiled baking dish. Top with the grated Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into the bowl and beat with the remaining milk, salt to taste (about 1/2 teaspoon) and freshly ground pepper.  Pour over the bread mixture and place the dish in the oven. Bake 50 to 60 minutes, until the mixture is puffed, golden brown on the top and set. Remove from the heat and allow to cool for 10 minutes or longer before serving."}]}