{"@context": "http://schema.org", "@type": "Recipe", "name": "Chivito Steak Sandwich", "description": "The chivito, a little steak sandwich that serves as one of Uruguay’s culinary calling cards, makes for a fine afternoon of lunching, or an easy outdoor dinner. Pound out the beef — rib-eye or shell steak, tenderloin or flat-iron — then put it on a hot grill. It cooks fast. Then assemble: a small kaiser or Portuguese roll, with lettuce, tomato and mayonnaise, some cheese and a slice of hard-cooked egg. Roasted peppers and grilled onions are welcome additions, and a spoonful of chimichurri salsa, freshly chopped, takes it over the top, but nicely. Figure on one or two per person. A nap can follow.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11steak/11steak-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "south american", "recipeCategory": "dinner, easy, quick", "keywords": "cheese, pancetta, steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 652, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "2 grams", "proteinContent": "28 grams", "saturatedFatContent": "14 grams", "sodiumContent": "724 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Salt and pepper", "3 five-ounce slices tender beef steak, cut 1/2-inch thick", "6 slices pancetta or bacon", "1 large onion, sliced in thin rings", "6 thin slices Monterey Jack or mozzarella cheese", "6 small kaiser or Portuguese sandwich rolls, split", "1/2 cup mayonnaise, preferably homemade", "lettuce leaves", "6 tomato slices", "1 roasted sweet pepper, optional", "2 hard-cooked eggs, sliced, optional", "Chimichurri salsa (<a href=\"http://cooking.nytimes.com/recipes/12581-chimichurri-salsa\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Ask your butcher for 3 five-ounce steaks, about a half-inch thick, using rib-eye, shell strip or other tender cut. Trim excess fat from edges if necessary. Cut each steak in half crosswise and lightly pound each piece to a 1/4-inch thickness. You will have 6 small, thin steaks. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide cast-iron pan or ridged grill pan over medium high heat, cook pancetta until crisp, about 2 minutes per side. Reserve. Wipe away excess fat and add the onion. Cook, stirring occasionally, until slightly charred and softened, about 5 minutes. Sprinkle with salt and set aside. (Alternatively, grill over hot coals.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pan (or over coals) sear the beef on one side till nicely colored, about 2 minutes. Flip it and top each little steak with a slice of cooked pancetta, a slice of cheese and some charred onion. Cook for about 1 minute more for rare, 2 minutes for medium rare. Remove steaks from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the sandwich rolls and spread with mayonnaise. For each sandwich, stack lettuce leaves, cooked steak, tomato slice, roasted pepper and egg if using, and 2 teaspoons chimichurri. Replace the top of the roll and press down lightly. Cut the sandwiches in half if desired. Serve immediately."}]}