{"@context": "http://schema.org", "@type": "Recipe", "name": "Aioli", "description": "Aioli is the quintessential Provençal condiment, a pungent garlic mayonnaise that in its home country of France contains even more garlic than this version, which is still pretty garlicky. It’s easy to make, and wonderful with all sorts of vegetables, like greens, steamed artichokes and asparagus. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/07/03/science/02recipehealth/02recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "condiments", "keywords": "healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 255, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "83 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 to 4 large garlic cloves (more to taste; authentic aioli has more like 4 to 6), peeled, cut in half, and green shoot removed ", "Salt to taste (about 1/2 teaspoon)", "2 free-range organic egg yolks, or 1 egg and 1 egg white (the yolks are traditional, but the whole egg and white works fine)", "1/2 cup grapeseed oil", "1/2 cup extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whether or not you are using a mortar and pestle for the mayonnaise, begin by mashing the garlic and salt together in a mortar and pestle. Mash to a smooth paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the mortar and pestle (for egg yolks only; this is the traditional method, and will result in a very silky, creamy aioli if you do it correctly): Add the egg yolks to the mortar and beat with the pestle until smooth. Measure the grapeseed oil into a measuring cup with a spout, and drip by drip, work the oil into the egg yolks, gently but constantly stirring in one direction with the pestle. As the mayonnaise begins to emulsify, you can start adding the oil in a steady stream, but the stream must be a thin one, and you must stir constantly but not too fast. Once you have a good emulsion, you can scrape the mixture into a bowl and continue with a whisk if it’s easier for you. It helps to rest the bowl on a damp towel shaped into a ring. Use up the grapeseed oil first, since it makes a better emulsion than olive oil, then continue with the olive oil. I find that once the egg yolks and oil are emulsified, it’s easiest to drizzle in a tablespoonful of oil while beating, stop drizzling and really beat hard to work it in, then continue with another tablespoonful. When all of the oil has been added and the mayonnaise is thick, taste and adjust salt. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a food processor:\nPlace the egg yolks or egg and egg white in a food processor fitted with the steel blade. Turn it on, and begin drizzling in the grapeseed oil, then the olive oil, in a thin stream. Some food processors have little holes in the plungers meant for controlling the flow of oil into the mayonnaise. When all of the oil has been added, stop the processor and scrape in the garlic paste. Process for a few seconds, until the paste is well blended into the mixture. Taste and adjust salt. Refrigerate until ready to use. The mayonnaise will be thinner than the mortar and pestle version.\n"}]}