{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Aioli Feast", "description": "In Provence an aioli feast is not just a summer affair. But I love to throw an aioli party in the summer, when my guests and I can sit outside and enjoy the endless array of fish and vegetables with chilled rosé. Sometimes it’s a potluck, and each guest brings a vegetable or fish to eat with the aioli. Traditionally the fish would be poached, but if you’re outside with the grill going, go ahead and grill it (though that would require more olive oil, and the whole point of this garlic mayonnaise feast is to serve the mayonnaise with plainly cooked foods). The vegetables are traditionally boiled, but I prefer steaming most of them. Use this list of vegetables to guide you, but rely on the market when you make your choice. You don’t have to serve everything on the list. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/07/03/science/04recipehealth/04recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "10 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "aioli, cod, vegetables, dairy-free, gluten-free, healthy, high fiber, nut-free, vegetarian, fall, summer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 625, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "13 grams", "proteinContent": "16 grams", "saturatedFatContent": "6 grams", "sodiumContent": "401 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["3 large artichokes", "1 lemon, cut in half", "5 medium carrots, peeled, trimmed and cut in half lengthwise", "5 medium or 10 small potatoes, cut in half", "4 beets, scrubbed and roasted, cut in wedges  ", "3/4 pound green beans, trimmed", "1 pound asparagus, trimmed", "1 to 1 1/2 pounds mixed summer squash, cut in half lengthwise and into 3-inch pieces or, if using pattypans, cut into wedges", "5 hard-boiled eggs, peeled and halved or quartered", "3/4 pound chickpeas, cooked, or 2 cans, drained and rinsed", "2 pounds cod fillets, seasoned with salt and pepper and steamed until tender and flaky, 5 to 10 minutes depending on the thickness (optional)", "2 cups aioli "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with water and add the juice of half a lemon. Cut the tops off the artichokes, about 1 inch from the end, and snip the spiny tops off the remaining leaves. Break off the leaves around the base, and cut away the stem. Rub the cut edges with the other lemon half as you work. Cut the artichokes into quarters, and cut away the chokes. Place the pieces in the bowl of acidulated water as you work. When all of the artichokes are ready, steam them above an inch of simmering water for 30 to 40 minutes, until the leaves pull away easily and the heart can be easily pierced with the tip of a knife. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the carrots above an inch of boiling water for about 10 minutes, or until tender. A pasta pot with an insert is a good pot to do this in. Remove from the steamer and set aside. Steam the potatoes until tender, about 20 minutes. Arrange on the platter or in a separate bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the squash for 5 minutes, or until just tender. Steam the green beans and asparagus or cook in boiling salted water for about 4 minutes, until just tender. Transfer to a bowl of ice cold water. Let sit for a minute, then drain. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange all the vegetables, fish and the eggs on platters, the chickpeas in a bowl and the aioli in bowls. Serve the vegetables hot or at room temperature. To serve them hot, bring a large pot of water to a boil. In batches, tip the vegetables into the water for 30 seconds, transfer to platters with a slotted spoon or skimmer, and serve, with generous helpings of aioli and lots of chilled dry rosé."}], "link": "https://cooking.nytimes.com/recipes/12586-summer-aioli-feast"}