{"@context": "http://schema.org", "@type": "Recipe", "name": "Melon Sorbet", "description": "I’ve learned a lot about making sorbets from Jacquy Pfeiffer, the founder and dean of student affairs at the French Pastry School in Chicago. He taught me to use a small amount of corn syrup – about 5 percent of the weight of the fruit – to prevent the sorbet from developing ice crystals. A very small amount of honey will also work. I asked him what the least sugar I could get away with is, and he said it depends on the fruit, but as a general rule he uses 15 to 20 percent sugar. I decided to factor the corn syrup and honey into that weight, and my sorbets were beautiful, with great texture. You can use yellow or green melon for this as long as it’s really ripe and sweet.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/07/10/science/09recipehealth/09recipehealth-articleLarge-v2.jpg", "totalTime": "PT4H45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "ice creams and sorbets", "keywords": "corn syrup, melon, sugar, dairy-free, gluten-free, healthy, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegan, vegetarian, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 96, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "22 milligrams", "sugarContent": "24 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup water", "65 grams (about 1/4 cup plus 1 teaspoon) sugar", "33 grams (about 1 tablespoon plus 2 teaspoons) corn syrup", "680 grams (1 1/2 pounds) peeled diced ripe cantaloupe, honeydew or similar yellow or green-fleshed melons (about 1 medium melon)", "1 tablespoon lime juice (optional)", "Pinch of salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the water and sugar in a saucepan and bring to a boil. Reduce the heat and simmer until the sugar has dissolved. Remove from the heat and allow to cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, purée the melon with the sugar solution and remaining ingredients until smooth. Chill in the refrigerator for 2 hours or overnight. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill a container in the freezer. Blend the mixture for 30 seconds with an immersion blender, then freeze in an ice cream maker following the manufacturer’s instructions. Transfer to the chilled container and place in the freezer for 2 hours to pack. Allow to soften in the refrigerator for 15 to 30 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/12589-melon-sorbet"}