{"@context": "http://schema.org", "@type": "Recipe", "name": "Burrata With Snap Peas and Shiitakes", "description": "This recipe plays cleanup in the kitchen, perfect for the depths of summer when counters and crispers are overflowing with the season's gifts. Don't crowd the mushrooms in the pan, which will affect the browning. If burrata isn't available, feel free to substitute the freshest mozzarella you can find.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/burrata/burrata-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings as an appetizer", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "appetizer, cheese, mushroom, sugar snap peas, gluten-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 494, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "3 grams", "proteinContent": "15 grams", "saturatedFatContent": "11 grams", "sodiumContent": "497 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup extra virgin olive oil", "1 lemon (Meyer if possible)", "Vegetable oil for pan-frying", "5 fresh shiitake mushroom caps, sliced about 1/8-inch thick", "Kosher salt", "Leaves of frisée, radicchio or other salad greens", "1 ball of burrata cheese, about 4 ounces, at room temperature (or use fresh mozzarella)", "1/2 cup sugar snap peas, strings removed and thinly sliced lengthwise (to a slaw-like texture)", "Maldon salt or other flaky finishing salt", "2 teaspoons toasted pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the olive oil in a small bowl. Using a microplane, zest the lemon directly over the olive oil so that the zest falls in and the essential oils are captured. If possible, do this an hour before serving. You’ll end up with more flavored oil than you need; you can refrigerate it and use for a salad dressing in the next few days. Juice the lemon and reserve the juice separately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a plate with paper towels. Put your largest skillet over medium-high heat and add enough vegetable oil to generously coat the bottom. When the oil is shimmering, add the mushrooms in a single layer. Sprinkle with a pinch of kosher salt. Cook until deep golden brown on one side, then flip and cook the other side. Transfer with a slotted spatula to paper towels and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the lemon zest from the olive oil. Put a few leaves of frisee or radicchio on your serving plate and place the burrata on top. In a small bowl, toss the sugar snap peas with a generous tablespoon of the olive oil, 2 teaspoons of the lemon juice and 1/4 teaspoon of the Maldon salt. Pour the contents of the bowl over the burrata. Scatter the shiitakes over the top, then the pine nuts and a few more flakes of Maldon salt. Serve right away, before the mushrooms lose their crunch."}], "link": "https://cooking.nytimes.com/recipes/12612-burrata-with-snap-peas-and-shiitakes"}