{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Corn, Greens, Bacon and Scallions", "description": "This recipe came to The Times by way of Katie Workman, author of “The Mom 100 Cookbook,” a book for parents who want to feed their kids (and themselves) wholesome meals that also taste good. She took as her motto for the vegetables chapter: “They can’t eat only raw baby carrots for the rest of their lives.” She believes that reasonably lavish applications of fat (bacon bits, butter, cheese, oil) make vegetables instantly palatable, and she is right. Her default technique is to sauté a shallot in butter, turn the vegetables in the pan until they start to soften, then cover tightly and let them cook in their own steam, testing them often. Here, a colorful medley of fresh corn, bell pepper, and kale are sautéed with bacon fat, butter and shallots, then tossed with bacon bits and scallions. It's endlessly versatile – substitute carrots or summer squash for peppers, onions for shallots, spinach for kale – and could very well win over the pickiest of eaters.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2012/07/18/dining/18JPVEGETABLES3_SPAN/18JPVEGETABLES3_SPAN-articleLarge-v4.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "easy, quick, weeknight", "keywords": "bacon, corn, greens, gluten-free, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 377}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "6 grams", "sodiumContent": "527 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 slices bacon, cut crosswise into 1-inch-wide strips", "1 tablespoon unsalted butter", "1 shallot or small onion, minced", "3 cups corn kernels, from about 4 ears corn (or a combination of corn and diced summer squash)", "1/2 cup chopped red or orange bell pepper (or carrot)", "Pinch red pepper flakes", "Coarse salt and freshly ground black pepper", "2 or 3  scallions, white and light green parts, thinly sliced", "4  to 6 cups shredded, de-stemmed greens, like chard or kale (or whole baby spinach, or another tender green)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook bacon in a large skillet over medium-low heat, turning occasionally, until browned and crisp, about 10 minutes. Transfer to paper towels to drain; pour off all but a teaspoon of fat from the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter and melt. Add shallot (and carrot, if using) and adjust heat; vegetables should sizzle, but not scorch. Cook, stirring, about 2 minutes. Add corn, peppers and pepper flakes and let sizzle, stirring occasionally, 5 minutes. Season to taste with salt and pepper. Crumble bacon and add to skillet with scallions. Add greens two cups at a time, stirring to wilt before adding more. Cook together 1 minute and serve hot."}], "link": "https://cooking.nytimes.com/recipes/12610-sauteed-corn-greens-bacon-and-scallions"}