{"@context": "http://schema.org", "@type": "Recipe", "name": "White Bean, Summer Squash and Tomato Ragout", "description": "Serve this hearty ragout on its own or with pasta or whole grains.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/07/24/science/25recipehealth/25recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegan, vegetarian, main course, summer, summer squash, tomato, white beans", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 214, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "9 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1065 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound cannellini beans or dried lima beans, rinsed, picked over and soaked if desired ", "1 medium or large onion", "4 garlic cloves, 2 peeled and crushed, 2 minced", "A bouquet garni made with a bay leaf, a couple of sprigs of thyme and parsley, and a Parmesan rind", "5 cups water", "Salt to taste", "2 tablespoons extra virgin olive oil", "1 1/2 pounds mixed summer squash, diced", "1 pound tomatoes, grated, or peeled, seeded and chopped", "Freshly ground pepper", "1 teaspoon fresh thyme leaves", "1 to 2 tablespoons slivered fresh basil or mint", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the beans if desired. I do not recommend soaking lima beans, as their skins detach too easily when you soak them. I usually do soak cannellinis. Cut the onion in half. Chop one half and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the beans, the onion half that isn’t chopped, the 2 crushed garlic cloves and the bouquet garni in a large saucepan. Add 5 cups of water, bring to a boil, reduce the heat and simmer 1 hour. Add salt to taste and simmer for another hour, until the beans are tender. Taste the broth and adjust seasoning. Remove the onion and the bouquet garni and discard"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large casserole or deep, wide skillet, heat the olive oil over medium heat and add the chopped onion. Cook, stirring often, until it is tender, about 5 minutes, and add the minced garlic and a generous pinch of salt. Cook, stirring, for about 30 seconds, until the mixture is fragrant, and add the summer squash. Turn up the heat slightly so that the squash begins to cook right away, and sauté until it begins to soften, about 3 minutes. Season to taste with salt and pepper, and add the thyme and the tomatoes. Cook, stirring often, for 5 minutes, until the tomatoes have begun to break down. Turn the heat to medium, season with salt and pepper, and simmer 10 minutes, stirring often. The tomatoes should have cooked down and smell fragrant. Stir in the beans and their broth, bring to a simmer and simmer 15 minutes. Stir in the basil, taste and adjust seasonings. Serve hot or warm, tossed with pasta, over grains, or as is."}], "link": "https://cooking.nytimes.com/recipes/12634-white-bean-summer-squash-and-tomato-ragout"}