{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled or Roasted Pattypan “Steaks” With Italian Salsa Verde", "description": "Cut into thick slices, pattypan squash, which look sort of like small flying saucers, can make a juicy sort of “steak” that could be topped by a pungent sauce. Grill or roast the “steaks” and serve them with this gorgeous green sauce. You’ll need only half the amount of salsa verde that this recipe yields, but it keeps very well in the refrigerator and it’s great to have on hand.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/07/24/science/23recipehealth/23recipehealth-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "easy, quick", "keywords": "dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, parsley, summer squash, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 97}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "600 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 to 2 garlic cloves (to taste), halved, green shoots removed", "Salt to taste", "1 anchovy fillet, rinsed (optional)", "1 tablespoon capers, rinsed and chopped", "1/4 cup extra virgin olive oil", "3/4 cup (tightly packed) parsley leaves (25 grams)", "Freshly ground pepper", "2 pounds large pattypan squash", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic, salt, anchovy fillet and capers in a mortar and pestle and grind to a paste. If you wish to make the sauce in a mini food processor or with an immersion blender (an immersion blender works very well, especially if it has a strong motor), transfer to the processor or place in a jar. Add the parsley. If using a mortar and pestle, grind together until you have a paste. If using a food processor or an immersion blender, add the olive oil with the parsley and blend to a purée. If using a mortar and pestle, slowly drizzle in the olive oil and work into the mixture. Continue to grind until you have a very smooth mixture. Season to taste with salt and pepper. If serving within a few hours, allow to sit at room temperature. Otherwise, refrigerate. Allow to come to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron skillet over high heat, and preheat the oven to 450 degrees. Line a sheet pan with parchment. Alternately, prepare a hot outdoor grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the squash 3/4 inch thick and toss in a bowl with the olive oil and salt and pepper to taste. Sear in the hot pan for 1 to 2 minutes on each side, until the surface is lightly browned, and transfer to a sheet pan. Place in the oven and roast for 5 minutes. Using tongs, turn the pieces over and roast for another 5 minutes, until they are sizzling and tender all the way through. Remove from the heat. If grilling, grill the pieces for about 5 minutes on each side, until they are tender all the way through and beginning to drip.Transfer the squash slices to a platter. Top each one with a teaspoonful of the salsa, and serve hot or warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the squash slices to a platter. Top each one with a teaspoonful of the salsa, and serve hot or warm"}]}