{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry Pie Filling", "description": "The scent of blueberry pie bubbling away in the oven is comforting and familiar, especially in high summer, when pie baking can become a daily event. But just imagine that summery smell, and taste, in deepest winter. This pie filling, which uses cornstarch as a thickener, has a shelf life of about nine months, so the best of summer can be yours in the winter, too.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2012/08/01/dining/01BLUEBERRY_SPAN/01BLUEBERRY_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "2 quarts", "recipeCuisine": "", "recipeCategory": "", "keywords": "blueberries, grand marnier, lemon, dairy-free, nut-free, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 108, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "1 milligram", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["1 cup sugar", "1/2 cup cornstarch", "Juice of two lemons", "4 pints blueberries", "1 teaspoon almond extract, optional", "4 tablespoons Grand Marnier or other orange liqueur, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit a large pot with a rack, or line with a folded kitchen towel. Fill 2/3 with water and bring to a boil. Add 2 one-quart canning jars and boil for 10 minutes. Jars may be left in the warm water in the pot until ready to be filled. (Alternatively, you can sterilize jars by running them through a dishwasher cycle, leaving them  there until ready to fill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add lids to soften their rubber gaskets. Rings and lids may be left in the water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy pot, combine 1 cup water with sugar, cornstarch and lemon juice, and whisk until smooth. Bring to a boil and add berries; the mixture will look gloppy. Smash some of the berries with a potato masher or the back of a spoon. Return mixture to a boil for 1 minute. Add extract and liqueur, if using, and stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove warm jars from pot and bring water back to a boil. Ladle hot filling into jars just up to the base of the neck, leaving 1 inch at the top. Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars back into the pot of boiling water. The water should cover the jars; if not, add more. Boil jars for 30 minutes. Transfer jars to a folded towel and allow to cool for 12 hours; you should hear them making a pinging sound as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the seals by removing rings and lifting jars by the flat lid. If the lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within a month, or reprocessed. (Rings and jars may be reused, but a new flat lid must be used each time jars are processed.) To reprocess, reheat filling to boiling point (as in Step 3), then continue as before."}]}