{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Corn Soup", "description": "This salty yet sweet, creamy yet crunchy fresh corn chowder was developed for The Times by Wade Burch, the executive chef of several restaurants owned by Merchants Hospitality in New York, for a series of articles about chefs who cook with their children. It's loaded with fresh corn (12 ears worth) and dotted with jalapeño and red bell pepper. It does take a little time owing to the corn stock, but it's so worth it. The taste of the finished soup is pure summer.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2014/04/17/dining/Summer-Corn-Soup/Summer-Corn-Soup-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "corn, red bell pepper, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 173}, "recipeIngredient": ["12 ears corn", "1 onion", "1 clove garlic", "2 jalapeño peppers", "2 red bell peppers", "1 bay leaf", "10 whole black peppercorns", "6 basil leaves", "2 tablespoons canola oil", "1 teaspoon butter", "1 to 2 tablespoons salt, to taste", "Black pepper", "1/2 cup light cream or soy milk", "1 tablespoon smoked paprika, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Husk corn. Dice onion and mince garlic. Cut jalapeños in half lengthwise, discard seeds and mince. Cut bell peppers in half lengthwise, discards seeds and dice. Chiffonade basil leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the corn stock, cut kernels off corn ears and reserves cobs. In large pot,  combine cobs, bay leaf, peppercorns, 1 pinch salt and 16 cups water. Bring to a boil, then reduce heat to medium and simmer for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place stockpot over medium-low heat and add oil. Add onion, jalapeño and red peppers. Stir vegetables until onions are translucent and peppers are soft but not brown, 5 to 10 minutes. Add garlic and stir 1 and 1/2 minutes more, until garlic is golden but not brown. Increase heat to medium, and add butter and corn kernels. Add a tablespoon salt, pepper to taste and stir for about 4 minutes. Adds more salt and pepper to taste. Add 6 cups corn stock. Stir broth. Add light cream or soy milk and stir. Cover pot and lower heat to simmer for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, purée soup coarsely, leaving some kernels partly broken or whole. Add more salt and pepper to taste and, if desired, smoked paprika. Ladle soup into bowls and garnish with basil."}], "link": "https://cooking.nytimes.com/recipes/12665-summer-corn-soup"}