{"@context": "http://schema.org", "@type": "Recipe", "name": "Sabine’s Stuffed Zucchini Flowers", "description": "We found zucchini flowers, just picked that morning, at the market in a little town called Céreste, and we snatched them up. You can use the same filling for stuffed tomatoes. The bread is soaked in milk, so if you have some stale bread lying around, this is a great use for it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/07/science/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "bread, fresh herbs, zucchini flowers, healthy, low-sodium, nut-free, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 128, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "118 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces whole-wheat bread, crusts removed", "1/2 cup low-fat milk (more as needed; you may need more if the bread is stale)", "2 tablespoons extra virgin olive oil", "1 small onion, very finely chopped", "1 small zucchini, very finely chopped", "2 garlic cloves, minced", "2 to 4 tablespoons chopped fresh herbs, like parsley, thyme, sage, rosemary", "2 eggs", "12 zucchini flowers or 6 medium tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the bread and milk together in a bowl and leave for 15 minutes or longer, until the bread has absorbed all the milk. Squeeze out excess milk and mash the bread with a whisk, fork or wooden spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a baking dish large enough to accommodate the flowers or tomatoes. If using zucchini flowers, very gently open them out and pull out the stamens. If using tomatoes, cut them in half along the equator, gently squeeze out the seeds, and scoop out the flesh. Set it aside for another purpose. Set the tomato shells upside down on a rack set over a sheet pan to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a medium skillet and add the onion. Cook, stirring, until it is tender, 3 to 5 minutes, and add a generous pinch of salt, the garlic and the zucchini. Cook, stirring often, until the zucchini is tender and the mixture very fragrant, about 8 minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Beat in the bread, onion and zucchini mixture, and the fresh herbs. Season to taste with salt and pepper. To fill zucchini blossoms, carefully pull apart the petals and fill the cavity inside, then let the petals close up around the stuffing. Lay the flowers on their side in the baking dish. Or spoon the filling into the hollowed-out tomatoes and place in the baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the remaining tablespoon of oil over the vegetables and place in the oven. Bake 30 to 40 minutes, until the top is lightly browned. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/12668-sabines-stuffed-zucchini-flowers"}