{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Eggplant and Tomatoes", "description": "You could make a different dish with tomatoes and eggplant every day of the summer in Provence. I used a couple of small eggplants for this, but you can use 1 large one if that is what is available. I also used round rice from the Camargue, the Rhone delta region of southern France, which has the same risotto-friendly qualities as arborio rice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/07/science/09recipehealth/09recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "4 to 6 servings. ", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "eggplant, rice, tomato, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1074 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound eggplant (1 large or 2 small)", "2 tablespoons extra virgin olive oil", "1 small onion, finely chopped (about 1/2 cup)", "1 pound tomatoes, grated, or peeled, seeded and chopped", "2 garlic cloves, minced", "1 teaspoon fresh thyme leaves or 1/2 teaspoon dried thyme", "Salt to taste", "250 grams (1 1/2 cups) arborio rice", "1/2 cup dry white wine", "6 cups vegetable stock or chicken stock", "Freshly ground pepper", "1 1/2 ounces Parmesan cheese, grated (1/3 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Line a baking sheet with foil, and oil the foil. Cut the eggplant in half lengthwise, and with the tip of your knife, make an incision down the middle of the cut sides that goes just about down to, but not through, the skin. Lay the eggplants on the baking sheet, cut side down, and place in the oven for 20 minutes, or until the skin has shriveled and the eggplants are beginning to collapse. Remove from the heat and allow to cool until you can handle them, then dice and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, wide skillet and add the onion. Cook, stirring often, until it is tender, about 5 minutes, and add the garlic. Cook, stirring, until the mixture is fragrant, about 30 seconds, then stir in the tomatoes, thyme, diced eggplant and salt to taste. Cook, stirring often, until the tomatoes have cooked down and smell fragrant and the eggplant is thoroughly tender, 10 to 15 minutes. Taste and adjust seasoning. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan and bring it to a simmer on the stove, with a ladle nearby or in the pot. Make sure that it is well seasoned. Heat the remaining olive oil over medium heat in a wide, heavy skillet or saucepan. Pour in the rice and stir just until the grains separate and begin to sizzle. Add the wine and stir until it is no longer visible. Stir in the tomato and eggplant mixture and cook, stirring, for about a minute, until the mixture is well combined and sizzling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin adding the simmering stock, a couple of ladlefuls at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Stir often, and when you see that the stock has been absorbed by the rice, add another ladleful. The rice will be cooked through but still chewy after 20 to 25 minutes of adding the stock in increments and stirring. When the rice is tender all the way through but still chewy, it is done. Add pepper, taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": ". Add another ladleful of stock to the rice. Stir in the Parmesan and remove from the heat. The mixture should be creamy. Serve right away."}], "link": "https://cooking.nytimes.com/recipes/12669-risotto-with-eggplant-and-tomatoes"}