{"@context": "http://schema.org", "@type": "Recipe", "name": "Mark Bittman’s Eggplant Parmesan", "description": "This is the most minimalist eggplant Parmesan imaginable, really an eggplant gratin with tomatoes. You cook the eggplant in abundant oil. Yes, you can broil it or bake it, but I really think the taste of eggplant slices that have had oil boiled right through them is dreamy. Make a 15-minute tomato sauce of fresh or canned tomatoes, onion and olive oil, then grab a gratin dish and layer the eggplant, sauce and Parmesan. Do this two or three times, and that's it. Bake until it's bubbly and golden brown. It's great hot or at room temperature, so it's perfect for a potluck.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/05/dining/05COOKING-MARKEGGPLANTPARMESAN2/05COOKING-MARKEGGPLANTPARMESAN2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "eggplant, tomato, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1126}, "recipeIngredient": ["Olive oil as needed", "2 pounds eggplant, preferably small ones but in any case, firm", "Salt and pepper", "1 medium onion, chopped", "2 pounds fresh plum tomatoes or one 28-ounce can, chopped", "Parmesan cheese, grated", "Chopped parsley for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1/8 inch of oil in your largest skillet (the bigger the skillet, the faster you can get through sautéing the eggplant) and turn the heat to medium. Start trimming and slicing eggplant: 1/2-inch slices, or maybe 3/8-inch, but not as thin as 1/4 inch. When the oil shimmers, add the eggplant; you can crowd them as long as they don't overlap. Season with salt and pepper and cook, turning as necessary, until nicely tender and browned on both sides; drain on paper towels. Add more oil when necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the onion in the remaining oil; when it's tender, add the tomatoes and some salt and pepper and cook at a lively simmer until saucy, 10 or 15 minutes. Heat the oven to 400."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Eyeball your eggplant and your baking dishes and pick a nice dish that will work. I like a big oval gratin dish for this. Add a layer of eggplant, then tomato sauce, then cheese, then eggplant, tomato sauce, cheese. That will probably do, but you can make more layers if you like. Bake until the cheese is melted and the whole thing is bubbly, about 15 minutes. Sprinkle with parsley and serve hot or at room temperature."}]}