{"@context": "http://schema.org", "@type": "Recipe", "name": "Floating Island With Apricot Creme Anglaise", "description": "A dessert whose sweetness can set an adult’s teeth on edge is given a tart reprieve in this recipe. In thinking about a less-sweet take on île flottante, Melissa Clark considered: What would Julia Child do? Would she purée fresh apricots and stir the mush into the custard to make a sauce that was tangy and bright? The result is a dessert that takes a few hours of your time, but it rewards deeply. It’s a familiar classic, brightened up.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/07/17/dining/xxfloat/xxfloat-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "eastern european", "recipeCategory": "", "keywords": "apricot, eggs, milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 309, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "184 milligrams", "sugarContent": "45 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 and 1/2 tablespoons unsalted butter, softened", "225 grams sugar (about 1 cup plus 2 tablespoons)", "8 egg whites, at room temperature (about 1 cup)", "1 gram fine sea salt (about 1/4 teaspoon)", "1 gram cream of tartar (about 1/4 teaspoon)", "1 teaspoon vanilla extract", "75 grams almond flour (about 2/3 cup)", "1 and 1/2 cups milk", "4 egg yolks", "100 grams sugar (about 1/2 cup)", "Pinch salt", "6 small apricots, pitted and roughly chopped", "1 teaspoon vanilla extract", "Sliced almonds and slivered apricots, for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringue: Heat oven to 250 degrees. Butter the inside of a 2-quart soufflé mold or baking dish, at least 3 and 1/2 inches deep, then use 2 tablespoons sugar to coat butter, knocking out excess over the sink."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer set on medium-slow speed, beat egg whites until they begin to froth. Add salt and cream of tartar, increase speed to fast, and continue to beat until whites hold soft peaks. Add remaining sugar a tablespoon at a time and beat until whites hold stiff peaks. Beat in vanilla. Using a rubber spatula, gently fold in almond flour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon mixture into the prepared dish and smooth the top. It might overfill the dish; that’s O.K. Do not press mixture down. Bake until meringue has risen at least 1/2 inch and is very lightly colored on top, 30 to 40 minutes. Let cool at room temperature for 30 minutes, then refrigerate for at least 1 hour and up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crème Anglaise: In a medium, heavy saucepan, bring milk to a simmer. In a bowl, vigorously whisk together yolks, sugar and salt until pale yellow and thick. Whisking constantly, dribble in about half of the hot milk. (Don’t stop whisking or you risk curdling the eggs.) Pour yolk mixture into the pan with the rest of the milk and gently cook over low heat, stirring constantly and thoroughly, especially around the sides of the pan. When mixture starts to thicken enough to coat the spoon, about 5 minutes, add apricots and cook for 2 minutes longer, just enough to soften the fruit, while continuing to stir. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer apricot mixture to a food processor or blender, add vanilla  and purée until just smooth. Don’t overdo it: you don’t want a mousse-like froth. Chill until serving, at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a knife around the sides of the meringue to loosen it from the dish and unmold it onto a large platter or, even better, into a wide, shallow bowl. The sugar syrup that’s formed will run down the sides of the meringue. Pour apricot crème Anglaise around the island, creating a pale orange sea. Serve garnished with sliced almond and apricots, if you like."}], "link": "https://cooking.nytimes.com/recipes/12678-floating-island-with-apricot-creme-anglaise"}