{"@context": "http://schema.org", "@type": "Recipe", "name": "Salade Niçoise With Yogurt Vinaigrette", "description": "The market tomatoes, green beans, peppers, cucumbers and lettuces were irresistible, and we would have been happy to dine on this iconic Provençal salad every day. I’m making the anchovies optional in this recipe, but they are always included in the authentic salade niçoise.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/07/science/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, salads and dressings", "keywords": "gluten-free, healthy, nut-free, green beans, lettuce, tuna, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 152}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 218, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "536 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons good-quality red or white wine vinegar or sherry vinegar", "1 tablespoon fresh lemon juice", "1 garlic clove, small or large to taste, green shoot removed, puréed with a garlic press or in a mortar and pestle", "Salt and freshly ground pepper to taste", "1 teaspoon Dijon mustard", "1/4 cup extra virgin olive oil ", "5 tablespoons plain low-fat yogurt (you can omit this and use a total of 1/2 cup extra virgin olive oil)", "3/4 pound medium Yukon gold or fingerling potatoes, cut in 3/4-inch dice", "1 5 1/2-ounce can light (not albacore) tuna packed in water, drained", "6 ounces green beans, trimmed, and cut in half if long", "1 small red or green pepper, thinly sliced or diced", "1 small cucumber (preferably Persian), cut in half lengthwise and then sliced in half-moons", "2 hard-cooked eggs, preferably free range, peeled and cut in wedges", "1 small head of Boston lettuce, 1 romaine heart, or 4 to 5 cups mixed baby salad greens, washed and dried", "2 to 4 tablespoons chopped fresh herbs, like parsley, basil, tarragon, chives and marjoram", "3 or 4 tomatoes, cut in wedges, or 1/2 pint cherry tomatoes, cut in half", "6 to 12 anchovy fillets, rinsed and drained on paper towels", "12 imported black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fork or a small whisk, mix together the vinegar and lemon juice with the garlic, salt, pepper and Dijon mustard. Whisk in the olive oil and yogurt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the potatoes above 1 inch simmering water for 10 to 15 minutes, until tender. Transfer to a large salad bowl and season with salt and pepper. Add the tuna and toss with 1/4 cup of the dressing while the potatoes are hot. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil, and fill a bowl with ice water. When the water comes to a boil, add a generous amount of salt and add the green beans. Cook 4 to 5 minutes, until just tender. Transfer to the ice water, then drain. Dry on paper towels. Add to the salad bowl, along with the red or green pepper, cucumber, hard-boiled eggs, lettuce and herbs. Garnish with the tomatoes, anchovies and olives, and serve."}]}