{"@context": "http://schema.org", "@type": "Recipe", "name": "Julia Child’s Pork With Allspice Dry Rub", "description": "The allspice is really what makes this recipe, adapted from “Mastering the Art of French Cooking” by Julia Child, which was featured in a New York Times article about readers’ favorite recipes from her cookbooks. It is a simple process: make a dry rub, cover a well-marbled pork loin with it for at least 6 hours, and then roast or grill the meat. A few minutes’ preparation before work yields a fine roast for a late supper, or the same time spent on a weekend brings a fine feast in for dinner.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2012/08/15/dining/15MYFAVORITE1/15MYFAVORITE1-articleLarge-v2.jpg", "totalTime": "PT7H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "dinner, roasts", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 205}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 303, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "0 grams", "proteinContent": "39 grams", "saturatedFatContent": "3 grams", "sodiumContent": "424 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3-to 4-pound boneless pork roast with a good marbling of fat, or two large tenderloins for the grill", "4 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "1 teaspoon dried thyme or sage leaves", "1 bay leaf, crushed", "1/4 teaspoon ground allspice", "2 cloves garlic, minced or put through a press"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry the meat well with paper towels. In a bowl or a mortar, mix the remaining ingredients together and rub into the surface of the pork. Place in a covered dish and marinate in the refrigerator for at least 6 hours or up to 2 days. Turn the meat 2 or 3 times if the marinade is a short one; several times a day if longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees, or a grill to medium-high. Scrape off the marinade and dry the meat thoroughly with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For roasting, place meat on a rack in a shallow pan and turn often until just cooked through, about 30 minutes per pound or until internal temperature reaches 140 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For grilling, place tenderloins on oiled grate, cover, and cook for 12 to 15 minutes, turning every 2 minutes, or until internal temperature reaches 140 degrees. Cover meat with foil and let rest 10 minutes before slicing."}]}