{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamed Corn Without Cream", "description": "When you grate corn on the large holes of a box grater, you get a lot of creamy milk from the corn, so no dairy cream is necessary for this version of what is usually a very rich dish. If the corn is sweet, as corn should be, I prefer to let the dish stand alone with no additional flavorings; that’s why I’ve made the shallot or onion and the herbs optional.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/21/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "butter, corn, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 188}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 204, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "380 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large ears of corn, husked", "2 tablespoons unsalted butter", "2 tablespoons minced shallot or red onion (optional)", "Salt to taste", "2 to 3 teaspoons minced fresh herbs such as sage, tarragon, thyme, chives (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate the corn on the large holes of a box grater placed over a wide bowl. If you wrap plastic wrap around the 3 other sides of the grater, the splashes will go into the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon of the butter in a medium saucepan over medium heat, and add shallots if using. Cook, stirring, until shallot is tender and fragrant, about 2 minutes, and add the corn and salt to taste. Cook for 5 minutes, stirring often, until the mixture is sweet and creamy. Taste and adjust salt. Stir in the remaining tablespoon of butter and remove from the heat. Serve hot, garnished with fresh herbs if desired."}]}