{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn Pudding With Roasted Garlic and Sage", "description": "This comforting pudding has a rich, creamy texture, but the only “cream” comes from the juice of the corn kernels, which are puréed in a blender with a small amount of milk. Toasted garlic has a rich, earthy flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/21/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 servings, as a side dish", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "corn, eggs, low-fat milk, gluten-free, halal, healthy, kosher, nut-free, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "recipeIngredient": ["4 garlic cloves, unpeeled", "Kernels from 4 ears corn (about 4 cups)", "3/4 cup low-fat milk (1 percent or 2 percent)", "3 eggs", "Salt to taste (about 1/2 teaspoon)", "Freshly ground pepper", "1 tablespoon slivered or chopped fresh sage"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil or butter a 2-quart soufflé dish or gratin. Set the dish in a pan and fill the pan with enough water to come partway up the sides of the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the garlic: Place the unpeeled cloves in a heavy skillet over medium-high heat and toast, turning the garlic cloves often, until the skin is blackened in spots and the garlic smells toasty, about 7 minutes. Remove from the heat. When the cloves are cool enough to handle, cut away the root end and remove the skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 1 cup of the corn kernels. Place the rest, with the garlic, milk, eggs, salt and pepper in a blender and blend until smooth. Pour into a bowl and stir in the sage and the corn kernels, then transfer to the baking dish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 1 hour to 1 hour 15 minutes, until the top is lightly browned and the pudding is firm. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/12692-corn-pudding-with-roasted-garlic-and-sage"}