{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pork and Peaches", "description": "Here is a simple dinner you could cook on a pancake griddle set on the grate above a fire pit or grill in someone’s backyard, as if performing a magic trick. The result is a plate of thick, luscious pork with a deep, burnished crust, redolent of garlic and rosemary, and a sunset of soft, smoky peaches nutty with brown butter. The technique is what Francis Mallmann, the Latin American chef who developed the recipe and is its most refined and stylish practitioner, calls “the uncertain edge of burnt.” It requires patience and keen observation. What you are looking for on the edges of the meat and fruit is color: a deep, dark brown that is almost black — a black without bitter, a burn that is not burned.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/06/06/dining/06COOKING-GRILLEDPORKNPEACHES2/06COOKING-GRILLEDPORKNPEACHES2-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "garlic, peach, pork, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 680}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 822, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "4 grams", "proteinContent": "51 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1179 milligrams", "sugarContent": "19 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Boneless pork butt, approximately 2 pounds, butterflied and trimmed", "8 to 10 cloves garlic, peeled and minced", "2 tablespoons minced fresh rosemary needles", "8 tablespoons extra virgin olive oil", "Kosher salt and freshly ground black pepper to taste", "6 fresh peaches, skin on, cut in half and pitted", "4 tablespoons unsalted butter, cut into dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a fire in a fire pit with a grill, or in a charcoal grill, or set a gas grill to high. If you have a very strong vent in your kitchen, you may use your stove with a burner set to high. Place a large cast-iron pan or two-burner griddle over the heat and allow it to get hot. At this point you can let the fire die slightly with no ill effect. If using a gas grill or stove, turn heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the pork on a work surface and, using a meat mallet, pound to an even thickness of approximately 3/4 of an inch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic, rosemary and 6 tablespoons olive oil in a small bowl, mixing to make a rough paste. Season the pork aggressively on both sides with salt and pepper, then spread half the garlic mixture over one side and half on the other side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the pan or griddle with the remaining olive oil, allow it to heat until it shimmers and is almost smoking, then place meat on the hot surface and cook, without touching, until it forms a good crust, approximately 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the meat cooks, surround it with the peaches, cut side down, and dot the fruit with the butter. (If you’re using two cast-iron skillets, place the peaches in their own oiled pan.) Let them cook for approximately 5 minutes, or until they are soft and slightly charred. Transfer to a platter and tent with foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the meat is well browned on the first side, use tongs to turn it over, and cook in the remaining butter for another 5 to 7 minutes. Remove the meat to a carving board and allow it to rest below a tent of foil for approximately 5 minutes. Slice the meat and serve with the peaches."}]}