{"@context": "http://schema.org", "@type": "Recipe", "name": "Puffy Corn Pancake With Blackberry Sauce", "description": "This pancake is similar to a recipe that ran in The Times in 1966 called <a href=\"http://cooking.nytimes.com/recipes/9408-david-eyres-pancake\">David Eyre’s pancake</a>, named for a man whose fame seems to rest mainly on this tasty invention.\n\nHere, in addition to the corn kernels I wanted to use up, I stirred in some cornmeal to highlight the corn factor. Because cornmeal can make things heavy and I feared the pancake might become too dense, I increased the number of eggs in the batter to help it rise and puff.\n\nI mixed in a little black pepper to contrast with the sweetness of the corn, and then simmered together a speedy blackberry syrup to drizzle on top. The recipe is versatile enough to make over and over, and I’m sure it will take me through the end of corn season.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/08/22/dining/22APPE_SPAN/22APPE_SPAN-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "blackberries, corn, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 136}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 432, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "10 grams", "sodiumContent": "175 milligrams", "sugarContent": "24 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter", "1/2 cup all-purpose flour", "1/4 cup fine cornmeal", "5 large eggs", "1/3 cup whole milk", "2 tablespoons honey", "1/8 teaspoon fine sea salt", "1/2 teaspoon black pepper", "3/4 cup fresh corn kernels (from 1 to 2 ears)", "2 cups fresh blackberries", "3 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Place the butter in the bottom of a 2-quart gratin dish. Place in the oven and cook until butter begins to bubble, 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl, whisk together flour and cornmeal. In a separate bowl, whisk together eggs and milk. Stir the wet ingredients into the dry. Whisk in honey, salt and pepper. Stir in the corn. Remove dish from the oven and pour in the batter evenly. Return to the oven and bake until the pancake rises and is dark brown around the edges, 20 to 25 minutes. The center of the pancake should also be golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pancake cooks, make the sauce: In a medium saucepan over medium heat, combine blackberries and sugar. Bring to a simmer and cook until berries are soft and syrupy. Remove from heat and serve warm, spooned over pancake in the gratin dish."}]}