{"@context": "http://schema.org", "@type": "Recipe", "name": "Nectarine Tart", "description": "A beautiful dessert made from any great summer fruit — figs, nectarines, apricots, plums — that, yes, takes a little time. The reward is in the wow factor you get from the result — and in the flavors it provides. Brushing the pastry with a slick of good preserves before you add the fruit will create a thick syrup on the bottom that helps keep the pastry from becoming soggy. Then cut the fruit into quarters or eighths, depending on their size, then crowd the wedges so that they stand at attention in tight concentric circles on a pastry shell. Dust the whole thing with sugar and baste the top with melted butter. Cook and cool the finished tart, then serve with crème fraîche, whipped cream, or a few scoops of your favorite ice cream.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/08/22/dining/22PIE/22PIE-articleLarge-v3.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fruit, jelly, pastry crust, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 250}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 330, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "149 milligrams", "sugarContent": "22 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups flour, plus more for rolling", "1/2 teaspoon salt", "4 tablespoons sugar", "11 tablespoons cold unsalted butter", "1 egg yolk, beaten", "2 1/2-3 pounds fruit like peaches, nectarines, figs, apricots, plums", "6 tablespoons red currant jelly, or other preserves, depending on fruit", "1 cup crème fraîche, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend flour, salt and 2 tablespoons sugar in a bowl or food processor. Dice 8 tablespoons of the butter. Use a pastry blender or two knives to blend flour mixture and butter, or pulse them together in a food processor to make a crumbly mixture. Beat the egg yolk with 3 tablespoons cold water. Dribble it over the flour mixture, then stir or pulse slowly until the mixture starts clumping together. A bit more water may be necessary. Gather dough in a loose ball and form into a disk on a lightly floured surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Roll out dough and line a 10-inch loose-bottom tart pan. Line pastry with a sheet of foil and spread pastry weights or dry beans on top. Bake 12 minutes. Meanwhile, melt the remaining butter, cooking it on low until it turns a light nut brown. Pit fruit (except figs) and cut in eighths or, if fruit is small, fourths. After 12 minutes, remove foil and weights from pastry. Return pastry to oven and continue baking until it is lightly browned, another 8 to 10 minutes. Remove pastry from oven and increase temperature to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush pastry with preserves. Arrange fruit in tight concentric circles, starting by placing it around the perimeter, skin side down, against the vertical sides of the pastry and standing it up as much as possible. Brush with melted butter. Dust with remaining sugar. Bake about 35 to 40 minutes, until edges have browned but fruit has not collapsed. Cool before serving with crème fraîche."}]}