{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Grilled Chicken With Tomato-Cucumber Relish", "description": "Chicken thighs meet with a mellow mix of Indian spices and are grilled into weekend dinner excellence. In Indian cooking, most spices are toasted before they’re used, a process that brings up their aromatics and mellows and rounds their flavors. Here they’re then rubbed onto chicken thighs and grilled, which gives them an additional smokiness that pairs beautifully with the tomato-and-cucumber relish.", "author": {"@type": "Person", "name": "John Willoughby And Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2014/02/20/dining/recipes-spicedrubbedgrilledchicken/recipes-spicedrubbedgrilledchicken-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, weekday", "keywords": "chicken, spices, tomato, dairy-free, gluten-free, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 167}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 761, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "3 grams", "proteinContent": "54 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1340 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon cracked cumin seeds", "1 teaspoon cracked coriander seeds", "1 teaspoon cracked mustard seeds", "1 medium tomato, diced small", "1 cucumber, peeled and seeded if desired, diced small", "1 teaspoon minced fresh chile pepper of your choice", "1/2 cup fresh lemon juice", "1 tablespoon sugar", "Kosher salt and pepper to taste", "1 teaspoon ground turmeric", "1 tablespoon ground ginger", "1 tablespoon chile powder", "1 tablespoon curry powder", "8 bone-in chicken thighs, about 8 ounces each"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in your grill; when the coals are all covered with gray ash and the temperature is medium-hot (you can hold your hand 5 inches above the coals for 3 to 4 seconds), you are ready to cook. (For a gas grill, turn all burners to high, lower cover and heat for 15 minutes, then turn burners to medium-high.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While fire heats, make the relish: In a small sauté pan, toast the cumin seeds, coriander seeds and mustard seeds over medium heat, shaking frequently to avoid burning, until they begin to darken slightly and you can smell them. Remove from heat, allow to cool slightly, then combine in a medium bowl with the tomato, cucumber, chile pepper, lemon juice, sugar and salt and pepper to taste. Toss gently to combine and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same small sauté pan, toast the turmeric, ginger, chile powder and curry powder over medium heat, shaking frequently to avoid burning, until mixture begins to darken slightly and you can smell it. Remove from heat, and allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle chicken generously with salt and pepper, then rub toasted spices all over it, pressing gently so they adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the thighs on the grill directly over the coals, skin down, and cook until skin is crisp, about 8 minutes. Flip and cook 6 to 8 minutes. Thighs are done when a thermometer inserted in the thickest part of the thigh reads 165 degrees. Remove from heat and serve with the relish."}]}