{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum, Almond and Orange Galette", "description": "The galette is a free-form French tart that is effortlessly chic, the kind of dish whose imperfections can render it that much more perfect. It makes an exceptionally good showcase for fruit at the height of the season, as with the plums of late August and early September. Orange zest adds wonderful perfume. Typically, buttery doughs are used in galettes, but this recipe calls for a yeasted dough that is not too heavy or rich, a mixture of white and whole-wheat flour (add almond flour for nutty flavor), with significantly less butter. You can use another dough recipe if you like, though, and just heap on this plum filling.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/28/science/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H15M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, halal, healthy, kosher, low-sodium, vegetarian, plum, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 127, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "16 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["1 <a href=\"http://www.nytimes.com/recipes/12722/Dessert-Galette-Pastry.html\">dessert galette pastry (1/2 recipe)</a>", "1 1/2 pounds plums, pitted and sliced", "3 tablespoons raw brown sugar or 2 tablespoons mild honey, like clover", "3 tablespoons finely chopped walnuts", "Finely chopped zest of 1 orange, preferably organic", "1/2 teaspoon vanilla extract", "3/4 teaspoon cinnamon", "25 grams (1/4 cup) almond powder (almond flour)", "1 egg beaten with 1 teaspoon milk, for egg wash ", "1 tablespoon raw brown sugar (if using honey with the fruit)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pastry from the freezer and place it on a baking sheet lined with parchment. Leave it to thaw while you prepare the fruit. It will thaw quickly and is easiest to handle if it’s cold. You want it just soft enough so that you can manipulate it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the plums, 2 tablespoons of the sugar or honey, walnuts, orange zest, vanilla and 1/2 teaspoon of the cinnamon in a large bowl and gently toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the almond powder over the pastry, leaving a 2- to 3-inch border all around. Place the fruit on top. Fold the edges of the dough in over the fruit, pleating the edges as you work your way around the fruit to form a free-form tart that is roughly 9 inches in diameter. Place in the freezer on the baking sheet for 45 minutes to an hour. This helps the galette maintain its shape. Meanwhile, preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the galette from the freezer. Brush the exposed pastry with the egg wash. Combine the sugar and the remaining 1/4 teaspoon cinnamon and sprinkle over the fruit and the crust. Place in the oven and bake 1 hour, until the fruit is bubbly and some of the juices have run out and caramelized on the parchment. Remove from the oven and serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/12725-plum-almond-and-orange-galette"}