{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Bass in a Salt Crust From Île de Ré", "description": "", "author": {"@type": "Person", "name": "Elaine Sciolino"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/saltbass-still/saltbass-still-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "main course, sea bass, sea salt, vegetables", "aggregateRating": null, "recipeIngredient": ["2 pounds (about 4 cups) coarse gray sea salt or other coarse sea salt", "3 ounces (about 1/3 cup) fine salt", "17 ounces (about 3 and 1/4 cups) flour", "1 tablespoon thyme flowers or finely chopped thyme", "1 small stem (about 1/4 cup) finely chopped fennel", "5 large egg whites, more as needed", "3 and 1/2 ounces (about 1/2 packed cup) julienned vegetables (such as carrots, zucchini, mushrooms, fennel, leeks)", "1 whole sea bass, about 1 and 3/4 pounds (or other firm-fleshed fish, such as red snapper), gutted and scaled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. In a large bowl, mix together coarse salt, fine salt, flour, thyme and fennel. Add egg whites and mix for 2 to 3 minutes to make a flexible and firm dough; if dough is too dry, add more egg whites one at a time as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll dough out on parchment paper to a thickness of about 1/2 inch. Put vegetables in the cavity of the fish, and place fish in the center of the dough. Wrap fish entirely with dough, using the edges of the parchment to help lift the dough over the fish. Transfer parchment with encased fish to a shallow baking pan, and tear off excess parchment from around the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 minutes. Cut open and remove salt crust from fish. Remove the skin of the fish. Discard crust and skin, fillet the fish and, if desired, serve with a beurre blanc sauce."}], "link": "https://cooking.nytimes.com/recipes/12727-sea-bass-in-a-salt-crust-from-ile-de-re"}