{"@context": "http://schema.org", "@type": "Recipe", "name": "Dessert Galette Pastry", "description": "A galette is a free-form pie, more rustic than a tart, that is baked directly on a sheet pan or baking stone. Although they’re usually made with classic buttery pie dough or puff pastry, I’ve developed this yeasted dough recipe, which is delicate and tasty but not too rich. The yield is enough for two galettes, but has only 60 grams of butter (about four tablespoons). It’s sort of a cross between a pizza dough and pie-crust dough, wholesome because of the addition of whole-wheat flour but not heavy. Almond flour contributes a nutty flavor and delicate texture, but it’s optional. The trick is to roll it very thin, then freeze it right away so that it doesn’t continue to rise and become too bready. Make sure to dust your work surface well before you roll out the pastry, and to let the dough rest for a few minutes after each few passes with the rolling pin so that it doesn’t shrink back, as yeast doughs do. If you keep letting it rest, you won’t have trouble achieving a thin 12- to 13-inch round.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/28/science/27recipehealth/27recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Makes enough for 2 9 -inch galettes", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, flour, yeast, dessert, halal, healthy, kosher, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 821, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "122 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "10 grams", "proteinContent": "21 grams", "saturatedFatContent": "17 grams", "sodiumContent": "627 milligrams", "sugarContent": "14 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["5 grams (1 1/2 teaspoons) active dry yeast", "115 grams (1/2 cup) lukewarm water", "2 tablespoons plus 1/4 teaspoon sugar", "1 large egg, at room temperature, beaten", "135 grams (1 cup) whole-wheat flour", "155 grams (1 1/4 cups) unbleached flour", "25 grams (1/4 cup) almond flour (optional)", "1/2 teaspoon salt", "60 grams (4 tablespoons) unsalted butter at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the yeast in the water. Add 1/4 teaspoon of the sugar, and allow the mixture to sit until it is creamy, about 5 minutes. Beat in the egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flours, 2 tablespoons sugar, and salt into a large bowl or into the bowl of a standing mixer fitted with the paddle or a large bowl. Add the butter and work with your fingers or beat at low speed until the mixture is crumbly. Add the yeast mixture and stir or beat at low speed until the ingredients come together. Turn out onto a lightly floured surface and knead gently just until the dough is smooth, about a minute. Shape into a ball. Place in a lightly buttered bowl, cover the bowl with plastic wrap, and allow the dough to rise in a draft-free spot until it has doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a lightly floured surface and divide into 2 equal pieces. Gently shape each piece into a ball without kneading it, cover the dough loosely with plastic wrap and let it rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out into very thin rounds, about 12 to 13 inches in diameter. If you have a Silpat silicone mat, roll the dough out on the mat; otherwise, use a lightly floured surface and dust regularly with flour to prevent the dough from sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover a pizza pan or a baking sheet with plastic wrap and place the rolled-out dough on top. Wrap the edges of the plastic wrap over the dough and place plastic wrap on top. Roll out the other round, wrap in plastic and place on top of the first round. Freeze until ready to use."}], "link": "https://cooking.nytimes.com/recipes/12722-dessert-galette-pastry"}