{"@context": "http://schema.org", "@type": "Recipe", "name": "Vietnamese Summer Rolls with Black Bean Garlic Dipping Sauce", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/vietnamesesummerrolls/vietnamesesummerrolls-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 small rolls (4 appetizer servings)", "recipeCuisine": "vietnamese", "recipeCategory": "", "keywords": "abalone, bean sprouts, fresh herbs, appetizer, side dish, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 99, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "242 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons preserved salted black beans (available in Asian specialty stores)", "4 garlic cloves ", "4 slender chives", "2 tablespoons canola or other vegetable oil", "2 tablespoons soy sauce", "20 slender chives", "2 cups basil leaves ", "1 red bell pepper", "8 6-inch-diameter rice paper wrappers", "1 cup mint leaves", "1 cup cilantro leaves", "1 1/4 cup (about 80) bean sprouts "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dipping sauce:\n<br/>\nChild: To remove some of the salt from the beans, put them in a small bowl of warm water for 2 minutes. Rinse in a small colander or a strainer, and repeat 3 times.\n<br/>\nAdult: Mince garlic cloves. Trim ends of chives.\n<br/>\nChild: In another small bowl, mix beans and garlic, and give to the adult. Using a pair of small blunt kitchen scissors, cut chives into tiny pieces.\n<br/>\nAdult: In a small frying pan over medium heat, heat oil until shimmering, and add beans and garlic. Stir until they begin to sizzle, about 1 minute, then reduce heat to low, add soy sauce and cook for 2 minutes. Pour into a small bowl.\n<br/>\nChild: Garnish sauce with chives. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the summer rolls:\n<br/>\nAdult: Trim ends of chives.\n<br/>\nChild: Count out 16 chives and, using kitchen scissors, cut them in half. Tear basil leaves in half.\n<br/>\nAdult: Mince remaining chives and set aside for garnish. Cut bell pepper in half lengthwise, discard seeds, and cut 8 slices 1/2 inch wide. (Reserve remaining bell pepper for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adult: Place a wide shallow bowl or baking pan on the counter and add 1 to 2 inches of cold water. Slide a rice wrapper into the water until pliable but not soggy, about 10 to 30 seconds. Transfer wrapper to a large plate.\n<br/>\nChild: In the center of the wrapper, place a row (about 4 pieces) of basil, mint (about 5 leaves), cilantro (about 6 leaves) and chives (about 4 pieces). Add 10 bean sprouts and a strip of red bell pepper.\n<br/>\nAdult: Roll up wrapper halfway to cover filling, then tuck in ends of wrapper. Continue rolling, wrapping tightly. Place roll, seam-side down, on a serving plate. Continue to make 8 rolls.\n<br/>\nChild: Garnish rolls with minced chives; serve with dipping sauce."}]}