{"@context": "http://schema.org", "@type": "Recipe", "name": "Nectarine or Peach and Blackberry Galette", "description": "Nectarines and peaches work equally well here, as long as they're ripe and sweet. You can find almond powder, also called almond flour, in markets that sell baking supplies. The thin layer under the fruit will absorb juice so that the crust doesn't get soggy. Once you assemble the galette, you must place it in the freezer for an hour before baking, so plan accordingly.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/08/28/science/28recipehealth/28recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "1 9-inch galette, serving 8", "recipeCuisine": "french", "recipeCategory": "", "keywords": "blackberries, nectarine, dessert, halal, healthy, high fiber, kosher, low-sodium, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 106}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 103, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "16 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 dessert galette pastry (1/2 recipe)", "1 1/2 pounds ripe nectarines, pitted and sliced", "1 basket (6 ounces) blackberries", "2 tablespoons mild honey, like clover, or 3 tablespoons brown sugar", "3/4 teaspoon cinnamon", "1/2 teaspoon vanilla", "25 grams (1/4 cup) almond powder", "1 egg beaten with 1 teaspoon milk, for egg wash ", "1 tablespoon raw brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pastry from the freezer and place it on a baking sheet lined with parchment. Leave it to thaw while you prepare the fruit, but don’t keep it out of the freezer for too long. It will thaw quickly and is easiest to handle if it’s cold. You want it just soft enough so that you can manipulate it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the nectarines, blackberries, honey or 2 tablespoons of the sugar, 1/2 teaspoon of the cinnamon and the vanilla in a large bowl and gently toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the almond powder over the pastry, leaving a 2- to 3-inch border all around. Place the fruit on top. Fold the edges of the dough in over the fruit, pleating the edges as you work your way around the fruit to form a free-form tart that is roughly 9 inches in diameter. Place in the freezer on the baking sheet for 45 minutes to an hour. This helps the galette maintain its shape. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 350 degrees. Remove the galette from the freezer. Brush the exposed edge of the pastry with the egg wash. Combine the remaining tablespoon of sugar and 1/4 teaspoon cinnamon and sprinkle over the fruit and the crust. Place in the oven and bake 1 hour, until the fruit is bubbly and the juice is running out and caramelizing on the parchment. Remove from the oven and allow to cool for at least 15 minutes. Serve hot or warm or at room temperature."}]}