{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro and Arborio Risotto With Leeks, Herbs and Lemon", "description": "The leeks, herbs and lemon juice added at the end of cooking contribute a lightness to this chewy risotto. You can use one herb or a combination. If you’ve bought a big bunch of flat-leaf parsley and needed only a bit of it, here’s a good way to use up the rest.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/04/science/04recipehealth/04recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, farro, leek, rice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 317, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1089 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["6 cups vegetable stock or chicken stock", "2 tablespoons extra virgin olive oil", "1 pound leeks, white and light green parts only, rinsed thoroughly of sand and chopped", "Salt to taste", "2 plump garlic cloves, minced", "2/3 cup Arborio rice", "1/2 cup dry white wine", "3 cups cooked farro (1 cup uncooked) ", "2 cups chopped fresh herbs, like parsley, tarragon, basil, chives", "Freshly ground pepper", "2 ounces Parmesan, grated (1/2 cup, optional)", "2 tablespoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a saucepan. Season well and turn the heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large nonstick frying pan or wide, heavy saucepan and add the leeks. Cook, stirring, until they begin to soften, about 3 minutes, and add a generous pinch of salt, the garlic and the rice. Cook, stirring, until the grains of rice are separate and beginning to crackle, about 3 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine and cook over medium heat, stirring constantly. The wine should bubble, but not too quickly. You want some of the flavor to cook into the rice before it evaporates. When the wine has just about evaporated, stir in a ladleful or two of the simmering stock (about 1/2 cup), enough to just cover the rice. The stock should bubble slowly (adjust heat accordingly). Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, not too fast and not too slowly, stirring often and adding more stock when the rice is almost dry, for 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the farro and more stock to cover and continue to cook, adding more stock as necessary and stirring often, for another 10 minutes or until the rice is cooked through but al dente. If it is still hard in the middle, you need to continue adding stock and stirring for another 5 minutes or so. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the herbs and fresh pepper (be generous), add another ladleful of stock and continue to cook, stirring, for a minute, then add the Parmesan and the lemon juice, stir together and remove from the heat. The risotto should be creamy; if it isn’t, add a little more stock. Stir once, taste and adjust seasonings, and serve."}], "link": "https://cooking.nytimes.com/recipes/12735-farro-and-arborio-risotto-with-leeks-herbs-and-lemon"}