{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Rice and Arborio Risotto With Corn and Red Pepper", "description": "Though chefs these days get away with calling all sorts of grainy dishes risottos, the finished products often lack the creamy texture that makes classic risottos so appealing. But that creamy texture is possible if whole grains are cooked separately and combined with some arborio rice, the traditional risotto rice.  Wild rice and corn contribute a New World character to this multicolored, multitextured risotto. The dish is delicious with or without the cheese.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/04/science/03recipehealth/03recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 361, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "887 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup wild rice (3 cups cooked)", "6 cups chicken or vegetable stock", "2 ears corn", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "Salt to taste", "1 red bell pepper, cut in small dice", "2/3 cup arborio rice", "1/2 cup dry white wine, like pinot grigio or sauvignon blanc", "2 teaspoons fresh thyme leaves", "Freshly ground pepper to taste", "1/4 to 1/2 cup freshly grated Parmesan cheese (1 to 2 ounces) (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the wild rice, bring 3 1/2 cups of the stock or water to boil in a medium saucepan. Add salt to taste and the wild rice. When the water returns to the boil, reduce the heat, cover and simmer 40 to 45 minutes, until the rice is tender and has begun to splay. Drain and transfer the rice to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock into a saucepan and bring it to a simmer over low heat, with a ladle nearby. Cut the kernels off the cobs and add the cobs to the stock. Cover and simmer 20 minutes. Remove the corncobs from the stock. Taste the stock and make sure that it is well seasoned. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet or saucepan. Add the onion and a generous pinch of salt, and cook gently until it is just tender, about 3 minutes. Add the red pepper and continue to cook, stirring often, for another 5 minutes, until tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the arborio rice and stir until the grains separate and begin to crackle. Add the wine and stir until it has been absorbed. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, adding more stock and stirring when the rice is almost dry. You do not have to stir constantly, but stir often. After 10 minutes, stir in the corn kernels and continue to add stock and stir the rice until the rice is tender all the way through but still chewy, about 10 more minutes. Add another ladleful of stock and stir in the wild rice and thyme. Cook for 3 to 5 minutes. Add pepper, taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to the rice. Stir in the Parmesan if using and remove from the heat. Serve right away in wide soup bowls or on plates."}], "link": "https://cooking.nytimes.com/recipes/12734-wild-rice-and-arborio-risotto-with-corn-and-red-pepper"}