{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Rice and Arborio Risotto With Artichokes", "description": "You can use fresh baby artichokes for this if they’re in season. Otherwise, it may be easier to find frozen ones.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/04/science/05recipehealth/05recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "artichoke, rice, dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegan, vegetarian, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 461, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "77 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "14 grams", "proteinContent": "18 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1369 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 cup black rice, like Lundberg Black Japonica or Forbidden Rice, cooked (3 cups cooked)", "8 baby artichokes, trimmed and quartered, or 1 12-ounce package frozen artichoke hearts, thawed ", "1 lemon, cut in half", "About 7 cups chicken or vegetable stock, as needed", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion ", "Salt to taste", "2 garlic cloves, minced", "2/3 cup arborio rice", "1 teaspoon fresh thyme leaves, or 1/2 teaspoon dried thyme", "1/2 cup dry white wine, like pinot grigio or sauvignon blanc", "1/4 cup chopped fresh parsley", "2 teaspoons lemon zest", "2 teaspoons fresh lemon juice", "1/4 to 1/2 cup grated Parmesan cheese, or a mixture of Parmesan and pecorino Romano (optional)", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the black rice, combine with 2 cups water in a saucepan, add salt to taste and bring to a boil. Reduce the heat, cover and simmer 30 to 40 minutes, until all of the liquid has been absorbed by the rice. Remove from the heat, remove the lid from the pan and place a dish towel over the pan, then return the lid. Let sit for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To trim the artichokes, fill a bowl with water and add the juice of 1/2 lemon. Cut the stems off the artichokes and, with a sharp knife, cut away the tops — about 1/2 inch from the top for baby artichokes. Rub the cut parts with the other half of the lemon. Break off the tough outer leaves until you reach the lighter green leaves near the middle. With a paring knife, trim the bottom of the bulb right above the stem by holding the knife at an angle and cutting around the artichoke, until you reach the light-colored flesh beneath the tough bottoms of the leaves. Cut in quarters and cut away the chokes. Place in the bowl of acidulated water until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan and bring it to a simmer on the stove, with a ladle nearby or in the pot. Make sure that it is well seasoned. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the artichoke hearts and pat dry. Heat the oil in a wide, heavy nonstick skillet or saucepan over medium heat. Add the onion and salt to taste, and cook gently until tender, 3 to 5 minutes. Add the artichoke hearts and the garlic and stir for 2 to 3 minutes, until the artichoke hearts are beginning to color. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the arborio rice and thyme and stir until the grains become separate and begin to crackle. Add the wine and cook, stirring, until the wine has just about evaporated and been absorbed by the rice. Stir in enough of the simmering stock to just cover the rice. The stock should bubble slowly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, not too fast and not too slowly, adding more stock when the rice is almost dry and stirring often, for about 20 minutes. When the rice is tender all the way through but still chewy, it is done. Add pepper, taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mince the parsley and lemon zest together, and add to the risotto with the black rice, along with another ladleful or two of stock and freshly ground pepper. Simmer, stirring often, for 5 minutes. Remove from the heat, add another small ladleful of stock and a teaspoon or two of lemon juice, and stir in the cheese if using. Serve right away, in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}], "link": "https://cooking.nytimes.com/recipes/12736-black-rice-and-arborio-risotto-with-artichokes"}