{"@context": "http://schema.org", "@type": "Recipe", "name": "Black and Arborio Risotto With Beets and Beet Greens", "description": "The red from the beets will bleed into the white rice in this nutrient-dense risotto. Both the beets and the black rice contribute anthocyanins, flavonoids with antioxidant properties.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/04/science/06recipehealth/06recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beet, beet greens, rice, dairy-free, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegan, vegetarian, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 267, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "768 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 cup black rice, like Lundberg Black Japonica or Forbidden Rice, cooked (3 cups cooked black rice)", "1 quart chicken or vegetable stock, as needed", "1 bunch beet greens, stemmed and washed ", "2 tablespoons extra virgin olive oil ", "1/2 cup finely chopped onion", "2/3 cup arborio rice", "2 garlic cloves, minced", "1/2 cup dry white wine", "3/4 pound beets (1 bunch small), roasted, skinned and diced", "Salt", "Freshly ground pepper", "1 to 2 ounces Parmesan cheese, grated (1/4 to 1/2 cup, to taste, optional)", "2 tablespoons finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the black rice, combine with 2 cups water in a saucepan, add salt to taste and bring to a boil. Reduce the heat, cover and simmer 30 to 40 minutes, until all of the liquid has been absorbed by the rice. Remove from the heat, remove the lid from the pan and place a dish towel over the pan, then return the lid. Let sit for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a saucepan. Season well and turn the heat to low. Stack the stemmed, washed greens and cut crosswise into 1-inch-wide strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large nonstick frying pan or wide, heavy saucepan and add the onion. Cook, stirring, until the onion begins to soften, about 3 minutes, and add the rice and garlic. Cook, stirring, until the grains of rice are separate and beginning to crackle, about 3 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine and cook over medium heat, stirring constantly. The wine should bubble, but not too quickly. You want some of the flavor to cook into the rice before it evaporates. When the wine has just about evaporated, stir in a ladleful or two of the simmering stock (about 1/2 cup), enough to just cover the rice. The stock should bubble slowly (adjust heat accordingly). Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, not too fast and not too slowly, stirring often and adding more stock when the rice is almost dry, for 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the greens, the diced beets and black rice and continue adding more stock, enough to barely cover the rice, and stirring often, for another 10 to 15 minutes. The arborio rice should be chewy but not hard in the middle – and definitely not soft like steamed rice. If it is still hard in the middle, you need to continue adding stock and stirring for another 5 minutes or so. Now is the time to ascertain if there is enough salt. Add if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice is cooked through, add a generous amount of freshly ground pepper, and stir in another ladleful of stock, the Parmesan and the parsley. Remove from the heat. The risotto should be creamy; if it isn’t, add a little more stock. Stir once, taste and adjust seasonings, and serve."}], "link": "https://cooking.nytimes.com/recipes/12737-black-and-arborio-risotto-with-beets-and-beet-greens"}