{"@context": "http://schema.org", "@type": "Recipe", "name": "Oatmeal Tabbouleh", "description": "This is a good tabbouleh alternative for those of you who can’t tolerate wheat, though you must seek out a brand of steel-cut oats that has been processed in a gluten-free facility if you need to avoid gluten. Unlike traditional tabbouleh, which is a really a parsley salad with a little bit of fine bulgur, this is more of a lemony grain salad with a generous amount of parsley and other herbs. For best results, toss the soaked oats with the dressing and refrigerate overnight.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/12/science/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, oats, parsley, tomato, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "456 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup quick-cooking steel-cut oats", "Salt to taste", "1 cup boiling water", "1/4 cup fresh lemon juice", "1/2 teaspoon cumin seeds, lightly toasted and ground", "1/4 cup extra virgin olive oil", "1 cup chopped fresh parsley", "2 to 4 tablespoons chopped fresh mint (to taste)", "2 tablespoons chopped chives", "2 to 3 medium tomatoes, finely chopped (omit if not in season)", "1 cucumber, 2 Persian cucumbers, or 1/2 European cucumber, seeded if necessary and cut in small dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the steel-cut oats and salt to taste in a bowl and pour on 1 cup of boiling water. Let sit for 25 to 30 minutes. Drain through a strainer and press the oats against the strainer with the back of your spoon to extract water. Transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the lemon juice, salt to taste, cumin and olive oil and whisk together. Toss with the oats and let sit for at least 20 minutes or, preferably, cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining ingredients, toss together and let sit for 10 to 15 minutes or longer (in the refrigerator if longer than 15 minutes) before serving."}]}