{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Torta", "description": "This torta is inspired by an award-winning one made by Laurie Figone of Petaluma, Calif. And her Pinhead Torta is a spin on a rice and egg torta, a sort of frittata made with eggs, rice, oregano and Parmesan. She substituted steel-cut oats for the rice, soaking and cooking the oats in mushroom broth, which contributed great flavor. She also added shredded zucchini, soaked portobello mushrooms and sun-dried tomatoes. This recipe is slightly different. Three tablespoons of extra virgin olive oil are a substitute for Ms. Figone's 6 tablespoons of butter, and fresh garlic for garlic salt. There’s also a choice between dried portobello mushrooms and dried porcinis. Serve the torta with a simple tomato sauce.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/11/science/10recipehealth-1347296320547/10recipehealth-1347296320547-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, gluten-free, halal, healthy, high fiber, kosher, nut-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 231, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "13 grams", "saturatedFatContent": "4 grams", "sodiumContent": "365 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ounce (about 1 cup) dried portobello mushrooms or 1/2 ounce dried porcinis", "1 1/2 cups boiling water", "1 1/2 cups quick-cooking steel-cut oats", "Salt to taste", "3 tablespoons extra virgin olive oil", "1 cup diced onion", "1 cup coarsely shredded zucchini", "1 to 2 garlic cloves (to taste), minced", "1/2 cup diced sun-dried tomatoes (packed in olive oil, drained)", "1/4 to 1/2 cup chopped fresh oregano, to taste, or 1/4 cup fresh marjoram", "6 eggs, at room temperature", "Freshly ground pepper", "4 ounces Parmesan, grated (1 cup)", "Fresh Tomato Sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried mushrooms in a bowl and pour on the boiling water. Let sit for 15 to 20 minutes, until the mushrooms are soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the steel-cut oats in a bowl. Add salt to taste. Line a strainer with cheesecloth and place over the bowl. Drain the mushrooms, pouring their soaking liquid through the strainer, and then squeeze liquid out of the mushrooms while holding them over the strainer. The oatmeal should be submerged in the soaking liquid (add a little water if it is not). Leave the oatmeal to soak for 20 minutes while you prepare your other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the mushrooms of any sand. Drain them, then squeeze dry and chop medium-fine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a wide saucepan over medium-high heat and add the soaked steel-cut oats, along with any liquid remaining in the bowl. Stir constantly until all of the liquid has evaporated and the oats are cooked al dente, about 3 minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat another tablespoon of the olive oil over medium heat in a heavy 10- or 11-inch nonstick skillet. Add the onion and a pinch of salt. Cook, stirring often, until onion is tender and translucent, about 5 minutes. Add the garlic, zucchini, mushrooms and sun-dried tomatoes and cook, stirring, for another minute, until the zucchini begins to soften. Add the steel-cut oats, stir together until everything is well combined, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the eggs and season to taste with salt and pepper. Add the oregano or marjoram and 3/4 cup of the Parmesan. Stir in the oat mixture and mix well. Clean the pan and wipe dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to medium-high heat and add the remaining tablespoon of olive oil. When the oil is hot, pour in the egg mixture, scraping every last bit out of the bowl with a rubber spatula. Cover the pan tightly and turn the heat to medium. Cook for 10 to 15 minutes, until the eggs are set (insert a knife in the middle; it should come out clean). Remove the lid and remove from the heat. Let sit for a few minutes in the pan, then invert onto a serving plate. Top with the remaining Parmesan. Allow to cool for 10 to 15 minutes and cut in wedges. Serve with a simple marinara sauce."}]}