{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Brisket With Plums, Star Anise and Port", "description": "For this recipe, I added plums to the onions in the sauce for brightness, and port for sweetness. Star anise and bay leaf add depth, but you could leave them out without anyone missing them, or substitute a cinnamon stick and orange zest. And if you don’t want to use port, regular red wine spiked with a few tablespoons of honey or brown sugar is a nice substitute.\n\nIf you can, track down a second cut, or deckle, brisket for this dish. For lovers of fatty meat, this is brisket nirvana. It’s juicy, it’s succulent, it falls apart under the fork with barely a nudge. It’s also as tasty as short ribs but less expensive, which is what you want when you’re cooking for a large family dinner. You can’t find the second cut in many supermarkets, but butchers have it if you ask.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/09/12/dining/12APPE_SPAN/12APPE_SPAN-articleLarge-v2.jpg", "totalTime": "PT6H", "recipeYield": "12 to 14 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "brisket, plum, port, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 614}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 671, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "2 grams", "proteinContent": "39 grams", "saturatedFatContent": "19 grams", "sodiumContent": "788 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 brisket (6 to 7 pounds), preferably second cut", "2 tablespoons kosher salt", "1 1/2 tablespoons black pepper", "3 garlic cloves, thinly sliced", "1 bunch lemon thyme or regular thyme", "2 tablespoons extra virgin olive oil", "3 white onions, thinly sliced", "1 cup ruby port", "1/2 cup dry white wine", "4 whole star anise (or 2 whole cloves)", "4 whole bay leaves", "2 1/2 pounds ripe but firm plums, halved and pitted", "Thyme leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season brisket all over with salt and pepper. Place it in a large container and cover with garlic and half the thyme sprigs. Cover and refrigerate overnight or for at least 4 hours. Let meat stand at room temperature for 30 minutes before cooking. Wipe off garlic and thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. On the stovetop, place a very large Dutch oven over high heat. Add oil. Place brisket in pot and cook, without moving, until browned, about 7 minutes per side. (Cut meat into two chunks and sear in batches if it doesn’t fit in a single layer.) Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions to pot and reduce heat to medium-high. Cook onions, tossing occasionally, until golden brown around the edges and very tender, 15 to 20 minutes. Pour in port and wine and scrape up any browned bits from the bottom of the pot. Stir in star anise, bay leaves and remaining thyme. Scatter half the plums over the bottom of the pot and nestle brisket on top. Scatter remaining plums over meat. Cover pot and transfer to oven. Cook, turning every 30 minutes, until meat is completely fork tender, about 5 hours. After 4 hours, uncover the pot so some of the liquid can evaporate and sauce can thicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have time, let brisket cool completely in the pot, then refrigerate, covered, overnight. (This makes it easier to remove the fat from the top with a slotted spoon.) Reheat meat in a 300-degree oven for about 45 minutes before serving, if necessary. If sauce seems thin, remove meat from the pot and bring liquid to a simmer. Let cook until it’s reduced to taste. Slice meat and serve with the plum sauce, garnished with thyme leaves if you like."}]}