{"@context": "http://schema.org", "@type": "Recipe", "name": "Couscous With Tomatoes, Cauliflower, Red Peppers and Olives", "description": "Cauliflower is one of the few cruciferous vegetables you find in North African tagines. The spicy tagines make a good vehicle for this nutrient-rich food and are one of the few types of dishes in which cauliflower can be cooked until quite soft and not lose its appeal.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/19/health/nutrition/20recipehealth-pic/20recipehealth-pic-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner", "keywords": "beans, cauliflower, couscous, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 270, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "473 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, chopped", "2 to 4 large garlic cloves (to taste), minced ", "Salt to taste", "1 1/2 teaspoons paprika", "1/2 teaspoon cayenne (more to taste)", "1 pound ripe tomatoes, peeled, seeded and chopped, or 1 14-ounce can with juice", "2 cups pinto beans, Christmas limas or white beans, soaked in 2 quarts water for 6 hours or overnight and drained", "A bouquet garni consisting of 3 sprigs each parsley and mint", "1 tablespoon tomato paste", "2 to 3 teaspoons harissa (more to taste), plus additional for serving", "1/2 pound (1 large) red bell peppers, seeded and cut in large dice", "1 small cauliflower, cut into florets, then sliced about 1/2 inch thick", "16 imported black olives, pitted and cut in half", "2 to 4 tablespoons chopped parsley or mint, or a combination", "2 to 2 2/3 cups couscous (1/3 cup per serving)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, heavy soup pot or Dutch oven over medium heat and add the onion. Cook, stirring, until it is tender, about 5 minutes, and stir in the garlic, 1/2 teaspoon salt and the spices. Stir together for about 30 seconds, until the mixture is fragrant, and add the tomatoes. Cook, stirring often, until the tomatoes have cooked down slightly, 5 to 10 minutes. Stir in the beans, 2 quarts water and the bouquet garni. Bring to a gentle boil, reduce the heat, cover and simmer 1 1/2 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste, harissa, red bell pepper, cauliflower, olives and salt to taste. Bring back to a simmer and simmer 30 minutes, or until the beans are tender. Stir in the chopped fresh herbs and simmer another 5 minutes. Taste and adjust salt. Remove a cup of the broth for seasoning the couscous. The stew should be spicy and flavorful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reconstitute and steam the couscous [ed: please link]. Serve the couscous in wide bowls or mound onto plates and top with the stew. Pass more harissa at the table."}], "link": "https://cooking.nytimes.com/recipes/12757-couscous-with-tomatoes-cauliflower-red-peppers-and-olives"}