{"@context": "http://schema.org", "@type": "Recipe", "name": "Israeli Couscous With Mixed Summer Vegetables", "description": "This is the best use for Israeli couscous that I’ve found. Make a delicious vegetable stew, then cook the couscous in the stew. If you are making this ahead, wait until half an hour before you wish to serve, reheat the stew and then cook the couscous in the stew. Otherwise it will soak up too much of the broth overnight.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/21/health/nutrition/21recipehealth-pic/21recipehealth-pic-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "8 generous servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 353, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "11 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1436 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 pound eggplant, preferably long Asian eggplants", "2 tablespoons extra virgin olive oil", "1 large onion, chopped", "2 to 4 large garlic cloves (to taste), minced", "Salt to taste", "2 teaspoons paprika", "1 teaspoon ground cumin seeds", "1/2 teaspoon cayenne (more to taste)", "1 pound ripe tomatoes, peeled, seeded and chopped, or 1-14 1/2-ounce can, with juice", "2 leeks, white and light green parts only, cut in half lengthwise, cleaned of sand and sliced", "1/2 pound fingerling potatoes, sliced about 1/2 inch thick", "1/2 pound summer squash, diced", "About 2 1/2 quarts water", "2 tablespoons tomato paste", "A bouquet garni consisting of 3 sprigs each parsley and cilantro", "1 15-ounce can chickpeas, drained and rinsed thoroughly", "Freshly ground pepper", "2 cups Israeli couscous", "4 to 6 tablespoons finely chopped parsley, mint or cilantro, or a combination"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Cut the eggplant in half lengthwise and score down the middle, down to but not through the skin. Line a baking sheet with foil or parchment, brush with olive oil and place the eggplant on it, cut side down. Roast 15 to 20 minutes, until the skin is beginning to wrinkle. Remove from the heat and allow the eggplant to cool until you can handle it, then cut into 1-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy soup pot or Dutch oven over medium heat and add the onion. Cook, stirring, until it is tender, about 5 minutes, and stir in the garlic, the spices and salt to taste. Stir together for about 30 seconds, until the mixture is fragrant, and add the tomatoes. Cook, stirring often, until the tomatoes have cooked down slightly, 5 to 10 minutes. Stir in all of the vegetables, the tomato paste, and 2 to 2 1/2 quarts water, enough to cover the vegetables by a good inch. Add salt to taste, the bouquet garni and the chickpeas, bring to a gentle boil, reduce the heat, cover and simmer 30 minutes, until the vegetables are tender and the broth is fragrant. Taste and adjust seasonings. If serving the next day, remove from the heat and allow to cool, then refrigerate overnight. Bring back to a simmer about 30 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually add the Israeli couscous to the simmering stew, stirring all the while. Stir for a minute or two to make sure the couscous doesn’t clump together. Simmer over low heat for 15 to 20 minutes, until the couscous is tender. Add freshly ground pepper, taste and adjust salt. Stir in the herbs shortly before serving."}]}