{"@context": "http://schema.org", "@type": "Recipe", "name": "Couscous With Tomatoes, White Beans, Squash and Peppers", "description": "This hearty vegetarian dish, served with couscous, can be made ahead and uses the bounty of vegetables from late summer and early fall. And when the weather turns cold and winter rolls in, canned tomatoes are a fine substitute. The hot and the sweet peppers contribute great contrasting flavors.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/17/health/nutrition/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "couscous, vegetables, white beans, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 442, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "14 grams", "proteinContent": "21 grams", "saturatedFatContent": "1 gram", "sodiumContent": "725 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, chopped", "2 to 4 large garlic cloves (to taste), minced ", "Salt to taste", "1 1/2 teaspoons paprika", "1/2 teaspoon cayenne (more to taste)", "1 pound ripe tomatoes, peeled, seeded and chopped, or 1 14-ounce can, with juice", "2 cups dried white beans, soaked in 2 quarts water for 6 hours or overnight and drained", "A bouquet garni consisting of 3 sprigs each parsley and cilantro", "2 to 3 teaspoons harissa (more to taste), plus additional for serving", "1 pound bell peppers (red, green, yellow or mixed), seeded and cut in large dice", "2 Anaheim peppers, seeded and diced", "2 serranos or 1 to 2 jalapeños (more to taste), seeded and chopped", "1 pound summer squash, sliced or cut in large dice", "2 to 4 tablespoons chopped parsley, mint or cilantro, or a combination", "2 to 2 2/3 cups couscous (1/3 cup per serving)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, heavy soup pot or Dutch oven over medium heat and add the onion. Cook, stirring, until onion is tender, about 5 minutes, and stir in the garlic, the spices and salt to taste. Stir together for about 30 seconds, until the mixture is fragrant, and add the tomatoes. Cook, stirring often, until the tomatoes have cooked down slightly, 5 to 10 minutes. Stir in the beans, 2 quarts water and the bouquet garni. Bring to a gentle boil, reduce the heat, cover and simmer 1 hour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the harissa, sweet and hot peppers, squash and salt to taste. Bring back to a simmer and simmer 45 minutes to an hour, until the beans are tender. Stir in the chopped fresh herbs and simmer another 5 minutes. Taste and adjust salt. Remove a cup of the broth for seasoning the couscous. The stew should be spicy and flavorful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reconstituting and steaming the couscous: In a large microwave-safe bowl, combine the couscous and salt to taste. Drizzle the remaining olive oil over the couscous and add the cup of broth you removed from the stew. Stir well, or moisten your fingers and rub the couscous with them to evenly distribute the oil and broth. Add enough water to cover by 1/2 inch and let sit for 20 minutes, or until all of the liquid is absorbed. Stir every 5 minutes with a wooden spoon or rub the couscous between your moistened thumbs and fingers, so that the couscous doesn't lump. The couscous will now be fairly soft; fluff it with a fork or with your hands. The traditional way to finish reconstituting the couscous is to place it above the simmering stew for 45 minutes. I find, however, that steaming it in a microwave results in perfectly fluffy couscous. Cover the bowl tightly with plastic and pierce the plastic with the tip of a paring knife. Heat at 100 percent power for 3 minutes. Remove from the microwave carefully and allow it to sit for 1 minute. Carefully remove the plastic and fluff with forks or a spoon. Cover again with plastic and microwave for 2 to 3 more minutes. Be very careful when you remove the plastic, as the couscous will be steamy. You can reconstitute the couscous a day ahead and reheat in the microwave shortly before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the stew and the couscous. Serve the couscous in wide bowls or mound onto plates and top with the stew. Pass more harissa at the table."}], "link": "https://cooking.nytimes.com/recipes/12754-couscous-with-tomatoes-white-beans-squash-and-peppers"}