{"@context": "http://schema.org", "@type": "Recipe", "name": "Neige Aux Marrons Glaces", "description": "", "author": {"@type": "Person", "name": "Ken Hom"}, "image": null, "totalTime": "PT6H30M", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "sauces and gravies", "keywords": "candied chestnuts, egg yolks, sugar, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 330, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "0 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "111 milligrams", "sugarContent": "24 grams", "transFatContent": null}, "recipeIngredient": ["10 egg yolks", "1 1/4 cup sugar", "3 cups milk", "1 vanilla bean, split in half", "Pinch of salt", "1 cup creme de marron (French chestnut puree), see note", "2 1/4-ounce packages unflavored gelatin", "1/4 cup warm water", "Creme chantilly", "1/2 cup chopped marron glace (French candied chestnuts), see note", "28 to 32 store-bought ladyfingers", "2 tablespoons Cognac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the egg yolks in a large bowl and add the sugar and salt. Beat the mixture until it is thick, with a light yellow color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the milk and vanilla bean in a saucepan and bring the mixture almost, but not quite, to the boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the vanilla bean and gradually add the milk to the egg mixture, beating constantly until all the milk is fully incorporated. Pour this mixture back into a saucepan and cook over very low heat, constantly scraping the bottom with a spoon or whisk. Cook until it coats a spoon like a thick custard. Do not let the sauce boil, or it will curdle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately remove the saucepan from the stove, stirring constantly. Add the chestnut puree and mix well. Dissolve the gelatin in a quarter-cup of warm water and add this to the sauce. Stir until the gelatin is thoroughly dissolved. Let stand until thoroughly cooled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the creme chantilly (see recipe) and fold into the cooled sauce. Then fold in the marrons glace."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the bottom of a 4-by-12-inch rectangular collapsible mold with parchment paper. Trim and arrange the ladyfingers across the bottom of the mold. Sprinkle with one tablespoon of cognac. Add the sauce mixture halfway up the mold, then arrange another layer of ladyfingers in the same manner as before and sprinkle with the remaining cognac. Pour the remaining mixture to the top of the mold. Let it rest for two hours in the refrigerator, wrap well and place the mold in the freezer for at least three hours or more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to serve, unmold the neige and let it thaw for one hour in the refrigerator before serving. It may be served with a creme anglaise or a fruit puree sauce."}]}