{"@context": "http://schema.org", "@type": "Recipe", "name": "North African Meatballs", "description": "In France, meatballs are called boulettes, and by far the favorite versions are the spice-scented North African type. Most of the neighborhood Tunisian and Moroccan restaurants in Paris offer them, served as an appetizer or a side, or in a fragrant main-course tagine with couscous. \n\nThis recipe is an amalgam of several that I found on my bookshelf, among them one called boulettes tangéroises in an old French cookbook. Since I like things a bit spicier, my boulettes are more like Tunisian ones, in which hot pepper is more assertive.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/09/19/dining/19KITCH_SPAN/19KITCH_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings, about 36 meatballs", "recipeCuisine": "african", "recipeCategory": "dinner", "keywords": "beef, spices, tomato sauce, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1786}, "recipeIngredient": ["2 tablespoons olive oil", "1 and 1/2 cups finely diced onion", "3 garlic cloves, minced", "2 tablespoons tomato paste", "1 inch piece cinnamon stick", "Large pinch saffron, crumbled", "Salt and pepper", "3 cups chicken broth, vegetable broth or water", "1 and 1/2 cups cubed day-old firm white bread", "1 cup milk", "1 pound ground beef or lamb", "1 large egg, beaten", "1 teaspoon salt", "1/4 teaspoon black pepper", "4 garlic cloves, minced", "1/8 teaspoon grated nutmeg", "1 teaspoon ground ginger", "1 teaspoon turmeric", "2 teaspoons paprika", "1/4 teaspoon cayenne", "1/4 teaspoon ground cloves", "1/4 teaspoon ground coriander", "1/2 teaspoon ground cumin", "3 tablespoons chopped parsley", "3 tablespoons chopped cilantro", "3 tablespoons finely chopped scallion", "All-purpose flour, for dusting", "Olive oil or vegetable oil", "1 cup giant couscous, m’hamsa, or medium couscous", "2 tablespoons butter", "1/2 cup golden raisins, soaked in hot water to soften, then drained", "Salt", "1/4 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Heat oil over medium-high heat in a wide, heavy bottomed saucepan. Add onion and cook without browning until softened, about 5 minutes. Add garlic, tomato paste, cinnamon and saffron, and stir well to incorporate. Season generously with salt and pepper, and allow to sizzle for 1 minute more. Add broth and simmer gently for 5 minutes. May be made several hours in advance, up to a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meatballs: Put bread cubes and milk in a small bowl. Leave bread to soak until softened, about 5 minutes, then squeeze dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, put squeezed-out bread, ground meat and egg. Add salt, pepper, garlic, nutmeg, ginger, turmeric, paprika, cayenne, cloves, coriander and cumin. Mix well with hands to distribute seasoning. Add 2 tablespoons each of parsley, cilantro and scallion, and knead for a minute. May be prepared several hours in advance, up to a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With hands, roll mixture into small round balls about the size of a quarter. Dust balls lightly with flour. Heat a few tablespoons of oil, or a quarter-inch depth, over medium-high heat and fry meatballs until barely browned, about 2 minutes per side. Drain and blot on paper towel. Simmer meatballs in saffron-tomato sauce, covered, over medium heat for about 20 minutes, until tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the couscous, if desired: Cook according to package directions, fluff gently and stir in butter and raisins. Season with salt and cinnamon, and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish meatballs with remaining parsley, cilantro and scallion. Serve with couscous and roasted tomatoes if desired."}], "link": "https://cooking.nytimes.com/recipes/12763-north-african-meatballs"}