{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet Greens Frittata", "description": "The New York City Greenmarket Web site has a handy table that shows what’s available during each month of the year. It tells me, for example, that fresh beets are available from June through November, but that you can count on the greens only through September. Use whatever color beet you choose for this recipes. The red ones will be higher in anthocyanins, the pigment-based phytonutrients that are believed to have strong antioxidant properties. But yellow and pink beets have a lot going for them nutritionally as well. All beets are rich in folates, potassium and the B-complex vitamins niacin, pantothenic acid and pyridoxine. This is one of the most versatile dishes you can make with beet greens. Cut the frittata into wedges and serve as a main dish or into smaller diamonds and serve as an hors d’oeuvre. It packs well in a lunchbox, too.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/24/health/nutrition/24recipehealth-frittata/24recipehealth-frittata-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "beet greens, eggs, gluten-free, halal, healthy, kosher, low sugar, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 144, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "335 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 pound beet greens, stemmed and washed thoroughly", "2 garlic cloves, minced", "8 eggs", "Salt and freshly ground pepper to taste", "2 tablespoons milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large pot of water over high heat while you stem and wash the beet greens in 2 changes of water. When the water comes to a boil, salt generously and add the beet greens. Cook for about 1 minute, until tender, and transfer to a bowl of ice water. Let sit for a few minutes, then drain, squeeze dry and chop. Alternatively, steam the greens for 2 minutes over 1 inch of boiling water. Refresh with cold water, squeeze out excess water and chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a 10-inch nonstick skillet over medium heat and add the garlic. Cook, stirring, until it is fragrant, 30 seconds to a minute, and stir in the beet greens. Cook, stirring, for about 1 minute, until greens are coated with oil and fragrant. Season to taste with salt and pepper and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a whisk, beat the eggs in a bowl and whisk in salt to taste (about 1/2 teaspoon), freshly ground pepper and the milk. Stir in the cooked beet greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry your pan and return to the stove. Heat over medium-high heat and add the remaining tablespoon of olive oil. Hold your hand over the pan, and when you can feel the heat of the olive oil, test the heat by dropping a bit of egg into the pan. If it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with a spatula to let the eggs run underneath during the first few minutes of cooking. Turn the heat down to low, cover (use a pizza pan if you don’t have a lid that will fit your skillet), and cook 10 minutes, shaking the pan gently every once in a while. From time to time, remove the lid and loosen the bottom of the omelet with a spatula, tilting the pan so that the bottom doesn’t burn. It will, however, turn a deep golden brown. This is fine. The eggs should be just about set; cook a few minutes longer if they’re not. Meanwhile, heat the broiler. Finish the omelet under the broiler for 1 to 2 minutes, watching very carefully to make sure the top doesn’t burn (it should brown slightly, and it will puff under the broiler). Remove from the heat, shake the pan to make sure the omelet isn’t sticking (it will slide around a bit in the nonstick pan) and allow to cool for at least 5 minutes and up to 15. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Serve hot or at room temperature."}]}