{"@context": "http://schema.org", "@type": "Recipe", "name": "French Salt Cod and Potato Brandade", "description": "Your feelings about salt cod may depend on where your roots are. If your memories of the dish evoke words like bland and woolly, you likely had it in the Midwest. If you grew up in a Portuguese or Caribbean community, you may have more fond recollections. This recipe, common in France, is an opportunity to give salt cod a second chance, or to try it for the first time. The cod should be rinsed and soaked overnight, but that doesn’t take much effort. For tender fish, the trick is not to overcook it. Keep the flame low, just under a simmer. Cooking the fish in a combination of milk and water, along with a few aromatics like bay leaf, thyme, clove and peppercorns, will keep the fish sweet. While the cod is warm, flake it into a bowl and roughly mash with potatoes and moisten with garlicky olive oil and cream. A bit of cooking liquid is added to lighten the mixture. Serve smooth or chunky, as you like. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11cod/11cod-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "cod, milk, potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 100}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 553, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "53 grams", "saturatedFatContent": "9 grams", "sodiumContent": "5414 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound skinless, boneless salt cod", "1 cup milk ", "1 large thyme sprig", "1 bay leaf", "5 peppercorns", "2 allspice berries", "1 clove", "1 pound potatoes, peeled, cut in 1-inch cubes", "6 large garlic cloves, peeled", "Salt and pepper", "1/3 cup olive oil", "Pinch cayenne", "Grated nutmeg", "1/2 teaspoon grated lemon zest", "1/2 cup crème fraîche, plus 2 tablespoons", "3 tablespoons cold butter ", "1/2 cup coarse dry bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse salt cod well and rub off any salt. Soak in 2 quarts cold water. Drain and change water every few hours (an overnight soak without changing is fine). Total soaking time should be at least 8 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, heat milk plus 1 cup water over medium-high heat. Add soaked salt cod, thyme, bay leaf, peppercorns, allspice berries and clove. Adjust heat to maintain a bare simmer. Cook until fish flakes easily, about 15 minutes. Remove fish and hold at room temperature. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in another pot, cover potatoes with water and bring to a boil. Add garlic cloves and a good pinch of salt. Drain potatoes when they are soft, about 15 minutes, reserving cooking liquid and garlic. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cooked garlic cloves in a small saucepan and crush with a fork. Add olive oil and heat over a medium flame until quite warm to the touch. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put potatoes in a large mixing bowl. With your fingers, flake cooked salt cod on top. With a potato masher, roughly blend potatoes and fish. Drizzle in warm garlic oil and mash again. Add cayenne, nutmeg to taste and lemon zest. Stir in ½ cup crème fraîche and beat well to combine. Beat in about ½ cup cooking liquid to lighten mixture so it has the texture of soft mashed potatoes. Taste and adjust seasoning — it will probably need salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Use 1 tablespoon butter to grease a low-sided 1-quart baking dish or pie pan. Transfer brandade mixture to dish and smooth with a spatula. Paint the top with 2 tablespoons crème fraîche, and sprinkle with bread crumbs. Dot top with remaining butter. (May be prepared up to a day ahead and stored in the refrigerator; bring to room temperature before baking.) Bake until golden and bubbling, about 20 minutes. "}], "link": "https://cooking.nytimes.com/recipes/12777-french-salt-cod-and-potato-brandade"}