{"@context": "http://schema.org", "@type": "Recipe", "name": "Jean-Georges Vongerichten’s Fried Sushi Cakes", "description": "Jean-Georges Vongerichten's recipe here, for fried cakes of sushi-style rice topped with chipotle mayonnaise and raw scallop, then painted with a thin glaze of a soy-honey mixture, is just irresistible. (If I were an award committee, I’d give it “best of the year.”)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2012/09/18/dining/video-ricecakes/video-ricecakes-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "24 cakes, 6 to 12 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner", "keywords": "chipotle, mayonnaise, rice, scallops, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 44}, "recipeIngredient": ["1 and 1/2 cups short-grain sushi rice", "2 tablespoons mirin", "1 and 1/2 tablespoons rice-wine vinegar", "2-inch piece konbu", "1 tablespoon salt", "1 egg yolk", "1 teaspoon red-wine vinegar", "1 and 1/2 teaspoons orange juice", "2 teaspoons lime juice", "1 tablespoon chipotle in adobo, including some of the liquid", "1 teaspoon salt", "3/4 cup grapeseed oil", "1/4 cup olive oil", "1/2 cup light soy sauce", "1/2 cup honey", "2 tablespoons sherry vinegar", "1 tablespoon rice-wine vinegar", "Rice flour, for dredging (or substitute all-purpose flour)", "Grapeseed oil", "Coarse salt", "Minced scallions", "6 big scallops, each sliced into 4 pieces", "Minced cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine sushi rice, mirin, rice-wine vinegar, konbu and 1 tablespoon salt in a medium saucepan with 3 cups of water and bring to a boil. Cover with a lid wrapped in a damp cloth and reduce to a simmer. Cook for 20 minutes or until done. (Alternatively, use a rice cooker.) Remove from the heat and let sit for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8-by-8-inch baking dish with plastic wrap. Firmly press the rice into the pan. Refrigerate until set, preferably overnight. Remove the rice from the pan and, using a chef’s knife dipped in hot water to prevent sticking, cut into roughly 1-by-3-inch rectangles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chipotle mayonnaise: Combine the egg yolk, red-wine vinegar, orange juice, lime juice, adobo and liquid and 1 teaspoon salt and purée in a food processor or blender. Add the 3/4 cup grapeseed oil and the olive oil in a drizzle and process until smooth, thick and creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the honey soy sauce: In a small saucepan, bring the soy sauce, honey, sherry vinegar and 1 tablespoon rice-wine vinegar to a boil and stir until smooth. Cool before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grapeseed oil in a pan, deep enough to just about cover the rectangles. A broad skillet will require more oil than a deep saucepan, but will allow you to cook more pieces at once. Allow oil temperature to reach 350 to 360 degrees. Dredge the rice rectangles in rice flour and cook until golden and crispy, about 5 minutes total, turning once; transfer to paper towels and season with salt"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine chipotle mayonnaise and scallions. Top each rectangle with a bit of the mayonnaise, then drape with a piece of raw scallop. Brush or drizzle with honey soy, then garnish with a bit of cilantro and a tiny pinch of salt."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Fried Sushi Cakes With Scallops", "description": "Jean-Georges Vongerichten shows Mark Bittman how to make fried sushi cakes with scallops, honey soy sauce and chipotle mayonnaise.", "thumbnailUrl": "https://static01.nyt.com/images/2012/09/18/dining/video-ricecakes/video-ricecakes-mediumThreeByTwo440.jpg", "uploadDate": "2012-09-18T19:26:50.000Z", "duration": "PT6M45S"}, "link": "https://cooking.nytimes.com/recipes/12771-jean-georges-vongerichtens-fried-sushi-cakes"}