{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini Frico", "description": "It may be daunting to imagine, but this dish is really quite simple. All you do is take some good hard cheese, grate it, spread it in a nonstick pan and let it melt until it turns golden. Montasio is traditional, but Parmesan, asiago or a young, not too salty pecorino will all work well, too, so use whatever you have. You can form frico into small individual crackers for neater serving, or you can make one large cracker the size of your pan and break it apart as you devour it. Frico on its own doesn’t need much embellishment. All it truly requires is a chilled cocktail or a glass of Italian white wine served alongside. But this one incorporates zucchini. First, I browned thin rounds of zucchini in olive oil, then I topped them with the cheese and let them cook. It took only five minutes, plus another minute or so to let the cheese crisp up after I turned it out of the pan.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/07/10/dining/zucchinifrico/zucchinifrico-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 hors d'oeuvres servings", "recipeCuisine": "italian", "recipeCategory": "quick", "keywords": "appetizer, parmesan, zucchini, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 121}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 86, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "262 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["Olive oil, for brushing", "1 medium Romanesco zucchini, sliced into 1/4-inch rounds", "4 ounces Parmesan, grated medium-fine (about 1 cup)", "Fresh basil leaves", "Cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a large nonstick skillet with oil and heat over medium-high until hot. Arrange half the zucchini rounds in a single layer, allowing about an inch of space between them. Cook, without moving them, until undersides are dark golden, about 2 minutes. Carefully flip and cook until golden, about 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle half the cheese evenly over zucchini and into the spaces between it. Cook, without moving, until cheese looks lacy and translucent, and no longer sticks to the pan, about 5 minutes. Tip the skillet and using a spatula, gently help slide the frico in one piece onto a large plate. Sprinkle with torn basil and finish with pepper. Repeat with remaining zucchini and cheese. Break into pieces to serve."}]}