{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet and Beet Green Fritters", "description": "I’ve modeled these delicious and easy grated beet fritters after traditional Greek zucchini fritters. Make sure to buy beets that have a generous amount of greens attached. Don’t be alarmed by the amount of oil: About half of it will still be in the pan when you’re finished, if you are careful to get it hot enough before you add the fritters.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/27/health/nutrition/27recipehealth-fritters/27recipehealth-fritters-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "16 to 18 fritters, serving 5 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, beet, bread crumbs, herbs, halal, healthy, high fiber, kosher, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 364, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "5 grams", "sodiumContent": "518 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bunch beets, with greens, peeled and grated on the wide holes of a grater or food processor (about 1 to 1 1/4 pounds beets)", "Salt", "Greens from 1 bunch beets, stemmed and washed in 2 changes of water", "2 eggs", "1/2 cup chopped mixed fresh herbs, like as fennel, dill, mint, parsley ", "2 teaspoons ground cumin", "1 teaspoon ground caraway", "1 cup fresh or dry bread crumbs (more as necessary)", "Freshly ground pepper", "2 ounces feta, crumbled (1/2 cup)", "All-purpose flour as needed and for dredging", "1/4 cup canola oil", "1/4 cup extra virgin olive oil", "Plain Greek-style yogurt or aioli for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the beets generously and leave them to drain in a colander placed in the sink or in a bowl for 1 hour, tossing and squeezing the beets from time to time (wear rubber gloves to protect your hands from the color). After an hour, take up the grated beets by the handful, squeeze out as much liquid as you can and transfer to a bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beets are draining, heat a large pot of water over high heat and stem and wash the beet greens in 2 changes of water. When the water comes to a boil, salt generously and add the beet greens. Cook for about 1 minute, until tender, and transfer to a bowl of ice water. Let sit for a few minutes, then drain, squeeze dry and chop fine. Alternatively, steam the greens for 2 minutes above 1 inch of boiling water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the eggs and add the grated beets, herbs, cumin, caraway, beet greens, bread crumbs, salt and pepper to taste, and feta. Mix together well. Take up a small handful (one to 2 tablespoons) of the mixture, and if it presses neatly into a patty, it is the right consistency. If it seems wet, add more bread crumbs or a few tablespoons of all-purpose flour. When the mixture has the right consistency, cover the bowl with plastic wrap and refrigerate for one hour or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the oils in a large frying pan and heat until rippling, about 275 degrees. Meanwhile, take up heaped tablespoons of the beet mixture and form patties. Lightly dredge in flour. Carefully transfer to the pan, taking care to fry them in batches so you don’t crowd the pan, and fry until patties are golden brown on both sides. Use tongs, a slotted spatula or a spider to turn the fritters over. Remove from the oil and drain briefly on a rack, then serve, with yogurt or aioli if desired."}], "link": "https://cooking.nytimes.com/recipes/12781-beet-and-beet-green-fritters"}