{"@context": "http://schema.org", "@type": "Recipe", "name": "Malaysian-Style Ginger-Chile Crab", "description": "Steamed crabs are great. But this recipe takes them a step further, into the luxurious, spicy territory of Malaysia, where the cooked crabs are sautéed fiercely with an enormous amount of chopped ginger and chiles, garlic and curry powder before you serve them under a spray of sliced scallions. Eat with your hands. All but the most fastidious eaters should consider wearing a bib. ", "author": {"@type": "Person", "name": "John Willoughby And Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2014/03/07/dining/07crab/07crab-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "malaysian", "recipeCategory": "dinner", "keywords": "crab, ginger, dairy-free, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 146, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "191 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 dozen live blue crabs (or use precooked crabs)", "1/4 cup vegetable oil", "1/2 cup minced ginger", "1/4 cup minced fresh chile peppers of your choice (or substitute sriracha sauce)", "1/4 cup minced garlic", "2 tablespoons curry powder", "1/2 cup thinly sliced scallions, white and green parts", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using live crabs, pour water in a large pot to a depth of 1 1/2 inches. Bring to a boil over high heat, add crabs, turn heat to medium-high, cover and steam until crabs are bright orange-red and all the blue-green color is gone, about 15 to 20 minutes. Remove from heat and rinse under cold running water. (If using precooked crabs, skip to Step 2.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the crabs: Grasp the top shell at the front, pull it away from the body and discard it. Turn the crab over, pry off the triangular apron and discard it, along with the spongy white gills. Grab the legs and claws close to the body, twist them off, and crack the claws lightly with a hammer. Discard the legs (or, if you are a crab fanatic, suck the meat out of them). You want to end up with a body and 2 claws, including knuckles, from each crab. Snap the body in half, using a chef’s knife to cut through the shell if necessary. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan, heat 2 tablespoons oil over high heat until it just begins to smoke. Add half the crab bodies and claws and sauté, tossing frequently with your tongs, for about 3 minutes. Add half of each of the remaining ingredients, except the salt and black pepper. Cook, stirring frequently, for 1 minute more. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove everything from pan, add remaining 2 tablespoons oil, and repeat with remaining crabs and ingredients. Season with salt and black pepper. Serve warm or room temperature, with nutcrackers and picks."}]}