{"@context": "http://schema.org", "@type": "Recipe", "name": "Parsley Hummus", "description": "I’m convinced that parsley, used so abundantly in the cuisines of Greece, Turkey, the Middle East and North Africa, is one reason those diets are so healthy. In addition to being an excellent source of vitamins A, C and K and a good source of iron and folate, it is rich in volatile oils (which give it its astringent flavor) and flavonoids. The volatile oils contain components that have been shown to inhibit the activity of harmful elements in the body, and studies have attributed antioxidant properties to the flavonoids, particularly luteolin. It’s important to pick the parsley leaves off the stems, because unlike the stems of cilantro, parsley stems are tough and should be discarded. The leaves reduce quite a bit in volume when you chop them, especially if you chop them fine. Two cups of parsley leaves will yield a little over 1/2 cup of finely chopped parsley. This hummus has a pale green hue and herbal overtones.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/01/health/nutrition/01recipehealth/01recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "2 cups", "recipeCuisine": "middle eastern", "recipeCategory": "easy, quick, condiments, dips and spreads", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low-carb, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 114}, "recipeIngredient": ["2 cups cooked chickpeas", "2 large garlic cloves, peeled, cut in half, green shoots removed", "2 cup flat-leaf parsley leaves", "Salt to taste", "1/4 cup fresh lemon juice", "1/4 cup extra virgin olive oil, plus additional for drizzling if desired", "3 tablespoons sesame tahini, stirred well if the oil has separated", "Plain low-fat yogurt as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "(Optional step): If you want to take the time to do this, remove the papery outer shells of the cooked chickpeas by gently squeezing them between your thumb and first two fingers. Discard the shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade and drop in the garlic. Process until the garlic adheres to the sides of the bowl. Turn off the machine and scrape down the sides of the bowl. Add the chickpeas, parsley and salt to taste and process to a coarse purée. Stop the machine and scrape down the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on the machine and add the lemon juice and olive oil with the machine running. Add the tahini and process until the hummus is smooth. It should not be too thick or dry. If it is, thin out as desired with yogurt or water, or with the broth from the chickpeas if you cooked them. Season to taste with salt. Scrape out into a bowl or mound on a platter. Run a fork over the surface and drizzle with olive oil if desired. Serve with crudités or pita bread."}]}