{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatballs", "description": "This fast recipe for meatballs came to The Times from the actor and director Stanley Tucci, who compiled his Italian-American family’s recipes into “The Tucci Cookbook” in 2012. Make sure the bread for this is really dry  --  it will improve the meatballs’ texture. And if they are to be used in sauce, undercook them slightly before adding them to the sauce. (The New York Times)", "author": {"@type": "Person", "name": "Frank Bruni"}, "image": "https://static01.nyt.com/images/2014/04/17/dining/Meatballs/Meatballs-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings (about 12 large meatballs)", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick", "keywords": "beef, cheese, italian bread, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 253}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 399, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "34 grams", "saturatedFatContent": "6 grams", "sodiumContent": "550 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["10 1-inch-thick slices of dry Italian bread ", "1 pound ground beef chuck", "2 tablespoons chopped fresh Italian flat-leaf parsley, more to taste ", "2 cloves garlic, finely chopped, more to taste", "1 large egg", "5 tablespoons finely grated pecorino Romano, more to taste", "Kosher salt and black pepper to taste", "2 tablespoons olive oil, more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 6 slices dried bread in a bowl and cover with warm water. Set aside until bread softens, about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, combine meat, parsley, garlic, egg, cheese and salt and pepper to taste, using your hands to mix the ingredients. Remove and discard crust from each slice of soaked bread. Squeeze water out of bread and, breaking it into small pieces, add it to meat. Work bread into meat until they are equally combined and mixture holds together like a soft dough. Moisten remaining slices of dried bread and add as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm 2 tablespoons olive oil in a large frying pan set over medium- to medium-low heat. Scoop out a tablespoon of meat mixture. Roll between the palms of your hands to form a ball about 3/4 of an inch in diameter. Cook meatball until well browned on all sides, about 8 minutes. (A meatball that sticks to the pan is not ready to be turned.) Taste the meatball, and if needed, adjust seasoning of remaining mixture by adding more garlic, parsley, cheese and salt and pepper. Remaining meatballs should be 1 1/2 inches in diameter. Cook meatballs in small batches. As each batch is completed, remove to a warmed serving plate. Add oil to pan as necessary. Serve when all the meatballs are cooked. "}]}