{"@context": "http://schema.org", "@type": "Recipe", "name": "Tucci Ragù", "description": "This recipe, a contemplation on classic Italian cooking, is adapted from “The Tucci Cookbook,” a book of recipes from the actor and director Stanley Tucci’s food-obsessed family. It will take some time, so set aside an afternoon, say, a Sunday in the fall, when browning meat and listening for the correct simmer are exactly what you want to do. (The New York Times)", "author": {"@type": "Person", "name": "Frank Bruni"}, "image": null, "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "beef, pork, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 376, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "5 grams", "proteinContent": "25 grams", "saturatedFatContent": "6 grams", "sodiumContent": "273 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup olive oil ", "1 pound stewing beef, trimmed of fat, rinsed, patted dry and cut into pieces", "1 pound country-style spareribs, trimmed of fat, rinsed, patted dry and cut in half", "1 cup coarsely chopped onions ", "3 cloves garlic, coarsely chopped", "1/2 cup dry red wine", "1 6-ounce can tomato paste", "8 cups whole plum tomatoes (about two 35-ounce cans), passed through a food mill or puréed in a blender or food processor", "3 fresh basil leaves ", "1 tablespoon chopped fresh oregano leaves, or 1 teaspoon dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stew pot over medium-high heat, warm olive oil. Sear stewing beef until brown on all sides, about 10 minutes. Remove from pot, set aside in a bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add spareribs to pot and sear until brown on all sides, about 10 minutes. Remove ribs and set aside in bowl with stewing beef. (If your pot is big enough to hold all the meat in a single layer, it may be cooked at the same time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir onions and garlic into pot. Reduce heat to low and cook until onions begin to soften, about 5 minutes. Stir in wine, scraping bottom of the pot clean. Add tomato paste to pot. Pour 1/2 cup warm water into tomato paste can to loosen any residual paste and then pour into pot. Cook to warm the paste through, about 2 minutes. Add tomatoes along with additional 1 cup warm water. Stir in basil and oregano. Cover with lid slightly askew and simmer about 30 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return meat to pot, along with any juices that accumulated in bowl. Cover with lid slightly askew and simmer, stirring frequently, until meat is very tender and tomatoes are cooked, about 2 hours. Warm water may be added to sauce, in 1/2-cup portions, if sauce becomes too thick. "}], "link": "https://cooking.nytimes.com/recipes/12797-tucci-ragu"}