{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Rolls With Tofu, Vegetables, Rice Noodles and Herbs", "description": "Most spring rolls come with dipping sauce. I decided to put the dipping sauce on the inside, spread on the tofu, for a more portable, flavorful roll.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/09/health/nutrition/09recipehealth/09recipehealth-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "8 substantial spring rolls", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "appetizer, side dish, dairy-free, halal, healthy, kosher, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, fresh herbs, rice noodles, tofu, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 189, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "331 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces rice vermicelli", "1/4 cup rice vinegar", "2 teaspoons soy sauce", "1/4 pound firm tofu, cut into dominoes 1/4 inch thick by 1/2 inch wide and drained on paper towels", "2 tablespoons peanut-ginger sauce", "2 large carrots, peeled and grated", "2 medium turnips or 1/2 daikon radish, peeled and grated", "6 shiitake mushrooms, stems removed, cut in thin slices", "1/2 cup coarsely chopped cilantro, chopped, plus additional sprigs", "1/3 cup mint leaves, coarsely chopped, plus additional leaves", "1/4 cup Thai basil leaves, coarsely chopped, plus additional leaves (may substitute regular basil if you can’t get the Thai variety)", "Salt to taste", "8 to 10 inner romaine lettuce leaves, cut in chiffonade (crosswise strips)", "8 8 1/2-inch rice flour spring roll wrappers", "3 tablespoons creamy peanut butter, unsalted and unsweetened", "1 tablespoon rice vinegar", "2 teaspoons soy sauce", "1 to 2 teaspoons light brown sugar, to taste", "1 1/2 teaspoon ginger juice (grate 1 tablespoon ginger, wrap in cheesecloth and squeeze)", "Cayenne to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice noodles in a large bowl and cover with hot water. Soak for 20 minutes, or until pliable. Meanwhile, bring a large pot of water to a boil. Drain the noodles and add to the boiling water. Boil 1 minute and drain. Rinse with cold water and transfer to a bowl. Using kitchen scissors, cut the noodles into 2-inch lengths. Toss with 2 teaspoons of the rice vinegar and the soy sauce"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a small amount of peanut sauce on each cut piece of tofu"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shredded carrots, turnips, slivered mushrooms and chopped herbs in a large bowl and toss with 2 tablespoons of the rice vinegar and salt to taste. Place the lettuce in another bowl and toss with the remaining vinegar and salt to taste"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with warm water and place a spring roll wrapper in it just until it is pliable, about 30 seconds. Remove from the water and drain briefly on a kitchen towel. Place the wrapper on your work surface in front of you and arrange several cilantro sprigs, whole mint leaves and basil leaves, vein side up, on the wrapper. Leaving a 2-inch margin on the sides, place a handful of the carrot mixture on the wrapper, slightly nearer to the edge closest to you. Top with 3 pieces of tofu, then a handful of lettuce, and finally a handful of noodles. Fold the sides in, then roll up the spring rolls tightly, squeezing the filling to get a tight roll. Refrigerate until ready to serve. If desired, serve with more peanut sauce, thinned out with water, or with another dipping sauce of your choice"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Peanut-Ginger Sauce", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together all of the above ingredients. Spread onto the tofu pieces. For serving, add 2 to 4 tablespoons water or more as desired to thin out"}]}], "link": "https://cooking.nytimes.com/recipes/12819-spring-rolls-with-tofu-vegetables-rice-noodles-and-herbs"}