{"@context": "http://schema.org", "@type": "Recipe", "name": "Potatoes au Gratin", "description": "The humble potato gets the red carpet treatment in this easy yet luxurious recipe for potatoes au gratin. Sliced Yukon Gold or russet potatoes (you can use either, but don't use a combination as they cook at different rates) are layered with half-and-half or heavy cream, topped with butter and grated cheese, then baked until golden and bubbly. Feel free to play around: Add leeks, onions, garlic or more cheese between the layers. Experiment with fresh or dried herbs. It's incredibly adaptable and practically foolproof. Just don't forget to season with salt and pepper as you go. Like all potato dishes, it needs plenty of seasoning.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2018/12/01/dining/mb-gratin/merlin_147141342_5554df8b-75f7-4e2e-b7ed-7284671a6426-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "dinner, casseroles, vegetables", "keywords": "butter, half and half, potato, gluten-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 392}, "recipeIngredient": ["3 to 4 pounds potatoes, peeled and cut into 1/4-inch slices", "Kosher salt and black pepper", "2 tablespoons unsalted butter", "2 to 3 cups half-and-half or heavy cream", "1/4 cup grated Parmesan or Gruyère", "Pinch of nutmeg (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Seasoning each layer with salt and pepper as you go, layer the potatoes in a 10- or 12-inch ovenproof skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dot the top with 2 tablespoons butter. Pour in half-and-half. (It should come about 3/4 of the way to the top.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil over medium-high heat. Reduce to low and cook for 10 minutes, uncovered, until the half-and-half has reduced by about half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the oven and bake until the top is golden brown, about 10 minutes. Reduce heat to 300 degrees and cook until the potatoes are fork tender and the top is nicely browned, about 8 minutes more. Top with grated cheese and return to the oven until the cheese is melty and golden brown, about 3 to 5 minutes. Sprinkle with a pinch of nutmeg, if using, and serve."}]}