{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Chicken With Greens", "description": "The chicken is not the centerpiece of this stir-fry, and you can leave it out, or use tofu instead, for a vegetarian version. It adds flavor and some substance, but this stir-fry is mostly about antioxidant-rich cruciferous vegetables, with a red pepper thrown in for color, adding its own set of nutrients (anthocyanins, beta carotene, vitamin C).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/16/science/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 main-dish servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "bok choy, chicken, kale, dairy-free, healthy, high fiber, kosher, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 141}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "19 grams", "saturatedFatContent": "2 grams", "sodiumContent": "734 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces boneless, skinless chicken breast, cut across the grain into 1/4-inch-thick by 1/2-inch-wide pieces", "1 tablespoon egg white, lightly beaten", "2 teaspoons cornstarch", "1 1/2 teaspoons plus 1 tablespoon rice wine or dry sherry", "Salt to taste", "1/4 cup chicken stock or vegetable stock", "1 tablespoon low-sodium soy sauce", "1 bunch kale, stemmed and washed well in 2 rinses of water", "2 tablespoons peanut oil, rice bran oil or canola oil", "1 tablespoon minced ginger", "2 fat garlic cloves, minced", "1/2 teaspoon red pepper flakes", "4 to 6 scallions (1/2 bunch), cut on the diagonal in 1/2-inch lengths, dark green part separated", "6 to 8 brussels sprouts, quartered (about 1/2 pound)", "1 small or 1/2 large red bell pepper, cut in thin 2-inch strips", "1/2 pound baby bok choy, cut in 1-inch slices", "Freshly ground pepper", "Rice, whole grains or noodles for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, stir together the egg white, cornstarch, 1 1/2 teaspoons of the rice wine or sherry, salt to taste and 1 1/2 teaspoons water. When you can no longer see any cornstarch, add the chicken and stir together until coated. Cover the bowl and place in the refrigerator for 30 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 to 3 quarts of water to a rolling boil in a large saucepan and add the kale. Boil 1 minute, until just tender, and transfer to a bowl of cold water. Do not drain the water from the pot. Drain the kale, squeeze out excess water and chop coarsely"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the remaining rice wine, the stock and the soy sauce in a small bowl and set near your wok"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water in the pot back to a boil, add 1 tablespoon of the oil and turn the heat down so that the water is at a bare simmer. Carefully add the chicken to the water, stirring so that the pieces don’t clump. Cook until the chicken turns opaque on the surface but is not cooked through, about 1 minute. Drain well in a colander"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in the remaining oil by adding it to the sides of the pan and swirling the pan, then add the garlic, ginger and red pepper flakes and stir-fry for no more than 10 seconds. Add the white and light green pieces of scallions, the brussels sprouts and the red pepper and stir-fry for 2 minutes. Add the bok choy and stir-fry for another minute. Add the chicken, the kale and the broth mixture. Sprinkle with salt and pepper to taste and stir-fry until the chicken is cooked through, 1 to 2 minutes. Sprinkle on the green scallion ends. Remove from the heat and serve with grains or noodles"}], "link": "https://cooking.nytimes.com/recipes/12867-stir-fried-chicken-with-greens"}