{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Chinese Broccoli and Chicken With Hoisin", "description": "The extra step to “velvet” the chicken is worth it for such tender, succulent chicken. I always look for sustainably raised chicken. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/16/science/15recipehealth/15recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "3 main-dish servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "broccoli, chicken, noodles, dairy-free, gluten-free, healthy, high fiber, kosher, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 229}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 328, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "32 grams", "saturatedFatContent": "2 grams", "sodiumContent": "794 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces boneless, skinless chicken breast, cut across the grain in 1/4-inch-thick slices", "1 tablespoon egg white, lightly beaten", "2 teaspoons cornstarch", "1 1/2 teaspoons plus 1 tablespoon rice wine or dry sherry", "Salt to taste", "2 tablespoons hoisin sauce", "1 teaspoon low-sodium soy sauce", "2 tablespoons peanut oil, rice bran oil or canola oil", "1 bunch Chinese broccoli (about 1 pound), ends trimmed", "1 tablespoon minced ginger", "2 fat garlic cloves, minced", "1/2 teaspoon red pepper flakes", "8 shiitake mushrooms, stems removed, sliced thin", "Rice, whole grains or noodles for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, stir together the egg white, cornstarch, 1 1/2 teaspoons of the rice wine or sherry, salt to taste and 1 1/2 teaspoons water. When you can no longer see any cornstarch, add the chicken and stir together until coated. Cover the bowl and place in the refrigerator for 30 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 quarts of water to a rolling boil in a large saucepan and add the Chinese broccoli. Boil 2 minutes, until it is just crisp-tender, and transfer it to a bowl of cold water. Do not drain the water from the pot. Drain the broccoli and dry on paper towels. Cut into 2-inch lengths"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the remaining rice wine, the hoisin sauce and the soy sauce in a small bowl and set near your wok"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water in the pot back to a boil, add 1 tablespoon of the oil and turn the heat down so that the water is at a bare simmer. Carefully add the chicken to the water, stirring so that the pieces don’t clump. Cook until the chicken turns opaque on the surface but is not cooked through, about 1 minute. Drain in a colander"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in the remaining oil by adding it to the sides of the pan and swirling the pan, then add the garlic, ginger and red pepper flakes and stir-fry for no more than 10 seconds. Add the mushrooms, chicken, broccoli, hoisin sauce mixture and salt to taste.  Stir-fry for 1 to 2 minutes, until the chicken is cooked through, and serve with grains or noodles"}], "link": "https://cooking.nytimes.com/recipes/12865-stir-fried-chinese-broccoli-and-chicken-with-hoisin"}