{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage and Carrot Noodles With Egg", "description": "This is based on Grace Young’s Cilantro Chili Noodles With Egg. I added cabbage and carrots to the mix, and I’ve given a choice of rice noodles or glass noodles, also known as bean threads, made with mung bean flour. They’re both treated the same way. Bean thread noodles have more texture, even after softening in warm water. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/16/science/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "cabbage, carrot, noodles, dairy-free, gluten-free, halal, healthy, kosher, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 110}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 248, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "454 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces rice noodles or glass noodles", "1/2 cup chicken or vegetable stock", "2 tablespoons soy sauce", "2 teaspoons rice vinegar", "1/2 teaspoon sugar", "2 tablespoons peanut oil, rice bran oil or canola oil", "2 large eggs, beaten", "Salt to taste", "1 to 2 green chilies, like jalapeño or serrano, minced", "2 plump garlic cloves, minced", "1 tablespoon minced ginger", "4 cups thinly sliced green cabbage", "2 cups shredded carrots", "1 cup chopped cilantro leaves and stems", "1/8 teaspoon freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the noodles in a bowl and cover with warm water. Let sit for 20 minutes, until pliable. Drain in a colander and cut into 6-inch lengths with kitchen scissors. Set aside"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the broth, soy sauce, rice vinegar and sugar in a small bowl"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Meanwhile, beat 1 of the eggs in a bowl and add salt to taste. Swirl 1 teaspoon of the oil into the wok and add the egg, using a rubber spatula to scrape out every last bit. Tilt the wok to spread the egg into a pancake and cook until set, 30 seconds to a minute. Using a metal spatula, flip over the egg pancake and brown it for about 5 seconds, then transfer to a cutting board. Allow to cool and cut into 2-inch-long by 1/4-inch-wide slices. Repeat with the other egg"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining oil to the wok, swirl the pan, then add the garlic, ginger and chili and stir-fry for no more than 10 seconds. Add the cabbage and carrots and stir-fry 1 to 2 minutes, then add the noodles, the broth mixture and salt to taste. Turn the heat down to medium and stir-fry for about 2 minutes, until the noodles are just tender and the broth has evaporated. Sprinkle with salt and pepper, add the eggs and cilantro, and stir-fry for another 30 seconds to a minute. Serve"}], "link": "https://cooking.nytimes.com/recipes/12868-cabbage-and-carrot-noodles-with-egg"}