{"@context": "http://schema.org", "@type": "Recipe", "name": "Celeriac Rémoulade", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT20M", "recipeYield": "At least 4 servings", "recipeCuisine": "french", "recipeCategory": "quick, condiments", "keywords": "celeriac, eggs, oil, dairy-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 282, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "4 grams", "sodiumContent": "215 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 big or 2 small celeriacs", "1 egg ", "2 teaspoons Dijon mustard, or more to taste", "Salt and freshly ground black pepper", "1 tablespoon sherry vinegar, white wine vinegar, or freshly squeezed lemon juice, or more to taste", "1/2 cup olive oil", "1/2 cup neutral oil, like grape seed or corn", "Chopped parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "This is the hard part: trim the celeriac. You must be fearless and ruthless, but conservative. Cut off the top of the less squiggly end, and then cut down along the sides, following the contour of the root and taking as little of the flesh as possible. You will find much of the bottom part comes off more easily than you&rsquo;d imagine. When you&rsquo;re nearly done, use a paring knife to trim out as much of the brown skin as you can &mdash; but don&rsquo;t worry if you leave a few bits. Julienne by hand (you&rsquo;re a better man than I, if you do!) or with the grating disk of a food processor, which will take no time at all. Sprinkle with a little salt and put into a serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mayonnaise in the food processor: Put the egg, mustard, salt, pepper and acid in a food processor (preferably with a small bowl) and turn on the machine. While it&rsquo;s running, add the oil in a slow, steady stream. (Most food processors have a hole in the feed tube for this purpose; you can just dump all the oil in the feed tube. Amazing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mayonnaise by hand: Put the egg, mustard, salt, pepper and acid in a medium bowl. Beat together with a wire whisk or a fork. Begin to add the oil in dribbles as you beat, adding more as each amount is incorporated. You&rsquo;ll notice when a thick emulsion forms, then you can add the remaining oil a little faster. Depending on how fast you beat, the whole process will take about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and adjust the seasoning. For this dish, the mayonnaise should be a little thin, so add a tablespoon or 2 of water, again with the machine running or whisking by hand. Use immediately or refrigerate for about a week. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the julienned celeriac with enough mayonnaise to bind; you won&rsquo;t use the whole cup. Stir in some parsley and garnish with a little more. Serve.  "}]}