{"@context": "http://schema.org", "@type": "Recipe", "name": "Teff and Oatmeal Pancakes", "description": "Teff is a tiny, nutrient-dense grain native to Ethiopia. Its calcium content is higher than that of any other grain, and it’s an excellent source of vitamin C. It has a low glycemic index and is gluten-free, though these pancakes are not. I grind the tiny grains into flour in my spice mill, but you can also find teff flour in whole-foods stores.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/23/science/25recipehealth/25recipehealth-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "20 pancakes", "recipeCuisine": "", "recipeCategory": "breakfast, easy", "keywords": "buttermilk, flour, teff, halal, healthy, kosher, low cholesterol, low-fat, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 73}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 118, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "163 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup (200 grams) ground teff or teff flour", "1 cup (140 grams) whole-wheat flour", "2 teaspoons baking powder", "1 teaspoon baking soda", "1/4 teaspoon salt", "2 eggs", "2 tablespoons agave nectar or 1 tablespoon blackstrap molasses and 1 tablespoon agave nectar", "1 3/4 cups buttermilk", "2 tablespoons canola oil", "1 teaspoon vanilla extract", "1 cup (270 grams) cooked oatmeal (rolled oats, not steel-cut; 1/2 cup uncooked)", "Butter or oil as needed for cooking", "1 cup blueberries, preferably organic", "1 teaspoon unbleached all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flours, baking powder, baking soda and salt"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the eggs. Whisk in the agave syrup and molasses (if using), buttermilk, canola oil and vanilla. Quickly whisk in the flour mix. Do not overwork the batter. Stir in the cooked oatmeal"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a griddle or a large skillet, either nonstick or seasoned cast iron, over medium-high heat. Brush with butter or oil. Use a 1/4-cup ladle or cup measure to drop 3 to 4 tablespoons of batter per pancake onto your heated pan or griddle"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the berries with 1 teaspoon flour in a bowl. Place 6 to 7 berries on each pancake (more if using small wild blueberries), gently pressing them down into the batter. When bubbles break through the pancakes, flip the pancakes over and cook for another minute, or until they are brown on the other side. Serve right away, or allow to cool and wrap individual servings in plastic, then place in a freezer bag and freeze"}]}