{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Chicken Breasts With Polenta and Salsa", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT40M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "chicken breast, polenta", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 522, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "9 grams", "proteinContent": "30 grams", "saturatedFatContent": "9 grams", "sodiumContent": "739 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups instant polenta", "4 tablespoons unsalted butter", "1/2 cup coarsely grated Parmigiano-Reggiano", "Salt and freshly ground black pepper", "3 small ripe avocados, skinned and pitted", "4 tablespoons lime juice", "1 small red onion, finely diced", "2 jalapeno or serrano chilies, seeded and minced", "2 tablespoons fresh coriander leaves plus 4 coriander sprigs", "1 tablespoon olive oil", "4 large chicken breasts, halved", "8 ripe plum tomatoes", "4 scallions, finely chopped", "2 large heads arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 6 cups of water to a boil. Carefully whisk in the polenta to prevent lumps from forming. Reduce the heat, and continuously stir the mixture until it thickens (just a couple of minutes). Remove from the heat, and stir in the butter and cheese. Season with salt and pepper. Spoon into a greased 9-by-13-inch baking dish, and spread evenly with a spatula. Allow to cool. Refrigerate, if making ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the guacamole, puree the avocados with the lime juice in a food processor. Stir in the onion, a quarter to a half of the minced chilies and the coriander leaves. Season to taste with salt and pepper. Refrigerate, if making ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat the olive oil in a large nonstick pan. Add the chicken, skin-side down, and brown over high heat. Turn, and brown on the other side. Reduce the heat to medium-high, and cook the chicken until it is done, a total of about 20 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the salsa. Trim the tomatoes, quarter them and place in the food processor along with the coriander sprigs, scallions and the remaining minced chilies (or less to taste). Process until coarse. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to brown the polenta, preheat the broiler. Turn out the polenta from its dish onto an oiled baking sheet, and place under the hot broiler until the surface begins to puff and brown, 3 to 5 minutes. The polenta can broil while chicken is cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In center of a plate, place a pool of salsa. Place the polenta on top of the salsa. Arrange a few arugula leaves on the side; place a piece of chicken on the arugula, and top the chicken with guacamole."}]}