{"@context": "http://schema.org", "@type": "Recipe", "name": "Pretzel Pork and Chive Dumplings With Tahini", "description": "In Park Slope, Dale Talde engineered one of the most hunted-down bar snacks of 2012, a beer-friendly, street-cart collision known as the “pretzel dumpling.” Inside, there’s some slightly cured pork. Outside, a process of boiling, brushing, pan-searing and baking creates a skin with the crust and chew of a hot pretzel. The dipping sauce echoes what you might get at a deli, or in a bag full of Chinese takeout: strong mustard.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2012/10/21/dining/video-dumplings/video-dumplings-mediumThreeByTwo440-v3.jpg", "totalTime": "PT45M", "recipeYield": "About 40 dumplings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "appetizer, side dish, fatback, pork, wonton wrappers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 28}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 101, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1228 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup Chinese dry mustard or other mustard powder", "2 tablespoons tahini", "2 tablespoons rice vinegar", "1/2 teaspoon sugar", "1/4 teaspoon salt", "1/4 cup vegetable oil", "1/4 cup sesame oil", "1 pound lean ground pork", "8 ounces ground fat back (a butcher can grind this)", "1 cup finely sliced Chinese chives or other chives", "1 tablespoon minced ginger", "1 tablespoon sugar", "1 tablespoon sesame oil", "1 tablespoon soy sauce", "1 teaspoon potato starch or cornstarch", "1 teaspoon ground white pepper", "1/2 teaspoon salt", "1 package of 40 or more wonton wrappers", "3/4 cup baking soda", "3 tablespoons melted butter", "Coarse pretzel salt, bagel salt or Margarita salt, as needed", "2 tablespoons vegetable oil or sesame oil, or as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tahini mustard: In a medium bowl, combine mustard powder with 1/4 cup plus 2 tablespoons water. Mix well. Add tahini, vinegar, sugar, salt, vegetable oil and sesame oil. Whisk until smooth. Cover and refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: In a large bowl, thoroughly mix ground pork and ground fat back. Add chives, ginger, sugar, sesame oil, soy sauce, potato starch or cornstarch, white pepper and salt. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For finishing: Place a heaping teaspoon of filling in the center of a wonton wrapper. Brush the edges of the wrapper with water and fold it over to shape a triangle, rectangle or other flat shape, gently pressing the edges for a tight seal. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine 8 cups of water with baking soda, and bring to a boil. Working in batches, blanch the dumplings in the solution for 1 minute. Using a slotted spoon, transfer blanched dumplings to a tray, and brush on both sides with melted butter. Sprinkle very lightly with pretzel salt, bagel salt or Margarita salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large sauté pan over medium heat and add enough oil to lightly coat the pan. Working in batches without overcrowding, add dumplings and allow them to brown lightly on one side. Using a stiff spatula, turn them to brown the other side. Serve with tahini mustard."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Dumplings to Die For", "description": "New and exciting variations on the classic dumpling have recently appeared on menus in New York City. Meet some of the people behind a few of these delicious creations.", "thumbnailUrl": "https://static01.nyt.com/images/2012/10/21/dining/video-dumplings/video-dumplings-mediumThreeByTwo440-v3.jpg", "uploadDate": "2012-10-23T19:33:55.000Z", "duration": "PT4M11S"}, "link": "https://cooking.nytimes.com/recipes/12889-pretzel-pork-and-chive-dumplings-with-tahini"}