{"@context": "http://schema.org", "@type": "Recipe", "name": "Puréed Winter Squash Soup With Ginger", "description": "One of the most comforting dishes you can make with winter squash is a puréed soup. I use rice to thicken this one, but you could also use a potato, or not add additional starch at all, as the squash itself has a lot of body. To enhance the flavor, this one calls for ginger, with a little lime juice and a swirl of yogurt added before serving.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/29/health/nutrition/29recipe/29recipe-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "soups and stews", "keywords": "appetizer, side dish, fall, winter, ginger, rice, winter squash, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 139}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 154, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1094 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon canola or rice bran oil", "1 medium onion, chopped", "1 carrot, diced", "2 pounds peeled winter squash, like butternut or kabocha", "2 garlic cloves, minced", "1 tablespoon minced ginger", "6 1/2 cups water, chicken stock or vegetable stock", "1/3 cup rice", "Salt and freshly ground pepper", "1/2 teaspoon ginger juice (made by grating a teaspoon of fresh ginger, wrapping in cheesecloth and squeezing the cheesecloth)", "Pinch of freshly grated nutmeg", "1/2 lime", "4 to 6 tablespoons plain yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy soup pot or Dutch oven and add the onion and carrot. Cook, stirring, until the vegetables are tender, about 5 minutes. Add the winter squash, garlic and minced ginger and cook, stirring, until the mixture smells fragrant, about 1 minute"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the water or stock, the rice and salt to taste and bring to a boil. Reduce the heat, cover and simmer 45 minutes to 1 hour, until the squash is very tender"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, or in batches in a regular blender, purée the soup. If using a regular blender, cover the top with a towel pulled down tight, rather than airtight with the lid. Return to the pot and heat through. Stir in the ginger juice, taste and season with salt and pepper. If desired, thin out with a little more water or stock"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into bowls and add a tablespoon of yogurt (more to taste), then slowly swirl the yogurt into the soup with a spoon. Squeeze a few drops of lime juice onto each serving and sprinkle with whisper of nutmeg"}], "link": "https://cooking.nytimes.com/recipes/12898-pureed-winter-squash-soup-with-ginger"}