{"@context": "http://schema.org", "@type": "Recipe", "name": "Lasagna With Roasted Kabocha Squash and Béchamel", "description": "This rich-tasting lasagna is inspired by my favorite northern Italian pumpkin-filled ravioli. It would make a terrific vegetarian item on a Thanksgiving buffet. Making the lasagna is not time-consuming if you use no-boil lasagna noodles. Be sure to season the squash well as you assemble this", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/30/health/nutrition/30recipe/30recipe-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, casseroles", "keywords": "fall, winter, halal, healthy, high fiber, kosher, nut-free, vegetarian, kabocha, no-boil lasagna noodles, parmesan, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 142}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 324, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "741 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["3 pounds kabocha squash", "3 tablespoons extra virgin olive oil", "3 tablespoons minced shallot or onion", "3 tablespoons sifted all-purpose flour", "3 cups low-fat milk (1 percent)", "Salt and freshly ground pepper", "Pinch of freshly grated nutmeg", "2 tablespoons chopped fresh sage", "1/2 pound no-boil lasagna noodles (or a little more, depending on the size of your lasagna pan)", "4 ounces Parmesan cheese, grated (1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Line a baking sheet with foil. Cut the squash into big chunks, brush the exposed flesh with 1 tablespoon of the olive oil and place on the baking sheet. Bake 45 minutes or until squash is tender enough to be pierced through to the skin with a paring knife. Remove from the heat and allow to cool until you can handle it, then cut away the skin and cut in thin slices. Turn the oven down to 350 degrees"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the squash is in the oven, make the béchamel. Heat the remaining oil over medium heat in a heavy medium saucepan. Add the shallot or onion and cook, stirring, until it has softened, about 3 minutes. Stir in the flour and cook, stirring, for about 3 minutes, until the mixture is smooth and bubbling, but not browned. It should have the texture of wet sand. Whisk in the milk all at once and bring to a simmer, whisking all the while, until the mixture begins to thicken. Turn the heat to very low and simmer, stirring often with a whisk and scraping the bottom and edges of the pan with a rubber spatula, for 10 to 15 minutes, until the sauce is thick and has lost its raw flour taste. Season with salt, pepper and nutmeg. Strain while hot into a large measuring cup or a medium bowl and stir in 1/4 cup of the Parmesan and 1 tablespoon of the sage"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a rectangular baking dish. Spread a spoonful of béchamel over the bottom. Top with a layer of lasagna noodles. Spread a thin layer of the béchamel over the noodles. Top with half the squash. Season the squash with salt and pepper and sprinkle with Parmesan. Repeat the layers, ending with a layer of lasagna noodles topped with béchamel and Parmesan. Sprinkle the remaining sage over the top. Make sure the noodles are well coated with béchamel so they will soften during baking"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the baking dish tightly with foil and place in the oven. Bake 40 minutes, until the noodles are tender and the mixture is bubbling. Uncover and, if you wish, bake another 5 to 10 minutes until the top begins to brown. Remove from the heat and allow to sit for 5 minutes before serving"}]}