{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan-Style Pumpkin (With Lentils)", "description": "The pumpkin — or those squashes whose non-English names translate as “pumpkin” — is a staple the world over, turned into substantial dishes celebrated for their sweetness and density. So-called sugar pumpkins, which are smaller and more flavorful than anything you might carve, are the best for cooking and available even in supermarkets. But you can tackle the big boys too.\n\nThis recipe uses cubes of pumpkin flesh. Admittedly, getting at the good stuff is the tricky part. And of course you can use any orange-fleshed squash in any pumpkin recipe. But given the season, let’s assume you’re working with a pumpkin. Start just as if you were carving a jack-o’-lantern: cut a circle around the stem, then pull up on the stem and discard it. Using the cavity as a handle, peel the pumpkin with a sturdy vegetable peeler. Yes, it will take a while.\n\nThen cut the pumpkin in half and scrape out the seeds with an ice cream scoop or heavy spoon. You can discard the seeds or roast them. (More on that in a moment.) Cut or scrape off any excess string and cut the pumpkin into approximately 1-inch cubes. (A 4-pound pumpkin will yield about 8 cups of cubes.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, fall, winter, lamb, pumpkin, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 222}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 392, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "25 grams", "saturatedFatContent": "6 grams", "sodiumContent": "760 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil, plus a little more if necessary", "1 pound boneless leg of lamb, cut into 1-inch cubes and trimmed of fat", "Salt and freshly ground black pepper", "1 large or 2 medium onions, roughly chopped", "6 cups 1-inch cubes pumpkin flesh", "2 teaspoons minced garlic", "1 teaspoon ground turmeric", "1 teaspoon ground cinnamon", "1 teaspoon ground cumin", "2 fresh bay leaves", "1/2 cup dry white wine", "2 cups chicken, beef or vegetable stock", "1 1/2 cups chopped ripe tomatoes with juices (canned are fine)", "1 cup lentils", "Chopped cilantro for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy pot with a lid, heat 2 tablespoons olive oil on medium-high heat. When hot, add the lamb; sprinkle with salt and pepper and cook until browned on all sides, 5 to 8 minutes total, stirring as\nneeded. Remove the pieces of lamb to a plate and reduce the heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the pan is dry, add more oil. Add onions and cook, stirring occasionally, until soft, 5 minutes. Add pumpkin, garlic, turmeric, cinnamon and cumin; cook until pumpkin begins to soften, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bay leaves, wine, stock and tomatoes, and return lamb to the pan. Bring to a boil, then reduce the\nheat and cook for at least 45 minutes on medium-low, partly covered. Stir occasionally; add more stock if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lentils, and bring the mixture back to a boil. Adjust heat a simmer. Continue to cook, uncovered, stirring occasionally, until the lentils are tender and the liquid is thick, about 30 minutes. (If at any point\nit threatens to become too thick, add a bit of stock or water.) Taste, and adjust the seasoning. Remove the bay leaves, and garnish with cilantro before serving."}]}