{"@context": "http://schema.org", "@type": "Recipe", "name": "Balsamic Roasted Winter Squash and Wild Rice Salad", "description": "Squash absorbs the rich, acidic flavor of balsamic vinegar in the most inviting way; the idea of tossing it with the vinegar before roasting comes from Heidi Swanson. Put this delicious autumn salad in your Thanksgiving file. Make sure to cook the wild rice until it begins to splay or you won’t get the full nutty flavor of the grains", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/02/health/nutrition/02recipe/02recipe-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "arugula, wild rice, winter squash, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, vegan, vegetarian, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 139}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 309, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "924 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup wild rice", "3 1/2 cups water or stock (chicken or vegetable)", "Salt to taste", "2 pounds kabocha or butternut squash, peeled and cut in small dice (about 3 cups peeled and diced, weighing 1 1/2 to 1 3/4 pounds)", "Salt to taste", "1 tablespoon balsamic vinegar", "3 tablespoons extra virgin olive oil", "2 tablespoons fresh lemon juice (more to taste)", "1 garlic clove, minced or puréed", "1 teaspoon Dijon mustard", "3 tablespoons walnut oil, or substitute extra virgin olive oil", "1/2 cup chopped fresh herbs, like parsley, chives, tarragon", "1/2 cup diced celery", "1 5- or 6-ounce bag baby arugula or spinach"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the wild rice. Bring the water or stock to a boil in a medium saucepan, add salt to taste and the rice. Bring back to a boil, reduce the heat, cover and simmer 45 minutes, until the rice is tender and has begun to splay. Drain through a strainer, return to the pot and cover the pot with a clean dishtowel. Return the lid to the pot and let sit for 10 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 425 degrees. Line a baking sheet with foil. Place the squash in a bowl or directly on the baking sheet and toss with salt to taste, the balsamic vinegar and 1 tablespoon of the olive oil. Spread on the baking sheet in an even layer and make sure to tip all of the liquid remaining in the bowl over the squash. Roast for 20 to 30 minutes, stirring every 10 minutes so that the squash browns evenly. The squash should be tender all the way through. Remove from the heat"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, whisk together the lemon juice, garlic, salt to taste and mustard. Whisk in the remaining olive oil and the walnut oil"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the wild rice, squash, herbs and celery in a large bowl. Toss with the dressing. Add salt and pepper to taste. Line a platter, individual plates or a wide salad bowl with the baby spinach or arugula. Top with the salad and serve"}]}