{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Millet Kugel With Dried Apricots and Raisins", "description": "Millet, a light, fluffy gluten-free grain that is a good source of magnesium, manganese and phosphorus, lends itself beautifully to both sweet and savory kugels. In fact, this kugel turned me into a millet convert", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/06/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner, casseroles", "keywords": "cottage cheese, dried fruit, millet, fall, winter, gluten-free, halal, kosher, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 233, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "397 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2/3 cup millet", "2 tablespoons unsalted butter", "2 cups water", "Salt to taste", "1 cup cottage cheese", "3 eggs", "1/4 cup low-fat milk", "1/4 cup mild honey or agave nectar", "1 teaspoon vanilla extract", "1/4 teaspoon freshly grated nutmeg", "1/2 cup (3 ounces) diced dried apricots", "1/2 cup (3 ounces) raisins (or omit and use all apricots)", "Finely grated zest of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the butter or oil over medium-high heat in a heavy 2- or 3-quart saucepan. Meanwhile, bring the water to a simmer in another saucepan or in the microwave. Add the millet to the heavy saucepan and toast, stirring, until it begins to smell fragrant and toasty, about 5 minutes. Add the boiling water and salt to taste, and bring back to a boil. Reduce the heat to low, cover and simmer 25 to 30 minutes, until the liquid in the saucepan has evaporated and the grains are fluffy. Transfer to a large bowl"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Butter a 2-quart baking dish. In a food processor fitted with the steel blade, blend the cottage cheese until smooth. Add the milk, honey, eggs, vanilla and nutmeg and blend until smooth. Scrape into the bowl with the millet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together the millet and cottage cheese mixture. Stir in the apricots, raisins and lemon zest. Scrape into the prepared baking dish. Cut the remaining butter into small pieces and dot the top of the kugel with them. Bake 40 to 50 minutes, until the kugel is set and beginning to color on the top"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and allow to cool for at least 15 minutes (longer if possible) before serving. Serve warm or at room temperature"}]}