{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Standing Rib Roast", "description": "A juicy, beautifully pink rib roast is one of the most impressive dishes imaginable for a holiday spread. (It's also one of the most expensive. Invest in a digital, oven-safe thermometer and there will be no reason to worry you're overcooking it.) This recipe elevates the classic by adding a stuffing of spinach, sausage and mushrooms that is most appropriate for use with the lean beef of grass-fed steers.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2013/12/19/dining/recipes-stuffedstandingribroastNEW/recipes-stuffedstandingribroastNEW-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 to 12 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "fall, winter, italian sausage, mushroom, rib roast, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 111}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1127, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "95 grams", "fiberContent": "2 grams", "proteinContent": "55 grams", "saturatedFatContent": "38 grams", "sodiumContent": "978 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ounce dried porcini mushrooms", "2 mild Italian sausages, removed from the casings", "1/2 cup chopped shallots", "1 tablespoon chopped garlic", "2 cups 1/4-inch bread cubes, roughly cut from day-old coarse white bread (don’t use store-bought dried bread cubes)", "1 teaspoon chopped fresh rosemary", "1 cup cooked spinach, squeezed dry and chopped (frozen is fine)", "1 large egg, lightly beaten", "Salt and freshly ground black pepper", "1 4-bone standing rib-eye roast (about 8 pounds), chine bone removed and fat trimmed to 1/4 inch", "2 tablespoons minced garlic", "1 1/2 tablespoons salt", "1 tablespoon freshly ground black pepper", "3 tablespoons finely chopped fresh rosemary", "1 tablespoon crushed fennel seeds", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stuffing: place the porcini in a small bowl and cover with boiling water. Soak for at least 45 minutes, or up to several hours, until soft. Lift porcini out of the liquid, drain on paper towels, chop and set aside. Strain the soaking liquid, leaving behind any grit in the bottom of the bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium heat. Add sausages and cook for about 5 minutes, breaking the meat apart with a fork as it browns. Add mushrooms, shallots and garlic, cover, and cook for about 5 minutes more, stirring from time to time, until the vegetables are tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a large bowl. Stir in bread cubes, rosemary, spinach and egg and mix well. Moisten with about 1/4 cup reserved mushroom liquid. The stuffing should be slightly moist but not wet. Season to taste with salt and pepper and set aside, or refrigerate if not using immediately. (The stuffing is best made a day ahead and refrigerated, but don&rsquo;t stuff the meat ahead, as it can spoil.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the meat: let the roast stand at room temperature for 4 hours before roasting. Heat the oven to 450 degrees, with a rack in the lower third of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a long sharp knife, cut the roast between the bones and the meat so that the rack of ribs is almost severed from the meat, leaving about 3/4 inch of the meat attached to the bones. Place the roast on a flat surface so that you are looking down into the crevices between the bones and meat. Spread the stuffing into each crevice, using a rubber spatula to pack it in. (If you have extra stuffing, bake it in a buttered uncovered casserole dish for 30 minutes.) Tie the bones back in place with a couple of loops of butcher&rsquo;s twine to keep the stuffing inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic, salt, pepper, rosemary, fennel seeds and oil in a small bowl. Generously rub the mixture over the top and sides of the roast and bones. Place a large V-shape roasting rack in a roasting pan and nestle the roast on the rack so that the bones are sticking straight up. Wrap the bone tips in aluminum foil to prevent burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast for 20 minutes, then turn down the oven to 350 degrees and roast until the internal temperature is about 120 degrees. If you are not using a continuous-read thermometer, begin monitoring the internal temperature with an instant-read thermometer after 45 minutes, checking the temperature every 15 minutes at the thickest part of the roast. When the roast is done (usually 1 1/4 to 2 hours), set aside, covered loosely with aluminum foil, to rest for at least 20 minutes and up to 45 minutes before carving and serving. The temperature will rise 10 to 15 degrees as it rests. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To carve and serve, remove the twine from the roast. Place the roast on a cutting board so that the bones are vertical. Sever the strip of meat attached to the bones and spoon the stuffing into a serving bowl. Set the bones aside, and turn the roast so the bone side lies flat. Cut the roast into 1/4- to 1/2-inch-thick slices and arrange in an overlapping row on a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice between the bones to separate them and add to the platter. Pour any carving juices over the meat and serve. "}]}