{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Gumbo with Andouille Sausage", "description": "Most cooks agree that gumbos must have the vegetable trinity of chopped bell pepper, onion and celery, and that they should be highly seasoned. Some gumbos do contain sausage, shrimp and chicken, but there are humbler ones that are made with only salt pork, onions and greens. Finally, there is the filé powder camp. These cooks use copious amounts of the stuff, which is made from finely powdered sassafras leaves. Added at the last minute, it thickens the soup while imparting a flavor that’s earthy and herbal. I confess to using all three — a roux, okra and filé powder — in my own gumbo, which I hope is not sacrilegious. Not having grown up in gumbo territory, I based mine on a number of visits to New Orleans.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/01/16/dining/recipes-shrimpgumbo/recipes-shrimpgumbo-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "cajun, creole", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "dairy-free, fall, winter, main course, okra, sausage, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 790}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 384, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "4 grams", "proteinContent": "23 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1160 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound medium shrimp in the shell", "Salt and pepper", "2 teaspoons chopped fresh thyme", "6 garlic cloves, minced", "4 tablespoons olive oil", "1 1/2 cups diced onion", "1 cup diced red or green bell pepper", "1/2 cup diced celery", "4 tablespoons all-purpose flour", "1 tablespoon tomato paste", "1 teaspoon paprika", "1/4 teaspoon cayenne", "1 cup diced ripe tomato, fresh or canned", "6 ounces smoked andouille sausage, in 1-inch-thick slices", "6 cups <a href=\"http://cooking.nytimes.com/recipes/12914-shrimp-broth\">shrimp broth</a> or chicken broth", "2 cups chopped okra", "1 tablespoon filé powder", "1/2 cup chopped scallions for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and devein shrimp. Reserve shrimp shells for broth. Season shrimp with salt and pepper, thyme and 1/2 teaspoon garlic. Cover and refrigerate. Make the shrimp broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gumbo base: In a heavy-bottomed soup pot, heat olive oil over medium-high heat. Add onion, bell pepper and celery and cook briskly, stirring frequently, until lightly browned, about 8 minutes. Sprinkle in flour and stir to combine. Continue cooking for about 5 minutes, stirring, until flour-vegetable mixture is well browned. Add tomato paste, paprika, cayenne and remaining garlic. Cook for 1 minute, stirring well, then add diced tomato and andouille sausage and cook for about 2 minutes. Season mixture generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in shrimp broth and reduce heat to medium. With a wooden spoon, scrape bottom of pot to dissolve any browned bits. Simmer for about 25 minutes, until gumbo base thickens somewhat. Taste and adjust salt. (You may prepare gumbo base up to this point several hours ahead; bring it back to a brisk simmer before continuing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add okra and let cook until softened, about 5 minutes. Add shrimp and cook for 2 minutes more. Turn off heat. Stir in filé powder. Serve immediately, sprinkled with scallions, along with steamed rice or cornbread if desired."}]}