{"@context": "http://schema.org", "@type": "Recipe", "name": "Deconstructed Pumpkin Pie", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/11/14/dining/14DESSERT_SPAN/14DESSERT_SPAN-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "chocolate, heavy cream, pumpkin, dessert, fall, winter, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["12 ounces 70 percent bittersweet chocolate, in pieces", "1 1/3 cups heavy cream", "1/4 cup agave syrup", "2 1/2 cups sugar", "1/2 vanilla bean, scraped", "Zest of 1/2 orange", "Zest of 1/2 lemon", "1 small pumpkin, about 1 1/2 pounds, or winter squash, peeled, seeded and diced", "1/2 cup fresh cranberries", "1 1/3 cup unseasoned canned pumpkin purée", "1/2 packet unflavored gelatin", "1 cup heavy cream", "1/2 vanilla bean, scraped", "1/3 cup sugar", "1/4 teaspoon cinnamon", "1/8 teaspoon nutmeg", "1/8 teaspoon ground ginger", "Butter for pan", "1 1/2 cups flour", "3/4 teaspoon baking soda", "1/2 teaspoon salt", "1 teaspoon cinnamon", "1/2 teaspoon nutmeg", "1/2 teaspoon ground ginger", "1 1/2 cups sugar", "2 large eggs, beaten", "1 cup unseasoned pumpkin purée", "4 ounces (1 stick) unsalted butter, melted and cooled", "Reserved chocolate from ganache", "6 thin ginger or speculaas cookies"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ganache: Place 10 ounces of the chocolate in a bowl. Reserve the rest for decoration. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring cream and syrup to a boil. Pour over chocolate. Mix well with a whisk without incorporating any air. Place a piece of plastic wrap on the surface. Refrigerate until well chilled and fairly firm, about 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the confit: Mix sugar with 2 cups water in a 2-quart saucepan. Add vanilla bean, orange and lemon zest. Bring to a boil and when sugar has dissolved, add pumpkin. Reduce heat to very low and simmer until pumpkin is translucent, about 2 hours. Use a slotted spoon to remove pumpkin to a small container, cover with about half the sugar syrup, cover container and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cranberries to remaining syrup, simmer 5 minutes, then set aside for 15 minutes. Drain cranberries into a small container, cover with some syrup, cover container and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the mousse: Preheat oven to 250 degrees. Line a small baking sheet with foil, spread the 1 1/3 cup of pumpkin pur&eacute;e on foil and bake about 25 minutes to remove some moisture. Transfer to a bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place gelatin in a small dish, stir in 1 1/2 tablespoons cold water and set aside. Place 1/3 cup cream, the vanilla, sugar and spices in a small saucepan and bring to a boil. Remove from heat. Stir in softened gelatin. Mix thoroughly into pumpkin pur&eacute;e. Cover and refrigerate until cold, about 2 hours. When cold, whip remaining cream. Fold into pumpkin pur&eacute;e. Refrigerate until ready to use. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Butter a 9-by-13-by-2-inch baking pan. Line with parchment, allowing overhang on the long sides. Butter the paper. Preheat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour, baking soda, salt and spices in a sieve. Sieve into a large bowl. Stir in sugar. Mix eggs with pumpkin pur&eacute;e. Fold into dry ingredients. Add melted butter and mix well. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread batter in pan and bake 20 minutes, until a cake tester comes out clean. Cake will not rise to the rim of pan. Cool in pan at least 1 hour. Use parchment overhang to help remove from pan. Refrigerate until ready to assemble. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the dessert: Place pumpkin confit in a strainer. Rinse briefly in cold water, drain and place on paper towels. Repeat with cranberry confit. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cake on a cutting board. Trim 1/2 inch from all sides. Nibble trimmings or let the army of assistants have at them. Cut cake in half lengthwise. Place half the cake on a large platter. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a spatula to spread or a pastry bag to pipe ganache in a thick layer all over the top of the cake half on the platter. Place second half on top and press lightly. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place mousse in a pastry bag and pipe peaks or rows all over the top of the cake. Alternatively, form ovals with 2 teaspoons to cover top of cake, or simply spread the mousse on the cake and use the point of a knife to make peaks. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break up reserved chocolate and the ginger cookies and stick them randomly into the pumpkin mousse. Place some of the pumpkin and cranberry confit on the mousse and scatter the rest on the platter around the cake. Refrigerate until ready to serve."}]}