{"@context": "http://schema.org", "@type": "Recipe", "name": "Coiled Greek Winter Squash Pie", "description": "This is a beautiful way to present a Greek phyllo-wrapped vegetable pie. The filling is wrapped in phyllo cylinders, which are arranged in a coil in a pan, then baked until crisp. It takes longer to assemble than a regular pie, but it’s worth the time for Thanksgiving. For a vegan version, you can omit the egg and the feta", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/13/science/15recipehealth/15recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "fall, winter, halal, kosher, vegetarian, main course, phyllo, walnut, winter squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "528 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds pumpkin or winter squash, like kabocha, seeds and membranes scraped away, cut into large pieces (if using butternut, cut in half crosswise, just above the bulbous bottom part, then cut these halves into lengthwise quarters and scrape away the see", "About 1/4 cup extra virgin olive oil", "2 large leeks, white and light green part only, cleaned well and chopped", "1/4 cup chopped fresh mint", "1/4 teaspoon freshly grated nutmeg", "1/2 cup (2 1/2 ounces/75 g) lightly toasted walnuts, chopped medium-fine", "3 ounces feta cheese, crumbled (about 3/4 cup)", "1/4 cup currants", "1 egg", "Salt and freshly ground pepper", "3/4 pound phyllo dough, thawed and at room temperature (more if needed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Line a baking sheet with foil and oil the foil. Place the squash on the baking sheet and place in the oven. Bake until tender, 40 to 60 minutes, depending on the type of squash and the size of the pieces. Every 15 minutes, use tongs to turn the pieces over so that different surfaces become browned on the foil. Remove from the oven and allow to cool, then peel and place in a bowl. Mash with a fork, a large wooden spoon, a potato masher or a pestle. Turn the oven down to 375 degrees"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy skillet and add the leeks. Cook, stirring, until leeks are tender and just beginning to color, about 5 minutes. Remove from the heat and add to the squash. Stir in the mint, nutmeg, walnuts, feta, currants and 1 tablespoon olive oil. Season to taste with salt and pepper. Beat the egg and stir in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a 12-inch pie pan or cake pan with olive oil and line the bottom with parchment. Brush the parchment with olive oil"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unroll the phyllo dough. Keep it covered with 2 towels, the first one dry and the second one damp. Take a sheet of phyllo and place it on your work surface horizontally (with the long edge closest to you). Brush lightly with olive oil and place another sheet on top. Fold the two layers in half horizontally, with the folded edge at the bottom. Brush with a little more oil. Leaving a 1-inch border on the bottom and sides, and a larger border on the top, spread a thin line of the filling (about 3 heaped tablespoons) down the length of the phyllo. Fold the ends up over the filling, then fold the bottom edge over and carefully roll up into a cylinder about 1 inch thick. Place, seam side down, along the edge of the pan. Continue to wrap the filling and coil the ropes into the pan, starting each cylinder where the last one left off, until the pan is full. If any of the filling and phyllo remains, start another, smaller coil in another pan, or make a little pie"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pie is assembled, brush the top with olive oil. Bake on the middle rack for 50 to 60 minutes, until nicely browned. Remove from the heat and allow to cool for at least 10 minutes before serving. You can serve this hot or warm. To serve, lift out pieces of the coil for each person"}], "link": "https://cooking.nytimes.com/recipes/12936-coiled-greek-winter-squash-pie"}