{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower With Oyster Mushrooms and Sherry", "description": "This dish of cauliflower and oyster mushrooms in sherry and cream is pan-simmered, though the cauliflower is blanched beforehand in highly salted water to keep it crisp. The addition of sherry to the cream sauce keeps it from being bland, and the mushrooms are seared for a bit of chew.", "author": {"@type": "Person", "name": "Julia Moskin And Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/Cauliflower-With-Oyster-Mushrooms-and-Sherry/Cauliflower-With-Oyster-Mushrooms-and-Sherry-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cauliflower, oyster mushroom, sherry, fall, winter, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 284, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "11 grams", "sodiumContent": "898 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 quarts whole milk", "6 tablespoons kosher salt", "2 heads cauliflower, trimmed into bite-size florets", "1 pound oyster or chanterelle mushrooms, tough stems removed, torn into bite-size pieces", "Fine sea salt", "1/4 cup minced shallots", "4 sprigs fresh thyme, plus extra for garnish", "1 cup Amontillado or other dry sherry", "3/4 cup heavy cream", "4 tablespoons chilled butter, diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, combine the milk, salt and 2 quarts water; bring to a simmer. Blanch the florets until barely tender, about 2 minutes; the cauliflower should still have a little crispness and bite. Drain well and transfer to a baking sheet to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large (14-inch) sauté pan, heat 3 tablespoons of the canola oil over medium heat. Add the mushrooms to the pan in a single layer, allowing them to become browned and crisped on both sides, stirring as needed, about 10 minutes. Season lightly with sea salt. Add the shallots and thyme, and, if needed, more canola oil. Sauté until the shallots are tender, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the blanched cauliflower florets to the pan and mix well. Add the sherry, scraping the bottom of the pan with a wooden spoon and stirring until reduced to one quarter of the original amount. Add the cream and allow it to reduce to a thickened sauce that coats the cauliflower. Turn off the heat, and stir in the chilled butter, a few cubes at a time, to create a rich, velvety emulsion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a warmed serving dish and garnish with thyme sprigs. Serve as soon as possible, while still hot."}]}