{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Acorn Squash Stuffed With Wild Rice and Kale Risotto", "description": "The filling here is a Greco-Italian fusion, with a little American (wild rice) thrown in. I’m usually not a fusion sort of cook, but I wanted something creamy like risotto to fill these squash. Look for small acorn squash so that each person can have one. They’ll be like miniature vegetarian (or vegan) turkeys", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/13/science/16recipehealth/16recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 generous servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "acorn squash, kale, wild rice, dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 241, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "6 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1047 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["6 small acorn squash", "1 bunch kale or 1 10-ounce package stemmed and washed kale, stems picked out and discarded", "Salt to taste", "1 cup cooked wild rice (1/3 cup uncooked)*", "1 quart vegetable stock", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "2/3 cup arborio rice", "1 plump garlic clove, minced", "1/2 cup dry white wine, like pinot grigio or sauvignon blanc", "1/4 cup chopped fresh dill", "1/4 cup chopped flat-leaf parsley", "Freshly ground pepper to taste", "1/4 to 1/2 cup freshly grated Parmesan cheese (1 to 2 ounces) (optional)", "Cayenne or freshly grated nutmeg to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Line a baking sheet with foil and brush the foil with olive oil. Place the squash in the oven and bake 30 minutes. Each squash should be intact but beginning to give on the side it’s resting on, and soft enough to cut through. Remove from the oven and let sit for 15 minutes, until the squash has cooled slightly. Then, resting a squash on the slightly flattened side that it was sitting on in the oven, cut away the top third. You will be putting the top “cap” back on once the squash is filled, so cut it off in one neat slice. Scrape out the seeds and membranes from both pieces and set aside. Repeat for the remaining squash. Turn the oven heat down to 350 degrees. Oil a baking dish or sheet pan that can accommodate all of the squash"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, blanch the kale in a large pot of salted boiling water for 2 to 4 minutes, until just tender. Transfer to a bowl of cold water, drain and squeeze out excess water. Chop medium-fine and set aside. Cook the wild rice, following the directions below, and set aside"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the stock into a saucepan and bring it to a simmer over low heat, with a ladle nearby. Heat 1 tablespoon of the olive oil over medium heat in a wide, heavy nonstick saucepan or skillet. Add the onion and a generous pinch of salt, and cook gently until it is just tender, 3 to 5 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the arborio rice and garlic and stir until the grains separate and begin to crackle. Add the wine and stir until it has been absorbed. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, adding more stock and stirring when the rice is almost dry. You do not have to stir constantly, but stir often. Continue to add stock and stir until the rice is almost tender, about 20 minutes. The rice should still be a little chewy. Add another ladleful of stock and stir in the kale, wild rice and herbs. Stir together until the stock is just about absorbed, about 5 minutes, and add another ladleful of stock. Remove from the heat. Add pepper, taste and adjust seasonings. Stir in the remaining olive oil and the Parmesan if using"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the surface of the acorn squash with salt, pepper and nutmeg or cayenne (if desired). Fill the hollowed-out squash with the risotto. Place the tops back on the squash and put them in the baking dish or on the sheet pan"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 40 minutes, or until the squash is tender all the way through when pierced with a knife"}], "link": "https://cooking.nytimes.com/recipes/12937-baked-acorn-squash-stuffed-with-wild-rice-and-kale-risotto"}