{"@context": "http://schema.org", "@type": "Recipe", "name": "Giant Beans With Spinach, Tomatoes and Feta", "description": "This delicious, dill-infused dish is inspired by a northern Greek recipe from Diane Kochilas’s wonderful new cookbook, “The Country Cooking of Greece.” The traditional way to wilt spinach in that part of Greece is to salt it lightly, put it in a colander and knead it against the sides of the colander for about 10 minutes. I find blanching or steaming the spinach more efficient, and a better method for those who need to watch their salt intake", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/13/science/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "greek", "recipeCategory": "soups and stews", "keywords": "beans, dill, spinach, fall, winter, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 236, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "9 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1460 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound (about 1 1/8 cups) dried Greek giant beans, giant lima beans or Christmas limas, washed and picked over", "1 1/2 quarts water", "1 bay leaf", "1 onion, cut in half", "Salt to taste", "2 garlic cloves, crushed", "2 large bunches spinach, (1 1/2 to 2 pounds), stemmed and washed", "3 tablespoons extra virgin olive oil", "1 leek, white and light green part only, chopped", "1 bunch scallions, trimmed and chopped", "1/2 cup chopped flat-leaf parsley", "1/2 cup chopped fresh dill", "1 28-ounce can chopped tomatoes, with juice, pulsed to a coarse purée in a food processor", "Freshly ground pepper", "4 ounces Greek feta cheese, crumbled (about 3/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the beans, water, bay leaf, halved onion, and crushed garlic in a large saucepan and bring to a gentle boil. Reduce the heat and simmer 30 minutes. Add salt to taste and simmer another 30 minutes. The beans should be al dente: not yet soft but not hard either.  Remove from the heat. Using tongs, remove and discard the onion, garlic and bay leaf. Place a strainer over a bowl and drain the beans. Taste the broth and adjust seasonings. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans are simmering, blanch the spinach in a large pot of salted boiling water for 20 seconds, or steam just until it wilts, abut 1 minute. Transfer to a bowl of cold water, then drain and squeeze out excess water. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy skillet and add the leek and the scallions. Add a pinch of salt and cook, stirring often, until the mixture is tender, 3 to 5 minutes. Transfer to an ovenproof casserole or baking dish, preferably earthenware. Stir in the spinach, parsley, dill, beans, half the tomato purée, 2 cups of the bean broth and half the feta. Season to taste with salt and pepper and stir in another tablespoon of olive oil. Place the remaining tomatoes over the top and sprinkle on the remaining feta. Drizzle on the remaining tablespoon of olive oil. Cover and place in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 to 2 hours, checking the liquid every 20 minutes to make sure that the beans are submerged; add more bean broth if necessary. When they’re done, the beans will be creamy but intact."}], "link": "https://cooking.nytimes.com/recipes/12933-giant-beans-with-spinach-tomatoes-and-feta"}