{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Eggplant and Chickpeas With Tomato Sauce", "description": "Eggplant is always a good, substantial vegetable to use for a vegetarian main dish. The chickpeas and the feta provide plenty of protein. Vegans can leave out the feta and substitute sugar or agave nectar for the honey.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/13/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "chickpea, eggplant, tomato, fall, winter, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 190}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 310, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "11 grams", "proteinContent": "12 grams", "saturatedFatContent": "4 grams", "sodiumContent": "789 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra virgin olive oil", "2 garlic cloves, minced", "1 28-ounce can chopped tomatoes, with juice, pulsed to a coarse purée", "1 teaspoon mild honey (more to taste)", "1/4 to 1/2 teaspoon cinnamon, to taste", "Salt to taste", "1 large or 2 medium eggplants (about 1 1/4 pounds), cut into 1/3-inch-thick slices", "3 cups cooked chickpeas (2 cans, drained and rinsed, or, 1 1/2 cups dried – about 3/4 pound", "4 ounces feta, crumbled (3/4 cup", "1 teaspoon dried oregano, preferably Greek or Turkish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomato sauce. Heat 1 tablespoon of the olive oil in a heavy skillet or wide saucepan over medium heat, and add the garlic. Cook, stirring, until it smells fragrant, about 30 seconds, and add the tomatoes, honey, salt to taste and cinnamon. Cook over medium heat until the tomatoes have cooked down and the sauce is fragrant, about 20 minutes. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oven to 425 degrees. Line a baking sheet with aluminum foil and brush the boil with olive oil. Place the eggplant slices on the baking sheet, salt lightly and brush with olive oil. Place in the oven and bake 20 minutes, or until eggplant is lightly browned and soft all the way through. Remove from the heat. Fold the aluminum foil over and crimp the edges together so that the eggplant steams as it cools. Do this in batches if you need more than one baking sheet. Turn the oven down to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a 2-quart baking dish or gratin. Place the chickpeas in the baking dish and stir in 1 cup of the tomato sauce. Layer the eggplant over the chickpeas and top with the remaining tomato sauce. Sprinkle the feta over the top and drizzle on any remaining olive oil. Sprinkle with the oregano and cover tightly with foil. Bake 30 minutes. Uncover and bake another 10 minutes, until the dish is bubbling."}], "link": "https://cooking.nytimes.com/recipes/12935-roasted-eggplant-and-chickpeas-with-tomato-sauce"}