{"@context": "http://schema.org", "@type": "Recipe", "name": "Heirloom Squash Salad With Pepita Purée and Pickled Shallots", "description": "", "author": {"@type": "Person", "name": "Julia Moskin And Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/squashsalad-still/squashsalad-still-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, winter, pepitas, shallot, squash, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 424, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "749 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces (1 cup) plus 2 tablespoons raw unsalted pepitas (shelled pumpkin seeds)", "1/2 cup extra virgin olive oil", "3/4 cup vegetable stock, and more as needed", "1 teaspoon freshly squeezed lemon juice", "Salt and white pepper", "Salt", "1 1/2 cups white wine vinegar", "1/2 cup sugar, preferably raw", "Half a cinnamon stick", "5 cloves", "1 fresh bay leaf", "1 star anise", "Dash of hot red pepper flakes", "1 pound shallots (about 8 to 12), thinly sliced", "Salt", "2 unpeeled delicata squash, halved lengthwise and cut crosswise into 1/2-inch thick half-circles", "The necks of 2 butternut squash, peeled, halved lengthwise and cut with an apple corer into small cylinders", "2 unpeeled kabocha squash (also known as buttercup), ends trimmed, halved root to stem and cut into 6 half-circles", "Salt and black pepper", "2 to 3 tablespoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pepita pur&eacute;e: Heat oven to 350 degrees. Toss the pepitas with 1 teaspoon of the olive oil and roast until evenly browned, 5 to 7 minutes. Remove from oven and allow to cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 2 tablespoons of the cooled pepitas and place remaining pepitas in a blender with 3/4 cup vegetable stock. Pur&eacute;e, drizzling in the remaining olive oil. Add lemon juice and season with salt and pepper to taste. Pur&eacute;e again, adding more broth if necessary for a consistency that is slightly thinner than tomato paste. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the shallots: Bring a large saucepan of lightly salted water to a simmer. Meanwhile, in another large saucepan, combine the vinegar, sugar, cinnamon, cloves, bay leaf, star anise and red pepper flakes. Bring the vinegar mixture to a boil, reduce heat to low and cover and simmer for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a large bowl of ice water. Blanch the shallots in the simmering water for 2 minutes. Using a slotted spoon, transfer to the bowl of ice water until cooled, then drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shallots to the vinegar mixture and simmer for 1 minute. Transfer to a bowl and allow to cool. Cover and refrigerate for up to 1 week; bring to room temperature before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the squash: Heat oven to 450 degrees. Fill a large pot halfway with lightly salted water and set over high heat to bring to a simmer. Prepare a large bowl of ice water. Spread paper towels across two baking sheets and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using one type of squash at a time, blanch in the simmering water until tender but not falling apart. The delicata and butternut squash may take about 2 minutes; the kabocha may take slightly longer. Be careful not to overcook. As soon as the squash are blanched, remove with tongs or a slotted ladle and plunge into the ice water. When they have cooled, transfer to paper towels. Pat the squash with paper towels and allow to dry well; they will not brown when roasted if the surfaces are not dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread all the squash on 2 large baking sheets and season with salt and pepper. Drizzle with oil and rub the surfaces to coat well. Roast until the squash starts to color, 5 to 10 minutes. Meanwhile, spread the pepita pur&eacute;e on a large platter or individual plates, creating an even layer about 1/8-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the roasted squash to the platter or plates on top of the pur&eacute;e, arranging it loosely to show off the different shapes. Disperse a cup of the drained pickled shallots among the squash. Garnish with the remaining pepitas, and serve warm."}], "link": "https://cooking.nytimes.com/recipes/12945-heirloom-squash-salad-with-pepita-puree-and-pickled-shallots"}