{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Sweet Potatoes and Fresh Figs", "description": "This dish from Yotam Ottolenghi, a chef and an author of \"Jerusalem,\" the beloved Middle Eastern cookbook, takes inspiration from a city where fig trees grow in abundance. Roasted sweet potatoes, along with wedges of fresh figs, are piled onto a plate, drizzled with a green onion-chile sauce and a balsamic reduction then dotted with generous pats of goat cheese. Do plan ahead, as this recipe does require a bit of preparation, but it's easy work that's more than worth it.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2012/11/12/health/wellveggie_jerusalem3/wellveggie_jerusalem3-articleLarge-v4.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "fall, winter, fig, goat cheese, sweet potato, gluten-free, kosher, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 247}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 343, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "7 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "619 milligrams", "sugarContent": "26 grams", "transFatContent": null}, "recipeIngredient": ["4 small sweet potatoes (2 1/4 pounds total)", "5 tablespoons olive oil", "Scant 3 tablespoons balsamic vinegar (you can use a commercial rather than a premium aged grade)", "1 1/2 tablespoons superfine sugar", "12 green onions, halved lengthwise and cut into 1 1/2-inch segments", "1 red chili, thinly sliced", "6 ripe figs (8 1/2 ounces total), quartered", "5 ounces soft goat’s milk cheese (optional)", "Maldon sea salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 475 degrees. Wash the sweet potatoes, halve them lengthwise, and then cut each half into 3 long wedges. Mix with 3 tablespoons of the olive oil, 2 teaspoons salt and some black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the wedges out, skin side down, on a baking sheet and cook for about 25 minutes, until they are soft but not mushy. Remove from the oven and leave to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the balsamic reduction, place the balsamic vinegar and sugar in a small saucepan. Bring to a boil, then decrease the heat and simmer for 2 to 4 minutes, until it thickens. Be sure to remove the pan from the heat when the vinegar is still runnier than honey; it will continue to thicken as it cools. Stir in a drop of water before serving if it does become too thick to drizzle"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the sweet potatoes on a serving platter. Heat the remaining oil in a medium saucepan over medium heat and add the green onions and chili. Fry for 4 to 5 minutes, stirring often to make sure not to burn the chili. Spoon the oil, onions and chili over the sweet potatoes. Dot the figs among the wedges, and then drizzle over the balsamic reduction. Serve at room temperature. Crumble the cheese over the top, if using."}], "link": "https://cooking.nytimes.com/recipes/12959-roasted-sweet-potatoes-and-fresh-figs"}