{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Walnut Galette", "description": "A great rustic apple pie for Thanksgiving, this has very little butter in the pastry and a minimum of sweetening. It’s all about the apples.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/20/science/20recipehealth/20recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "1 9-inch galette, serving 8", "recipeCuisine": "french", "recipeCategory": "", "keywords": "apple, walnut, dessert, fall, winter, halal, healthy, kosher, low-sodium, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 84}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 180, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "19 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 dessert galette pastry (1/2 <a href=\"http://cooking.nytimes.com/recipes/12722-dessert-galette-pastry\">recipe</a>)", "Juice of 1/2 lemon", "2 pounds slightly tart apples, like Braeburns, peeled, cored and cut in wedges (about 1/2 inch thick at the thickest point)", "2 tablespoons (1 ounce) unsalted butter", "1/4 cup (50 grams) plus 1 tablespoon dark brown sugar or turbinado sugar", "1 teaspoon vanilla extract", "1/4 cup lightly toasted walnuts, chopped", "3/4 teaspoon cinnamon", "1/4 teaspoon freshly grated nutmeg", "1/4 cup (25 grams) almond flour", "1 egg beaten with 1 teaspoon milk, for egg wash"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 sheet pans with parchment. In a large bowl combine the lemon juice and apples and toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy frying pan over high heat and add the butter. Wait until it becomes light brown and carefully add the apples and 1/4 cup of the sugar. Do not add the apples until the pan and the butter are hot enough or they won’t sear properly and retain their juice. But be careful when you add them so that the hot butter doesn’t splatter. When the apples are brown on one side, add the vanilla, 1/2 teaspoon of the cinnamon and the nutmeg, flip the apples and continue to sauté until golden brown, about 5 to 7 minutes. Stir in the walnuts, then scrape out onto one of the lined sheet pans and allow to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pastry from the freezer and place it on the other parchment-lined baking sheet. Leave to thaw while the apples cool, but don’t keep it out of the freezer for too long. It’s easiest to handle if it’s cold and will thaw quickly. You just want it soft enough so that you can manipulate it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the almond flour over the pastry, leaving a 2- to 3-inch border all around. Place the apples on top. Fold the edges of the dough in over the fruit, pleating the edges as you work your way around the fruit to form a free-form tart that is roughly 9 inches in diameter. Place in the freezer on the baking sheet for 45 minutes to an hour. This helps the galette maintain its shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile preheat the oven to 350 degrees. Remove the galette from the freezer. Brush the exposed edge of the pastry with the egg wash. Combine the remaining tablespoon of sugar and 1/4 teaspoon cinnamon and sprinkle over the fruit and the crust. Place in the oven and bake 1 hour, until the crust is nicely browned and the apples are sizzling. Remove from the oven and allow to cool for at least 15 minutes. Serve hot, warm or at room temperature."}]}