{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Pear Strudel With Dried Fruit and Almonds", "description": "This strudel is made with phyllo dough. When I tested it the first time, I found that I had enough filling for two strudels. Rather than cut the amount of filling, I increased the number of strudels to 2, as this is a dessert you can assemble and keep, unbaked, in the freezer.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/20/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "2 strudels, each serving 8", "recipeCuisine": "american", "recipeCategory": "", "keywords": "apple, dried fruit, pear, dessert, fall, winter, halal, kosher, low cholesterol, low-sodium, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "recipeIngredient": ["1/2 pound mixed dried fruit, like raisins, currants, chopped dried figs, chopped dried apricots, dried cranberries", "1 1/2 pounds apples (3 large) (I recommend Braeburns), peeled, cored and cut in 1/2-inch dice", "1 tablespoon fresh lemon juice", "2 tablespoons unsalted butter for cooking the apples", "1/4 cup (50 grams) brown sugar", "1 teaspoon vanilla", "1 teaspoon cinnamon", "1/2 teaspoon freshly grated nutmeg", "1/4 cup (30 grams) chopped or slivered almonds", "3/4 pound (1 large or 2 small) ripe but firm pears, peeled, cored and cut in 1/2-inch dice", "8 sheets phyllo dough", "7/8 cup (100 grams) almond flour, divided", "1 1/2 ounces butter, melted, for brushing the phyllo"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Line 2 sheet pans with parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried fruit in a bowl and pour on hot or boiling water to cover. Let sit 5 minutes, and drain. Toss the apples with the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy frying pan over high heat and add 2 tablespoons butter. Wait until it becomes light brown and carefully add the apples and the sugar. Do not add the apples until the pan and the butter are hot enough, or they won’t sear properly and retain their juice. But be careful when you add them so that the hot butter doesn’t splatter. When the apples are brown on one side, add the vanilla, cinnamon, nutmeg and almonds, flip the apples and continue to sauté until golden brown, about 5 to 7 minutes. Stir in the pears and dried fruit, then scrape out onto one of the lined sheet pans and allow to cool completely. Divide into two equal portions (easiest to do this if you weigh it)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 8 sheets of phyllo dough on your work surface. Cover with a dish towel and place another, damp dish towel on top of the first towel. Place a sheet of parchment on your work surface horizontally, with the long edge close to you. Lay a sheet of phyllo dough on the parchment. Brush lightly with butter and top with the next sheet. Continue to layer all eight sheets, brushing each one with butter before topping with the next one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top sheet of phyllo dough with butter. Sprinkle on half of the almond powder (50 grams). With the other half, create a line 3 inches from the base of the dough, leaving a 2 1/2-inch margin on the sides. Top this line with one portion of the fruit mixture. Fold the bottom edge of the phyllo up over the filling, then fold the ends over and roll up like a burrito. Using the parchment paper to help you, lift the strudel and place it on the other parchment-lined baking sheet. Brush with butter and make 3 or 4 slits on the diagonal along the length of the strudel. Repeat with the other sheets of phyllo to make a second strudel. If you are freezing one of them, double-wrap tightly in plastic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the strudel in the oven and bake 20 minutes. Remove from the oven, brush again with butter, rotate the pan and return to the oven. Continue to bake for another 20 to 25 minutes, or until golden brown. Remove from the heat and allow to cool for at least 15 minutes. Serve warm or room temperature."}], "link": "https://cooking.nytimes.com/recipes/12963-apple-pear-strudel-with-dried-fruit-and-almonds"}