{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Brussels Sprout Salad With Smoked Feta and Candied Pecans", "description": "This recipe came to The Times by way of Amy Lawrence, and her husband, Justin Fox Burks, who developed it for their blog, the Chubby Vegetarian. The trick to this salad is to blanch the brussels sprouts in salty water to remove the bitterness. The candied pecans combined with smoky feta creates a heavenly dish. “Even the little kids eat it,’’ said Ms. Lawrence.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "salads and dressings", "keywords": "brussels sprouts, feta, pecans, fall, gluten-free, kosher, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 555, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "8 grams", "proteinContent": "11 grams", "saturatedFatContent": "8 grams", "sodiumContent": "495 milligrams", "sugarContent": "19 grams", "transFatContent": null}, "recipeIngredient": ["1 pound brussels sprouts (15 to 20 larger ones work best here)", "1/4 cup vegan cane sugar", "1 1/2 cups whole roasted and salted pecans", "4 ounces smoked feta", "4 tablespoons olive oil", "2 tablespoons golden balsamic vinegar", "Sea salt flakes and cracked black pepper (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start by tearing apart the brussels sprouts. Cut off about 1/3 of the stem end and pull the leaves apart; this takes some time, but it’s worth it. Start by pressing outward with your thumbs on the cut side. This will yield the largest leaves and make for a fluffier salad. When you get to the core, just split it in half and throw it in with the leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the leaves in boiling, salted water (as salty as the sea) until they turn bright green. This will take 10 seconds. Run the leaves under cold water to stop the cooking. Dry the sprout leaves in a salad spinner or lay them out on a clean towel to dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the sugar in a cold 10-inch frying pan and melt it over medium heat. Once the edges of the sugar start to melt, stir the sugar until all the lumps disappear. Remove from the heat. Toss the pecans in the melted sugar until coated. It will look a bit like spun sugar as you stir the pecans into the sugar, and the pecans will stick together as they cool. Transfer to a plate to cool completely. Once the pecans have cooled, break the mass apart using your hands. Roughly chop the pecans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the feta into a 1/4-inch dice. If you cannot find smoked feta in your area, just use feta cheese and add 1/4 teaspoon Liquid Smoke to the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now you’re ready to assemble the salad. Place 4 tablespoons of olive oil and 2 tablespoons of vinegar into a large frying pan over low heat. The heat should not be so high that the dressing sizzles. Once the dressing is warm, place the sprout leaves in the pan and toss with the dressing. Transfer to a large plate. Sprinkle with cheese and nuts. Add salt and pepper to taste."}], "link": "https://cooking.nytimes.com/recipes/12972-warm-brussels-sprout-salad-with-smoked-feta-and-candied-pecans"}