{"@context": "http://schema.org", "@type": "Recipe", "name": "A Cream for All Seasons", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, eggs, heavy cream", "aggregateRating": null, "recipeIngredient": ["4 whole eggs", "2 egg yolks", "1 3/4 cups whipping or heavy cream (not ultrapasteurized)", "1/4 cup creme fraiche or heavy cream", "1/2 cup vanilla sugar", "2 teaspoons orange-flower water, available from Middle Eastern stores", "Finely grated peel of 1/2 lemon", "1/2 cup granulated sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water to boil in bottom half of a double boiler. In the top half beat together the whole eggs and yolks until they are thick and foamy. Beating continuously, slowly pour in the cream and creme fraiche; then beat in the vanilla sugar, orange-flower water and lemon peel. Have a bowl or pan of ice water on the side to use for chilling the mixture. Place over slowly simmering water and cook, stirring constantly, until the cream is custardy, or so thick the spoon or whisk leaves traces. If it starts to curdle, immediately plunge the top half of the boiler into the bowl of ice water and stir vigorously to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If it is ice cream weather, allow custard to cool; then freeze according to directions of your ice-cream maker. Or to make burnt cream, strain it through a fine sieve into six ramekins or small individual souffle dishes and leave to cool thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cream is cold, rub the granulated sugar through a strainer to form an even layer, about an eighth of an inch thick, on top of each ramekin. No custard should show through. Put the ramekins in a baking dish or shallow roasting pan and fill the pan with ice and water to come halfway up the sides of the ramekins. Heat the broiler as hot as you can and run the pan under it, turning the pan if necessary, until the sugar is melted and brown. Don't burn the sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve within two hours of browning the sugar. Otherwise the glasslike glaze begins to soften and the appearance is ruined, although the flavor is still good."}], "link": "https://cooking.nytimes.com/recipes/1361-a-cream-for-all-seasons"}