{"@context": "http://schema.org", "@type": "Recipe", "name": "Merguez and Lamb Couscous", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "african", "recipeCategory": "dinner", "keywords": "couscous, lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["2 pounds lamb neck or shoulder, trimmed of fat and cut into 2-inch pieces (on the bone)", "2 lamb shanks, trimmed, meat removed and cut into 2-inch pieces", "10 medium-size onions, skinned and cut into 1/2-inch pieces", "1/2 rutabaga, skinned and cut into 2-inch cubes", "1 head fennel, cut into 2-inch-thick slices", "1 tablespoon salt", "4 teaspoons ground pepper", "2 teaspoons ground ginger", "2 1/2 cups slow-cooking couscous", "3 tablespoons olive oil", "15 medium carrots, scraped, halved and cut into 2-inch lengths", "3/4 pound seedless raisins", "2 cups (1 can) chickpeas, drained", "1 pound merguez, or any good spicy sausage, cut into 2-inch lengths"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lamb in a deep kettle (preferably one with a steamer attachment on top). Add onions, rutabaga and fennel. Season with salt, and add 4 quarts cold water (it should cover the ingredients), black pepper and ginger."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil, reduce heat and simmer for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place couscous in a large bowl, and cover with cold water. Mix thoroughly with your hands to break up lumps. Transfer couscous to a steamer attachment with fine holes (if you do not have one, try a colander), and drain the couscous into a separate bowl. Then, transfer couscous to the original large mixing bowl, and let sit 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break up the couscous again with your hands, and return it to the steamer or colander. Place the steamer over the simmering lamb and vegetables. Cover and let steam for about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return couscous to a large bowl and, when it is cool, grease your hands with the olive oil and mix the grains thoroughly, breaking up any lumps. Do this several times, adding more oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return couscous to steamer, and place over simmering meat and vegetable liquid, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat has cooked for 45 minutes, add carrots, raisins, chickpeas and merguez. Taste broth for seasoning. Add more pepper if necessary (withhold salt until the end). Simmer for another 20 minutes. (At this point the stew may be set aside to cool, scraped of any surface fat, and reheated before serving. Place couscous in a large bowl and cover with a damp towel.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready for final cooking, place stew over a medium-low flame. Place a couscous-filled steamer on top, covered. Bring to a boil, reduce to simmer and cook for 20 minutes. Taste for seasonings before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a mound of couscous on a warm plate. Cover with meat, vegetables and broth. Serve with hot sauce, like Tabasco, on the side."}]}