{"@context": "http://schema.org", "@type": "Recipe", "name": "Walnut-Steamed Pudding With Vanilla-Orange Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "sauces and gravies", "keywords": "all-purpose flour, brandy, walnut, dessert, vegetarian, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 413, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "9 grams", "sodiumContent": "345 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup unsalted butter, melted", "1/2 cup sugar", "1/2 cup dark brown sugar", "2 eggs", "1/2 cup milk", "1/4 cup brandy", "2 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon salt", "1 cup toasted walnuts, ground", "1 cup milk", "1/2 vanilla bean, split, seeds scraped from pod", "2 teaspoons grated orange zest", "3 egg yolks", "2 tablespoons sugar", "2 tablespoons fresh orange juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make pudding, butter a 2-quart souffle dish with a tightly fitted lid. Have ready a pot with a lid, large enough to hold the covered souffle dish and a rack that will fit in the bottom of the pot to allow water to circulate freely under the dish. Bring a large saucepan of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk the butter and the sugars together in a large bowl. Whisk in eggs, milk and brandy. In another bowl, combine flour, baking powder, salt and walnuts. Add butter mixture and stir just until smooth. Scrape mixture into buttered dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rack in the bottom of the pot. Cover souffle dish and place it in the pot. Pour in enough boiling water to come halfway up the sides of the souffle dish and cover. Check occasionally to make sure there is enough water and that it is simmering; add boiling water if necessary. Steam the pudding until a skewer inserted into the center barely comes out clean, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make sauce, place milk, vanilla seeds and pod and orange zest in a saucepan. Whisk yolks and sugar together in a bowl. Bring milk mixture just to a boil. Whisking rapidly, slowly pour the milk into the egg mixture. Pour mixture back into pan and place over low heat. Cook, stirring constantly, until sauce thickens enough to coat the back of a spoon -- do not let it come to a boil. Remove from heat and strain through a fine sieve. Whisk in orange juice. Refrigerate until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the souffle dish from the pot, uncover and let cool for 10 minutes. Unmold. Cut into wedges, place each wedge on a plate and surround with a pool of the orange sauce. The pudding can also be served at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1385-walnut-steamed-pudding-with-vanilla-orange-sauce"}