{"@context": "http://schema.org", "@type": "Recipe", "name": "Frances Bissell's Turkey Fillets With Pomegranate Sauce", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT40M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, pomegranate, turkey breast, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 557, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "9 grams", "proteinContent": "43 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1094 milligrams", "sugarContent": "30 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 turkey breast fillets, weighing approximately 6 ounces each", "6 ripe, red pomegranates", "2 tablespoons walnut oil", "4 cloves garlic, peeled and crushed", "1 tablespoon juniper berries", "1/2 teaspoon ground cardamom", "1/2 teaspoon ground cumin", "2 ounces (half a stick) unsalted butter, cut in 2 equal pieces", "2 1/2 cups rich turkey stock, made from the wings and giblets of the bird", "Salt and pepper to taste", "Fresh walnut halves to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slightly flatten the turkey fillets and place in a single layer in a shallow dish. Cut the pomegranates in half. Remove about 30 to 40 seeds and reserve for garnish. Squeeze the pomegranate halves as you would lemons, straining out the seeds, to extract as much juice as possible. Add the walnut oil, garlic, juniper berries and spices. Pour over the meat, cover and marinate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, remove the fillets, reserving the marinade. Dry the meat on paper towels. Melt half of one of the butter pieces in a large heavy frying pan until it is nut-brown. Then add four of the turkey fillets in a single layer. Cook over high heat to brown the meat thoroughly, then lower the heat and cook for about four to five minutes. Raise the heat again, turn the meat over and brown the other side. Lower the heat and cook gently, until the meat is done, four to five minutes. Remove the fillets from the pan and keep them warm on a covered platter while you repeat the cooking process with the remaining half of the butter and fillets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the turkey fillets are done and removed from the pan, cut the remaining piece of butter into four equal pieces. Raise the heat under the pan, add the marinade and stock and cook rapidly, scraping up all the brown bits from the bottom of the pan, until the sauce is reduced to about half a cup of syrupy glaze. Correct seasonings, adding salt and pepper to taste. Remove from the heat and rapidly beat in the remaining butter, one piece at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the sauce among the plates, arranging the turkey fillets on top, and garnish with two or three walnut halves and the pomegranate seeds."}]}