{"@context": "http://schema.org", "@type": "Recipe", "name": "Semi-Classic Hunter Sauce", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "2 1/2 - 3 cups", "recipeCuisine": "", "recipeCategory": "dinner, condiments, sauces and gravies", "keywords": "beef stock, canned tomatoes, mushroom, fall", "aggregateRating": null, "recipeIngredient": ["5 whole canned tomatoes", "4 cups good beef stock, preferably homemade", "1 1/2 cups dry white wine", "1 onion, coarsely chopped", "2 stalks celery, coarsely chopped", "2 carrots, peeled and coarsely chopped", "8 to 10 whole black peppercorns", "1 bay leaf", "1 teaspoon wild mushroom powder (optional - see note)", "1/2 pound mushrooms, wiped clean, stems removed", "4 tablespoons ( 1/2 stick) unsalted butter", "2 tablespoons Cognac or brandy", "1 tablespoon extra-virgin olive oil", "4 to 5 shallots, peeled and finely chopped", "2 teaspoons finely chopped fresh sage, or 1/2 teaspoon dried", "2 tablespoons flour", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Seed the tomatoes, reserving juices. Finely chop the tomatoes and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the beef stock in a three-quart saucepan with one cup of the wine, the reserved tomato liquid and the onion, celery, carrots, peppercorns and bay leaf. Bring to a boil, reduce the heat and simmer, uncovered, for one to one-and-a-half hours, until reduced to about two cups. Strain the liquid into a bowl and discard the solids. Return the broth to the saucepan and hold over a low flame."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broth is reducing, wipe the mushrooms clean and remove any tough stems. Cut the caps into quarter-inch dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat three tablespoons of butter in a large skillet over medium-high heat. Add the diced mushrooms and optional mushroom powder and cook, stirring occasionally, until the mushrooms are tender and lightly browned, about five to seven minutes. Add the Cognac or brandy and cook, stirring, until the liquids are reduced to just a glaze. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining tablespoon of butter and the olive oil in a two-quart saucepan over medium heat. Add the shallots and sage and saute until soft but not browned, about five to seven minutes. Sprinkle with flour and cook, stirring constantly, until the shallots are coated. Raise the heat, pour in warm broth and cook, stirring, until well blended. Add the remaining half cup of wine, the diced tomatoes and sauteed mushrooms. Cook over medium heat for 10 minutes, until the sauce is slightly thickened and the flavors are incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with roast or sauteed chicken or veal, or over other meats."}]}