{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild-Mushroom Pie With Polenta Crust", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H", "recipeYield": "Ten servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, vegetarian, wild mushrooms, yellow cornmeal, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 239, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "819 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 cups water", "1 cup yellow cornmeal", "1/3 cup mascarpone", "2 teaspoons kosher salt", "Freshly ground pepper to taste", "1 ounce dried porcini", "4 cups water", "3 pounds mixed wild mushrooms (like portobello, shiitake and cremini), cut into large dice, stems reserved", "1/4 cup olive oil", "3 shallots, peeled and minced", "1 cup sherry", "2 teaspoons kosher salt plus more to taste", "Freshly ground pepper to taste", "2 eggs", "1/3 cup chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, bring the water to a boil in a medium saucepan. Whisking constantly, add the cornmeal in a very thin, steady stream. Turn the heat as low as possible. Cook for 1 hour, stirring vigorously every 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the porcini and water in a large saucepan. Simmer for 30 minutes. Drain, reserving the mushrooms and broth. Coarsely chop the porcini and set aside. Return the broth to the pan, add the wild-mushroom stems and simmer slowly until reduced to 1 cup, about 25 minutes. Strain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of oil in a large skillet over medium heat. Add the shallots; saute 2 minutes. Add 1 tablespoon of oil and 1/3 of the mixed wild mushrooms; saute until browned and softened, about 5 minutes. Place in a bowl. Repeat until the remaining oil and mushrooms are used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With no mushrooms in the skillet, add the sherry and simmer, scraping the bottom of the skillet with a wooden spoon, until reduced to 1/2 cup. Add the mushroom broth, all of the mushrooms, the salt and pepper. Bring to a simmer, cover and cook for 20 minutes. Taste and adjust seasoning. Whisk the eggs in a bowl and whisk in 1 cup of the mushroom mixture. Stir the egg mixture into the skillet. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. While the cornmeal mixture is hot, stir in the mascarpone, salt and pepper. Generously brush a 10-inch springform pan with olive oil. Place the polenta in the pan, cover with a sheet of plastic wrap and press it evenly over the bottom and 3/4 of the way up the sides of the pan. Discard the plastic. Spoon the mushrooms into the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie for 1 hour. Garnish with the parsley. Serve hot or, for neater slices, at room temperature."}], "link": "https://cooking.nytimes.com/recipes/14-wild-mushroom-pie-with-polenta-crust"}