{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Salmon Pate", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H", "recipeYield": "10 - 12 servings", "recipeCuisine": "spanish", "recipeCategory": "", "keywords": "appetizer, salmon, smoked salmon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 15}, "recipeIngredient": ["1 tablespoon olive oil", "1 medium tomato finely chopped", "Coarse salt to taste", "1/2 pound smoked salmon (not too salty)", "1/2 pound fresh salmon, skinned and boned", "2 eggs", "White pepper, freshly ground", "1 1/2 cups heavy cream", "2 tablespoons diced cured ham, cut from a 1/4-inch-thick slice", "Unsalted butter", "Bread crumbs", "A 1/2 pound avocado, halved lengthwise, peeled and pitted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make a simple tomato sauce, heat the oil in a small skillet. Add the tomato and salt and cook over low heat for two to three minutes, until the tomato is softened. Strain, pressing with the back of a wooden spoon to extract as much liquid as possible. Reserve four tablespoons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the smoked and fresh salmon in the bowl of a processor or blender and beat until smooth. Beat in the eggs, reserved tomato sauce and pepper. With the motor running, pour in the cream gradually. With an on-off motion, blend in the ham. Taste for salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 9 1/4-by-5 1/4-by-2 3/4-inch loaf pan generously, then dust with bread crumbs. Pour half of the salmon mixture into the pan. Arrange the avocado halves cut side down (if the halves seem to protrude too far for the rest of the salmon to cover them, trim the cut side) and cover with the rest of the salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pan tightly with foil and place in a larger pan of hot water (bain-marie). Bring to a boil on top of the stove, then lower the heat to medium low and continue cooking for one-and-a-half hours. Remove the mold from the water, loosen the foil and cool. Refrigerate until cold. Unmold and serve chilled and sliced."}]}