{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic Souffle", "description": "This gentle, earthy soufflé first appeared on the menu of Chez Panisse, Alice Waters’s groundbreaking restaurant in Berkeley, Calif., and was brought to The Times by Craig Claiborne and Pierre Franey, who called it “splendid.” That it is. (The New York Times)", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Garlic-Souffle/Garlic-Souffle-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 697, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "1 gram", "proteinContent": "24 grams", "saturatedFatContent": "33 grams", "sodiumContent": "564 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 large garlic bulb (head), broken into individual cloves, plus 3 additional cloves for the basic cream sauce", "1/4 cup olive oil", "1/4 cup water", "2 teaspoons dried thyme", "3 bay leaves", "Salt to taste, if desired", "Freshly ground pepper to taste", "6 tablespoons butter, plus butter for greasing a dish for the souffle", "5 tablespoons flour", "1 1/2 cups half and-half", "1 cup heavy cream", "1 small onion, peeled and quartered", "4 sprigs parsley", "10 peppercorns", "5 eggs, separated", "1 cup finely grated Gruyere or Swiss cheese", "1 2/3 cups finely grated Parmesan cheese", "1/8 teaspoon cayenne pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 250 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside three cloves of garlic for the basic sauce. Put the remaining garlic cloves in a small, shallow baking dish and add the olive oil, water, one-half teaspoon thyme, one bay leaf, salt and pepper. Cover closely and place in the oven. Bake one and one-half hours or until the garlic is totally tender. Baste the garlic pieces occasionally as they cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the six tablespoons butter in a heavy saucepan and add the flour, stirring with a wire whisk. Bring the half-andhalf and heavy cream to the boil in a small saucepan and add it to the flour and butter mixture, stirring rapidly with the whisk. When thickened and smooth, add salt to taste. Set the saucepan in a basin of simmering water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tie the quartered onion, the reserved garlic cloves, one-half teaspoon thyme, the remaining two bay leaves, parsley sprigs and peppercorns in a small square of cheesecloth. Bring up the ends and tie them to make a bag. Add this to the sauce. Cover closely and let the sauce cook in simmering water about one hour, stirring the sauce occasionally. Remove the saucepan from the water and let it cool briefly. Remove and discard the cheesecloth bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the oven heat to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the baked garlic through a food mill, pressing to extract as much pulp and liquid as possible from the solids. Or press it through a sieve, using a pestle. There should be about one and one-half tablespoons. Add this to the cream sauce and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the egg yolks, the Gruyere or Swiss cheese and two-thirds cup of the Parmesan and beat well to blend. Add the cayenne, salt and pepper and blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until stiff. Add half of them to the cheese sauce and beat them in. Add the remaining whites and fold them quickly until well distributed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously butter a 12-inch oval, ovenproof platter. Pour in the souffle mixture. Sprinkle with the remaining cheese and thyme. Place on the top rack of the oven and bake 10 minutes until well browned."}], "link": "https://cooking.nytimes.com/recipes/1424-garlic-souffle"}