{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck with Olives in Sherry Sauce (Pato a la Sevillana)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT3H35M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "duck, olives, sherry, main course", "aggregateRating": null, "recipeIngredient": ["1 four-and-one-half- to five-pound duck, cleaned weight", "2 onion slices", "2 whole garlic cloves, peeled", "1/2 cup coarsely chopped or thinly sliced pitted Spanish olives (without pimento)", "1/2 cup dry white wine", "2 tablespoons olive oil", "1/2 cup finely chopped onion", "1 tablespoon finely minced garlic", "1/2 cup Sherry wine", "1/2 cup, plus three or four tablespoons, rich fresh or canned chicken broth", "1 cup scraped, thinly sliced carrots", "1 sprig fresh parsley", "1/4 teaspoon dried thyme", "1 bay leaf", "4 peppercorns", "Salt to taste, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prick the duck all over the skin with a two-pronged fork. Insert the onion slices and garlic cloves inside the duck. Truss the duck. Place it breast side up in a shallow baking or roasting pan and arrange the neck, if available, around it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the duck in the oven and bake one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the olives in a small saucepan and half of the white wine. Let simmer five minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a shallow ovenproof casserole. Add the chopped onion and minced garlic, and cook, stirring, until onion is wilted. Add the sherry, one-half cup chicken broth, carrots, parsley, thyme, bay leaf, peppercorns and salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the duck has baked for one hour, remove it from the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the duck to a flat surface and cut it into quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the fat from the roasting pan. Add the remaining white wine, cooking over moderate heat and stirring to dissolve the juices that cling to the bottom and sides of the pan. Pour the pan liquid into the casserole containing the vegetable mixture. Let simmer five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the duck pieces skin-side-up over the vegetables, spooning some of the sauce over the pieces. Return to the oven and bake one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the duck pieces to a serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a sieve inside a saucepan. Skim off any more fat from the duck. Pour and scrape the vegetables and nonfat pan juices into the sieve and strain. Press the solids with the back of a heavy spoon to extract as much liquid as possible. Discard the solids. Add three or four additional tablespoons of chicken broth if desired and add the olives. Heat the sauce and pour it over the duck."}], "link": "https://cooking.nytimes.com/recipes/1426-duck-with-olives-in-sherry-sauce-pato-a-la-sevillana"}