{"@context": "http://schema.org", "@type": "Recipe", "name": "Swedish Mulled Wine (Glogg)", "description": "One of the most interesting hot mulled wines is Swedish glogg (pronounced glook), a heady combination of red wine, sauternes and aquavit, enriched with raisins and almonds. Glogg is traditionally served in mugs with tiny spoons for eating the nuts and fruit.\n\nThe recipe relies on a process called mulling. The term has the same root as our word mill (as in milling or grinding) and herein lies one of the secrets of holiday bartending. Whole spices, like cinnamon sticks, allspice berries, cardamom pods, blades of mace and whole nutmegs, have more flavor than pre-ground spices. Bruise seed spices, like cloves or cardamom, in a mortar and pestle or beneath a heavy skillet. Whole nutmegs should be freshly grated. Fresh ginger is so widely available, there is little excuse to use powdered.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": null, "totalTime": "PT25M", "recipeYield": "12 servings", "recipeCuisine": "scandinavian", "recipeCategory": "", "keywords": "dry red wine, fruit, spices, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 136}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 342, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "13 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 bottles dry red wine", "1 bottle sweet white wine, like sauternes or German spaetlese", "1 lemon", "1 orange", "10 cloves", "10 cardamom pods", "3 cinnamon sticks", "1 inch fresh ginger, thinly sliced", "1 cup raisins", "1 cup blanched almonds", "1 cup sugar (or to taste)", "1 tablespoon bitters", "1 cup aquavit or vodka (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine wines in a large saucepan. Using a vegetable peeler, remove the zest of citrus fruits. Squeeze fruits and add juice to wine. Tie up lemon peel, orange peel and spices in cheesecloth and add to wine. Add raisins, almonds and sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring wine mixture to a boil. Reduce heat and gently simmer for 15 minutes, or until flavors are well blended and almonds are soft. Skim wine from time to time to remove any foam. Taste glogg and add sugar as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add bitters and aquavit or vodka. Ladle glogg into mugs or cups and provide each guest a spoon for eating the raisins and almonds."}], "link": "https://cooking.nytimes.com/recipes/1448-swedish-mulled-wine-glogg"}