{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Pate (Pate de legumes)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "appetizer, carrot, red beets, veal, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 227, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "16 grams", "saturatedFatContent": "8 grams", "sodiumContent": "591 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 beets, about one and one-quarter pounds", "1 pound carrots, trimmed, scraped and cut into rounds, about two and one-half cups", "2 pounds spinach in bulk or two 10-ounce packages cleaned spinach", "1 1/2 pounds lean veal", "1 egg", "1 1/2 cups heavy cream", "Salt to taste, if desired", "Freshly ground pepper to taste", "1/8 teaspoon freshly grated nutmeg", "Corn, peanut or vegetable oil for greasing the pan", "Sauce fines herbes (<a href=\"http://cooking.nytimes.com/recipes/1461-herb-mayonnaise-sauce-fines-herbes\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off and discard the stems from the beets. Put the beets in a saucepan. Add water to cover and bring to the boil. Let simmer about 35 minutes or until tender. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, drop the carrots into a saucepan of boiling water. Cook about five minutes. Drain. Put the carrots into the container of a food processor or electric blender and blend thoroughly. There should be about one and one-half cups. Spoon and scrape the mixture into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the spinach into a kettle of boiling water and stir down. Let cook about one minute. Drain well. When cool enough to handle, squeeze to extract most of the liquid. Put the spinach into the container of a food processor or electric blender and process until smooth. There should be about one and one-half cups. Spoon and scrape this into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the veal into the container of a food processor or electric blender and blend well. Add the egg and blend. Gradually add the cream while blending. Season with salt, pepper and nutmeg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one-third of the veal mixture to the spinach and blend thoroughly. Add another third to the carrots and blend well. Set both mixtures aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the beets and put the slices into the container of a food processor or electric blender. Blend thoroughly. Spoon and scrape the mixture into a mixing bowl. Add the remaining veal mixture and blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using oil, lightly grease the inside of a loaf pan that measures nine by five by two and three-quarter inches. The goal in filling the pan is to achieve a checkered pattern with each puree. Fill the bottom of the pan with two evenly packed lengthwise layers, using one-half of the spinach mixture and one-half of the carrot mixture. Spoon the spinach mixture carefully to cover half of the bottom of the pan lengthwise, smoothing over the top. Spoon the carrot mixture next to it, smoothing over the top. Top the spinach mixture with onehalf of the beet mixture, smoothing over the top. Top the carrot mixture with the remaining spinach mixture, smoothing over the top. Top the beet mixture with the remaining carrot mixture, smoothing over the top. Top the middle spinach mixture with the remaining beet mixture, smoothing over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the loaf pan closely with aluminum foil. Place the loaf pan in a basin of water and bring it to the boil on top of the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pans in the oven and bake one hour and 15 minutes. Remove and let cool. Chill thoroughly before unmolding and slicing. Serve with sauce fine herbes."}]}