{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Beans With Ginger and Garlic", "description": "Here is a recipe for fresh green beans, boiled just until barely tender and bright green, then tossed in a pan with minced garlic and ginger. The beans can be cooked a day ahead, leaving nothing more to do before the meal than to assemble everything over high heat.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/10/23/dining/jm-green-beans-with-ginger-and-garlic/jm-green-beans-with-ginger-and-garlic-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "fall, garlic, ginger, green beans, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1131}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 88, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "285 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "2 1/2 pounds green beans (French-style slim haricots verts work especially well), trimmed", "4 tablespoons vegetable oil", "1/4 cup minced fresh ginger (about 6 inches ginger root, peeled)", "4 medium-size garlic cloves, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil, and fill a large bowl with ice water. Working in two batches, boil beans until just tender but still crisp and bright green. Start testing after 4 minutes or so, being careful not to overcook. When done, plunge beans into ice water to stop cooking, lift out immediately when cool and drain on towels. (Recipe can be made to this point up to a day in advance and kept refrigerated, wrapped in towels.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat 2 tablespoons oil in a wide skillet over high heat. Add half the beans, half the ginger and half the garlic, and cook, stirring and tossing constantly, until beans are heated through and ginger and garlic are softened and aromatic. Sprinkle with salt, and remove to a serving dish. Repeat with remaining oil, beans, ginger and garlic. Serve."}]}