{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Free-Form Sweet Potato Tart", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, pie dough, sweet potato, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "339 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plus 2 tablespoons all-purpose flour (about 5 ounces), more for rolling", "1/2 teaspoon salt", "8 tablespoons (1 stick) cold unsalted butter, cut into about 8 pieces", "3 tablespoons ice water, more if necessary", "Butter for greasing baking sheet", "2 tablespoons olive oil", "1 medium red onion, chopped", "2 tablespoons minced garlic", "Salt and black pepper", "1 tablespoon chile powder", "1/4 cup tomato paste", "2 pounds sweet potatoes, peeled and grated, about 4 cups"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine flour and salt in a food processor and pulse once or twice. Add butter and turn on machine; process until butter and flour are blended and mixture looks like cornmeal, about 10 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put mixture in a bowl and add 3 tablespoons ice water; mix with your hands until you can form dough into a ball, adding another tablespoon or two of ice water if necessary; if you overdo it and mixture becomes sodden, add a little more flour. Form into a ball, wrap in plastic and freeze for 10 minutes or refrigerate for at least 30 minutes. (You can refrigerate for up to a couple of days or freeze for up to a couple of weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling: Put oil in a small skillet over medium-high heat. Add onion and cook, stirring occasionally, until softened, 2 or 3 minutes; add garlic, stirring constantly, and cook for another minute. Sprinkle with salt and pepper, then stir in chile powder and tomato paste. Cook and stir until fragrant, less than a minute; then toss with sweet potatoes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Grease a large rimless baking sheet or line it with a piece of parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a clean countertop with flour, put chilled dough on it, and sprinkle top with flour. Use a rolling pin to roll dough into a circle at least 12 inches in diameter, adding flour and rotating and turning dough as needed; it is O.K. if it's not perfectly round. Use ragged edges of dough to repair any tears, adding a drop of water while you press patch into place. (If dough is hard, let it rest for a few minutes. If dough is sticky, add a little flour; if it continues to become sticky and it is taking you more than a few minutes to roll it out, refrigerate or freeze again.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use rolling pin to transfer dough to prepared baking sheet. Toss sweet potato mixture again; taste and adjust seasoning if necessary. Carefully spread it on crust, leaving about 3 inches free all the way around edge. Fold sides up over filling. You should have a big circle open in top. Press down gently to flatten tart a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tart until crust is nicely browned and insides are bubbly, 45 to 50 minutes. Cool a bit before slicing or serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1474-savory-free-form-sweet-potato-tart"}