{"@context": "http://schema.org", "@type": "Recipe", "name": "Chou vert farci (Stuffed cabbage)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "10 - 12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cabbage, chicken liver, ground pork, main course, winter", "aggregateRating": null, "recipeIngredient": ["1 three-and-one-half-pound firm, unblemished cabbage", "1 tablespoon butter", "2 cups finely chopped mushrooms, about 1/2 pound", "1 cup finely chopped onion", "1 tablespoon finely chopped garlic", "1 1/2 bay leaves, finely minced", "1 1/2 teaspoons chopped fresh thyme or 1/2 teaspoon dried", "1/2 pound chicken livers, picked over to remove any tough fibers", "1 pound ground pork (with a small amount of fat included)", "Salt, if desired", "Freshly ground pepper", "2 eggs, lightly beaten", "1/2 cup finely chopped parsley", "1 cup fine fresh bread crumbs", "1/8 teaspoon freshly grated nutmeg", "1/8 teaspoon allspice", "1 1/2 pounds chicken wings", "3/4 pound pork bones, chopped into two-inch pieces", "1/2 cup coarsely chopped onion", "1/2 cup coarsely chopped carrots", "1/2 cup coarsely chopped celery", "1 whole clove garlic", "6 peppercorns", "1/2 cup dry white wine", "2 cups fresh or canned chicken broth", "1/4 cup tomato paste", "1 cup chopped, red, ripe tomatoes or imported canned tomatoes", "1 teaspoon arrowroot or cornstarch", "2 tablespoons dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, cut off the stem end of the cabbage. Cut out the core of the cabbage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large quantity of water to the boil in a kettle. Add the cabbage and cover. Let it boil, turning the cabbage so that it cooks evenly all over. As the cabbage cooks, separate the leaves at intervals and cook from 10 to 15 minutes. Drain thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a skillet and add the mushrooms and finely chopped onion. Cook, stirring, until onion is wilted and mushrooms have given up their liquid. Continue cooking until liquid evaporates. Add the finely minced garlic, half a bay leaf and half of the thyme and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop the livers or puree them in an electric blender or food processor. Add the livers and pork to the mushroom-and-onion mixture. Cook, stirring, about 30 seconds. Add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon and scrape the mixture into a mixing bowl. Let cool briefly. Add the eggs, parsley, bread crumbs, nutmeg and allspice. Add salt and pepper to taste and blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay out a large square of cheesecloth on a flat surface. Arrange six or seven of the large cabbage leaves in the center of the cheesecloth, the edges of the leaves slightly overlapping in a circular fan shape. The stem ends of the leaves should point outward and not to the center. Cover the middle of the circle of leaves with another large leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about one-third of the pork mixture into the center of the round layer of cabbage leaves. Spoon it almost but not quite to the outer edges of the leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another layer of slightly smaller leaves. Spread this with another third of the filling. Add another layer of leaves and a final third of the filling. Put the smallest leaves in the center of the final layer of filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring up the edges of the cheesecloth so that the leaves and filling are returned to a whole cabbage shape. Press the large cabbage together compactly and tighten the cheesecloth all around. Tie the cheesecloth into a tight bag and cut off the excess cheesecloth at the ends."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select a heavy casserole large enough to hold the stuffed cabbage. Add the chicken wings and pork bones and cook, stirring, until nicely browned. Add the coarsely chopped onion, carrots, celery, whole clove of garlic, peppercorns and the remaining bay leaf and thyme. Cook, stirring, about one minute. Pour off most of the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine, chicken broth, salt and pepper to taste. Add the tomato paste and stir. Add the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the cabbage tied side down and cover closely. Place in the oven and bake two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cabbage from the sauce. Untie and discard the cheesecloth. Arrange the cabbage on a baking dish. Return it to the oven and bake 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook down the sauce remaining in the casserole over moderately high heat five minutes. Strain the sauce, pressing the solids to extract as much liquid as possible. Put the sauce in a saucepan. Blend the arrowroot or cornstarch and wine and add it to the sauce, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the cabbage bakes for 10 minutes, baste it occasionally with the sauce. Serve with parsleyed potatoes."}]}