{"@context": "http://schema.org", "@type": "Recipe", "name": "Sesame-Coated Sautéed Chicken Breasts", "description": "Here is a classic recipe from Pierre Franey’s “60-Minute Gourmet,” one that happens not to take quite that long to cook at all. Sesame was a novel ingredient for him, he wrote in 1981, introduced to him by the cooking of “the late Virginia Lee, one of the finest Chinese chefs I have ever met. She used a lot of sesame oil and sesame paste in her flavorings, both in main courses and sauces such as that which accompanies a Mongolian hot pot.” Mr. Franey used sesame seeds as a coating quite a bit after that — on fish fillets, for example — and here adapted the idea to a main course, using whole, skinned, boned chicken breasts. “The dish turned out admirably in texture and flavor,” he wrote. Even better, “it is certainly easy to make, involving nothing more than coating the breast halves with the seeds and sauteing them briefly on both sides in butter. There is a final touch, a light ‘sauce’ made of hazelnut butter to which a dash of lemon juice is added.” (By that, Mr. Franey meant butter that is browned until it is hazelnut in color.)", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": "https://static01.nyt.com/images/2014/04/11/dining/sesamechicken/sesamechicken-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "easy, quick, times classics", "keywords": "chicken breast, sesame seeds, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 628}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 370, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "15 grams", "sodiumContent": "204 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 skinless, boneless chicken breast halves, about 1/4 pounds each, 2 pounds total weight", "Salt to taste, if desired", "Freshly ground pepper to taste", "3/4 cup sesame seeds", "7 tablespoons butter, approximately", "Juice of half a lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each chicken breast half between slices of wax paper or plastic wrap. Pound lightly with a mallet. Sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dredge the pieces on all sides in the sesame seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat three tablespoons of the butter in a large, heavy skillet and add the breasts in one layer. This may have to be done in two steps, or you may use two skillets. If two skillets are used, double the basic amount of butter. Cook about five minutes on one side. Turn and cook on the second side about five minutes. Then transfer them to a heated serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the four remaining tablespoons of butter in a skillet and add the lemon juice. Swirl the butter around until it is hazelnut brown. Pour this sauce over the chicken breasts and serve hot."}]}