{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Heritage Roast Turkey", "description": "", "author": {"@type": "Person", "name": "Kim Severson"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "butter, turkey, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 94, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "233 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 12-to 18-pound heritage turkey such as a Bronze or Bourbon Red, thawed, with giblets and neck removed", "3 tablespoons kosher salt", "1 1/2 tablespoons black pepper", "4 tablespoons butter, cut into four pieces", "1 medium onion, quartered", "2 stalks celery, cut in two or three pieces each", "1 medium apple, halved", "8 sprigs fresh thyme", "2 cups turkey broth, water or a mixture of half water and half apple juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least four hours before roasting, rub turkey inside and out with salt and pepper; refrigerate. Remove from refrigerator 45 minutes before roasting. Heat oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set turkey in roasting pan fitted with a V-shaped rack. Slip your fingers under skin to loosen it. Rub butter over breasts. Stuff vegetables, apple and thyme into cavity. Tuck wingtips under bird."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour broth or water into pan, around bird. Put turkey in oven and roast, uncovered, for 30 minutes. Reduce heat to 325, baste turkey with pan juices, cover with a foil tent and return to oven. Cook for another 30 minutes. Remove foil, baste again and place foil back on turkey. Cook for 30 more minutes. Remove foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When turkey has roasted for a total of two hours, insert a meat thermometer straight down into fleshiest part of thigh, where it meets drumstick. Check a second spot, then remove thermometer. (Do not let thermometer touch bone.) Thigh meat should reach no more than 165 degrees. Juices should run clear. (If bird is larger than 14 pounds, keep foil on longer and begin checking meat temperature at two and half hours.) To assure perfectly cooked white and dark meat, you may remove bird when meat thermometer shows thigh temperature at 155, then remove legs and roast them separately for another 15 to 30 minutes, depending on size of bird."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When bird has reached desired temperature, remove from oven and let rest for at least 30 minutes, covered in foil and with a damp towel on top of foil, to retain heat and allow juices to return to meat. Remove foil and towel and serve."}]}