{"@context": "http://schema.org", "@type": "Recipe", "name": "English Toffee", "description": "This heavenly chocolate-toffee is one of our favorite holiday treats to make (and eat). We know the thought of making candy can be intimidating, but it really needn't be. Sure, you need a candy thermometer, and you do need to pay close attention – the toffee can go from perfect to burnt in a matter of moments - but beyond that, it's pretty simple, and the results are spectacular. We recommend making two batches; one to give away as gifts, and the other to keep for yourself.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/ff-english-toffee/merlin_146899842_fa290a27-ca64-4089-9056-13370fecf3d6-articleLarge.jpg", "totalTime": "PT5H30M", "recipeYield": "5 pounds", "recipeCuisine": "british", "recipeCategory": "sauces and gravies", "keywords": "butter, milk chocolate, walnut, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 369}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 358, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "13 grams", "sodiumContent": "11 milligrams", "sugarContent": "32 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 pound walnuts, coarsely ground, divided", "1 pound semisweet chocolate, preferably Lindt or Tobler, grated (see note), divided", "2 1/2 cups sugar", "1 pound butter", "4 tablespoons light corn syrup", "5 1/2 ounces walnut meats, finely chopped", "1 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread half the ground nuts in a thin, even layer over 3/4 of an ungreased half-sheet baking pan. Spread half the chocolate over the nuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine sugar, butter, corn syrup, chopped walnuts and water in a heavy saucepan; place over medium heat. Cook, stirring constantly with a wooden spoon until a candy thermometer reads 280 degrees. Remove from heat, allow to stand a few minutes longer until thermometer reads 285 degrees. Pour the hot mixture over the nut and chocolate layers, use an offset spatula to evenly spread the toffee over the chocolate. Allow to cool for 1-2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle remaining chocolate evenly over the cooling syrup, and carefully spread the chocolate over the surface of the toffee. Then sprinkle on the remaining ground nuts. Let stand in a cool place (preferably not the kitchen) for at least five hours. Break or cut into bite-size pieces. If the chocolate has not hardened thoroughly, place the candies in the refrigerator for 10 to 15 minutes. Store in a covered container or in glass jars or decorated tins."}]}