{"@context": "http://schema.org", "@type": "Recipe", "name": "Cafe Marimba King's Bread", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H", "recipeYield": "1 large loaf", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "butter, flour, milk, dessert, winter", "aggregateRating": null, "recipeIngredient": ["3 1/2 cups flour, approximately", "1 package yeast", "1 teaspoon salt", "2/3 cup plus 1 tablespoon milk", "8 tablespoons butter", "2 large eggs", "1/2 cup chopped blanched almonds", "1/2 cup golden raisins", "2 tablespoons sugar", "1/2 teaspoon cinnamon", "Small clay doll, coin or other good-luck trinket (optional)", "2/3 cup confectioners' sugar", "1 tablespoon each slivered almonds and golden raisins for garnish", "1 tablespoon golden raisins"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine 1 1/2 cups of flour with the package of yeast and the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat to 115 degrees, 1/3 cup milk and 6 tablespoons of the butter in a saucepan. Stir this into the flour mixture. Beat eggs until well blended and stir into flour mixture. Add as much of the remaining flour as needed to make a soft dough, turn out on a floured board and knead for 8 minutes or place in an electric mixer and knead with a dough hook. Place the dough in a greased bowl, turn to grease all sides of the dough, then cover loosely to set aside to rise until doubled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt remaining 2 tablespoons of butter. Punch dough and roll out to form a rectangle 12-by-20 inches. Brush with melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together almonds, raisins, sugar and cinnamon, sprinkle over the dough and place the trinket somewhere along the filling. Roll the dough from the long end jellyroll-style. Seal the edge by pinching. Bring together the two ends of the dough and join by pinching them together, forming a ring. Slash top of the dough at 1-inch intervals. Cover loosely and allow to rise until doubled, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Place the ring on a lightly greased baking sheet and bake for 30 to 45 minutes, until browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and allow to cool completely. Mix confectioners' sugar and 1 tablespoon of milk to form a glaze with the consistency of thick cream. Spread on the top of the bread and scatter slivered almonds and raisins on it."}], "link": "https://cooking.nytimes.com/recipes/1601-cafe-marimba-kings-bread"}