{"@context": "http://schema.org", "@type": "Recipe", "name": "Scrambled Eggs With Mushrooms", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT25M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "breakfast", "keywords": "eggs, wild mushrooms, main course, vegetarian, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 301, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "15 grams", "sodiumContent": "325 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["10 large eggs", "6 ounces mushrooms, preferably of the wild variety, such as chanterelles, oyster mushrooms, shiitake or morels and so on (if wild mushrooms are not available, the cultivated kind may be used)", "10 tablespoons butter", "Salt to taste, if desired", "Freshly ground pepper to taste", "1/2 cup finely chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into a mixing bowl. Beat well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mushroooms on a flat surface and chop them coarsely into half-inch or slightly smaller cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat four tablespoons of the butter in a heavy casserole and add the mushrooms. Cook, stirring, about three to five minutes, until they give up their moisture. Continue cooking until the moisture evaporates. Do not brown the mushrooms. The liquid around the mushroom pieces will take on an oily appearance. Remove from the heat and let the bottom of the casserole cool slightly. Place the casserole over moderately low heat and add six tablespoons of the butter, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the butter is melted, add the beaten eggs, salt and pepper and start stirring around and around, taking care to scrape the bottom of the casserole all over. If the eggs start sticking to the bottom at any point, the heat is too high. If this happens, remove the casserole from the heat, stirring constantly. Continue cooking over low heat, removing the casserole from the heat as necessary to prevent sticking. The total cooking time is approximately 12 minutes, or slightly longer, until the eggs take on the texture of a very soft custard. Add the chives and stir. Spoon the hot eggs and mushrooms into individual ramekins or small soup bowls and serve immediately."}]}