{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Chicken Breasts With Jalapeño Marinade", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, chicken wings, citrus, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 702, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "5 grams", "proteinContent": "39 grams", "saturatedFatContent": "10 grams", "sodiumContent": "119 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 boneless, unskinned chicken breasts with the main wing bone attached, about 2 1/2 pounds", "4 oranges", "2 limes", "1 lemon", "2 cups finely chopped onions", "2 tablespoons finely minced garlic", "3 1/2 tablespoons finely diced, seeded jalapeno peppers", "1 tablespoon finely chopped fresh sage or half the amount dried", "3/4 cup finely chopped parsley, loosely packed", "1 cup loosely packed, coarsely chopped fresh coriander leaves", "1 cup olive oil", "Peanut, corn or vegetable oil for greasing the grill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken breasts in a flat rimmed dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a swivel-bladed paring knife, pare away the zest or thin outer layer of two of the oranges and one of the limes and the lemon. Set the zest aside. Squeeze the four oranges, the two limes and the lemon. You will need one and one-half cups of orange juice, one-fourth cup lime juice and two tablespoons of lemon juice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the onions, garlic and jalapeno pepper into the container of a food processor. Blend briefly (about 20 pulses off and on). Do not overblend or make a puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the zest of the oranges, the lime and the lemon. Pulse (that is to say, turn the machine on and off at quick intervals) in order to blend, about 10 times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the orange, lime and lemon juices, sage, parsley, coriander and the olive oil. Blend thoroughly, about one minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour half the marinade in the bottom of a dish large enough to hold the breast halves in one layer. Place the breast halves skin-side up in the dish. Spoon the remaining marinade over. Let stand at least 30 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the breasts marinate, preheat a charcoal, gas or electric grill to medium heat. The grill should be scrubbed and scraped as clean as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, brush the grill evenly with oil. Remove the breast pieces and place them skin-side down on the grill. Brush the top of each half with a little of the marinade. Let cook 10 minutes. Remove the pieces from the grill and dip them once more in the marinade. Return the pieces skin-side down onto the grill but give them a quarter lateral turn to form a pattern. Grill five minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip the pieces once more in the marinade and arrange the pieces skin-side up on the grill. Continue cooking five to 10 minutes longer, depending on the thickness of the pieces."}]}