{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Sea Toast", "description": "Caviar has always symbolized the best in life; it is the single food most clearly identified with wealth, opulence and luxury. Yet for the connoisseur, caviar is more than a sybaritic, ostentatious display of riches. It is the ultimate edible, with all the subtleties, complexities and refinement of a great vintage wine or Champagne.", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "eastern european", "recipeCategory": "", "keywords": "appetizer, black bread, egg, salmon caviar, raw", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 142, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "433 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 hard-cooked eggs", "1/4 cup finely chopped onion", "4 slices black Russian, dark pumpernickel, or Danish-style hard rye bread, about 4 to 5 inches in diameter", "6 tablespoons (about 3 ounces) salmon caviar", "4 tablespoons sour cream", "1 tablespoon chopped chives", "4 lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Shell the eggs and separate the whites from the yolks. Push the whites and the yolks separately through a sieve and set aside in individual bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the chopped onion in a colander under cold water. (Rinsed onion is milder in flavor and will not discolor.) Drain, transfer to a kitchen towel and press to remove any excess water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the crust from the bread slices. Spoon some caviar around the edges of each slice, spreading it gently to create a 1/2-inch border of caviar. Inside this border, right next to the roe, spread the sieved egg white on the bread to form a ring that is 1/2 inch wide. Inside this ring, spread the sieved egg yolk to form another 1/2-inch ring. Inside that, spread the chopped onions to form a 1/2-inch ring. In the center of each slice, place 1 tablespoon of sour cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish each slice with a few grains of caviar and the chives. Serve immediately with lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/1636-black-sea-toast"}