{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallop And Sole Ragout", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "british", "recipeCategory": "dinner", "keywords": "main course, scallops, sole, vegetables", "aggregateRating": null, "recipeIngredient": ["2 cups fish stock (<a href=\"http://cooking.nytimes.com/recipes/1665-fish-stock\">see recipe</a>)", "1 1/3 pounds gray sole or flounder fillets", "12 bay scallops", "1 small carrot, peeled", "1 small leek, white only, washed well", "1/4 of a small celeriac (celery root), peeled", "6 mushrooms", "6 tablespoons unsalted butter", "1/4 cup Vouvray", "Salt and freshly ground white pepper", "2/3 cup heavy cream", "10 fresh basil leaves, coarsely chopped", "Fresh lemon juice to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the stock in a small saucepan and boil until it is reduced by two-thirds. Hold in a warm spot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the sole across the fillet into strips about three-quarters of an inch across. Slice the scallops in half horizontally. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the carrot, leek and celeriac into julienne strips about one inch by an eighth of an inch. Remove the stems from the mushrooms and thinly slice the caps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over medium-low heat, place the butter and half the Vouvray in a wide, shallow saucepan with a thick bottom or a skillet. When the butter is melted, add the carrot, leek and celeriac and cook until they're al dente, about five minutes. Add the mushrooms and season lightly with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the sole strips over the vegetables and sprinkle with the remaining Vouvray and the fish stock. Season lightly again. Cover the pan and cook over medium heat for two minutes. Add the scallops and cook two minutes longer. The seafood should just turn white. Using a slotted spoon, transfer the fish and scallops to a warm plate. Add the cream and basil to the pan and boil vigorously until the sauce thickens. With the slotted spoon, remove the vegetables to the plate. Taste and season with salt, pepper and lemon juice to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve on large plates, arranging the fish, scallops and vegetables attractively, then spooning the sauce over."}], "link": "https://cooking.nytimes.com/recipes/1664-scallop-and-sole-ragout"}