{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn And Clam Chowder", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT50M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, clams, corn", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 582, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "26 grams", "sodiumContent": "1168 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ears shucked fresh corn on the cob, or 5 cups canned, well-drained or frozen whole-kernel corn", "60 littleneck clams, the smaller the better", "1 large carrot, about 5 ounces, trimmed and scraped", "2 ribs celery, trimmed", "1 onion, about 1/2 pound", "6 sprigs fresh thyme, finely chopped, or 1/2 teaspoon dried", "2 cups dry white wine", "8 cups rich chicken broth, preferably homemade, although canned broth may be used", "5 cups heavy cream", "Salt to taste, if desired", "Freshly ground pepper to taste", "2 tablespoons freshly squeezed lime juice", "3 tablespoons butter", "2 small hot red or green peppers, stems removed", "2 tablespoons olive oil", "1/4 cup finely chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If fresh corn on the cob is used, cut each ear crosswise into thirds. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the clams well and put them in a kettle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the carrot lengthwise in half. Cut each half crosswise into thin slices. There should be about one cup. Add this to the clams."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the celery. There should be about one cup. Add this to the clams."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the onion. There should be about one and one-half cups. Add the onion, thyme and wine to the clams."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the kettle over high heat and cover closely with a lid. Bring to the boil and cook until the clams open, about three minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line another kettle with a sieve and line the sieve with cheesecloth. Or use a sieve of the sort known in French kitchens as a chinois."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the clams, vegetables and liquid into the sieve. There should be about two and one-half cups of liquid. Add the chicken broth to the clam liquid and bring to the boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove the meat from the clams and set aside. Unless the meat pieces are small, cut the pieces in half. Discard the shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the strained vegetables to the clam and chicken broth. If corn on the cob is used, add it to the kettle and cook about five minutes and add four cups of the cream. Bring to the boil. Add salt and pepper and let simmer about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If corn on the cob has been used, remove the pieces of corn from the kettle, using a pair of tongs. When the pieces of corn are cool enough to handle, cut the kernels from the cobs. There should be about five cups. Add this or the canned or frozen corn to the kettle. Pour the mixture, one portion at a time, into the container of a food processor or, preferably, an electric blender and blend. Combine the blended soup in a kettle and add one tablespoon of the lime juice, salt and pepper. There should be about 16 cups of soup. Add the meat from the clams."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the soup to the boil and swirl in the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the peppers coarsely. There should be about three tablespoons. Put the peppers in the container of an electric blender. Add the remaining lime juice, olive oil, cilantro, salt and pepper. Blend as finely as possible. This is to be used as a garnish for the soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the remaining one cup of cream and add the blended pepper and lime juice mixture. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the hot soup in 12 individual bowls and top each serving with an equal portion of the whipped cream mixture."}]}