{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Chicken With Artichokes and Mushrooms", "description": "The men who ruled the world in the late 1950s, or at least six of the men who ruled publishing, rejected Peg Bracken’s manuscript, “The I Hate to Cook Book.” It would never sell, they told her, because “women regard cooking as sacred.” It took a female editor to look at the hundreds of easy-to-follow recipes and say, “Hallelujah!” Since its publication in 1960, Bracken’s iconic book, which celebrated the virtues of canned cream-of-mushroom soup and chicken bouillon cubes, has sold more than three million copies. This simple chicken dish, adapted from Ms. Bracken, is as no-fuss as one would expect. Just sear the chicken in a bit of butter and transfer it to a baking dish. Scatter artichoke hearts (from a can, of course!) across the top. Make a quick sauté of mushrooms, flour, broth and a little sherry and pour it over the chicken. Slide it into the oven and bake for about an hour. Ms. Bracken recommended serving it with baked potatoes, but we like it best with a pile of rice to soak up all of the flavorful sauce.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2018/01/25/dining/25COOKING-BraiCasserole2/25COOKING-BraiCasserole2-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, casseroles", "keywords": "artichoke hearts, chicken, mushroom, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 696}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 505, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "4 grams", "proteinContent": "33 grams", "saturatedFatContent": "14 grams", "sodiumContent": "885 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Salt", "Freshly ground black pepper", "1/2 teaspoon paprika", "One 3 pound chicken, cut into pieces (or 3 pounds bone-in, skin-on chicken pieces)", "6 tablespoons butter", "8 ounces mushrooms, quartered", "2 tablespoons flour", "2/3 cup chicken broth or bouillon", "3 tablespoons sherry", "1 (12-to-15-ounce) can artichoke hearts, drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Mix together 1 1/2 teaspoons of salt, 1/4 teaspoon pepper and the paprika and sprinkle on all sides of the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 4 tablespoons of the butter in a large skillet over high heat. Brown the chicken prettily on all sides, in batches, adjusting the heat as needed. Transfer the chicken to a large Dutch oven or casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off the butter from the skillet, wipe it clean and return it to the heat. Add the remaining 2 tablespoons butter. When the butter starts to foam, add the mushrooms and sauté for about 5 minutes. Sprinkle the flour over them, stir in the chicken broth and the sherry and simmer for 2 to 3 minutes. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve artichoke hearts and arrange them between the chicken pieces. Pour mushroom-sherry sauce over them and cook in the oven, covered, for 40 minutes to an hour."}], "link": "https://cooking.nytimes.com/recipes/1740-braised-chicken-with-artichokes-and-mushrooms"}