{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Velvet Cake", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "all-purpose flour, red food coloring, sugar, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 484, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "14 grams", "sodiumContent": "318 milligrams", "sugarContent": "38 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["Butter for greasing pans", "2 cups all-purpose flour plus extra for dusting pans", "1 tablespoon unsweetened cocoa powder", "1 teaspoon salt", "1 1/2 cups sugar", "1/2 cup vegetable shortening", "2 eggs", "1 cup buttermilk", "1 teaspoon vanilla extract", "2 bottles (1 ounce each) red food coloring", "1 teaspoon baking soda", "1 tablespoon white vinegar", "4 egg yolks", "2/3 cup sugar", "1/2 cup whole milk", "8 ounces unsalted butter, softened, plus additional if needed", "1 tablespoon vanilla extract, bourbon or rum", "Chopped or halved pecans for decoration"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Butter and then flour two 9-inch round cake pans. Combine flour, cocoa and salt in a sifter and sift three times to thoroughly mix cocoa powder. Beat the sugar with the shortening with an electric mixer until blended. Beat in the eggs, one at a time, mixing well after each addition. Beat another minute at medium speed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Alternately beat the flour mixture (in four parts) and the buttermilk (in three parts) into the sugar mixture. (Do not overbeat.) Add the vanilla and food coloring and mix well to color evenly. Dissolve the baking soda in the vinegar and quickly fold it in. Pour half the batter into each prepared cake pan and bake until the cake top springs back when gently pressed, 20 to 25 minutes. Turn out layers onto wire racks and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the egg yolks in a large mixing bowl and gradually beat in the sugar with a whisk or mixer. Beat until the mixture is a thick pale yellow and forms a ribbon when a spoonful is dropped on the surface. Heat the milk to almost boiling and beat into the egg mixture by droplets. Pour into a heavy saucepan and cook over medium heat, stirring with a wooden spoon until mixture is thick enough to lightly coat the spoon (about 165 degrees on a candy thermometer). Immediately set the pan in a basin of cold water and beat until custard is barely tepid. Strain custard into another bowl and beat in softened butter by spoonfuls. Beat in flavoring. The icing should be smooth and thick. If it looks grainy or curdled, beat in additional softened butter, a teaspoonful at a time. Chill icing until cold but still spreadable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one cake layer on a serving plate and spread some icing on top. Cover with second layer and spread remaining icing over top and sides of cake. Sprinkle top with chopped pecans or press halved pecans around the top edge."}], "link": "https://cooking.nytimes.com/recipes/1747-red-velvet-cake"}