{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto Cakes With Mozzarella", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "7 servings (15 cakes)", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "arborio rice, broth, mozzarella, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 852, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "84 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "3 grams", "proteinContent": "25 grams", "saturatedFatContent": "17 grams", "sodiumContent": "837 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 cups lightly salted beef or chicken broth", "7 tablespoons butter", "10 tablespoons olive oil", "1 medium onion, finely chopped", "2 cups Arborio rice", "1/2 cup freshly grated Parmesan cheese plus more for serving", "1/2 pound fresh mozzarella", "2 to 3 eggs", "1 cup all-purpose flour", "1 1/2 cups fine dried bread crumbs", "1/4 teaspoon salt", "Homemade tomato sauce, for serving", "Fresh marjoram sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring broth to a slow simmer. Put 1 tablespoon butter, 2 tablespoons olive oil and the onion in a heavy saucepan over medium high heat. Stir until onion becomes translucent, about 7 minutes. Add rice and stir to coat well. Add 1/2 cup of the broth, stirring constantly, until almost all the liquid is absorbed. Repeat process, stirring constantly, and adjust heat so mixture simmers but rice does not scorch. After about 20 minutes, nearly all of the stock should be absorbed. Rice should be creamy but firm to the bite. Stir in Parmesan and 2 tablespoons butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, spread risotto onto a large plate and place in refrigerator for 1/2 hour until firm and chilled. Using a spoon or a melon scooper, make 15 small half balls of the mozzarella. Pack risotto into 1/3-cup measure and invert onto the palm of your hand. Place a half ball of mozzarella in center and press risotto around the ball to make a patty about 2 1/2 inches in diameter and 3/4 inch thick. Make sure risotto covers the cheese. Repeat until you have 15 rice cakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 eggs and 2 tablespoons water in a bowl and beat with a fork. Spread flour and bread crumbs on separate plates. Mix salt into bread crumbs. Coat each cake lightly with flour, dip in egg mixture, shake off excess and coat evenly with bread crumbs. (If needed, beat remaining egg with 1 tablespoon water.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 200 degrees. Line a baking sheet with paper towels. In a large skillet over medium-high heat, melt 2 tablespoons butter in 4 tablespoons oil. When butter stops bubbling, fry the first batch of cakes until golden brown and crispy, about two minutes per side. Place on baking sheet and put in the oven. Drain off oil and wipe out pan with paper towels. Fry the rest of the cakes in remaining oil and butter."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To serve:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place two cakes on each plate. Sprinkle with Parmesan and spoon tomato sauce around them. Garnish with marjoram."}]}], "link": "https://cooking.nytimes.com/recipes/1752-risotto-cakes-with-mozzarella"}