{"@context": "http://schema.org", "@type": "Recipe", "name": "Tangia of Cumin", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "4 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner", "keywords": "beef short ribs, couscous, preserved lemon, main course", "aggregateRating": null, "recipeIngredient": ["Beef Short Ribs", "4 6- to 7-inch-long beef short ribs, separated", "1/2 teaspoon salt", "1 teaspoon freshly ground black pepper", "4 tablespoons ground cumin", "2 preserved lemons, cut in half", "8 garlic cloves, peeled and crushed", "Steamed couscous"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Ask your butcher to detach half the meat from top of bone, fold that half back and tie it on itself and around bone, and have him saw off any excess bone. If he won't, do everything yourself. If you can't get long ribs, buy 4 pairs of shorter ribs(2-3 inches) and tie each pair together, meaty sides in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Season ribs with salt, pepper and cumin and pack closely in a roasting pan, with lemon halves between ribs. Add garlic and enough water to cover lemons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover dish with lid or foil, heat until almost simmering over medium heat and bake for 4 hours (about 3 hours for shorter ribs), keeping liquid barely simmering and turning ribs every hour. (Moroccans often cook at 125 degrees for 8 to 10 hours; most American ovens don't go that low, so if you want to try the slow cooking method, it should take about 6 hours at 180 degrees.) When ribs are tender, remove pan from oven and let cool to room temperature. Remove ribs from liquid, cut off strings and set aside. Skim grease from cooking liquid. Return ribs to liquid. Transfer to a clean bowl. Cover and refrigerate for 2-3 days, then warm before serving. Serve with bone in and cooking juice, with freshly steamed couscous."}], "link": "https://cooking.nytimes.com/recipes/1756-tangia-of-cumin"}