{"@context": "http://schema.org", "@type": "Recipe", "name": "Involtini", "description": "This involtini is one of the dishes you'll find yourself making again and again in some style or other. Slice eggplant thinly, then oil and grill it. The vegetable’s oily blandness is perfectly countered by the salty, minty, raisin-and-pine-nut-studded filling. Best of all, the eggplant can be grilled and the filling can be made in advance, and then assembled about half an hour to an hour before serving. Enjoy the rolling up: It's like basket-weaving, only more useful.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2016/01/19/dining/19COOKING_INVOLTINI1/19COOKING_INVOLTINI1-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "canned tomatoes, eggplant, mozzarella, main course, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 954}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 775, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "62 grams", "fiberContent": "9 grams", "proteinContent": "29 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1191 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 eggplants, about 1 pound each, trimmed and cut lengthwise into slices 1/4 inch thick (about 16 slices total)", "3/4 cup olive oil, or as needed", "8 ounces feta cheese, crumbled", "1/2 cup pine nuts", "1/3 cup raisins, soaked in hot water for 10 minutes until plump, then drained", "1/4 cup extra virgin olive oil, more for drizzling", "2 tablespoons bread crumbs", "1 garlic clove, peeled and minced", "Finely grated zest of 1 lemon", "1 1/2 teaspoons dried mint", "2 tablespoons chopped Italian parsley leaves", "1 large egg, beaten", "Salt and freshly ground black pepper", "2 1/2 cups drained canned crushed tomatoes", "1 large ball fresh mozzarella in 1/4-inch slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place a ridged cast-iron skillet or other heavy skillet over medium-high heat. Working in batches, brush eggplant slices on both sides with olive oil and cook, turning, until soft and (if using a ridged pan) crisscrossed with grid marks. Set aside and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine feta, pine nuts, raisins, 1/4 cup extra virgin olive oil, bread crumbs, garlic, lemon zest, mint and parsley. Mix in egg, and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread eggplant slices on a surface, and divide stuffing evenly among them, placing 1 to 2 tablespoons at one end of each slice. Roll up slices tightly to secure filling, and place in a 9-by-13-inch baking dish (or other shallow baking pan in which rolls fit snugly in a single layer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour crushed tomatoes on top of eggplant rolls. Arrange mozzarella slices in a line lengthwise down center of pan. Drizzle olive oil evenly over pan, and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until cheese has melted and eggplant is bubbling and fragrant, 25 to 30 minutes. Remove from heat and allow to stand 5 to 10 minutes. Serve hot."}]}