{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat Blini", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "About 6 dozen", "recipeCuisine": "russian", "recipeCategory": "for one", "keywords": "all-purpose flour, buckwheat flour, sturgeon caviar, appetizer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 33, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "37 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups whole milk", "4 tablespoons unsalted butter, plus extra for frying and serving", "1 teaspoon sugar", "2 teaspoons active dry yeast", "3 large eggs, separated", "1 cup all-purpose flour", "1 cup buckwheat flour", "1 teaspoon salt", "8 ounces crème fraîche or sour cream", "3 ounces caviar, preferably osetra"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the milk and 4 tablespoons of butter over low heat until butter is melted, and let cool slightly. Meanwhile, combine the sugar and 2 tablespoons of warm water and stir to dissolve the sugar. Sprinkle the yeast over the sugar water and let stand in a warm place until yeast is frothy, about 5 minutes. Pour in the milk mixture, add egg yolks and whisk to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flours and salt and gradually whisk into the yeast mixture until smooth. Cover bowl tightly with plastic wrap and let batter rise in a warm place until doubled in bulk, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir to deflate the batter. (Batter can be covered and refrigerated for 24 hours before proceeding.) Beat egg whites until soft peaks form. Gently fold whites into batter just until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 200 degrees. Melt enough butter to coat a large griddle or skillet over medium to medium-high heat. When butter sizzles, drop tablespoons of batter onto surface to make blini roughly 2 inches in diameter. Cook until bubbles appear on top and the bottom is golden brown. Turn and cook until bottom is lightly browned. Place blini, overlapping but not stacked (they will get soggy), on a baking sheet and keep warm in the oven while cooking the remaining batter. Stop using the batter when bubbles no longer appear on the top (there may be about 1 cup left), or the blini will be thin and tough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, brush blini lightly with melted butter and top each with a dab of créme fraîche or sour cream and a small dollop of caviar."}], "link": "https://cooking.nytimes.com/recipes/1785-buckwheat-blini"}