{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Lamb Shanks With Lemon", "description": "Many of us had our earliest experiences with braised foods not at the pricey restaurants that have recently rediscovered their appeal but at the Greek diners that never forgot it. So it's not surprising that I associate braised lamb shanks with egg-lemon sauce, a Greek staple. But when I set about to recreate this standard dish I found the sauce superfluous. Though a slow-cooked pot of braised lamb shanks and root vegetables becomes so sweet that it begs for something to counter it, it is also so rich that the thick sauce (a primitive form of béarnaise, really) is overkill. Better, it seems to me, is to finish the braised shanks with what you might call lemon-lemon sauce, using both a lemon's zest and a lemon's juice. That little touch converts this dish from a delicious but perhaps one-dimensional stew to something more, a braise that may never look particularly elegant but tastes that way.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/02/07/dining/07COOKING-BRAISEDLAMBSHANKS2/07COOKING-BRAISEDLAMBSHANKS2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, weekday, soups and stews, steaks and chops", "keywords": "lamb shanks, lemon, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 202}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1137, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "8 grams", "proteinContent": "76 grams", "saturatedFatContent": "26 grams", "sodiumContent": "2115 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "4 lamb shanks, roughly a pound each", "Salt and pepper to taste", "3 or 4 thyme sprigs", "6 cloves garlic, lightly crushed", "1 large onion, cut into chunks", "4 stalks celery, roughly chopped", "4 medium carrots, peeled and roughly chopped", "2 cups dry white wine or water", "1 1/2 pounds waxy potatoes, peeled and cut into chunks", "1 lemon", "Chopped fresh parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a large, deep skillet or casserole that can be covered later, and turn heat to medium-high. Add shanks, sprinkling them with salt and pepper. When pieces are deeply browned on one side, add thyme, garlic, onion, half the celery and half the carrots, and more salt and pepper to skillet. Continue to brown, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine, and let mixture bubble for about a minute; cover and adjust heat so that mixture simmers steadily. Cook for about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining vegetables to pan; zest lemon, and add zest as well. Continue to cook until lamb is very tender and vegetables soft, another 30 to 45 minutes. (You can prepare dish up to this point in advance; let sit for a few hours, or cover and refrigerate for up to a day before reheating and proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When lamb is done, juice lemon, and add juice to sauce. Taste, adjust seasoning, and serve, garnished with parsley."}], "link": "https://cooking.nytimes.com/recipes/1796-braised-lamb-shanks-with-lemon"}