{"@context": "http://schema.org", "@type": "Recipe", "name": "Scotian Lobster Chowder", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "8 servings", "recipeCuisine": "new england", "recipeCategory": "dinner", "keywords": "lobster, russet potatoes, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 796, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "4 grams", "proteinContent": "77 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1906 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 ounces slab bacon in 1/4-inch dice", "4 tablespoons unsalted butter", "2 1/2 pounds (about 5 medium) russet potatoes, peeled, quartered lengthwise, and sliced", "2 medium leeks, white and light-green parts only, in 1/4-inch dice", "6 live lobsters, 1 1/4 pounds each", "8 ounces frozen shoepeg corn kernels", "2 cups heavy cream", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large heavy stock pot or soup kettle over medium-low heat; add bacon and 1 teaspoon butter. Saut&#233; until bacon yields its fat and is crisp on edges. Add potatoes, leeks and 1 1/4 cups water. Cover and simmer until potatoes are tender, about 10 minutes, then remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate kettle large enough to hold six lobsters, put about 2 inches water. Place over high heat to bring to a rapid boil. Add lobsters and cover pot. Return to a boil and boil for 4 minutes. Immediately add cold water to pan to stop cooking, then drain. Immerse lobsters in cold water until cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a fine-meshed sieve over a large bowl, and break lobsters open over sieve, draining out and reserving all body liquids. Break claws and tails from bodies, and pull apart body sections. Break open carapace and remove any red coral or greenish tomalley, pushing this through sieve using a wooden spoon. Add liquid from bowl to potato mixture, and place over low heat to bring to a gentle simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Extract lobster meat from claws and tails, and cut into chunks. Put in a skillet with remaining butter and place over medium-low heat, stirring until meat becomes opaque. Scrape meat and butter into chowder pot. Cover, and continue to simmer gently for 20 minutes. At this point, if desired, chowder may be removed from heat and cooled to room temperature, then covered and refrigerated for up to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, bring chowder to a simmer. Add corn and simmer about 2 minutes. In a small saucepan over medium-low heat, simmer cream for 2 to 3 minutes, then add to chowder. Season to taste with salt and pepper, and ladle into warm bowls. Serve hot."}]}