{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic Chicken In A Pot", "description": "", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "chicken, preserved lemon, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["1/2 salt-preserved lemon, rinsed well (see note)", "1/4 cup sugar", "1/3 cup olive oil", "16 small peeled potatoes (white or sweet) or 2 large peeled potatoes, each cut into 8 pieces", "16 small onions or shallots, peeled and trimmed", "8 carrots, peeled and quartered", "4 stalks celery, trimmed and quartered", "4 heads garlic, cloves separated but not peeled", "Salt and freshly ground pepper", "3 sprigs fresh thyme", "3 sprigs Italian parsley", "2 sprigs rosemary", "1 chicken, whole or cut up", "1 cup chicken broth", "1/2 cup white wine", "About 1 1/2 cups flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Remove zest from preserved lemon and cut zest into small squares; save pulp for another use. Bring 1 cup water and the sugar to a boil, drop in zest and cook 1 minute; drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a large skillet over high heat. Add vegetables and garlic, season with salt and pepper and saut&#233; until brown on all sides. (If necessary, do this in 2 batches.) Spoon vegetables into a 4 1/2- to 5-quart lidded Dutch oven and stir in herbs and lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to heat, add another tablespoon of oil and brown chicken on all sides, seasoning it with salt and pepper as it cooks. Tuck chicken into casserole, surrounding it with vegetables. Mix together the broth, wine and remaining olive oil and pour it over chicken and vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix flour with enough hot water (about 3/4 cup) to make a malleable dough. On a floured surface, work dough into a sausage; place dough on rim of casserole. Press lid onto dough to seal casserole. Bake 55 minutes. To break seal, work the point of a screwdriver between pot and lid. If chicken is whole, quarter it. Chicken may be served in the pot or arranged with vegetables on a serving platter."}]}