{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry-Rose Truffles", "description": "", "author": {"@type": "Person", "name": "Bill Yosses"}, "image": null, "totalTime": "PT3H", "recipeYield": "About 95 truffles", "recipeCuisine": "", "recipeCategory": "", "keywords": "bittersweet chocolate, raspberries, rose syrup, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 66, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "0 grams", "saturatedFatContent": "3 grams", "sodiumContent": "3 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups fresh raspberries", "1 tablespoon sugar", "1/4 cup rose syrup (see note)", "1 pound plus 12 ounces bittersweet chocolate, finely chopped", "1 3/4 cups heavy cream", "7 tablespoons unsalted butter at room temperature, cut into pieces", "Cocoa for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor or blender, purée raspberries with sugar. Push mixture through a fine mesh sieve; discard solids. Stir rose syrup into raspberry purée and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 12 ounces chocolate in a heatproof bowl. In a saucepan, bring cream to a simmer. Pour cream over chocolate and let rest 3 minutes. Starting in center, whisk together chocolate and cream. Continue to whisk until mixture turns dark and shiny and has consistency of mayonnaise. Cool until slightly warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk butter into chocolate mixture until melted, then stir in raspberry mixture. Refrigerate until mixture is as thick as icing, 30 minutes to an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a pastry bag with a large plain tip or to a resealable plastic bag with a corner cut off. Line a baking sheet with parchment or waxed paper and squeeze 1 1/4-inch chocolate drops (a bit larger than a Hershey's Kiss) onto paper. Refrigerate drops until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, roll chocolate drops into balls, then return them to baking sheet and refrigerate for another 15 minutes, until their surfaces are matte."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the coating, set aside 1/4 of the remaining chocolate. Place the rest of the chopped chocolate in a microwave-proof bowl. Microwave on high for 3 minutes, stopping every 15 seconds to stir. Chocolate should feel very warm to the touch (115 to 120 degrees). Add reserved chopped chocolate to bowl; stir until mixture is melted and smooth and chocolate has cooled to 82 degrees. Return chocolate to microwave on high for another 5 seconds. Stir again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line another baking sheet with waxed or parchment paper. Use a fork to lower chocolate balls one by one into chocolate coating. Turn each one to coat, drain off excess, and place balls on parchment paper. If the melted chocolate cools too much and thickens, return it to microwave for 3 to 5 seconds, and stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let truffles rest for at least 20 minutes. If desired, roll truffles in cocoa powder before serving. Store in airtight containers in refrigerator for up to 2 weeks. Bring to room temperature before removing lid."}], "link": "https://cooking.nytimes.com/recipes/1805-raspberry-rose-truffles"}