{"@context": "http://schema.org", "@type": "Recipe", "name": "Osso Buco", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "anchovy fillets, garlic, veal shank, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 101}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "0 grams", "proteinContent": "59 grams", "saturatedFatContent": "4 grams", "sodiumContent": "855 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 tablespoon olive oil", "4 center-cut slices veal shank, 2 pounds or more", "Salt and freshly ground black pepper to taste", "3 or 4 cloves garlic, lightly mashed and peeled", "4 anchovy fillets", "1 cup dry white wine, chicken or beef stock, or water", "2 teaspoons butter, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, deep skillet over medium-high heat for a couple of minutes. Add the oil, swirl it around, and pour out any excess. Add the veal slices and cook until nicely browned on the first side, about 5 minutes. (For even browning, you can rotate the slices, but try not to disturb them too much.) Turn and brown the other side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the second side is just about completely browned, sprinkle with a little salt and pepper and add the garlic and anchovies to the pan. Cook, stirring a little, until the anchovies dissolve and the garlic browns, about 2 minutes. Add the liquid and let it bubble away for about a minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to low and cover the skillet. Five minutes later, check to see that the mixture is simmering &mdash; just a few bubbles appearing at once &mdash; and adjust the heat accordingly. Cook until the meat is very tender and pulling away from the bone, at least 90 minutes and probably somewhat more; turn the slices every half-hour or so. (When the meat is tender, you may turn off the heat and refrigerate the dish for up to 24 hours; reheat gently before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat to a warm platter and turn the heat to high. Boil the sauce until it becomes thick and glossy, about 5 minutes. Stir in the butter if you like, and serve the meat with the sauce spooned over it."}], "link": "https://cooking.nytimes.com/recipes/1807-osso-buco"}