{"@context": "http://schema.org", "@type": "Recipe", "name": "The Best Macaroni and Cheese", "description": "Amanda Hesser brought this recipe to The Times in a 1998 article about a return to simply-prepared, down-home foods in response to the brash, over-the-top 90's style of cooking. It's an adaptation of one found in Pam Anderson's book, \"The Perfect Recipe,\" and it calls for stirring the mixture every five minutes while it is baking. This gives it the ideal balance of lightness and creaminess -- a detail that is missing from most macaroni and cheese recipes.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2015/05/20/dining/20HIT_MACANDCHEESE/20HIT_MACANDCHEESE-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, casseroles, editors' pick, pastas", "keywords": "cheddar, evaporated milk, macaroni, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 638}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 824, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "3 grams", "proteinContent": "39 grams", "saturatedFatContent": "23 grams", "sodiumContent": "829 milligrams", "sugarContent": "12 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup fresh bread crumbs from French or Italian bread", "2 teaspoons salt, plus a pinch", "1 1/2 tablespoons melted butter, plus 4 tablespoons butter at room temperature", "1/2 pound elbow macaroni", "2 large eggs", "12 ounces evaporated milk, heated until warm", "1/4 teaspoon hot red-pepper sauce", "1/4 teaspoon freshly ground black pepper", "1 teaspoon dry mustard, dissolved in 1 teaspoon water", "", "10 to 12 ounces mild cheddar cheese, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Place a 1 1/2-quart heat-proof dish, such as a souffle pan, in oven to warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small baking pan, combine bread crumbs, a pinch of salt and the melted butter. Mix well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring 8 cups of water to a boil. Add 1 1/2 teaspoons of salt and the macaroni. Cook until almost tender but still a little firm to the bite. Drain and transfer to preheated dish. Stir in remaining 4 tablespoons of butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine eggs, 1 cup of the evaporated milk, the pepper sauce, 1/2 teaspoon salt, the black pepper and the mustard mixture. Mix well. Pour egg mixture over macaroni. Add 3/4 of the cheese, and stir until thoroughly combined and cheese starts to melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dish of macaroni and cheese in the oven, and bake for 5 minutes. Remove dish from oven and add about half of the remaining evaporated milk, and half of the remaining cheese. Stir well, and return pan to oven. Bake 5 minutes longer, remove pan from oven, and stir thoroughly. If mixture does not look moist and creamy, add a little more of the milk and cheese. Return to oven for an additional 20 minutes, removing pan from oven halfway through to stir in remaining evaporated milk and cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While macaroni is baking, add pan of bread crumbs to oven. Bake until bread crumbs are toasted and golden brown, 10 to 15 minutes. Remove from oven and set aside. When macaroni has baked, sprinkle surface with toasted bread crumbs, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1812-the-best-macaroni-and-cheese"}