{"@context": "http://schema.org", "@type": "Recipe", "name": "Moussaka", "description": "This recipe for moussaka is adapted from one found in David Rosengarten's book “Taste” which includes an entire section devoted to the classic Greek casserole. In the book, Mr. Rosengarten claims that his is “the lightest, least oily, least tomatoey, most eggplanty, most refined moussaka that you've ever tasted.” Isn't that just what you want as you plan a dinner party? Mr. Rosengarten writes with bravado, but he certainly persuaded me to try his recipe. And it delivered.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2017/03/27/dining/27COOKING-MOUSSAKA/27COOKING-MOUSSAKA-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "15 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, project, sauces and gravies", "keywords": "eggplant, ground lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 189}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 441, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "8 grams", "proteinContent": "19 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1034 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large eggplants, about 1 1/2 pounds each", "6 tablespoons Greek olive oil, plus a little for coating the eggplants", "Kosher salt, to taste", "4 medium onions, chopped", "6 garlic cloves, chopped", "1 28-ounce can crushed tomatoes in tomato puree", "1/4 cup parsley, minced", "2 teaspoons dried oregano", "1/2 teaspoon ground cinnamon", "2 tablespoons red wine vinegar", "2 pounds ground lamb", "1/2 cups dry white wine", "Black pepper to taste", "4 pinches freshly grated nutmeg", "6 tablespoons unsalted butter", "4 tablespoons flour", "2 cups hot, scalded milk", "White pepper, to taste", "4 eggs", "10 tablespoons fresh bread crumbs", "1 cup grated kefalotyri cheese or pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Prick eggplants several times with a fork. Rub a little olive oil into their skins. On a large baking sheet, roast eggplants until soft, about 30 minutes, turning frequently. Remove from oven and let cool. Cut into 1/2-inch-thick round slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saute pan, heat 4 tablespoons olive oil over high heat and brown eggplant slices lightly on each side. Do this in batches, adding more oil as necessary. Drain on paper towels and sprinkle with salt. Set aside."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make tomato sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan heat 1 tablespoon olive oil over medium heat. Add 1 chopped onion and 2 chopped garlic cloves, and saute until tender. Add tomatoes and their puree, squeezing them into coarse chunks. Add parsley, oregano, cinnamon and vinegar. Stir well. Simmer, uncovered, for 25 minutes. Reserve."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare lamb:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saute pan, heat 1 tablespoon olive oil over medium-high heat. Add remaining onions and garlic. Saute for 5 minutes. Add lamb, in stages if necessary, and brown well, breaking up pieces with a wooden spoon. Add wine and bring to a boil. Cook until wine has nearly evaporated. 5. Season lamb with salt, black pepper and 2 pinches of nutmeg. Stir in 1 cup of reserved tomato sauce. Bring to a boil, reduce heat and simmer, covered, for 1 hour."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare bechamel:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, melt 4 tablespoons of butter over medium-low heat, and gradually whisk in flour. Cook for 2 minutes, whisking constantly. Do not let this brown. Add hot milk and whisk rapidly to combine. Bring to a slow boil, whisking constantly. Reduce heat and simmer for 25 minutes, stirring frequently, until smooth and thickened. Season with salt, white pepper and remaining 2 pinches nutmeg. Let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, beat eggs and whisk in a spoonful of bechamel. Whisk in remaining bechamel in a thin stream, and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Assemble moussaka: Sprinkle 2 tablespoons of bread crumbs across the bottom of a large baking dish (18-by-8-by-3 inches) and cover crumbs evenly with half the eggplant slices. Drain as much oil from lamb mixture as possible, and spread the meat over the eggplant layer. Top meat with half the cheese, then with half the remaining bread crumbs. Place remaining eggplant slices on top of the bread crumbs, then add the bechamel, remaining cheese and remaining bread crumbs in even layers. Dot with remaining butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 45 minutes, until well browned. Remove from oven and let cool slightly, about 15 minutes. Cut into 3-inch squares to serve. Serve with the extra tomato sauce."}]}]}