{"@context": "http://schema.org", "@type": "Recipe", "name": "Churros", "description": "In the world of fresh pastry, few things are quicker than churros – those crullerlike strips of crisp fried dough that are street-corner snacks in Spain, Mexico and some New York City subway stations. In fact, there are few breakfast dishes or last-minute late-night snacks that can match a batch of churros. If there is a recipe ideal for learning deep frying, this is it. The dough is extremely forgiving, and will brown nicely at any temperature in the neighborhood of 350; with a frying thermometer, you can hit the temperature right on the money. The only trick, as with all deep frying, is to not crowd the dough strips. Work in batches. Once the strips are gloriously brown, turn them in a sugar-cinnamon mixture and serve hot, or at least warm. Cold churros are certainly edible, but they're a far cry from hot ones.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/12/dining/12COOKING-CHURROS1/12COOKING-CHURROS1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "1 dozen 4- to 6-inch churros", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "appetizer, cinnamon, eggs, flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 150}, "recipeIngredient": ["Corn, grapeseed, canola or other neutral oil for frying", "1/2 cup plus 1 tablespoon sugar", "1 teaspoon cinnamon", "1/2 cup or 1 stick butter", "1/4 teaspoon salt", "1 cup all-purpose flour", "3 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough oil to a large saucepan or deep skillet to come to a depth of at least 2 inches; heat to about 350 degrees. Mix 1/2 cup sugar and the cinnamon together on a large plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine remaining sugar, butter, salt and 1 cup water in a saucepan over high heat, and bring to a boil. Turn heat to low, and add flour, all at once. Stir constantly until mixture forms a ball, about 30 seconds. Remove from heat, and beat eggs one at a time into mixture, stirring until smooth after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon dough into a pastry bag with a large star tip (or simply drop spoons full of batter into oil). Press strips of dough about 4 inches long into hot oil. Cook as many as will fit comfortably at once, turning as they brown, 5 to 10 minutes each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove churros from oil, and drain on paper towels, then immediately roll them in cinnamon-sugar mixture. Serve hot or warm."}]}