{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Ball With Cumin, Mint And Pistachios", "description": "Cheese balls lack such an illustrious and definitive past. Nut-crusted and filled with mysterious cheeses and bits of vegetable, cheese balls tend to be associated with shag rugs and tinsel, symbols of the middle-class middlebrow. Maybe they came before their time. Cream cheese and industrial Cheddar made for likable filler before a meal. But now, with so many interesting cheeses available, it's easy to see that a cheese ball doesn't have to be stodgy.  This one, from Amanda Hesser, has hints of the Eastern Mediterranean. The cream cheese is mashed with goat cheese, then seasoned with cumin, coriander, lemon zest, celery hearts, mint and grated Pecorino Romano cheese. The ball is rolled in ground pistachios. For a Spanish-inspired version, try incorporating grated Manchego into the cream cheese, along with pimenton (Spanish red pepper), olives, scallion and Worcestershire sauce, then rolling it in ground almonds and smoked paprika.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT20M", "recipeYield": "8 hors d'oeuvres servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "appetizer, cream cheese, goat cheese, pecorino romano, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 202, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "9 grams", "sodiumContent": "294 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 cup cream cheese (8 ounces), softened", "1/2 cup goat cheese (ché,vre), (4 ounces), softened", "1 tablespoon lemon juice", "Grated zest of 1 lemon", "1/2 cup grated Pecorino Romano, preferably Fulvi", "1 teaspoon toasted and ground coriander seeds", "1 teaspoon toasted and ground cumin seeds", "1/2 cup finely sliced celery hearts, with leaves", "1/3 cup chopped mint", "1/4 teaspoon freshly ground black pepper", "Sea salt", "1/3 cup salted pistachio nuts, coarsely ground"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat cream cheese and goat cheese with a wooden spoon until creamy and light. Beat in lemon juice and lemon zest. Fold in Pecorino Romano, coriander, cumin, celery, mint and pepper. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a large piece of plastic wrap on counter. Using a spatula, scrape cheese mixture onto center of plastic. Pull up sides of plastic wrap and form cheese into a ball. Wrap tightly, place in a bowl and chill in refrigerator for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour ground pistachios into a shallow bowl. Unwrap cheese ball and roll it in nuts until coated. Lay ball on a serving plate, cover with plastic wrap and chill until ready to serve. A half hour before serving, unwrap cheese ball and let it come to room temperature. Serve with very thin plain crackers."}], "link": "https://cooking.nytimes.com/recipes/1829-cheese-ball-with-cumin-mint-and-pistachios"}