{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Goose With Pears", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT3H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dried pears, goose, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 8}, "recipeIngredient": ["1 goose, cut into serving pieces, excess fat removed", "Salt and freshly ground pepper", "1/2 cup diced bacon or pancetta, optional", "2 large onions, roughly chopped", "4 bay leaves", "A few thyme sprigs", "1/2 pound dried pears or apples", "2 cups not-too-dry white wine, like gewürztraminer or riesling", "1 tablespoon vinegar (sherry, Champagne or white wine vinegar)", "2 pounds pears (or apples), peeled, cored and sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to medium-high under a casserole or deep skillet, at least 12 inches across. A minute later, add goose pieces, skin side down. Cook, adjusting heat so the skin doesn't scorch and rotating pieces until skin side is browned and rendered of fat, 10 to 15 minutes. Turn, then sprinkle skin side with salt and pepper, and brown 2 or 3 minutes on the meat side. Remove goose, and pour off all but 1 tablespoon fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bacon to the skillet, if desired, and cook until brown and crisp, about 10 minutes. Add onions, bay leaves and thyme, and cook, stirring occasionally, and seasoning with salt and pepper, until onions are soft, about 10 minutes. Add dried fruit, and cook a minute or 2 more, stirring occasionally. Add wine, and raise heat to high. Cook until wine is reduced by half, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return goose to skillet, and turn heat to very low. Cover, and cook (the mixture should be barely bubbling) for at least 2 hours, turning once or twice, until goose is very tender. Add vinegar, sliced fruit and a good grinding of black pepper, and cook, stirring occasionally, until fruit is tender, 10 to 15 minutes. Taste, and adjust seasonings Serve with crusty bread or over lightly buttered noodles."}]}