{"@context": "http://schema.org", "@type": "Recipe", "name": "Morning Bread Pudding", "description": "This special occasion breakfast dish is like a cross between a tarte Tatin and a moist, delicate bread pudding. You have to plan ahead – it needs to sit in the refrigerator overnight – and it requires the preparation of a simple caramel sauce, but it's absolutely, 100% worth the effort. Once the sauce is done, swirl it around the bottom of a pie pan, fill it with slices of challah, then saturate it with a slurry of eggs, sugar, mascarpone cheese, milk and a dash of almond extract. Let it rest overnight, bake and invert on a platter. Serve with a dollop of mascarpone or fromage blanc to cut the sweetness.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2015/12/09/dining/09COOKING-BREADPUDDING2/09COOKING-BREADPUDDING2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, breads, custards and puddings", "keywords": "challah bread, eggs, mascarpone, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 211}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 644, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "13 grams", "sodiumContent": "573 milligrams", "sugarContent": "33 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup plus 2 tablespoons sugar", "1/4 teaspoon salt", "6 tablespoons butter", "12 to 15 slices brioche or challah bread (all should be about 1/2-inch thick and about 3 inches round; cut accordingly)", "8 eggs", "1/4 cup mascarpone cheese", "1 cup milk", "1/4 teaspoon almond extract", "1/4 cup coarsely chopped toasted almonds", "About 3/4 cup fromage or fromage blanc, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a 9-inch ceramic or Pyrex pie dish in a 350 oven. Meanwhile, in a small, heavy saucepan, combine 3/4 cup sugar, salt and butter. Place over medium low heat. The butter will melt and the sugar will dissolve; it will boil for a few minutes, then begin to brown. Adjust heat and stir occasionally with a wooden spoon so that it browns evenly. When it reaches a dark brown, remove from heat and pour into the base of the preheated pie dish. Swirl the caramel around the base and 1 inch up the sides of the dish. Let it cool before placing dish in refrigerator and chill until caramel is cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After chilling, place heel of bread in center of dish (or two slices stacked on top of each other). Then arrange the rest of the slices upright in a fan shape, around the center. They should overlap slightly and fill the pie dish snugly. In a large bowl, whisk together eggs, remaining 2 tablespoons sugar and mascarpone cheese, until very smooth. Add milk and almond extract. Pour this over the bread, making sure to saturate all of it. Cover with plastic wrap and chill overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the morning, take pie dish out of refrigerator and discard plastic wrap. Let it warm up on the counter for about an hour. Heat oven to 375 degrees. Bake pudding 15 minutes, then sprinkle almonds over pudding. Continue baking until moist but not wet in the center, about 15 to 20 minutes more. Remove from oven and run a knife around edge of dish, loosening bread from sides. Place a serving plate over top of dish (bottom side up), and, using potholders, hold pudding over sink and in a single fluid motion, holding it away from your body, invert plate. Lift off pie dish. Scrape any extra caramel from pie dish over pudding. Serve, cutting it into wedges at the table and spooning a healthy dollop of fromage frais onto each plate."}], "link": "https://cooking.nytimes.com/recipes/1833-morning-bread-pudding"}