{"@context": "http://schema.org", "@type": "Recipe", "name": "Cassoulet with Duck and Hot Sausages", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT5H", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "duck, sausage, white beans, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "recipeIngredient": ["2 pounds (5 1/2 cups) dry white beans (Great Northern)", "Rind from 1/2 pound salt pork", "1 onion, peeled and stuck with 2 cloves", "4 medium carrots, peeled and sliced", "Bouquet garni of 1 sprig thyme, 2 bay leaves, parsley stalks and 3 large cloves garlic", "1 2 1/2-pound chunk of slab bacon", "2 ducks, about 4 1/2 pounds each", "1 1/2 pounds hot Italian or Spanish sausage", "1 cup sliced onion", "6 cups chicken stock", "5 tablespoons tomato paste", "3 large cloves garlic, smashed", "Freshly ground black pepper", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with tepid water, add the beans, set over low heat and bring slowly to a boil. Remove from the heat and let the beans soak for about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pork rind into a pot of cold water, bring to a boil and cook for 20 minutes. Rinse with cold water and cut into pieces about 1 inch square. Wrap in cheesecloth, tie into a bundle and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans have finished soaking, add the pork rind, the onion stuck with cloves, the carrots and the bouquet garni. Add more water if necessary to cover the beans, bring to a boil and simmer, uncovered, for 112 hours or until the beans are tender but still slightly firm. Remove the scum that will rise to the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 1 1/2 pounds of the bacon into lardons 1 inch by 1/2 inch, cover them with cold water in a pan and boil for 10 minutes. Drain and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the ducks into serving pieces with poultry shears or a heavy sharp knife. Cut the sausage into 1-inch slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the remaining bacon into small pieces and place it with 1 tablespoon of water into a heavy, 6-to-8-quart pot. Set over low heat to render about 4 tablespoons of fat. Discard the bacon and leave the fat in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thoroughly dry the duck pieces and add them to the pot with the sausage and prepared lardons, and brown the duck evenly on all sides, about 15 minutes. (If the pot isn't big enough, use a second pot or heavy skillet.) Add the sliced onions. When everything is browned, cover with stock, stir in the tomato paste and bring to a boil, stirring. Add the garlic. Sprinkle with pepper, lower the heat and simmer for at least 45 minutes, or until the duck is tender. If the duck is cooked before the beans, turn off the flame and let it wait, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans are tender, discard the pork rind and the bouquet garni, and add the beans and their cooking juice to the duck. Simmer together until the flavor is nicely blended. With a spoon or bulb baster, remove any fat that has risen to the surface. Remove the beans to a warm serving platter with a slotted spoon, and arrange the meat on top of them. Reduce the cooking liquid to 2 cups and strain. Taste and correct the seasoning. Pour the sauce over the meat and beans, sprinkle with chopped parsley and serve."}]}