{"@context": "http://schema.org", "@type": "Recipe", "name": "Le Talleyrand", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/Le-Talleyrand/Le-Talleyrand-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "SERVES 8", "recipeCuisine": "french", "recipeCategory": "", "keywords": "almonds, dark cherries, kirsch, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 433, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "6 grams", "sodiumContent": "92 milligrams", "sugarContent": "48 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 16-ounce cans dark cherries, pitted", "1/3 cup plus 1/4 cup kirsch or dark rum", "4 egg yolks", "3/4 cup granulated sugar", "About 2/3 cup blanched almonds, finely ground", "4 1/2 tablespoons flour, preferably cake flour", "2/3 cup heavy cream", "10 tablespoons confectioners' sugar", "1 1/4 teaspoons vanilla extract", "7 egg whites", "Pinch of salt", "3 tablespoons slivered almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the cherries and reserve the juice. Put the cherries into a bowl with 1/3 cup of kirsch or rum and 3/4 cup of the juice from one of the cans of cherries, and let sit for at least half an hour, stirring once or twice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the egg yolks and sugar into the top of a double boiler. (Save the neatest empty eggshell, trimming its edges with scissors.) Beat until fluffy and pale yellow, 2 or 3 minutes. Strain in the maceration liquid from the cherries, combining gently with a whisk. Stir in the ground almonds and flour. Set over low heat and stir constantly until the mixture forms a thick, smooth custard, about 15 minutes. Remove from heat and transfer to a bowl set in an ice bath. Stir with a spatula until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream until the beaters leave light traces on the surface. Beat in 2 tablespoons of the confectioners' sugar and 12 teaspoon of the vanilla, until soft mounds form. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites with a pinch of salt until they are stiff but not dry. Fold half of the egg whites into the cream until mixed. Stir 3 tablespoons of the cream and egg whites into the custard to lighten it; then fold all back into the remaining cream mixture. Set aside. Add the remaining confectioners' sugar and vanilla to the remaining egg whites, and beat until glossy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Butter a 9-by-12-inch oval baking dish. Spread the cherries on the bottom and pour the custard over them. Spread the meringue over the custard, leaving a small border and making a dome of meringue toward the center. Press the eggshell into the meringue so that it shows only as a well in the center. (The dessert can be made up to 1 hour in advance to this point; keep refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the meringue with the slivered almonds, then sift the confectioners' sugar over the top. Cook until the meringue is lightly browned, 5 to 10 minutes. Heat the remaining kirsch or rum in a small saucepan. Remove the dish from the oven, pour some of the alcohol into the eggshell, letting the rest run over the meringue, and set aflame. Bring flaming to the table, spooning the liqueur over the top to caramelize the sugar, until the flames go out."}]}