{"@context": "http://schema.org", "@type": "Recipe", "name": "Coffee-Roasted Fillet of Beef", "description": "Just when I think all my recipe snipping and gluing and saving has been for naught, something turns me around. Take this coffee-roasted beef with mushrooms and pasilla chili broth. I couldn’t imagine why I had ever cut it out — so busy, so restauranty. But I tried it, soaking chilies in one corner, shiitakes in another, coating the beef with ground coffee and roasting it. Stacking was involved in the plating. I brought the admittedly gorgeous dishes to the table with a cynically arched brow. It was heavenly. And my faith was restored.", "author": {"@type": "Person", "name": "Julie Powell"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/Coffee-Roasted-Fillet-of-Beef/Coffee-Roasted-Fillet-of-Beef-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "beef tenderloin, coffee beans, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 493, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "4 grams", "proteinContent": "47 grams", "saturatedFatContent": "11 grams", "sodiumContent": "893 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 dried pasilla chilies", "1 6-inch white-corn tortilla", "3 tablespoons unsalted butter", "1 1/2 cups chopped white onion", "4 large cloves garlic", "2 1/2 cups chicken stock", "1/4 cup heavy cream", "Kosher salt", "1 teaspoon light-brown sugar", "3 tablespoons medium-roast coffee beans, finely ground", "1 tablespoon cocoa powder", "1/8 teaspoon ground cinnamon", "1 2-pound beef tenderloin roast, cut from the large end, trimmed and tied at 1/2 -inch intervals with kitchen twine", "Kosher salt and black pepper", "2 tablespoons extra-virgin olive oil", "3/4 pound shiitake mushrooms, stemmed and quartered", "Sprigs of watercress"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Seed, stem and cut the chilies into pieces. Tear the tortilla into pieces. Set both aside. In a saucepan, melt 1 tablespoon butter over medium-high heat. Add the onion and garlic and sauté until translucent, about 3 minutes. Add the chilies and tortilla and cook over medium-low heat, stirring, until softened. Pour in the stock, bring to a boil and then simmer, partly covered, for 10 minutes. In a blender, purée the hot mixture until smooth. Pour through a fine sieve set over a saucepan, pressing on the solids. Discard the solids. Whisk in the cream, 1 teaspoon salt and the brown sugar. Season to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. In a bowl, whisk together the coffee, cocoa and cinnamon. Pat the beef dry and rub with 2 teaspoons salt and 1 teaspoon pepper; then rub with oil. Sprinkle the coffee mixture over a sheet of wax paper and coat the beef in it. Place the beef on a rack set in a roasting pan and let stand at room temperature for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the beef for 10 minutes; then lower the temperature to 250 and cook for an hour more, or until the meat reaches 130 degrees. Let stand, loosely covered with foil, for 10 minutes. (The meat will continue to cook, reaching about 135 degrees.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the broth to a boil and simmer until just thick enough to coat the back of a spoon. Cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt the remaining butter over medium-high heat. Add the mushrooms and sauté until golden. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the twine and cut the beef into 1/2-inch-thick slices. Spoon just enough broth to cover the bottoms of 4 to 6 shallow, wide soup bowls. Add 2 to 3 slices of beef, spoon more broth over the beef if desired and top with mushrooms and watercress."}], "link": "https://cooking.nytimes.com/recipes/1849-coffee-roasted-fillet-of-beef"}