{"@context": "http://schema.org", "@type": "Recipe", "name": "Roquefort-and-Pear Eggnog", "description": "This fascinating recipe came to The Times in a 2007 article by Amanda Hesser about eggnog, specifically <a href=\"https://cooking.nytimes.com/recipes/1877-1958-eggnog\">the Craig Claiborne version of the classic Christmas punch</a> which Ms. Hesser said “sweeps the field.” She asked Eben Freeman, the head bartender at Tailor in SoHo, to come up with his own interpretation of Claiborne's 1958 concoction. “Freeman is a man who isn’t shy about using ingredients like bell peppers in his cocktails, infusing gin with hops and making drinks like ‘the Waylon,’ which involves blending bourbon with smoked Coca-Cola; he took to the eggnog with the enthusiasm of a dog unleashed in the park.” What he landed on was this: a savory-sweet mousse in which he infused the cream with Roquefort and scented the nog with poire William, a pear eau de vie. Serve it as a cheese course with a spoon. There's no sipping this stuff.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Roquefort-and-Pear-Eggnog/Roquefort-and-Pear-Eggnog-articleLarge.jpg", "totalTime": "P2DT3H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "cream, pear brandy, roquefort cheese, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 156, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": null, "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "187 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 ounces Roquefort cheese, crumbled", "1 1/2+cups heavy cream", "4 eggs, separated", "1 tablespoon sugar", "1/4 cup poire William, or other pear brandy", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "One to two days before making the eggnog, combine the cheese and cream in a container and refrigerate for 36 to 48 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer fitted with a whisk, combine the egg yolks, sugar and poire William. Beat until pale yellow and emulsified. Chill for 2 hours. Line a sieve with cheesecloth, and strain the cream-and-cheese mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream to stiff peaks, then fold into the egg-yolk mixture. Beat the egg whites until fluffy, then add the salt and continue beating to stiff peaks. Fold into the cream mixture. Chill for 1 hour. Serve in small cups with a spoon."}]}