{"@context": "http://schema.org", "@type": "Recipe", "name": "Salted Butter Caramels", "description": "Candy can be made by cooks of all skill levels, as long as they don't mind standing and stirring for what can seem like an eternity (but is really only 20 to 30 minutes).", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "Makes 128 caramels", "recipeCuisine": "", "recipeCategory": "", "keywords": "bittersweet chocolate, corn syrup, heavy cream, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 59, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "2 grams", "sodiumContent": "33 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Vegetable oil", "1 1/3 cups heavy cream", "2 cups sugar", "1/2 cup light corn syrup", "1/3 cup honey", "6 tablespoons unsalted butter, cubed", "1 teaspoon vanilla paste or extract", "3 teaspoons fleur de sel or sea salt", "1 1/2 pounds bittersweet chocolate, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8-by-8-inch baking pan with aluminum foil that extends over the sides. Grease with vegetable oil. In a heavy 4-quart saucepan, bring the cream to a boil. Add the sugar, corn syrup and honey and stir constantly with a wooden spoon until the mixture comes to a boil. Cook, stirring occasionally, until the mixture reaches 257 degrees on a candy thermometer, 15 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat and, with oven mitts on, stir in the butter, vanilla and 2 teaspoons salt. Pour into the prepared pan and let cool. If you are not coating them in chocolate, let cool slightly and sprinkle with the remaining salt. When completely cool, coat a cutting board and the blade of a large chef's knife with vegetable oil. Invert the caramel onto the cutting board; peel off the foil and invert again. Cut the caramel into 8 1-inch-wide strips; then cut each strip into 1/2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To coat with chocolate, melt the chocolate in a double boiler (temper it if you want the coating to have polish; directions can be found at www.baking 911.com). Using a fork to hold the caramel pieces, dip them one at a time into the chocolate and set them on a rack to cool. After dipping 4 caramels, sprinkle each with a little of the remaining sea salt. Transfer to parchment paper to set up and cool."}]}