{"@context": "http://schema.org", "@type": "Recipe", "name": "Ambassador Roland Eng's Khmer Noodles", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2014/05/23/dining/Khmer-Noodles/Khmer-Noodles-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "Serves 10", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "main course, pork, rice noodles, shrimp", "aggregateRating": null, "recipeIngredient": ["3 pounds pork leg bones", "1/4 of a large jicama", "1 head garlic, cut in half", "1 onion, quartered", "1/2 cup dried shrimp", "1 dried squid", "2 tablespoons preserved cabbage", "1 2-inch piece ginger, sliced", "1 tablespoon white peppercorns", "Handful of cilantro stems", "2 tablespoons fish sauce", "1 tablespoon sugar", "1 tablespoon salt", "3 pounds pork (preferably heart and tongue, but pork loin cut into two pieces also works well)", "5 tablespoons plus 2 teaspoons vegetable oil", "1/4 cup (about 8 cloves) chopped garlic", "1 pound ground pork", "3 pounds large shrimp, peeled and deveined, or 2 pounds shrimp and 1 pound squid sliced into rings", "6 cups loosely packed bean sprouts", "10 handfuls (about 10 ounces) fresh or dried rice noodles", "5 teaspoons preserved cabbage", "10 teaspoons soy sauce", "Freshly ground white pepper", "1/4 cup chopped cilantro leaves", "1/4 cup chopped parsley leaves", "1/4 cup chopped scallions", "Chinese hot sauce or chilies in vinegar", "Hoisin sauce", "4 limes, quartered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the broth and pork, place the bones in a large stockpot and add 12 quarts cold water. Bring to a boil over medium-high heat, adjust heat and simmer, uncovered, skimming off and discarding any foam that forms on top of the liquid. Meanwhile, in a large square of cheesecloth, tie together the jicama, garlic, onion, dried shrimp, dried squid, cabbage, ginger, peppercorns and cilantro stems and add them to the pot. Add fish sauce, sugar and salt. Simmer for 2 hours. Season to taste, only if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth and discard cheesecloth and bones. Return broth to the pot, bring back to a boil and add the pork. Simmer until just cooked through, about 30 minutes. Lift out the pork and slice thinly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garnishes: in a small skillet, heat 5 tablespoons of the oil over medium heat. Add the garlic and cook, stirring occasionally, until just golden, about 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 2 teaspoons oil in a skillet over medium heat. Add ground pork and cook, breaking up pieces, until no longer pink. Spoon into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower shrimp into the broth using a colander or strainer (you may have to do this in batches) and simmer 1 to 2 minutes. Do the same with the squid if you are using it. Remove to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide half the sprouts among 10 large soup bowls. Bring a large pot of water to a boil. Add noodles and cook, stirring with chopsticks, until soft, about 1 minute for dried (less for fresh). Drain. Divide the noodles between the bowls. Toss the noodles with a teaspoon of the garlic and oil. Top each with half a teaspoon of preserved cabbage, 1 teaspoon soy sauce and a sprinkle of ground white pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a few slices meat to each bowl, 1 tablespoon ground pork, a few shrimp (and squid, if using). Fill each bowl with hot broth. Combine the cilantro, parsley and scallion and top each bowl with about a tablespoon of the herbs. Top with bean sprouts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring bowls to the table and serve with soy sauce, hot sauce and hoisin. Guests should squeeze lime over their soups and season them with condiments of their choice."}], "link": "https://cooking.nytimes.com/recipes/1910-ambassador-roland-engs-khmer-noodles"}