{"@context": "http://schema.org", "@type": "Recipe", "name": "Endives With Ham", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, sauces and gravies", "keywords": "dry white wine, endive, ham, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 594, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "25 grams", "sodiumContent": "923 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 Belgian endives, halved vertically", "9 tablespoons unsalted butter, more for baking dish", "Juice of 1 lemon", "Pinch sugar", "Salt and ground white pepper", "2 cups dry white wine", "3 tablespoons flour", "2 cups whole milk, warmed", "4 1/8-inch-thick slices, or about 1/2 pound, cooked ham (jambon de Paris, prosciutto cotto or unsmoked Virginia ham)", "4 ounces coarsely grated Gruyère or Comté cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove outer layer of leaves from endives. Trim bottoms, and carve a V shape in cut side to remove cores. Place endives cut side down in a single layer in a saut&#233; pan. Dot with 1 tablespoon butter, sprinkle with lemon juice and season with sugar, salt and pepper. Add wine and about 1 cup water to barely cover endives. Cut a circle of parchment to fit into pan and place on endives. Bring to a simmer and cook 20 minutes, until tender. Remove from heat, and cool in liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt remaining butter in a saucepan. Whisk in flour and cook, stirring, over low heat for 5 minutes. Slowly whisk in warm milk, beating constantly, about 10 minutes, until b&#233;chamel sauce is thick and smooth. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter a baking dish to hold endives in a single layer. Drain endives, and pat dry on paper towel. Cut ham slices in half, and wrap endive halves in ham. Place seam side down in baking dish. Spoon b&#233;chamel over and around roll-ups. Sprinkle with cheese. Set aside until shortly before serving. Refrigerate dish if waiting more than 1 hour, but bring to room temperature before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Bake 6 to 8 minutes, until sauce is bubbling. Briefly place dish under broiler to lightly brown top. Serve hot."}]}