{"@context": "http://schema.org", "@type": "Recipe", "name": "Won Tons Stuffed With Three Fruit Purees", "description": "", "author": {"@type": "Person", "name": "Bruce Cost"}, "image": null, "totalTime": "PT40M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, fruit, milk, wonton skins, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1007, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "109 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "8 grams", "proteinContent": "16 grams", "saturatedFatContent": "35 grams", "sodiumContent": "585 milligrams", "sugarContent": "41 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound of bananas, peeled and diced", "1/2 pound mangoes, peeled and diced", "1/2 pound raspberries or hulled strawberries, diced", "1 lemon", "Sugar to taste", "1/2 pint milk", "3 tablespoons sugar", "4 egg yolks", "2 tablespoons litchi liquor", "12 won ton skins", "1 cup clarified butter or peanut oil", "Powdered sugar", "Slices of banana, mango and raspberries for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put each fruit in separate small frying pans and cook over medium heat, ''sweating'' them until you obtain a thick puree. Add the juice of one-third lemon to both the banana and mango purees, and add sugar to taste to all three. Let the purees cool while you make the creme anglaise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the milk and one and one-half tablespoons of the sugar into a heavy saucepan. Put the egg yolks into a mixing bowl, whisk just to combine, then whisk in the remaining one and one-half tablespoons of sugar. Set the saucepan over medium heat and bring the milk to a boil. Immediately turn off the heat and pour about half the milk into the egg yolk-sugar mixture. Whisk continuously to mix. When combined, pour the egg yolk-sugar mixture back into the saucepan, whisk to combine and then cook over medium-low heat. Stir continuously, scraping the bottom of the pan. Don't allow the mixture to boil. When the mixture is thick enough to coat a spoon, strain it, stir in the litchi liquor and set aside, stirring it occasionally over the next 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fruit purees have cooled, put a half teaspoon of each puree into the center of four won ton skins; moisten the edges with a little water, fold and press the edges together to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the won tons, put the butter or peanut oil into a wok or skillet and heat until nearly smoking. Brown the won tons a few at a time, turning them in the hot fat. Remove and drain. Sprinkle them with powdered sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the warm sauce onto the bottom of four plates. Arrange three won tons - each with a different puree - and the fruit garnish on the plates and serve."}]}