{"@context": "http://schema.org", "@type": "Recipe", "name": "Rabbit With Sesame Glaze", "description": "", "author": {"@type": "Person", "name": "Bruce Cost"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "main course, mushroom, rabbit", "aggregateRating": null, "recipeIngredient": ["2 rabbits", "Salt and pepper", "1/2 cup white vinegar", "1 pound domestic mushrooms", "Water", "1 large potato for parasol garnish", "2 tablespoons sesame oil", "Olive oil", "Leaves with stems from 2 heads small (baby) bok choy", "2 tablespoons toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the back legs with thighs off of the rabbits and carefully remove the bones from the thighs, leaving the meat intact. Set the legs aside and reserve the bones. Remove the loin with the flank meat attached from either side of the rabbits by starting along each side of the spine and cutting down. Or ask the butcher to do this for you. Season the loin with salt and pepper; roll the meat inside the flank and tie with a string. Cut up the remaining carcass and thigh bones for stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the vinegar and mushrooms in a stockpot, heat and reduce the liquid by half; add the rabbit bones, cover with water and bring to a boil. Skim and simmer for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the stock is simmering, make four potato parasols. Peel and slice the potato thinly. Stack the slices and cut into thin matchstick shreds. Cover the bottom of a large nonstick skillet with a film of olive oil and make four circles about two and one-half inches in diameter with the potato slices - leaving a hole in the center -by overlapping the shreds. Press lightly with a spatula. They should look like parasols; the starch will make them adhere. Turn the heat to low and slowly brown the potatoes until crisp on both sides. Season with a little salt to taste, remove and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the end of an hour, strain the stock, add the sesame oil and reduce it to a glaze, about a third of a cup. Correct the seasonings; cover and keep warm over a little steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an oven to 400 degrees. Add a little olive oil to a large skillet, heat and saute the reserved loins and legs briefly on both sides. Remove them to a rack in a baking pan and put in the oven for 10 minutes. Remove the loin, leaving the legs for another five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the bok choy to a pan with one tablespoon of olive oil, one-quarter cup of water and salt and pepper to taste. Cook just until done and bright green. On four warm plates, lay the bok choy down in a fan pattern, curving at the center. Cut the loins into quarter-inch slices and place one each around the center of a fan. Put the legs with the foot sticking up in the center of the loin slices; you may have to trim it to get it to stand. Spoon the sauce carefully around the meat and sprinkle the meat with the sesame seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potato parasols over the top of the rabbit legs and serve."}], "link": "https://cooking.nytimes.com/recipes/1937-rabbit-with-sesame-glaze"}