{"@context": "http://schema.org", "@type": "Recipe", "name": "Crab Meat and Mussels Cioppino With Glass Noodles", "description": "", "author": {"@type": "Person", "name": "Bruce Cost"}, "image": null, "totalTime": "PT40M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "crab meat, glass noodles, mussels, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "recipeIngredient": ["4 ounces dried glass noodles (also called cellophane or bean thread noodles)", "Boiling water", "Soy sauce", "3 tablespoons olive oil", "1 small onion, chopped finely", "1 clove garlic, crushed", "1 sprig fresh oregano or 1 teaspoon dried", "1/2 cup white wine", "2 pounds fresh mussels, scrubbed and de-bearded", "1 large ripe tomato, seeded, peeled and diced", "Salt and pepper to taste", "1 scallion, green included, chopped", "1 heaping tablespoon pine nuts", "4 ounces crab meat, preferably freshly picked from its shell", "Cayenne pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the noodles in a bowl and pour boiling water over to cover. Leave the noodles for 10 minutes, drain them well, then toss with just enough soy sauce to color them lightly and evenly and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put one tablespoon of the olive oil in a large saucepan and heat. Quickly saute the onion, garlic and the oregano. Add the white wine, bring to a boil and add the mussels. Cover and steam until the mussels open, about four minutes. Remove the opened mussels, leaving the sauce in the pan. Remove the mussels from the shells and discard the shells. Add the tomato to the reserved sauce and bring to a boil. Add salt and pepper to taste, turn off the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another saucepan or small skillet, add two tablespoons of olive oil. Heat and add the scallion and pine nuts. Stir briefly and add the crab meat and mussels. Saute briefly. Stir in salt and cayenne to taste and turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make nests of noodles in the center of four small plates. Divide the seafood into the center of the nests. Spoon the cioppino sauce outside of the nests and serve."}], "link": "https://cooking.nytimes.com/recipes/1939-crab-meat-and-mussels-cioppino-with-glass-noodles"}