{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant, Tomato And Ramps Sauce (Woods Gramercy)", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "eggplant, ramps, tomato, side dish, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 112, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "488 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 medium eggplant (about 10 inches long)", "8 ripe plum tomatoes", "3 tablespoons extra-virgin olive oil", "1 bunch ramps, thinly sliced, about 1/2 cup (see note)", "1 tablespoon fresh thyme, roughly chopped", "2 tablespoons fresh basil, roughly chopped", "3 tablespoons white wine", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 degrees. With fork, prick eggplant in several places to keep it from bursting; place it on a baking sheet and put in the oven. Let roast until it is thoroughly soft and skin is brown and shriveled, about 20 minutes. (Roasting the eggplant over a charcoal fire will lend a very pleasant smoky aroma to the finished sauce.) When cool enough to handle, peel eggplant, discard skin and chop flesh into rough chunks about 1/2 inch square."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While eggplant is roasting, bring a pan of water to a rolling boil. Dip each tomato in boiling water for 15 seconds to loosen skin. Peel tomatoes, cut in half and squeeze out seeds. Finely chop tomato flesh and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add olive oil to skillet. Over medium heat, saute chopped ramps in the oil until softened. Remove with a slotted spoon and set aside. In remaining oil, over medium-high heat, saute chopped eggplant, stirring constantly, for about 3 minutes, until it starts to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add reserved ramps, chopped tomatoes, thyme and basil. Toss to mix well. Add white wine. Saute over medium-high heat 5 to 7 minutes, until the sauce has amalgamated. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When sauce is done, set aside but do not refrigerate. Just before serving, it may be reheated very briefly. Serve with grilled swordfish or halibut steaks or with fillets of snapper or tilefish. Garnish the sauce, if desired, with more fresh herbs, finely minced."}]}