{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Liver With Chervil", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "chervil, foie gras, side dish", "aggregateRating": null, "recipeIngredient": ["1 small red onion, peeled", "1/2 pound Belgian endive", "1/2 pound red cabbage, quartered and cored", "1 bunch fresh chervil or 2 bunches fresh chives", "2 tablespoons corn oil", "4 3/4-inch thick crosswise slices fresh foie gras, about 3/4 pound total weight", "Salt to taste, if desired", "Freshly ground pepper to taste", "2/3 cup hazelnut oil, available in fine food specialty shops", "1/4 cup balsamic vinegar, available in fine food specialty shops"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the onion lengthwise in half. Put the halves on a flat surface and cut crosswise into thin slices. There should be about 1/2 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off and reserve the tips of the endive. Cut the remaining endive into 2-inch lengths. Cut each piece lengthwise into very thin strips. There should be about 1 cup loosely packed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the quartered cabbage on a flat surface and cut it crosswise into very thin shreds. There should be about 2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull off the top leaves from the stems of chervil. There should be about 2 cups. Reserve 10 or 12 leaves for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the corn oil in a heavy skillet. When it is hot and almost smoking, carefully slide the foie gras slices into the skillet. Sprinkle with salt and pepper. Cook over high heat about 45 seconds. Carefully turn each slice and cook about 1 minute longer. Remove and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half of the hazel oil to the skillet and when it is hot add the onion and red cabbage. Add salt and pepper and cook, stirring, about 1 minute. Add the remaining hazelnut oil. Stir and add the balsamic vinegar. Toss briefly and pour the mixture into a mixing bowl. Add the endive strips and chervil. Toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange pieces of the reserved endive tips around an oval or round platter, alternating them with the reserved chervil leaves. Spoon the red cabbage mixture in the center. Arrange the foie gras slices over the red cabbage mixture."}]}