{"@context": "http://schema.org", "@type": "Recipe", "name": "White Chocolate Jazz (A butter-cream mousse)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT8H30M", "recipeYield": "4 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, heavy cream, raspberries, white chocolate", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 437, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "21 grams", "sodiumContent": "41 milligrams", "sugarContent": "30 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["7 ounces white chocolate, available in specialty shops (see note)", "1/2 cup heavy cream", "8 tablespoons butter, at room temperature", "2 pints berries such as raspber ries or strawberries", "2 tablespoons sugar", "Macadamia meringue triangles (<a href=\"http://cooking.nytimes.com/recipes/1980-macadamia-meringue-triangles\">see recipe</a>), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the white chocolate and cream in a mixing bowl, preferably metal. Set the bowl in a basin of simmering water. When the chocolate is melted, beat the mixture briskly with a wire whisk. When well blended set aside to cool to almost room temperature. Add the butter and beat until pale in color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour or spoon equal portions of the mixture into each of 4 small ramekins or souffle dishes, each with a capacity of about 1/3 cup. Arrange the ramekins in a dish and place in the freezer. Let stand 8 hours or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside a dozen or more whole berries to be used as a garnish. Put the remaining berries into the container of a food processor and add the sugar. Blend thoroughly. Put the puree through a fine sieve, preferably of the sort known in French kitchens as a chinois. Press with a rubber spatula to extract as much liquid as possible. There should be about 1 cup of this sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold the ramekins. To do this, dip the base of each ramekin briefly in a basin of hot water. Run a knife around the inside of each ramekin to loosen the sides. Shake the ramekin over a plate. You may have to encourage the unmolding with a knife. This mousse is incredibly rich. You may serve 1 mousse as an individual portion, or you may cut each in half crosswise to make 2 round halves. If desired, serve one-half per person. Keep chilled until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon an equal portion of sauce on 4 or 8 serving dishes. Smear it over evenly. Arrange a portion of mousse in the center. Surround it with berries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve, if desired, with macadamia meringue triangles (see recipe) or macaroons."}]}