{"@context": "http://schema.org", "@type": "Recipe", "name": "Escarole Pizza", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT4H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "anchovy fillets, escarole, pine nuts, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 473, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "7 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "668 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1/4 ounce package yeast", "1 1/2 cups warm water", "3 cups flour", "2 tablespoons olive oil", "Coarse salt", "1 1/2 pounds escarole", "2 tablespoons olive oil", "3 cloves garlic", "10 black olives, pitted and sliced", "1 2-ounce can flat anchovies, chopped", "1/2 cup pine nuts", "1/2 cup raisins", "1 tablespoon capers, rinsed and drained", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pizza dough. Dissolve the yeast in one cup lukewarm water and let it stand for five minutes, or until it has begun to ferment. If the mixture does not ferment, throw it away and use another package of yeast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a food processor, fit the bowl with a steel blade and put in the flour, olive oil, salt, yeast mixture and remaining water into the bowl. Process until the dough forms a ball -about 20 seconds. Place the dough on a smooth surface and knead for a couple of minutes, adding more flour if the dough is too sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the hand method, combine the flour and salt and place the mixture on a smooth working surface. Make a well in the center and add the yeast mixture, olive oil and remaining water. Gradually work the flour into the liquid, using a wooded spoon. When the dough is too stiff to work with the spoon, knead until it is smooth and shiny, about eight to 10 minutes. Add more flour if the dough gets too sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the dough in a large floured mixing bowl. Cover with a damp cloth or plastic wrap and let it rise for two hours in a warm place (the back of the stove, for example) until doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough, sprinkle it with flour and knead for a minute. Flour a 12-inch pizza pan and roll out the dough with a rolling pin directly onto the pan. Brush with olive oil. Let rise for an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the escarole topping. Wash the leaves and simmer them in boiling water for five minutes. Drain, squeeze out the water and chop the leaves coarsely. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a frying pan and gently saute the garlic, olives, anchovies and pine nuts until the garlic begins to turn golden. Add the escarole and cook uncovered stirring frequently for 10 minutes over moderate heat. Stir in the raisins and capers and season with pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pizza for 10 minutes. Remove the pizza from the oven and spread with the escarole mixture. Season with pepper. Return to the oven and bake a further 15 minutes."}]}