{"@context": "http://schema.org", "@type": "Recipe", "name": "Chestnut Cake With Chocolate Ganache And Single-Malt Scotch Syrup", "description": "The combination of chestnuts, chocolate and single-malt Scotch is powerful, so you’ll need to frost this with milk chocolate instead of the usual bittersweet. The milk chocolate ganache tempers the Scotch and mellows the chestnuts, and brings the whole dessert together harmoniously. The cake itself is almost a meringue. Use your best single-malt for this — a lesser one will make for a good but not great result.", "author": {"@type": "Person", "name": "Bill Yosses"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 501, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "91 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "65 milligrams", "sugarContent": "55 grams", "transFatContent": null}, "recipeIngredient": ["1 cup confectioners' sugar, more for serving", "1 cup almond flour (see note)", "1/2 cup all-purpose flour", "1/2 cup chestnut flour (see note)", "8 large egg whites", "Pinch cream of tartar", "1 cup lightly packed light brown sugar, sifted", "1/2 cup granulated sugar", "1/4 cup aged single-malt Scotch whiskey", "1 cup walnut halves", "1 15-ounce jar chestnuts packed in syrup, drained (see note)", "Milk chocolate ganache (<a href=\"http://cooking.nytimes.com/recipes/202-milk-chocolate-ganache\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Grease and flour three 8-inch round cake pans, and line with parchment paper. Sift confectioners' sugar, almond flour, all-purpose flour and chestnut flour into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a dry bowl of a mixer fitted with whisk attachment, whip egg whites until foamy. Add cream of tartar and 1 tablespoon brown sugar, and beat until soft peaks form. Gradually add remaining brown sugar; whip until very stiff and glossy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently fold sifted dry ingredients into meringue in three stages. Divide batter among pans, and smooth tops. Bake for 17 to 20 minutes, until tops are brown and spring back when lightly pressed. Transfer to a wire rack, and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven temperature to 325 degrees. Line a rimmed baking sheet with parchment or a nonstick liner. In a small saucepan, combine granulated sugar with 1/2 cup water. Bring to a boil, stirring until sugar dissolves. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir whiskey into syrup. Place walnuts in a bowl, and toss them with 1/4 cup syrup. Pour nuts out onto baking sheet in a single layer. Bake for 15 minutes, stirring every 5 minutes. Transfer to a wire rack to cool. Meanwhile, chop all but four of candied chestnuts, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble cake, cut a piece of cardboard into an 8-inch round or use removable bottom of a springform pan. Place a cake layer upside down on this base. Brush cake with a generous amount of whiskey syrup. Spread about 3/4 cup ganache on top, and sprinkle with half the chopped chestnuts. Lay another upside-down cake layer on top, and brush with more syrup. Spread on another layer of ganache, and sprinkle with remaining chopped chestnuts. Repeat with final layer of cake, more syrup and more ganache. Using a metal spatula, spread a thin layer of ganache onto sides of cake. Refrigerate for 1 hour. Spread another coat onto top and sides of cake, smoothing it well. Press candied walnut halves onto sides, and arrange candied chestnuts on top. Sprinkle with confectioners' sugar before serving."}], "link": "https://cooking.nytimes.com/recipes/201-chestnut-cake-with-chocolate-ganache-and-single-malt-scotch-syrup"}