{"@context": "http://schema.org", "@type": "Recipe", "name": "Beggar's Chicken", "description": "Here is a traditional recipe from Hangzhou, a Chinese city long known for its gorgeous scenery and place in the Southern Song Dynasty. From that era comes this chicken, which is stuffed with a savory pork mixture and then encased in clay before baking. The clay lends the chicken an unearthly tenderness. This is a weekend project, yes, but one well worth tackling. ", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "Four servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, project", "keywords": "chicken, ground pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 694, "unsaturatedFatContent": "38 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "2 grams", "proteinContent": "43 grams", "saturatedFatContent": "12 grams", "sodiumContent": "991 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 chicken, 2 1/2 pounds ready-to-cook weight", "Salt to taste, if desired", "2 tablespoons dark soy sauce", "3 tablespoons shaohsing wine or dry sherry", "6 dried black mushrooms", "1/2 cup shredded Sichuan preserved vegetable, available in cans in Chinese markets (see first note)", "1/3 cup peanut, corn or vegetable oil", "1/4 pound ground pork, preferably not too lean", "1 cup thinly sliced bamboo shoots", "1/2 teaspoon sugar", "11 pounds, approximately, sculptor's or potter's earth clay (see second note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the chicken inside and out with salt, half of the soy sauce and half of the wine. Set aside for at least one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the mushrooms in a small mixing bowl and add warm water to cover. Let stand half an hour or until the caps are softened. Drain and squeeze to extract and discard excess moisture. Cut off and discard the tough stems. Cut the caps into thin slivers and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the preserved vegetable into thin slivers. If it has been packed in a shredded state, shred it further. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a wok or skillet and add the pork. Cook, stirring rapidly, until it loses its raw look. Add the mushrooms, preserved vegetable and bamboo shoots. Add the remaining soy sauce, remaining wine, salt and sugar. Cook, stirring, one minute. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the mixture inside the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the wing tips under the chicken. Truss the chicken as neatly as possible with string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay out a large rectangle of aluminum foil on a flat surface. Place the chicken in the center. Wrap the chicken as compactly as possible inside the foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather together a large handful of the clay. Flatten this handful to a thickness of about one inch and apply it to one outside section of the foil-wrapped chicken. Place another flattened handful of clay slightly overlapping and press to seal the two pieces together. Continue applying handfuls of clay, pressing as you work, until the chicken is completely and compactly covered with clay. Smooth the clay over as you work. You may bake the chicken at this point or you may ''sculpt'' the product with additional pieces of clay, shaping it to resemble a whole bird with beak, feet, eyes, tail feathers and so on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 45 minutes. Increase the oven temperature to 400 degrees. As the clay bakes, it may develop cracks. As these are noticed, seal the cracks by smearing on a little more clay."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue baking the chicken for 30 minutes. If desired, you may then paint the clay with poster paint or watercolors."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, crack the clay, remove the chicken and peel away and discard the foil. Carve the chicken and serve with the preserved-vegetable stuffing."}]}