{"@context": "http://schema.org", "@type": "Recipe", "name": "Deep-Fried Turkey", "description": "As every politician since Huey Long -- or possibly Madison himself -- has said, ''We can do better.'' And in Louisiana, they have, by doing the unthinkable: deep-frying an entire turkey in a bubbling vat of peanut oil or lard. The result is delicious, surprisingly ungreasy and fast. (A 14-pounder cooks in 49 minutes -- 49 minutes!) I've made five of these things, and comments have ranged from ''This is the best turkey I've ever eaten!'' to ''This is the best turkey I've ever eaten!'' with nary a discouraging word.\n\nDeep-frying must be done outside, which means you will need a propane tank. In New York City it is illegal to cook with propane gas except in large gardens or outdoor spaces of single-family dwellings. It should work fine in a yard, where your fryer can double as a defensive weapon in case of intruders scaling your wall.\n\nIn case the oil overflows, place a large bowl and a ladle next to the pot. Also, just before lowering the bird into the oil, and again just before taking it out a scant 49 minutes -- 49 minutes! -- later, turn the flame off for the same reason.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, main course, peanut oil, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 123}, "recipeIngredient": ["3/4 cup chopped onion", "3/4 cup chopped celery", "3 to 6 tablespoons chopped garlic", "4 tablespoons unsalted butter", "2 tablespoons (or more) chopped hot peppers from pepper vinegar", "2 tablespoons Worcestershire sauce", "1 tablespoon plus 1 teaspoon salt", "1 tablespoon cayenne", "1 tablespoon black pepper", "1 cup chicken stock", "1 recipe for internal turkey brine", "1 14-pound turkey", "1 tablespoon of cayenne or favorite Cajun spice", "5 gallons of peanut oil or lard (approximately)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Eight to 24 hours in advance, make the brine by sauteing onion, celery and garlic in butter until tender. Add hot peppers and Worcestershire, then stir in the salt, cayenne and black pepper. Add the chicken stock and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain into a bowl, pressing the solids to extract as much juice as possible, to yield about 1 1/2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With monster hypodermic, inject the turkey's breast in five places and each leg in one place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With your bare hands, rub the cayenne into the turkey's breast under the skin. Omit if you don't like the flavor -- though it's very mild in this quantity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate, uncovered, for 8 to 24 hours. Or if you prefer, you may fry the bird immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the day you plan to eat it, remove the turkey from the refrigerator, place it in the empty fryer pot and cover with water. Then empty the pot, measuring the water to find out how much oil you'll need (usually about 5 gallons for a 14 pounder)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry the pot very thoroughly and fill it with the same amount of oil or lard, attach the extra-long thermometer and heat the oil to 350 to 375 degrees. Just before lowering the bird, turn off the flame to make absolutely sure that Mr. Peanut's essence won't start a fire. Then pierce the turkey with its holder and lower slowly into the oil. Boil for 49 minutes or longer (3 to 3 1/2 minutes per pound)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the turkey, drain excess oil and rest it on a platter for 10 to 30 minutes. Slice and dive in!"}], "link": "https://cooking.nytimes.com/recipes/204-deep-fried-turkey"}