{"@context": "http://schema.org", "@type": "Recipe", "name": "White Chocolate And Chestnut Souffle", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT45M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "canned chestnut puree, sugar, white chocolate, dessert, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "0 grams", "proteinContent": "9 grams", "saturatedFatContent": "13 grams", "sodiumContent": "104 milligrams", "sugarContent": "43 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons unsalted butter at room temperature, plus butter for greasing the souffle dishes", "2/3 cup granulated sugar, plus sugar for dusting the souffle dishes", "6 ounces white chocolate, preferably imported, broken into small pieces", "1/2 cup dark brown sugar", "8 extra-large eggs at room temperature, separated", "1 tablespoon pure vanilla extract", "7 ounces unsweetened chestnut puree, available in cans", "8 teaspoons confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Position a rack in the center of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter eight individual souffle dishes, each with a one-and-one-half- cup capacity. Sprinkle each with a little granulated sugar and shake out the excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chocolate pieces into a mixing bowl. Select a saucepan in which this bowl will fit neatly. Put an inch or so of water in the saucepan and bring to the simmer. Place the mixing bowl over, but not in, the water. Stir until the chocolate is melted and without lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the heat and continue stirring until the chocolate is cooled almost to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the eight tablespoons of butter and the brown sugar into the bowl of an electric mixer. Start beating the butter mixture while adding the yolks one at a time. Add the vanilla and chestnut puree and beat until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the chocolate into the butter mixture and mix only until blended. If this is overbeaten, the mixture will become warm and separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites with the one- third cup of granulated sugar until they are shiny and hold soft peaks. Add about one-quarter cup of the beaten whites to the chocolate mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the chocolate mixture into the remaining beaten whites and fold gently. Pour an equal portion of the mixture into each of the prepared souffle dishes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the souffle dishes on a baking sheet and place in the oven. Bake 20 minutes or until the souffles are puffed and browned. Sift one teaspoon of confectioners' sugar over each souffle and serve."}], "link": "https://cooking.nytimes.com/recipes/2072-white-chocolate-and-chestnut-souffle"}