{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken in the Pot", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project, soups and stews", "keywords": "chicken, egg noodles, vegetables, low-fat, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 716, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "2 grams", "proteinContent": "55 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1148 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3 1/2-pound chicken cut in half", "Water", "1 large onion, trimmed of roots but left unpeeled", "1 large carrot, scraped", "1 stalk celery with leaves", "1 sprig parsley and 1 sprig dill, tied together", "2 cloves garlic, peeled and crushed", "Salt", "1/4 pound narrow egg noodles", "1 tablespoon finely minced parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull off as much of the yellow fat as possible from the chicken. Place chicken halves in a five- to six-quart pot along with the gizzard, neck and heart. Reserve the liver for another purpose. Cover with cold water, bring to a boil and allow to boil for five minutes, skinning off all the foam and scum that accumulates on the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to simmer and add the vegetables, herbs and garlic. Stir in salt to taste - you may need as much as one tablespoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer gently for 1 hour 15 minutes, until the chicken is done. At no time should the liquid boil, which would cause the finished soup to be cloudy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken is done, remove it from the pot and set it aside, covered, to keep warm. Strain the soup through a fine strainer or through a clean linen napkin set into a strainer. Rinse out the soup pot and return the soup to the pot. The soup should be clear, golden and with very little fat on the surface. Chilling it overnight will allow all the fat to be removed if you wish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finally, dice the carrot, half of the onion without the peel and half of the celery. Discard the rest of the vegetables and herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the noodles in a separate pot of water until tender, then set aside, covered, to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the skin from the chicken and cut the chicken into serving pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, reheat the soup to a simmer and return the chicken to the pot. Simmer for five minutes. Place a couple of pieces of chicken in each of four deep bowls along with some of the noodles and diced vegetables. Ladle hot soup over each serving. Sprinkle with minced parsley and serve."}], "link": "https://cooking.nytimes.com/recipes/2123-chicken-in-the-pot"}