{"@context": "http://schema.org", "@type": "Recipe", "name": "Bsteeya", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT2H20M", "recipeYield": "Six to eight servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, project", "keywords": "almonds, cornish game hens, phyllo, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 879, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "60 grams", "fiberContent": "4 grams", "proteinContent": "44 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1282 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 rock Cornish game hens, about 1 1/4 pounds each (see note)", "2 tablespoons butter", "1 1/4 cups finely chopped onions", "1 tablespoon finely minced garlic", "3/4 teaspoon ground turmeric", "1 tablespoon grated fresh ginger or 1 teaspoon dried 12-inch length of cinnamon stick", "1 teaspoon (2 grams) loosely packed thread saffron", "1/4 teaspoon allspice", "4 sprigs fresh parsley", "Salt to taste, if desired", "12 peppercorns", "4 cups water or chicken broth", "1 cup whole blanched almonds", "1/4 cup sugar", "1 teaspoon ground cinnamon, plus 1/4 to 1/2 teaspoon for garnish", "6 eggs, well beaten", "2 tablespoons finely chopped fresh coriander leaves, optional", "18 sheets phyllo pastry, available in specialty food shops and in shops that specialize in Greek and Middle Eastern foods", "10 tablespoons clarified butter (see note)", "2 teaspoons confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the game hens into serving pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt two tablespoons of butter in a kettle and add the onions and garlic. Cook, stirring, until the onions are wilted. Add the turmeric, ginger, cinnamon stick, saffron, allspice, parsley sprigs, salt and peppercorns. Stir to blend and cook briefly. Add the game hen pieces and sprinkle with salt and pepper. Add the water or broth and bring to the boil. Let cook 45 minutes. Carefully remove the pieces of game hen. Strain the broth into a skillet or saucepan, discarding the solids. Bring the broth to the boil and cook over high heat until reduced to about three-quarters of a cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the almonds in a skillet and cook, stirring often, until they are golden brown. Take care that they do not burn. Remove from the heat and let cool. Put the almonds into the container of a food processor or electric blender and process until coarse-fine. Blend with the sugar and one teaspoon ground cinnamon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull away and discard the skin and bones from the game hens. Shred the meat. There should be about five to six cups of meat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the broth to the boil. Pour about one-quarter cup of the simmering broth into the beaten eggs. Add the coriander. Pour this mixture into the remaining broth and cook over very low heat, stirring rapidly with a wire whisk, until the mixture is thickened. Pour and scrape it immediately into a mixing bowl and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select a large Pyrex pie dish, one and three-quarter inches deep and 11 inches in diameter, or another smooth- rimmed utensil of approximately the same size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay out the phyllo sheets in one stack and have a damp towel at hand to keep the leaves covered to prevent their drying out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You will use the top sheet of pastry as you work. Brush the top sheet with clarified butter and transfer it, buttered side up, over the pie plate, letting the outer edges extend outward. Butter a second sheet and add this to the first, buttered side up. Repeat with four more sheets, making a total of six."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about half of the egg mixture over the bottom of the pastry-lined pie plate. Smooth it over. Top this with the shredded poultry and smooth it over. Brush six sheets of pastry with butter and add them, buttered side up, over the poultry, letting the outer edges extend outward. Add the remaining egg mixture and smooth it over. Cover the egg mixture with the almond mixture, smoothing it over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the overlapping edges of pastry toward the center, covering the upper surface of the pie neatly and well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter one more sheet of pastry and place it, but tered side down, over the pie, outer edges extended outward. Butter a second sheet and arrange it neatly on top. Carefully tuck the edges of the pastry over the pastry-wrapped pie to make a smooth product."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pie in the oven and bake 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If any fat has accumulated around the edges of the pie, pour it off carefully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold a small sieve over the pie and add the confectioners' sugar. Sprinkle the sugar evenly over the pie. Decorate the top evenly with the remaining ground cinnamon sprinkled in thin lines over the top to make a wedge or square pat tern. Serve the pie cut into wedges."}]}