{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Chowder", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "Four to six servings", "recipeCuisine": "new england", "recipeCategory": "dinner", "keywords": "haddock, milk, russet potatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "recipeIngredient": ["1 small haddock or scrod, weighing 2 1/2 to 3 pounds (see note)", "2 bay leaves", "12 black peppercorns", "1/2 teaspoon butter", "4 ounces lean salt pork, diced", "1 medium onion, cut in half and thinly sliced", "2 medium russet potatoes, cubed", "1 cup whole milk", "1 cup evaporated milk", "1 teaspoon salt, if desired", "Freshly ground black pepper", "1/4 teaspoon dry mustard powder", "Common crackers, pilot crackers or oyster crackers", "Butter to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the fish and place in a kettle with the bay leaves and peppercorns. Add water to cover, at least two and one-half cups, and bring to a simmer over gentle heat. Cover the kettle and let simmer, 10 to 15 minutes, until the fish is cooked through but still firm-textured. (If necessary, you may cut the fish in half in order to fit the kettle.) Remove the fish from the broth. Skin and bone the cooked fish, break the flesh into chunks and set aside. Return the skin and bones, as well as head and tail pieces, to the broth and continue to simmer, covered, for 30 minutes to give a well-flavored broth for the chowder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in another soup kettle and gently saute the diced salt pork until the scraps have rendered their fat and turned crisp and brown. Remove the pork, drain on absorbent paper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the hot fat, saute the onion slices gently until they begin to brown. Then add the potato cubes and turn in hot fat to coat them well. When the potatoes begin to sizzle, add at least two cups of fish broth, strained of the bay leaves and peppercorns. The potatoes should be floating, but not drowning, in the liquid. Simmer gently, covered, until the potatoes are tender enough to pierce with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the fish pieces and continue simmering another five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the whole milk to just below boiling. Add it, a quarter of a cup at a time, to the chowder. Heat the evaporated milk and add it in a similar fashion. From the moment the milk is added, the chowder must not boil. This is very important. If it boils, it may curdle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste for seasoning and add salt, pepper and the dry mustard powder. Mix well. Then put the chowder ''to set,'' as they say in Maine, for at least two hours. Ideally, it should be placed on the least warm area of the woodstove top where it will stay just below the simmering point. A very low gas flame, as long as the chowder doesn't boil, will do as well. If you can't keep it at a temperature just below boiling, it is better to refrigerate the chowder for a day, rather than leaving it at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, reheat the chowder, without bringing to the boil. Put a pat of butter in each chowder bowl before filling it, and sprinkle bits of browned pork scraps over the top. Pass the crackers to add to the soup."}], "link": "https://cooking.nytimes.com/recipes/2172-fish-chowder"}