{"@context": "http://schema.org", "@type": "Recipe", "name": "Ravioli With Foie Gras and Truffles", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, black truffle, foie gras, wonton skins", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1017, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "101 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "4 grams", "proteinContent": "32 grams", "saturatedFatContent": "17 grams", "sodiumContent": "2063 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 pound cooked fresh foie gras (see note)", "1 tablespoon finely chopped fresh or canned black truffles", "20 won-ton skins, available in many supermarkets and most Chinese markets", "3 cups rich fresh chicken or beef broth", "1 whole fresh or canned black truffle shaved as thinly as possible"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the foie gras into slices about half an inch thick or slightly larger. Cut the slices into half-inch or slightly larger cubes. Dip one side of each cube into the chopped truffles and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the won-ton skins to make ravioli. Begin by laying the skins on a flat surface and, using a pastry brush, brush around the inside perimeter of each skin with water, making a 1-inch brushed margin. Place one piece of foie gras in the center of each won-ton skin. Fold over one corner of the won ton to meet its opposite corner, and enclose the foie gras. Press all around with the fingers to seal. Use a biscuit cutter to press around the filled won-ton skin to make a neat moon shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the broth to a simmer in a saucepan, and add the ravioli. When the liquid returns to a simmer, let the ravioli cook 1 minute. Remove the ravioli carefully with a slotted spoon. Put 5 ravioli in each of 4 heated soup plates. Spoon equal amounts of the broth over each serving, and sprinkle each serving with an equal amount of the shaved truffle. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/2183-ravioli-with-foie-gras-and-truffles"}