{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallops With Salad Greens", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "salads and dressings", "keywords": "mâche, scallops, watercress", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "1 gram", "proteinContent": "15 grams", "saturatedFatContent": "5 grams", "sodiumContent": "571 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound sea or bay scallops", "Salt to taste, if desired", "Freshly ground pepper to taste", "4 tablespoons olive oil, approximately", "1/4 pound red leaf lettuce", "1/4 pound corn salad, field salad or mache, available at many greengrocers", "1 small bunch watercress", "1/4 pound radicchio", "2 tablespoons plus 1/2 teaspoon balsamic vinegar", "1 1/2 tablespoons butter", "1 fresh or canned black truffle shaved as thinly as possible, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If sea scallops are used, cut them crosswise in half. If bay scallops are used, leave them whole. The scallops may be cooked in a skillet or, preferably, on a gas- or wood-fired grill. If they are to be cooked on a grill, preheat the grill until it is quite hot. Sprinkle the scallops with salt and pepper. If they are to be cooked on the grill, rub them all over with 1 tablespoon of oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the lettuce, corn salad, watercress and radicchio, pull off and discard any tough stems and blemished leaves. Rinse and drain thoroughly. Put the greens in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 3 tablespoons of oil in a mixing bowl, and add the 2 tablespoons vinegar and salt and pepper to taste. Beat thoroughly with a wire whisk. Pour the sauce over the greens and toss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the scallops are to be grilled, put them on the grill, and cook briefly about 1 minute or slightly longer. Cooking times will depend on the size of the scallops. Turn the scallops and cook on the second side 1 minute or longer. If the scallops are to be cooked in a skillet, heat 1 tablespoon of oil, and when it is quite hot, add the scallops. Shaking the skillet and stirring, cook for 2 minutes or longer. Do not overcook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the salad greens in an oval or circular serving dish. Arrange the scallops neatly around the greens. Reserve any leftover oil in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a small saucepan until it is hazelnut brown. Do not allow it to blacken. Line a saucepan with a small strainer, and strain in the butter. Stir in the remaining 1/2 teaspoon vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add any leftover oil from the skillet and blend. Spoon this sauce over the scallops. If desired, sprinkle with truffle shavings and serve."}], "link": "https://cooking.nytimes.com/recipes/2185-scallops-with-salad-greens"}