{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Roast Duck", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "duck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 34}, "recipeIngredient": ["2 4 1/2- to 5-pound Long Island ducklings, preferably fresh", "2 lemons", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove all excess pieces of fat from around the duck cavities and cut away the extra skin from around these openings. Reserve the skin to make cracklings (by frying until crisp) or discard it. Rinse the ducks and dry them thoroughly. Squeeze the juice of a lemon inside each, then season the insides with salt and pepper. Place the cut pieces of squeezed lemon inside each duck."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp roasting fork, lightly prick the skin of the duck all over, pricking just into the fat of the duck and not penetrating the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ducks breast side down on racks in a roasting pan. It is very important that the ducks be on racks. Even cake racks set into the roasting pan will do."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the ducks for one-and-a-half hours, turn them breast side up and roast one-and-one-half hours longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the ducks are going to be served simply roasted, then at the end of the three hours' roasting time increase the oven temperature to 425 degrees and roast the ducks 30 minutes longer. Remove ducks from the oven, allow to rest for 10 minutes, then cut into serving pieces and serve."}]}