{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Polenta", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 generous servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "cornmeal, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 290, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "0 grams", "sodiumContent": "598 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["4 1/2 cups water", "1 teaspoon salt", "2 cups polenta, medium-grain cornmeal or grits"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water to a rolling boil in a saucepan. Add salt and let water return to a boil. Lower heat to simmer and, in a slow but steady shower, add polenta, stirring continuously with a wire whisk to avoid lumps. Once all the polenta has been added, continue stirring, using a long-handled wooden spoon, while polenta cooks. The meal will gradually thicken and start to pop with surface bubbles (be careful of splatters). Cooking can take 20 to 40 minutes, depending on such variables as the age of the meal and the firmness desired. Polenta that cooks for 20 minutes should be soft and fluffy, but with no discernible ''bite'' and no hint of a raw flavor. Polenta that cooks for 40 minutes will be firm enough to pull away from the sides of the pan as it is stirred."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When polenta is done to desired firmness, serve it immediately or slice it and either toast the slices or fry them in olive oil, butter or rendered lard before serving. If serving immediately, turn polenta into a warm, high-sided platter or dish; top with the desired sauce and serve. For slicing, spread polenta to desired thickness on a bread board or in a square glass oven dish. When firm (a matter of a few minutes), cut slices about 1/2 inch thick."}], "link": "https://cooking.nytimes.com/recipes/2227-basic-polenta"}