{"@context": "http://schema.org", "@type": "Recipe", "name": "Sauteed Duck Breasts With Game Chips", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "2 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "duck breast, potato, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 761, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "88 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "12 grams", "proteinContent": "45 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1687 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 boned whole duck breasts", "1 tablespoon dark soy sauce", "2 tablespoons sesame oil", "1 clove garlic, minced", "1 tablespoon fermented black beans, minced", "1/2 cup white wine", "1/2 teaspoon cornstarch mixed to a paste with 1 teaspoon water", "Coarse salt and freshly ground pepper to taste", "3 tablespoons chives", "2 to 3 large potatoes", "The fat from the rendered duck skin", "Coarse salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the skin from the duck breasts and cut the breasts in half. Place them on a plate and sprinkle with the soy sauce, sesame oil, garlic and fermented black beans. Turn the pieces so that the breasts are coated on both sides. Leave to marinate for at least one hour at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the skin into strips and place them in a large heavy skillet (preferably cast iron) over medium to low heat. When the skin itself has reduced to a crisp crackling, remove it with a slotted spoon and drain it on paper towels. Leave the fat in the skillet, but turn off the heat until you are ready to cook potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes and slice them thinly, using your food processor. Place the slices in a large bowl and cover with cold water. Rinse thoroughly, put the potatoes back in the bowl and cover again with cold water. Leave them to soak in the water until you are ready to cook them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the duck fat in the skillet. Meanwhile, dry the potato slices. This can be done with a spin salad drier or with a dishcloth. Fry the potatoes a few slices at a time and drain them on paper towels. Season. Keep them warm in the oven, along with the pieces of crackling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a separate skillet and when it is hot, add the duck breasts with their marinade and brown lightly on both sides. Add the wine and the cornstarch mixture and bring to boil. Season to taste. Turn the breasts in the mixture and remove from heat. The breasts should be rare inside. Place them on heated individual plates and sprinkle with the chives. Serve the potatoes and crackling in a separate dish so that they remain crisp."}], "link": "https://cooking.nytimes.com/recipes/2285-sauteed-duck-breasts-with-game-chips"}