{"@context": "http://schema.org", "@type": "Recipe", "name": "Richard Witty's Angel Food Cake", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, eggs, sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 292, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "9 grams", "saturatedFatContent": "0 grams", "sodiumContent": "296 milligrams", "sugarContent": "45 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups egg whites (from about 12 large eggs)", "1 cup cake flour, sifted before measuring, then spooned lightly into the cup and leveled off", "1 1/3 cups sugar, superfine if possible, sifted before measuring", "1/2 teaspoon salt", "1 teaspoon cream of tartar", "1 tablespoon fresh lemon juice", "1 teaspoon cold water", "2 teaspoons vanilla extract", "1/4 teaspoon almond extract (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Be certain that your mixing bowl, whisk or beater, and 10-inch tube pan 4 inches deep (preferably with separate rim and bottom sections) are completely clean. Scrub them with detergent, then rinse and dry. Set aside. (There must be no trace of grease on the beating equipment, which would prevent the egg whites from expanding to their maximum. And grease on the pan would inhibit the rising of the cake.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Set out egg whites in beating or mixing bowl and let them come to room temperature, preferably at least 70 degrees. Measure all other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour and sugar separately onto sheets of waxed paper. Add salt and about 1/3 cup sugar to flour. Sift the salt, flour and sugar mixture 3 or 4 times; you might prefer to set out 2 large sheets of waxed paper, sifting the ingredients back and forth between them. Hold the sifter or strainer high as you sift, to aerate dry ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin to beat egg whites, slowly at first, using a rotary beater or electric mixer. (Be careful not to overbeat; whites should form peaks when beater is lifted and should end up moist and glossy, not dry.) When whites begin to get foamy, add cream of tartar, lemon juice, water and flavoring extracts. Begin to beat at high speed and continue beating, without stopping, just until whites form stiff peaks, but are still moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons sugar and beat in at moderately low speed until incorporated. Repeat additions, beating each in completely, until the rest of the sugar has been incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stop beating and sift about a quarter of the flour mixture over egg whites and fold it in with light strokes of a spatula. Repeat with second, third and fourth additions. Do not overfold. Lightly pour the mixture into the prepared pan. Run a thin metal spatula twice through the batter, once near the tube and once near the rim, to eliminate air pockets, and smooth the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 45 minutes, or until cake has shrunk very slightly from sides of pan and springs back when top is pressed lightly. If you use a cake tester, it should emerge clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cake from oven and invert it, still in pan. (Some pans have supporting legs; if yours doesn't, support the central tube of the pan on a narrow-neck bottle.) Let cake ''hang'' 1 1/2 hours, or until thoroughly cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a sharp knife around sides of pan and unmold cake. To serve, the traditional method is to ''tear'' the cake into wedges with two forks held back to back, or to divide it with a comblike cake divider. A finely serrated knife, used in a light sawing motion, will cut the cake neatly, despite the time-honored advice about never using a knife."}]}