{"@context": "http://schema.org", "@type": "Recipe", "name": "Piperade (Saute of peppers, onions and tomatoes)", "description": "REGIONAL inspirations and influences have always had their place on French menus, but with an increased interest in vegetables, country dishes such as piperade - a vegetable dish from the Basque region of France - are showing up in various guises. While the classic piperade often appears with scrambled eggs and country ham, Alain Dutournier of Au Trou Gascon of Paris recently served a more elegant molded version as a vegetable side dish to rabbit. The rabbit was sauteed and covered with thin slices of spicy- hot green peppers. Other regional vegetable inspirations recently appearing on Paris menus include cold Proven,cale ratatouille (a blend of tomatoes, eggplant, onions and zucchini) topped with a poached egg (served at Taillevent), and a Ni,coise tapenade (a blend of olives, capers, anchovies and olive oil) spread over roasted porgy fillets (at La Cantine des Gourmets).", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "bell pepper, onion, dairy-free, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 71, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "618 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 red or green bell peppers", "3 medium onions, minced", "4 tomatoes, coarsely chopped", "1 clove garlic, minced", "1 bay leaf", "1 1/2 teaspoons fresh thyme or 1/2 teaspoon dried", "Sprig of fresh parsley, minced", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler with broiler rack about 2 inches from heat. Broil peppers for 10 minutes, turning as skins blister and blacken. Remove peppers. When cool enough to handle, carefully peel and seed, discarding skins and seeds. Cut peppers into thin strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large skillet, using no butter or oil, combine peppers, onions, tomatoes, garlic and herbs and cook, covered, over very low heat for 1 to 1 1/2 hours, stirring occasionally. Mixture should be quite thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Piperade can be made ahead and put into 4 half-cup ramekins or molds. To reheat, place in boiling water bath and cook on top of stove until warmed through, about 10 minutes."}], "link": "https://cooking.nytimes.com/recipes/2289-piperade-saute-of-peppers-onions-and-tomatoes"}