{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Pasta and Seafood Salad", "description": "ALTHOUGH pasta has existed for years in French cuisine - 16th- century French cookbooks offer recipes for ravioli - its importance in the French diet evolved only recently. Today fresh pasta can be found at many cheese shops and charcuteries, while pasta appears on menus all over the country, in many cases replacing the potato as a side dish. In the kitchens at Tour d'Argent pasta is prepared fresh daily, while such restaurants as Rostang and Jamin include ravioli or pasta on the menu throughout the year. At Jules Verne, in the Eiffel Tower, the menu features a warm salad combining fresh fettuccine and sole in a light, creamy dressing, while at La Cantine des Gourmets goat cheese-filled ravioli floats in a rich duck stock, surrounded by slices of rosy duck and chunks of fresh artichoke hearts. This recipe comes from Colette Dejean of Chez Toutone, a small Left Bank restaurant.", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings as first course, 2 servings as main course", "recipeCuisine": "french", "recipeCategory": "dinner, pastas", "keywords": "dairy-free, main course, pasta, seafood", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 650, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "54 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1535 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup dry white wine", "1 1/2 pounds (1 quart) mussels, thoroughly scrubbed in several changes of water and bearded", "1 1/2 pounds (1 quart) clams, thoroughly scrubbed in several changes of water", "10 ounces fresh fettuccine", "1/4 cup olive oil", "3 tablespoons best-quality red wine vinegar", "1 clove garlic, minced", "Salt and freshly ground black pepper to taste", "1/2 cup or 1 bunch fresh basil leaves, washed and dried", "1/2 cup or 1 bunch fresh parsley leaves, washed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In 6-quart Dutch oven add white wine, mussels and clams and bring wine to boil over high heat. Cover and cook for 5 minutes, or just until mussels and clams open. Do not overcook. Remove from heat, strain and discard liquid and any mussels or clams that do not open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool slightly and when not too hot to touch, remove mussels and clams from shells and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring large pot of salted water to rolling boil. Add pasta and cook just until tender but not soft. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large salad bowl combine warm pasta, oil and vinegar, mussels, clams, minced garlic, salt and pepper. Let marinate for 20 minutes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, coarsely chop basil and parsley and add to pasta. Toss gently and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/2291-fresh-pasta-and-seafood-salad"}