{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Chaud-Froid", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six to eight servings (with sherbet and ice cream left over)", "recipeCuisine": "french", "recipeCategory": "ice creams and sorbets", "keywords": "apple, fruity red wine, vanilla ice cream, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 638, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "87 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "7 grams", "proteinContent": "5 grams", "saturatedFatContent": "15 grams", "sodiumContent": "51 milligrams", "sugarContent": "75 grams", "transFatContent": null}, "recipeIngredient": ["6 red apples", "4 cups water", "1 cup less 1 tablespoon sugar", "A few drops of lemon juice, to taste", "1 4-inch-piece vanilla bean", "2 cups whipping cream", "1 cup half-and-half", "2/3 cup sugar", "6 egg yolks", "6 apples", "1 750-millileter bottle fruity red wine (like zinfandel, pinot noir or Beaujolais)", "1 1/2 cups water", "1 cup sugar", "1 1/2-inch cinnamon stick", "Potato starch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sherbet, cut the peel with about 3/8 inch of the flesh from the apples. Place these pieces in a noncorroding saucepan over medium-high heat, discarding the rest of the apple. Add the water and sugar to the pan and bring to a boil. Reduce heat. Cover and simmer slowly for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the mixture into a bowl, pushing all of the apple pulp through the sieve. Discard the skin. You should have about 4 cups of puree. Refrigerate until cold. Stir in lemon juice to taste. Proceed according to the manufacturer's instructions on your ice-cream machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the ice cream, split the vanilla bean in half lengthwise and scrape the fine black seeds into a noncorroding saucepan. Add the vanilla pod, cream, half-and-half and sugar. Warm the mixture over low heat, stirring occasionally, until the sugar dissolves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the egg yolks slightly. Whisking constantly, gradually pour the cream mixture into the egg yolks. Return the mixture to the pan. Cook over very low heat, stirring constantly, until the mixture coats the back of the spoon, about 7 minutes. Do not let it come to a simmer. Strain into a bowl. Refrigerate until cold. Freeze according to the manufacturer's instructions on your machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the apples, peel, quarter and core 3 of the apples. Peel the other 3 apples. Place wine, water, sugar and cinnamon stick in a noncorroding saucepan over medium heat. Bring to a simmer. Meanwhile, using a melon baller, make as many balls as possible from the 3 whole apples. Set aside. Cut the apple quarters into 3/8-inch-thick slices. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the apple balls in the simmering liquid just until they are tender. (This can take from 5 to 25 minutes, depending on the apples.) Remove them to a container with a slotted spoon. Poach the apple slices just until tender. Remove from liquid and add to the apple balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure the poaching liquid. In a small bowl, for each cup of liquid, combine 1 teaspoon potato starch with 2 tablespoons water. Whisk this into the poaching liquid. Bring the liquid to the boil and cook until slightly thickened. Pour over the apples. Chill until serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm the poached apples with the liquid. Put a scoop each of the apple sherbet and the vanilla ice cream onto each plate. Put a mixture of apple balls and slices around the ice cream and sherbet. Pour the warm sauce on top. Serve with a crisp cookie."}]}