{"@context": "http://schema.org", "@type": "Recipe", "name": "Mussel-And-Spinach Gratin", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT40M", "recipeYield": "Four ervings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "butter, mussels, spinach, main course", "aggregateRating": null, "recipeIngredient": ["1/2 cup dry white wine", "2 pounds mussels, thoroughly scrubbed in several changes of water and bearded", "2 pounds fresh spinach, picked over, washed, dried and stemmed", "Freshly grated nutmeg", "3 egg yolks", "2 tablespoons mussel cooking liquid", "8 tablespoons softened unsalted butter", "1/4 teaspoon salt", "1 teaspoon lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep-sided saucepan combine the wine and mussels, and over high heat bring the mixture to a boil. Cover and cook just until the mussels open, about five minutes. Do not overcook. Remove from the heat. Remove the mussels with a strainer, then strain and reserve the mussel cooking liquid. Discard any mussels that do not open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the mussels to cool slightly, and when they are not too hot to touch, remove them from their shells and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a rolling boil. Add the spinach and cook just until soft, for one or two minutes. The spinach should remain a bright, vivid green. Immediately drain the spinach and rinse it thoroughly in cold water to set the color. Drain thoroughly, squeezing out any excess liquid. Season to taste with salt, freshly ground black pepper and freshly grated nutmeg and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the hollandaise: In the top of a double boiler combine the egg yolks and mussel cooking liquid and beat with a whisk over hot but not boiling water until fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a few spoonfuls of butter to the mixture and whisk continually until the butter has melted and the sauce begins to thicken. Be certain that the water in the bottom of the boiler remains hot but does not boil. Continue adding the butter, bit by bit, stirring constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the salt and lemon juice. Taste and adjust seasoning if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add several tablespoons of hollandaise to the spinach and toss. Divide the spinach among four six-inch round baking dishes and flatten it into a smooth bed. Sprinkle the mussels evenly over the spinach, then spoon hollandaise sauce over the mussels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil just until the top is crisp and brown. Serve immediately."}]}