{"@context": "http://schema.org", "@type": "Recipe", "name": "Singapore Noodles", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick", "keywords": "bean curd, chinese egg noodles, peanut oil, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "recipeIngredient": ["1/2 pound dried or fresh thin egg noodles", "1/2 pound firm (Chinese) bean curd", "1 1/4 cups peanut oil for deep frying, plus 3 tablespoons", "2 eggs, beaten", "2 teaspoons sesame oil", "1/2 teaspoon salt", "2 garlic cloves, crushed", "2 tablespoons light soy sauce", "2 teaspoons chili oil", "3 tablespoons tomato paste", "2 teaspoons sugar", "2 tablespoons finely chopped scallions", "1 fresh green chili, seeded and shredded (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are using fresh noodles, blanch them by boiling for three to five minutes in a large saucepan of water. Boil dried noodles four to five minutes. Drain noodles and set aside in a bowl of cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the bean curd into half-inch cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil for deep frying in a deep fat fryer or large wok until it almost smokes. Deep-fry the bean curd in two batches for one to two minutes, until lightly browned. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another wok or skillet, heat two teaspoons of the oil and add the eggs, sesame oil and salt. When cooked the eggs should look like a thin flat pancake. Remove from the pan, roll up the pancake and slice one-inch thick to form long strips. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining oil to a wok or skillet. Add garlic and stir-fry for 30 seconds. Drain the noodles and add them to the pan with the rest of the ingredients. Stir-fry until well mixed. Add the egg strips and fried bean curd and stir-fry another three to four minutes until the bean curd is heated through. Divide into two portions and serve at once."}], "link": "https://cooking.nytimes.com/recipes/2329-singapore-noodles"}