{"@context": "http://schema.org", "@type": "Recipe", "name": "Steak Salad With Vegetables", "description": "This is a hearty meat-and-potato dish. For those who wish, the steak can be omitted. Wild mushrooms will provide a meaty flavor.", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, steak, vegetables, summer", "aggregateRating": null, "recipeIngredient": ["1 medium morel, cleaned and chopped (about 1/4 cup)", "1 cup imported peanut oil", "1/4 cup good quality red-wine vinegar (or less, depending on the acidity)", "1 teaspoon Dijon-type mustard", "Salt and freshly ground white pepper to taste", "2 heads bibb lettuce, trimmed, washed and thoroughly dried", "1 small head red Boston lettuce, trimmed, washed and thoroughly dried", "1 cup hulled green peas (about 3/4 pound)", "1/2 lemon, juiced", "1 cup shelled fava beans (about 1 pound)", "1 bunch scallions, cut 2 inches long, including some of the green, and trimmed", "16 tiny new potatoes, washed", "1 cup chicken stock", "5 to 7 ounces fresh small morels, cleaned just before cooking", "3 ripe tomatoes (about 1 pound), blanched, peeled, seeded and juice removed and reserved", "1 cumin seed, peeled and crushed fine", "1 tablespoon first-pressing olive oil", "Salt and freshly ground pepper to taste", "1 2- to 2 1/2-pound boneless sirloin with fat at room temperature", "Kosher salt and freshly ground black pepper", "1 cup chervil sprigs, stems removed and very loosely packed (i.e. fluffy)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the vinaigrette, clean and chop one morel. In a small pan, combine the oil with the chopped morel and warm over low heat until the oil reaches 125 to 135 degrees, or is warm to the touch. Allow to steep for two hours. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the morel pieces from the oil after they have steeped. Discard the pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, combine the vinegar, mustard and the seasonings and mix thoroughly. Gradually whisk in three-quarters of a cup of the morel oil or a bit more, depending on the acidity of the vinegar. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the salad, tear the lettuce into bite-size pieces, wrap in a towel and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot of lightly salted boiling water, add the peas and a little lemon juice and cook the peas for six to 10 minutes, until tender. Drain under cold running water and drain again. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the same process with the fava beans, adding the remaining lemon juice. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the process with the scallions, simmering them for one to two minutes. Drain thoroughly and reserve on paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the process with the potatoes and cook for about 12 minutes, or until tender. Drain thoroughly and reserve in a covered pot. If the potatoes are larger than the size of a quarter, cut them in halves or quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, heat the stock over medium heat, add the cleaned and trimmed morels and simmer for five to seven minutes, or until tender. Drain and reserve, saving the stock for some other use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the relish, chop the tomatoes very fine or pulse once or twice in a food processor. Add the cumin, oil and seasonings. If too thick, add a little of the reserved juice of the tomato and chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat about one tablespoon of the remaining oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the steak with kosher salt and pepper and raise the heat under the skillet. Sear the steak for about five minutes on each side, until lightly crusted and browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the steak to the oven and bake for eight to 12 minutes, or until it is done to your preference. Let it rest while you cut the greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the lettuce with enough vinaigrette to coat, then divide among four plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the process with the vegetables and morels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the fat from the steak and slice the meat into thin strips. Arrange the slices over the greens and vegetables in lattice fashion and sprinkle with chervil. Add a little of the tomato relish on the side of each plate and serve."}], "link": "https://cooking.nytimes.com/recipes/2338-steak-salad-with-vegetables"}