{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash Risotto", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "arborio rice, butternut squash, parmigiano-reggiano, winter squash, main course, vegetarian, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 385, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "8 grams", "sodiumContent": "368 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces (1 stick) unsalted butter", "2 medium yellow onions", "1 small butternut squash or pumpkin, if available", "6 cups water, approximately", "1 teaspoon salt if desired", "1 pound imported Italian Arborio rice", "Freshly ground black pepper to taste", "1/3 cup freshly grated imported Parmigiano-Reggiano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the stick of butter in half. Melt half in a large, heavy saucepan. Peel and slice the onions thinly, and add to the melted butter. Saute gently for approximately 15 minutes, stirring occasionally, until the onions begin to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel the squash or pumpkin, and roughly chop into small pieces, discarding the fibrous part surrounding the seeds. You should have between 2 and 3 cups of the vegetable. Add the squash to the onions, and stir well. Cover and cook for at least 5 minutes, or until the squash is soft enough to be broken up with spoon. If it starts to scorch, add a little water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the squash is cooking, bring 6 cups of water to a rolling boil. Add salt if desired. Reduce heat to very low until the water barely simmers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice to the squash and onions, and stir to mix well. Add a ladle or two of simmering water to the rice and stir. As soon as the rice has absorbed the water, add more, and continue adding simmering water, ladleful by ladleful, stirring continuously. There should always be liquid visible in the pan. Do not add all the water at once, since this will produce boiled rice rather than risotto. The rice is done when it is al dente, with a bit of a bite in the center. Each grain should be well-coated with brilliant yellow stock, which should be dense and rather syrupy-looking. The risotto should be thick enough to eat with fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When rice is cooked, remove from the heat, and immediately stir in remaining butter, freshly ground black pepper if desired, and the Parmigiano-Reggiano cheese. Serve immediately, and pass more cheese at the table."}], "link": "https://cooking.nytimes.com/recipes/2357-butternut-squash-risotto"}