{"@context": "http://schema.org", "@type": "Recipe", "name": "Noodles", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings (one egg's worth of pasta serves a person)", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "eggs, flour, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 403, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "3 grams", "proteinContent": "15 grams", "saturatedFatContent": "1 gram", "sodiumContent": "318 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups flour, plus more as needed", "4 eggs", "1/2 teaspoon salt (or as desired)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour in heap on large wooden board or countertop. Make large well in center (bottom of a jar, moved in circular pattern, will make a well with nicely formed sides.) Break eggs into well and add salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using pastry scraper, Chinese cleaver or fingers, flick flour from outside of heap into well and mix it into eggs, breaking them up as you work (this is untidy at first, but the object, soon achieved, is a well-mixed paste)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once ball of paste has been formed, begin kneading it, sprinkling flour on both it and board until you achieve a medium-stiff dough that sticks neither to board nor to hands. Toward end of process, clean hands under tap to remove caked dough and dry and flour them before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead dough for 10 to 15 minutes, using as little additional flour as you can (as gluten is developed by kneading, dough will become so internally elastic that it ceases to stick to anything but itself.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let dough rest, covered, for 20 minutes in warm place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut dough into 3 pieces. Using rolling pin on clean, floured board, roll out each piece into largest, thinnest circle you can manage. Sprinkle flour on board and dough, if necessary, to prevent sticking. Do not fuss over perfect circularity (it disappears in cutting) or over extreme thinness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let circles of dough dry 5 minutes or so (just don't let them become brittle) by draping them over (nonjagged) chair backs or broom handles (or, most conveniently of all, over broom handles perched between chair backs)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taking one circle of dough at a time, place on lightly floured board and fold it over onto itself several times until you have a long \"bat\" of dough about 3 inches wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using large, sharp knife, cut bat crosswise into slices the width of noodles you want. When entire bat has been cut, lift and toss noodles about on the board with hands to separate them; then spread them out on table. Repeat process with rest of dough. Let stand for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 6 quarts of salted water to boil, add noodles, stirring frequently, and return to boil. Cook 5 to 10 minutes, depending on degree of doneness desired. Drain, butter and serve."}]}