{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum Raspberry Upside-Down Cake", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Eight to ten servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, plum, raspberries", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 360, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "206 milligrams", "sugarContent": "36 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 tablespoons plus 1 teaspoon lightly salted butter, at room temperature", "3/4 cup brown sugar", "1 pound firm, ripe purple plums, halved, pitted and sliced 3/4 inch thick", "3/4 cup fresh raspberries", "1 cup sugar", "2 eggs, separated", "1 teaspoon vanilla extract", "1/2 cup milk", "1 1/2 cups all-purpose flour", "2 teaspoons baking powder (see note)", "1/4 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Use 1 teaspoon of the butter to coat a 9-inch cake pan that is at least 2 inches deep. Place 4 tablespoons of the butter and the brown sugar in a small saucepan. Cook over low heat until melted, stirring to combine. Spread mixture over the bottom of the cake pan. Arrange the plum slices on top of the brown sugar mixture in concentric circles, skin side down. Arrange the raspberries, top side down, in the crevices between the plums. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, cream the remaining 8 tablespoons butter with the sugar until very light and fluffy. Add egg yolks and beat well. Add the vanilla to the milk. Combine the flour and baking powder. Add the flour mixture alternately with the milk mixture, beginning and ending with flour, until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until foamy. Add the cream of tartar. Beat until the whites hold soft peaks. Fold into the batter until just combined. Spread the batter over the fruit in the pan. Bake until the cake springs back in the center, about 50 minutes to 1 hour. Remove from oven. Let the cake stand in the pan for 5 to 10 minutes. Turn out onto a cake plate. Replace any fruit that sticks to the pan. Serve warm, with cream that is softly whipped with a little sugar and vanilla."}]}