{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Maple-Glazed Baby Carrots With Dried Grapes", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT2H20M", "recipeYield": "6 - 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "carrot, grape, maple syrup, fall, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 126, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "381 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound small green seedless grapes, washed and plucked (3 cups)", "Vegetable spray", "2 pounds baby carrots", "2 tablespoons butter", "1 tablespoon chopped sage", "2 tablespoons maple syrup", "1 tablespoon olive oil", "1 teaspoon fine sea salt", "1/2 teaspoon grated lemon peel", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Put grapes in a bowl and spray lightly with vegetable oil. Toss to coat. Turn grapes into a 12-inch non-stick ovenproof skillet. Dry in oven, tossing grapes every 20 minutes or so, until skin shrivels and grapes are tawny and lightly caramelized, 2 to 2 1/2 hours. Remove from oven and set aside. (Grapes can be made a day ahead and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place carrots on paper towel-lined pan to dry. Increase oven temperature to 500 degrees. Place broiler pan or heavy roasting pan in oven. In small saucepan over low heat, melt butter and cook until golden brown. Add sage leaves, maple syrup and dried grapes. Swirl to combine and turn off heat, but leave on burner to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place carrots, olive oil and salt in a bowl and toss, rubbing oil and salt into carrots. Turn carrots onto hot pan in oven in a single layer. Roast, shaking pan occasionally, until carrots have begun to color and are almost tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour grape mixture over carrots and toss with heat-proof spatula to coat. Roast until glaze begins to set and carrots are tender and spotty-brown, about 5 minutes more. Remove carrots from oven and sprinkle with lemon peel and pepper. Transfer to warm bowl and serve immediately."}]}