{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Ligurian Chicken", "description": "This dish came to The Times in a 2003 article about Jamie Oliver:\n\n\"What I found quite interesting with this dish, being English,\" Mr. Oliver said, \"is that when you eat this, it's quite delicately flavored. It's perfumed with the wine and the rosemary. You get this kind of meaty kind of saltiness from the olives, and what's really interesting is if an English housewife got hold of the recipe, she'd probably stone the olives and have quite a lot of them. But in Italy, literally for eight people they put that much and they leave the pits in.\" In his hand, he cradled about two dozen olives.\n\nMr. Oliver continued: \"When you cook olives whole like this, it's almost like an anchovy. The salt comes out of the olives, and the olive becomes more like a vegetable. And the salt from the olive flavors the chicken really wonderfully.\"\n\nThis is an adaptation of his recipe.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2016/09/27/dining/27COOKING-LIGURIAN-CHICKEN1/27COOKING-LIGURIAN-CHICKEN1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "soups and stews", "keywords": "calamata olives, chicken, rosemary, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 378}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 911, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "62 grams", "fiberContent": "3 grams", "proteinContent": "59 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1463 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 heaping tablespoons flour", "Sea salt and freshly ground black pepper", "1 4-pound chicken, cut into 8 pieces", "1/4 cup extra virgin olive oil", "4 to 5 fresh rosemary sprigs", "6 cloves garlic, peeled and thinly sliced", "1 1/2 cups white wine", "4 anchovy fillets (optional)", "1/2 cup calamata olives (with pits)", "3 ripe plum tomatoes, halved, seeded and coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine flour with salt and pepper to taste. Add chicken pieces and toss until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large flameproof casserole dish over medium-high heat, and heat olive oil. Add chicken pieces, and fry until golden underneath, about 5 minutes (Fry in batches if your pan isn't large enough to accommodate all of the chicken without crowding). Turn chicken, and add rosemary and garlic. Continue to fry until garlic is softened but not colored, about 3 minutes. Add wine. When it comes to a boil, add anchovies, olives and tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partly cover pan, and reduce heat to medium low. Simmer until chicken is cooked and tender, and broth is reduced to a rich sauce, 15 to 20 minutes. To serve, discard rosemary sprigs, and season well with salt and pepper to taste. Place a piece or two of chicken on each plate, and top with a spoonful of sauce."}]}