{"@context": "http://schema.org", "@type": "Recipe", "name": "Puff Pastry", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT3H20M", "recipeYield": "Enough puff pastry for one mille-feuille", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["1 pound all-purpose flour (preferably Hecker's)", "1 cup cold water, approximately", "1 teaspoon salt", "1 pound sweet butter, cold, cut in small pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put all but 1/3 cup flour on a work table and form into a ring. Place water and salt in the center. With the tips of your fingers, gradually incorporate the flour. Do not overwork. Form into a round - the dough should be smooth, moist and not overly sticky. Slash the top of the dough ball in a cross shape. Cover dough in plastic wrap and place in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix remaining flour with butter. Work to smooth mass and form it into an eight-inch square, cover with plastic wrap and refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured working surface, roll out the dough to form a large clover shape. Place butter-flour mixture in the center of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Close flaps of dough and completely enclose the butter. Roll out the dough to a rectangular shape approximately 18 inches by 8 inches. The rectangle should be rolled out vertically away from you. Always roll from the center out, never backtracking with the rolling pin. Leave the edges a little thicker than the center to avoid breaking dough. After rolling, gently flatten the edges with the rolling pin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush off excess flour and fold dough in thirds like a letter (top toward you, bottom over top) to complete first turn. Rotate the the dough clock-wise one quarter turn - at this point it should resemble a book with its binding on the left."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently roll it out again on a floured surface into an 18-by-8-inch rectangle as in step 4. Brush off excess flour and, once again, fold the dough in thirds as with a letter, top down and bottom up. This completes the second turn. Cover the dough and refrigerate for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Execute third and fourth turns exactly as was done with the first two. Refrigerate for another hour. Then make the 5th and 6th turns and refrigerate for another hour, or overnight."}], "link": "https://cooking.nytimes.com/recipes/2483-puff-pastry"}