{"@context": "http://schema.org", "@type": "Recipe", "name": "Helen Oless's Cheddar Cheese Ring", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT2H", "recipeYield": "3 large rings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread flour, cheddar, semolina flour, side dish, vegetarian", "aggregateRating": null, "recipeIngredient": ["1 package dry yeast", "1 cup milk, heated", "2 tablespoons butter, unsalted", "3 teaspoons salt", "2 teaspoons sugar", "4 1/2 cups cheddar cheese, shredded (1 pound of cheddar cheese)", "2 cups semolina flour", "2 tablespoons caraway seeds, braised", "2 teaspoons dry mustard", "5 cups bread flour, (approximately)", "2 cups warm water", "Cornmeal for baking sheets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, dissolve yeast in warm water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, heat milk, butter, salt and sugar to lukewarm. Add 4 cups of cheese gradually and stir until cheese and butter are melted. Pour into a large bowl and when lukewarm, add yeast mixture and 2 cups semolina flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Work the mixture with a wire whisk until smooth then add caraway seeds and dry mustard. Mix. Batter will begin to thicken and take on a grainy look. Add 1/2 cup of cheese. Mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3 cups bread flour, gradually, stirring with a wooden spoon. Dough will be sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out on a floured surface and knead until smooth and elastic, gradually adding remaining 2 cups of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you want to make a braided loaf, shape the dough into 3 balls of equal size and roll out each ball into an 8-inch-by-12-inch rectangle with rolling pin. Starting two inches from the top, slice each rectangle into three equal-size strips. Loosely braid the strips on each rectangle. Pinch the braided ends and form a circle with each piece of dough by connecting it with the other end. This will yield three rings. (If you want a nonbraided ring, simply roll out the three equal-size dough balls into loaves in the shape of French bread, and make a ring.) Make slashes on top of the ring with a sharp knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough rings on baking sheets dusted with cornmeal and let them rise until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake at 350 degrees for one hour, until a hollow sound is heard when the bottom is tapped."}], "link": "https://cooking.nytimes.com/recipes/2487-helen-olesss-cheddar-cheese-ring"}