{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Potpie (Pie in the Sky)", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, dry white wine, flour, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["1/4 cup shortening", "1 1/2 cups all purpose flour", "1/2 teaspoon salt", "1 teaspoon sugar", "1/4 cup butter (1/2 stick)", "1 egg, beaten", "1 teaspoon vinegar", "2 tablespoons cold water", "1 teaspoon heavy cream", "1 3- to 3 1/2-pound roasting chicken, cut into serving pieces", "1 cup all purpose flour", "2 cups dry white wine", "Salt to taste", "5 black peppercorns", "1 teaspoon thyme", "Several sprigs parsley", "1 bay leaf", "3 medium size potatoes, peeled and cut into 3/4-inch cubes", "6 carrots, peeled and cut into 3/4-inch pieces", "8 stalks celery, scraped, cut into 3/4-inch pieces", "1 large zucchini or two small ones, sliced 1/4-inch thickness, then halved", "4 tablespoons flour for roux", "4 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the crust (see note):", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor or with a pastry cutter, cut the shortening and the butter into the flour, salt and sugar until mixture resembles coarse cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, combine one tablespoon of beaten egg (reserve the rest for glazing the crust) with the water and vinegar. Add it all at once and mix until the dough comes away from the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out the dough briefly and knead it for two turns on a lightly floured surface. Form it into a ball, cover with plastic wrap and refrigerate for several hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble the pie, spread a sheet of wax paper on a flat surface and dust it with flour. Dust a rolling pin and roll out the dough until it is about 1/16th of an inch thick, rotating the wax paper, not the dough, as you go along. Dust the dough if necessary. Remaining dough can be used to make decorative patterns on top of the crust. After laying the crust over the pie, coat it with the remaining egg wash mixed with 1 teaspoon heavy cream."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour the chicken pieces and brown them in a hot skillet in rendered chicken fat (usually there is some fat inside the cavity of the chicken), 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken pieces in a heavy pot with the wine and enough water to cover and add salt, peppercorns, thyme, parsley and bay leaf. Cover pot and bring to a boil. Reduce to simmer and cook until just tender, 50 minutes to an hour. Boil the vegetables in salted water, one at a time, until cooked but not too soft. Remove from water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken, cool, and remove all skin and bones. Skim the stock of fat. Add chicken bones to the stock and cook at a low simmer for another hour to enrich it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a veloute by melting 4 tablespoons of butter over a medium flame and adding 4 tablespoons of flour. Mix well and cook, whisking, for about 2 minutes. Let it cool to room temperature, then chill in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim the chicken stock again and bring 1 quart to a boil. Add chunks of the cold roux a bit at a time while stirring with a whisk until you have a thick veloute. Taste for seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange about 3 cups of cut-up chicken and the vegetables in a 2-quart round ovenproof dish. Pour over enough veloute to barely cover. Lay over the pie crust, crimp it and cut steam vents in the top. Glaze with egg wash and cream (see recipe for pie crust)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pie on a baking sheet and bake in a 450-degree oven for 10 minutes, then lower heat to 350. Continue cooking for another 30 minutes, until the crust is golden."}]}]}