{"@context": "http://schema.org", "@type": "Recipe", "name": "The Dough", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT2H", "recipeYield": "", "recipeCuisine": "german", "recipeCategory": "", "keywords": "butter, cake flour, cardamom, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "15 grams", "sodiumContent": "110 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 envelope dry yeast", "1/4 cup tepid water", "4 cups cake flour or all-purpose flour", "1/2 cup sugar", "1 teaspoon salt", "3/4 teaspoon ground cardamom", "2 eggs, beaten", "1 cup milk", "1 1/2 pounds butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 1", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve yeast in water and let stand. Sift flour, sugar, salt and cardamom together onto a pastry board or counter top. Combine eggs, milk and yeast mixture in a bowl and stir to blend completely."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 2", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a large well in the middle of the flour (try a jar lid, placed in the center of the flour pile and moved in a circular pattern on the board) and pour the liquid mixture into the center of the flour."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 3", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a baker's dough scraper or a Chinese cleaver, scrape and flick the outer edges of the flour into the liquid and begin mixing it in with the edge of the scraper. Continue this process until all the flour is roughly moistened and there is no free liquid on the board. Do not overwork the dough. (This step is slightly untidy at first, but if the mixing were to be done in a bowl, the dough would likely be too elastic.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 4", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather the dough together with the scraper, adding more flour as needed but using only as much as will produce a manageable but still very soft dough. Pat the dough into a ball, using as little kneading as possible. Cut a deep cross in the top of the dough and pull the four center points outward to turn the ball into a square. Weigh the dough and let it rest."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 5", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take an amount of butter (about 1 1/2 pounds) equal to half the weight of the dough and flatten it out with your hands. (It helps to have cold hands; if yours are hot, chill them under the cold-water tap from time to time.) Flatten the dough into a square large enough to envelop the butter and place the butter in the center. Bring up all four sides of the dough and press them together on the top, enclosing the butter completely."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 6", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on a floured surface and using, if possible, a long French pastry pin, tap the dough gently, lengthwise and crosswise, until it is somewhat larger and flatter. Then, working from the center to the ends, applying moderate pressure and flouring the surface lightly as necessary, roll the dough out to a length of 2 1/2 to 3 feet."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 7", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold both ends of the long strip of dough to the center, dust off excess flour and fold the entire piece together, book fashion, at the center joint. Tap the dough gently to flatten it, slip it into a plastic bag and refrigerate it for half an hour.\n\nNOTE: You do not want to squish the butter out of the envelope of dough at this early stage: hence the refrigeration to firm things up before the second turn."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 8", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Give the square of dough a quarter turn from its previous position, i.e., so that it lies before you with its major fold at right angles to your midriff. Roll it out once again to 3 feet, or even more if you can manage it. Fold up as in step 7, pat, bag and refrigerate half an hour."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 9", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat step 8 for each turn, refrigerating between turns if necessary. (The danger of extruding the butter becomes less and less as you proceed through the turns.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Step 10", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the dough square and bag it in double plastic bags, leaving plenty of room for expansion, since the yeast will make it rise, even in the refrigerator. Refrigerate overnight, or for at least 6 to 8 hours. The dough will then be ready to roll out and use in any way you choose."}]}], "link": "https://cooking.nytimes.com/recipes/2523-the-dough"}