{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Schnecken", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT3H20M", "recipeYield": "15 schnecken", "recipeCuisine": "german", "recipeCategory": "", "keywords": "almond paste, chocolate, dessert", "aggregateRating": null, "recipeIngredient": ["piece of dough from above recipe", "1/2 pound almond paste", "1 or 2 eggs, beaten", "1/2 teaspoon almond extract (optional)", "1 square (1 ounce) bitter chocolate, grated", "Sugar as desired", "Beaten egg for brushing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "From one end of the finished dough, cut off a single slice that represents a generous one-tenth of the dough. Place this on a floured board, tap it out lengthwise and crosswise with pastry pin and then roll it out into an extremely thin sheet that will fit in the bottom of a large (say, 11-by- 16-inch) baking pan. (This requires patience, but at least you can be firm and aggressive: a bit of cutting, fitting and patching may be necessary, but all you really need to achieve is the covering of the entire bottom of the pan.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place this thin tissue of dough in the bottom of the pan and let it rest. Roll out the remaining dough into a rectangle measuring 18 inches wide, and of whatever length it comes to when you have made it a uniform quarter-inch in thickness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the almond paste with beaten egg until it has a spreadable consistency (adding almond extract as desired, for more flavor)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the almond paste over the entire rectangle of dough (except for 1 inch on one of the 18-inch sides) and roll the dough up into a loose ''jelly roll'' 18 inches long (rolling toward the edge left free of almond paste). Dab a bit of water along this edge with your finger and seal the roll firmly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Restretch the thin tissue of dough in the pan to cover the bottom completely and sprinkle it with the grated chocolate and with sugar as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the roll of dough crosswise into 15 schnecken and arrange them evenly on top of the sheet in 3 rows of 5 each. Let rise in a warm place for 2 to 3 hours, or until doubled in bulk (the dough, being cold, will take a while to get going)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Brush the tops of the risen schnecken with beaten egg, sprinkle on sugar as desired and bake for 45 minutes, or until golden brown (lower heat if they seem to brown too quickly)."}]}