{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Lobsters With Tarragon-Cream Sauce", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "heavy cream, lobster, main course", "aggregateRating": null, "recipeIngredient": ["4 live lobsters, 1 1/2 pounds each", "8 cups water", "2 tablespoons chopped shallots", "1/2 cup heavy cream", "Salt to taste if desired", "Freshly ground pepper to taste", "2 tablespoons lemon juice", "2 tablespoons butter", "1 teaspoon chopped fresh tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard the rubber or wood claw holders from lobsters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water to a vigorous boil in a large kettle and drop the lobsters into it. When the water returns to the boil cook the lobsters for exactly 2 minutes and drain. Arrange the lobsters shell side up in one layer in a baking pan. Place in the oven and bake exactly 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break off the lobsters' claws. Crack the claws in several places. Place the lobster carcasses shell side down on a flat surface and crack each lengthwise to cut them in half. Pull away and discard the tough sac at the beak end of each lobster. Scoop out the soft mass (the tomalley, coral, liver and so on) from the inside of each lobster. Spoon and scrape this into a saucepan. Save any juices and add these to the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shallots to the saucepan and bring to the boil, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the lobster halves shell side down in one layer on a baking pan. Pull and discard the upper half of each claw shell. Add the remaining claws to the baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cream to the mixture in the saucepan. Add salt and pepper and bring to the boil. Add the lemon juice. Cook about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a saucepan with a sieve and pour the mixture into the sieve. Rub with a rubber spatula to extract as much liquid as possible. There should be about 1 cup. Discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sauce on the stove and bring to the simmer. Swirl in the butter and tarragon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the sauce over the cut portions of each lobster and serve."}]}