{"@context": "http://schema.org", "@type": "Recipe", "name": "Venison Sausage", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H", "recipeYield": "11 to 12 sausages", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "dry red wine, pork shoulder, venison, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 254, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "0 grams", "proteinContent": "38 grams", "saturatedFatContent": "4 grams", "sodiumContent": "347 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds boneless venison", "1 pound partly fat boneless shoulder of pork", "Salt to taste, if desired", "Freshly ground pepper to taste", "1/4 teaspoon ground allspice", "1/4 teaspoon ground cloves", "2 juniper berries, finely crushed or ground in a spice mill", "1/2 cup dry red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "It is best to prepare these sausages at least one day in advance and refrigerate them until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As carefully as possible, trim off and discard all membranes, nerves, cartilage and so on from the venison. There should be about 2 pounds of trimmed meat. Cut the venison and pork into 1-inch cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the cubes in a bowl and add the remaining ingredients. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a sausage stuffer, put half the mixture into the container of a food processor and blend to a hamburger-like texture. Repeat with the remaining meat and combine the two batches. Blend well with the fingers. Follow the manufacturer's instructions for filling the sausage casings. If using a meat grinder and stuffer, follow the manufacturer's instructions for stuffing the casings. When the filling has been added, pinch off the casing and tie a knot at each end. Tie a piece of string at 5- or 6-inch intervals. There should be 11 or 12 sausages. Wrap the sausages in clear plastic wrap and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, cut off as many lengths of sausage as desired. Prick each sausage all over, forming pin-sized holes. Grill or broil the sausages, turning as necessary, about 15 minutes or until done. Or preheat the oven to 375 degrees. Place the sausages in a skillet and add 1/8 inch water. Bring the water to a boil and place the skillet in the oven. Bake 15 to 20 minutes, turning occasionally, until the sausages are done."}]}