{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna And Salmon Patchwork With A Gazpacho Mousse", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, dried chili peppers, salmon, tuna", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 393, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "34 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1280 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup virgin olive oil", "4 very small, hot, dried red chili peppers", "8 ounces well-trimmed, fresh, skinless, boneless raw salmon", "6 ounces well-trimmed, fresh, skinless, boneless raw tuna", "2 teaspoons freshly squeezed lime juice", "4 teaspoons sour cream", "1 teaspoon caviar, preferably beluga or sevruga, although red salmon caviar may be used", "4 individual molds of gazpacho mousse (<a href=\"http://cooking.nytimes.com/recipes/2614-gazpacho-mousse\">see recipe</a>)", "1/4 teaspoon Dijon-style mustard", "1 tablespoon white-wine vinegar, preferably champagne vinegar", "Salt to taste, if desired", "Freshly ground black pepper to taste", "1 tablespoon peeled, seeded, finely chopped cucumber", "1 tablespoon seeded, deveined, finely chopped sweet red pepper", "1 tablespoon finely chopped scallion", "8 unblemished salad leaves, preferably arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the oil and chilies and let stand at least 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to prepare this dish, place four round cookie-cutter molds, each about one-and-one-half inches in diameter and one-and-one-half inches in height, on a flat surface with the sharp edges up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut enough of the salmon into small cubes to make four tablespoons. Cut enough of the tuna into small cubes to make four tablespoons. Place the cubes in a small bowl and add the lime juice, sour cream and salt and pepper to taste. Blend well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the remaining salmon on the bias into very thin slices. Arrange one slice at a time over the upper edges of one mold covering the inside bottom of the mold and slightly overlapping at the top. Let the slices hang over the edges. Use only enough slices to line the mold. Line the other three."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon one-quarter teaspoon of the caviar inside each of the salmon-lined molds. Spoon equal portions of the cubed fish mixture on top of the caviar. Fold over the overhanging bits of the salmon slices to enclose the filling and cover the top of each mold neatly. Unmold each serving on large, white dinner plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the remaining salmon and tuna into very thin slices. Arrange equal portions of the tuna and salmon slices, edges slightly overlapping, in a neat pattern in the center of the plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold one portion of gazpacho mousse onto each plate, opposite the filled salmon molds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mustard and vinegar in a small mixing bowl and start beating with a wire whisk. Remove the hot chilies from the oil and beat the oil into the sauce. Add salt, pepper, cucumber, sweet red pepper and scallion. Blend well. Spoon equal portions of the sauce over the salmon and tuna slices. Garnish each serving with salad leaves."}], "link": "https://cooking.nytimes.com/recipes/2613-tuna-and-salmon-patchwork-with-a-gazpacho-mousse"}