{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacalhau A Bras (Salt Cod Scrambled With Eggs And Potatoes)", "description": "", "author": {"@type": "Person", "name": "Jean Anderson"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "portuguese", "recipeCategory": "dinner", "keywords": "black olives, eggs, salted cod, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["6 ounces boneless dried salt cod", "2 large Idaho potatoes, peeled", "1 quart corn oil (for deep frying)", "2 medium yellow onions, peeled and sliced very thin", "2 teaspoons minced garlic", "3 tablespoons robust olive oil", "6 extra-large eggs", "1/4 teaspoon freshly ground black pepper", "1 tablespoon coarsely chopped parsley", "12 oil-cured black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the cod overnight in several changes of cool water. Next day rinse the cod well, discard the skin, then with the fingers tear the cod into fine shreds and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the potatoes, one at a time, in the feed tube of a food processor fitted with the fine shredding disc and cut them into long thin shreds. Empty into a large sieve and rinse well under cool water. Pat potatoes very dry on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the corn oil in deep 10-inch skillet or saute pan to 380 degrees, then fry the potatoes in small batches, separating the shreds, 8 to 10 seconds until the color of straw. With a skimmer lift the potatoes to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy 12-inch skillet (not iron) set over low heat, saute the onions and garlic in the olive oil 2 minutes until they begin to color; turn the heat to its lowest point, cover and steam 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the cod into the onion mixture, cover and steam 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly whisk the eggs with the black pepper until frothy. Toss half the reserved potatoes with the cod mixture, pour in the eggs and raise the heat to moderate. Scramble 1 1/2 to 2 minutes until softly set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle onto a small heated platter, wreathe with the remaining potatoes, sprinkle with parsley, garnish with black olives and serve."}]}