{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Rice Piirakka", "description": "", "author": {"@type": "Person", "name": "Janet Bukovinsky"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "Sixteen piirakka", "recipeCuisine": "scandinavian", "recipeCategory": "", "keywords": "brown rice, flour, milk, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "7 grams", "sodiumContent": "280 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup short-grain brown rice, uncooked", "1 cup water", "3 cups milk", "3/4 cup unsalted butter", "Salt and pepper to taste", "1/2 cup half-and-half", "1 tablespoon unsalted butter, melted", "3/4 cup water", "Salt to taste", "1 cup unbleached white flour", "1 1/2 cups rye flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, in a medium saucepan, combine the rice with the cup of water and bring to a boil. Add the milk and three tablespoons of the butter and reduce the heat to low. Cover and cook until the liquid is absorbed and the rice is creamy, adding more milk if necessary. This will take about one-and-a-half hours. Stir occasionally to prevent burning. Season with the salt and pepper and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, combine the melted butter, water, salt and white flour in a large bowl and beat until smooth. Stir in the rye flour and mix until the dough is stiff and compact. Turn out onto a lightly floured surface and knead until smooth, about five minutes. Cover and refrigerate for up to one hour, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the piirakka, preheat the oven to 425 degrees. Divide the dough into four pieces, and divide each piece into four balls. Roll out each ball on a lightly floured surface to form a five-inch circle. Place three tablespoons of the filling on each circle, spreading it to within one inch of the edge. Fold the uncovered edges of the dough over the filling, crimping them to form an oval-shaped pastry, but leaving the center of each one open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a glaze by melting the remaining butter with the half-and-half, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pastries on a lightly greased baking sheet and brush with the glaze. Bake for five minutes, then brush again with the glaze and bake for 10 minutes longer, or until golden. Brush once more after removing the pastries from the oven. Serve warm or cold with buttered egg salad."}], "link": "https://cooking.nytimes.com/recipes/2659-brown-rice-piirakka"}