{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach with Crab Meat And Crab Roe", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings as part of a multi-dish Chinese meal", "recipeCuisine": "chinese", "recipeCategory": "quick", "keywords": "crab meat, crab roe, spinach, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 295, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "309 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["5 ounces water", "3 ounces plus 1 tablespoon corn or peanut oil", "Pinch of salt", "10 ounces fresh spinach, washed and trimmed (discard the bottom 2 inches of the stems)", "2 teaspoons of fresh ginger juice, made by crushing slices of fresh ginger in a garlic press or in a mortar and pestle", "2 tablespoons of dry sherry", "3 ounces fresh lump crab meat", "4 ounces chicken broth", "1 tablespoon cornstarch", "1 ounce fresh crab roe (1 ounce of flying fish roe can be substituted, or 1/2 ounce uni, which is sea urchin roe, available at Japanese food stores)", "1 egg white"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok, bring 3 ounces of water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3 ounces of oil and the salt and bring the liquid to the boil again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the spinach and cook for 2 to 5 minutes, until the spinach is done. (The oil will make the spinach glisten.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the spinach, pressing with a spatula or spoon so it is as dry as possible. Arrange spinach on a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce by pouring the remaining tablespoon of oil along with the ginger juice and sherry in a wok over medium-high heat. When the liquid is hot, but not boiling, add the crab meat and chicken broth, stirring quickly and gently breaking up the crab meat so that it is in strands. Cook for 30 seconds to one minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the cornstarch with the remaining 2 ounces of water and add this and the crab roe to the crab-meat mixture, stirring until the sauce thickens. Turn off the flame. Add the egg white and stir for 3 seconds. Do not let the egg white solidify. The sauce should glisten. Pour the sauce over the spinach and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/2672-spinach-with-crab-meat-and-crab-roe"}