{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin-Apple Chiffon Pie", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT6H45M", "recipeYield": "Eight servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "apple, pumpkin, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 454, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "13 grams", "sodiumContent": "225 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/3 cups finely chopped chocolate wafers (about 25 cookies)", "5 tablespoons sweet butter, melted", "2 tablespoons sweet butter", "2 cups cooking apples, peeled and cut into 1/2-inch dice (about 2 small apples)", "1/2 cup granulated sugar", "1/3 cup light brown sugar, firmly packed", "1/2 teaspoon cinnamon", "1/4 teaspoon powdered ginger", "1/4 teaspoon ground nutmeg", "1/4 teaspoon grated lemon rind", "1 1/4 cups cooked pureed pumpkin (fresh or canned)", "1 package plain gelatin", "1/4 teaspoon salt", "3 egg yolks", "1/2 cup half-and-half", "3 egg whites", "3 tablespoons granulated sugar", "1/2 cup coarsely chopped toasted pecans", "1/2 cup chilled heavy sweet cream", "2 teaspoons powdered sugar", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, butter a nine-inch Pyrex pie plate. Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the wafers into pieces. Place in processor and make fine crumbs, about one and one-third cups. Add the butter and pulse five to six times or until the crumbs are coated with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the contents into the pie plate, reserving one tablespoon for garnish. Press the crumbs thickly onto the sides of the pan with a spoon, forming a half-inch border. Use a glass to press the remaining crumbs into the bottom of the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 8 to 10 minutes. The crust should set, but not brown. Cool and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, melt the butter in a heavy three-quart saucepan. Stir in the apples, sugars, spices and rind. Bring to a slow boil. Cover and simmer for five minutes. Remove the lid, raise heat slightly and continue to cook the apples for six to eight minutes or until the caramel syrup forms a six- to eight-inch thread when dropped from the tip of a spoon. Stir occasionally. Watch carefully: If the syrup becomes too hot, it will taste bitter and quickly burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately remove the pot from the heat. Stir in the pumpkin, gelatin and salt. Blend well and return to flame. Cook on low heat until the mixture is very hot, stirring constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the yolks into the half-and-half. Gradually whisk into the filling. Heat slowly to just under boiling, about one-and-a-half to two minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the filling into a processor. Puree for 45 seconds. Pour into a large bowl and place over ice for five minutes to cool to room temperature. Stir occasionally. The filling can also be cooled in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until soft peaks form. Add sugar, one tablespoon at a time, to form a meringue. Beat 30 seconds longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir a quarter of the egg whites into filling. Fold in the remaining whites and the toasted pecans at the same time, reserving one tablespoon of nuts for garnish. Mound the filling into the pie shell. Smooth surface with a spoon. Chill until set, about six hours or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the garnish, whip the cream in a chilled bowl. As it starts to thicken, add the sugar and vanilla. Beat until fairly thick. Pipe or spoon around the edge of the pie. Sprinkle the top with the reserved crumbs and nuts."}]}