{"@context": "http://schema.org", "@type": "Recipe", "name": "Oysters Wrapped In Caviar Butter, Breaded And Deep-Fried", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "Twelve oysters", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, caviar, oyster", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 186, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "0 grams", "proteinContent": "9 grams", "saturatedFatContent": "6 grams", "sodiumContent": "267 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["12 giant Belon or other briny oysters", "1/4 pound pressed caviar", "1/4 pound unsalted butter", "1 egg, lightly beaten", "1 cup fresh bread crumbs", "Peanut oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the oysters and cut off and discard the gills. Place a sheet of plastic wrap over tiny muffin tins and place one oyster in each hole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree all but about two tablespoons of the caviar with the butter. With a pastry tube, spread one teaspoon of caviar butter on top of each oyster. Press down and rotate so that the butter side is down in the plastic wrap. Cover each with one-half teaspoon of caviar and then two more teaspoons of the caviar butter, applying it in circles to cover the caviar and the oyster. Pat the butter down to cover, then cover with another sheet of plastic. Leave the tins in the freezer for about a half hour until the butter is cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip each oyster in egg, then roll it in the bread crumbs, making sure the crumbs completely cover the oyster. Dip it in the egg once more and roll again in the bread crumbs. Refrigerate the oysters for another half hour, then dip them in egg and bread crumbs one last time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In oil that is almost smoking, fry the oysters for 30 to 60 seconds or until they are brown. Remove them and drain, then place them in a 550-degree oven for about five minutes to melt the butter and warm the oysters. Serve immediately on a plate with a fork."}]}