{"@context": "http://schema.org", "@type": "Recipe", "name": "Pot Likker Soup", "description": "", "author": {"@type": "Person", "name": "Sarah Belk"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "About five cups, serving four as a first course", "recipeCuisine": "southern", "recipeCategory": "soups and stews", "keywords": "appetizer, bacon, turnip greens, vegetables, high fiber, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 372, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "8 grams", "proteinContent": "11 grams", "saturatedFatContent": "11 grams", "sodiumContent": "518 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound unblemished turnip greens, trimmed of tough stems and any discolored leaves, washed and roughly chopped (about 3/4 pound trimmed weight or 9 cups loosely packed)", "2 cups chicken broth, preferably homemade", "1/4 pound bacon, preferably double-smoked", "2 medium carrots, peeled and cut into chunks", "2 medium yellow onions, peeled and halved", "1 herb bouquet, tied in cheesecloth, consisting of 3 large cloves garlic, halved; 2 whole dried hot peppers (or 1/2 teaspoon dried red-pepper flakes); 8 whole black peppercorns; 10 sprigs fresh parsley; 2 sprigs fresh thyme (or 1/2 teaspoon dried); 1 smal", "1/2 cup cream", "12 baby turnips (about 3/4 inch in diameter), trimmed and washed but not peeled; if baby turnips are unavailable, substitute diced, peeled turnips", "1/4 cup cooked, crumbled bacon for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all ingredients except the turnips and cooked bacon in large saucepan with just enough water to cover vegetables and bring to a boil. Lower heat and simmer partially covered for one hour, adding water as necessary to cover vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a colander over a large saucepan and strain the soup. Discard the onion, carrot and bacon pieces and the herb bouquet. Set the greens aside. Return the liquid to a boil and add the turnips. Lower the heat and simmer until the turnips are crisp-tender, approximately 10 minutes. There should be three cups liquid; add water or reduce as necessary. Set the turnips aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, puree the reserved greens with half the cooking liquid. Return the puree to the remaining cooking liquid in the saucepan. Add cream and turnips and heat through. Ladle into bowls and sprinkle with bacon, if desired."}]}