{"@context": "http://schema.org", "@type": "Recipe", "name": "Ham-And-Peanut-Stuffed Chicken Breasts With Cider Sauce", "description": "", "author": {"@type": "Person", "name": "Sarah Belk"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "apple cider, chicken, ham, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 886, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "6 grams", "proteinContent": "46 grams", "saturatedFatContent": "26 grams", "sodiumContent": "499 milligrams", "sugarContent": "31 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup roasted, unsalted peanuts", "1 tablespoon unsalted butter, at room temperature", "1/4 cup heavy cream", "1/4 cup unseasoned bread crumbs", "1/4 teaspoon salt", "1/8 teaspoon freshly ground black pepper", "1/8 teaspoon ground nutmeg", "1/8 teaspoon cayenne", "8 boneless chicken breast halves, skinned", "1/8 pound very thinly sliced Smithfield ham", "2 medium yellow onions, peeled and coarsely chopped", "1 large carrot, peeled and coarsely chopped", "1 large tart, firm apple, peeled, cored and coarsely chopped", "5 tablespoons unsalted butter", "1 1/2 cups fresh, unpasteurized apple cider", "3 tablespoons cider vinegar", "3 tablespoons unsalted butter", "1 medium-size tart unpeeled apple, cored and sliced 1/4-inch thick", "2 to 3 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the stuffing, process the nuts in a food processor or blender until they are finely ground. Add the butter and process until smooth. Add the cream, bread crumbs, salt, pepper, nutmeg and cayenne and process until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the chicken breasts, place each breast half between sheets of wax paper and flatten with a mallet, the flat side of a cleaver or a rolling pin to a thickness of about half an inch. Place the breasts smooth side down on a work surface and discard the wax paper. Lay one slice of ham on each breast half. Spread approximately three teaspoons of stuffing on top of the ham. Beginning with the narrowest end of the breast, roll up into a neat, plump shape, tucking the edges in. Secure with toothpicks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strew the onions, carrot and apple in a baking dish large enough so that the rolled breasts fit snugly. Place the breasts on top of the vegetables. In a saucepan, melt four tablespoons of the butter and brush some of it on the breasts. Bake uncovered in the center of a preheated 375-degree oven for 10 minutes. Baste with butter and bake 10 minutes more. Turn the breasts over, baste and bake another 10 minutes. While the chicken cooks, boil the cider and vinegar in a saucepan over high heat until reduced to six tablespoons. Set aside. Transfer the chicken breasts to a warm platter and cover with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the onions, carrot, apple and any juices from the baking pan to a food processor. Add the cider reduction and puree until it is smooth. Press through a sieve set over a medium saucepan, reheat over low heat and whisk in the remaining tablespoon of butter. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the garnish, heat the butter in a large, heavy skillet. Dredge one side of each apple slice in sugar and place sugared side down in the hot butter. Cook over medium-high heat for four to five minutes or until deep golden brown. Sprinkle the remaining sugar on the apples, turn over and brown the other side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add any juices that have collected from the chicken to the sauce; reheat sauce if necessary. To serve, cut each chicken breast into one-quarter- to one-third-inch slices; discard toothpicks. Divide the sauce evenly among four plates, place slices on top of sauce in an overlapping pattern and garnish with two or three apple slices. Pass remaining sauce separately."}]}