{"@context": "http://schema.org", "@type": "Recipe", "name": "Auvergnese Seven-Hour Leg Of Lamb", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "Eight servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "dry white wine, lamb, potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 29}, "recipeIngredient": ["1 leg of lamb, bone in, 6 to 7 pounds, carefully trimmed of excess fat", "1 large, whole head garlic, cloves peeled and halved", "Sea salt and freshly ground black pepper to taste", "6 onions, peeled and quartered", "6 carrots, peeled and quartered", "6 bay leaves", "1 bunch fresh thyme or several teaspoons dried", "2 bottles dry white wine, such as a French Riesling", "5 pounds large boiling potatoes", "5 tomatoes, cored, peeled, seeded and chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pierce the skin of the lamb and insert the cloves of garlic, distributing evenly throughout. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer the onions, carrots, bay leaves and thyme on the bottom of a large Dutch oven or covered roaster large enough to hold the lamb. Place the lamb on top and roast in the oven, uncovered, for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven and slowly add the wine. Cover, place over high heat on top of the stove and bring the liquid to a boil. Return the pan, covered, to the oven, reduce the heat to 350 degrees and roast the lamb, turning from time to time, until it is very tender and actually falling off the bone. This should generally take two to three hours more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One hour before serving, bury the potatoes and tomatoes in the liquid, cover and roast until cooked through. The lamb should be very moist. As the French say, you should be able to eat it with a spoon. Much of the liquid will have cooked away, but what remains will be sweet and flavorful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the lamb from the pan, cut the meat into thin slices and serve, surrounded with vegetables and the remaining cooking liquid."}]}