{"@context": "http://schema.org", "@type": "Recipe", "name": "Broth With Trout and Fresh Vegetables", "description": "", "author": {"@type": "Person", "name": "Paula Wolfert"}, "image": null, "totalTime": "PT35M", "recipeYield": "Two to three servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "fish, trout, vegetables, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 14, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "90 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 scallions, roots trimmed, halved lengthwise and all but 3 inches of the green shoots removed, washed and drained", "2 Brussels sprouts, trimmed, halved, cored and washed", "1 medium carrot, scraped and sliced crosswise, at a slight diagonal, about 1/8 inch thick", "4 to 6 asparagus stalks, woody bottom trimmed, spear peeled and cut into 2-inch lengths", "2 bibb lettuces, split", "2 stalks Swiss chard with leaves, root ends trimmed; stalks and leaves separated", "6 cups water, preferably a mineral water such as Evian", "Coarse sea salt", "1/4 cup unsalted butter", "2 garlic cloves, peeled", "1 clove", "1 bay leaf, tied with 2 small stalks celery with leaves and 3 sprigs flat leaf parsley", "2 shallots, peeled and cut into 1/8-inch-thick slices", "2 to 3 fish fillets, skinned (4 to 5 ounces each of either trout, Arctic char, porgy, whiting or small pieces of salmon trout)", "Freshly ground white pepper", "1 1/2 tablespoons French walnut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 250 degrees. In a saucepan, cook the scallions, Brussels sprouts, carrot, asparagus, lettuce and Swiss chard stalks in six cups of salted water until the vegetables are tender, about eight minutes. Scoop out the vegetables, using a slotted spoon; refresh them under cold water, drain and place them in an 8- to 10-cup wide baking-serving dish. Add the Swiss chard leaves to the cooking liquid and boil until they are tender, about one minute. Remove and refresh under cold running water. Drain well and add to the vegetables. Place the dish in the oven to keep it warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour off all but one-and-one-quarter cups of the vegetable water (or reserve for some other purpose). Add the butter, garlic, clove, herb bouquet and shallots. Cover and cook over medium low heat for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle the fish fillets in a single layer among the vegetables in the baking dish. Pour over that the contents of the saucepan and return to the oven to cook the fish, about 10 minutes. (Note that the texture of the fish will be very smooth, due to the low-temperature cooking). Remove the herb bouquet. Adjust seasoning with sea salt and freshly ground white pepper. Drizzle the fish with walnut oil. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/2747-broth-with-trout-and-fresh-vegetables"}