{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Wine-Poached Pears With Hubbardston Blue", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT1H", "recipeYield": "Five servings and a snack for the cook (the test pear)", "recipeCuisine": "", "recipeCategory": "", "keywords": "blue cheese, pear, zinfandel, dessert, nut-free", "aggregateRating": null, "recipeIngredient": ["1/2 bottle zinfandel, 1 2/3 cups", "1/4 bottle dry vermouth, 3/4 cup plus 2 tablespoons", "1/2 cup sugar", "Zest of 1 medium orange, cut in long strips", "Zest of 1 lemon, cut in long strips", "2 cinnamon sticks, 3 inches long", "5 whole cloves", "5 black peppercorns", "2 quarter-sized slices fresh ginger", "11 Seckel pears, just ripe", "1 round, approximately 3 1/2 ounces, Hubbardston blue cheese", "1 tablespoon sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the first nine ingredients to a boil in a large, noncorrodable saucepan. Turn off the heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and core the pears, opening a generous hollow for the stuffing, but leaving the stems on. Drop each into the liquid as it is completed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wring out a detergent-free dish towel (or five layers of cheesecloth) in hot water and lay it on top of the pears. Bring the liquid to a fast simmer and cook for about 30 minutes, or until a sample pear is tender enough to cut with a spoon edge and still firm enough so it will hold up to being stuffed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pears with a slotted spoon, reserve and refrigerate, if desired. Return the pan to the heat and boil until the liquid is reduced by about a third. You should have a thick syrup that will evenly coat the spoon. Strain and chill it, reserving the peels if desired (see note)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At serving time, bring the pears to room temperature. Whip the cheese until it is light and fluffy, adding the tablespoon of sugar if a sweeter dessert is desired. Use a pastry bag to pipe each pear full of the cheese and place two on each plate. Spoon about one tablespoon of syrup over each. There should be just enough to streak and flavor the pears and form a bit of a puddle around them. Some syrup will probably be left over."}], "link": "https://cooking.nytimes.com/recipes/2759-spicy-wine-poached-pears-with-hubbardston-blue"}