{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Pork in Orange Sauce (Carne de Puerco a la Naranja)", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "caribbean", "recipeCategory": "dinner", "keywords": "dairy-free, main course, orange juice, pork, scallion", "aggregateRating": null, "recipeIngredient": ["3 pounds boned pork shoulder, cut in 1-inch cubes", "2 tablespoons vegetable cooking oil", "2 tablespoons caramel coloring (<a href=\"http://cooking.nytimes.com/recipes/2762-caramel-coloring\">see recipe</a>)", "3 cloves garlic, peeled and crushed", "6 green onion or scallion tops, sliced on the diagonal", "Peel of 1 orange, white part discarded, cut in thin juliennes", "Peel of 1/2 lemon, white part discarded, cut in thin juliennes", "Juice of 1/2 lemon", "2 cups of freshly squeezed orange juice", "1 3-inch stick cinnamon", "1/2 teaspoon freshly ground allspice", "1 sprig fresh thyme, or 1/4 teaspoon dried thyme", "2 bay leaves", "Freshly ground black pepper to taste", "1/2 teaspoon salt, or to taste", "1 tablespoon flour, mixed with 3 tablespoons fresh orange juice", "Unpeeled orange slices or wedges for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large pot, add pork cubes and saute over medium-high heat until cubes start to brown, about 10 minutes. The cubes may give off a lot of water; if so, continue cooking and stirring until water evaporates. Add caramel coloring and continue cooking and stirring until pieces are a rich brown. Do not let caramel coloring burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all the remaining ingredients except the flour and orange juice paste. Stir to mix well. Then add flour paste and mix well so there are no lumps in the sauce. Lower heat to barely simmering, cover pan and leave to cook 1 hour or longer, until pork cubes are tender and sauce is thick and unctuous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, removing bay leaves, cinnamon stick and fresh thyme sprig. Garnish with thin slices of unpeeled orange or orange wedges, and serve with rice and beans, and West Indian vegetables, such as yams, yautia and malanga."}]}