{"@context": "http://schema.org", "@type": "Recipe", "name": "Blue Cheese And Pear Pizza", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT2H10M", "recipeYield": "Six to 12 appetizer servings", "recipeCuisine": "", "recipeCategory": "pizza and calzones", "keywords": "appetizer, blue cheese, pear, pizza dough", "aggregateRating": null, "recipeIngredient": ["1 1/2 cups lukewarm water", "2 teaspoons granular yeast", "1 teaspoon dark brown sugar", "3/4 cup rye flour", "2 3/4 cups, approximately, all-purpose flour, plus enough for rolling out dough", "Salt to taste, if desired", "1 tablespoon olive oil", "Oil for greasing a bowl", "4 firm, ripe, unblemished pears, about half a pound each", "1/2 lemon", "Cornmeal for sprinkling on tin", "2 1/4 cups grated Gruyere cheese", "1 1/3 cups crumbled blue cheese", "1/4 cup melted butter, approximately"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the water in a warm bowl and sprinkle the yeast and brown sugar on top. Stir to dissolve and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the rye flour, all-purpose flour, salt and olive oil in a mixing bowl and blend well. Add the yeast mixture and blend. Turn the dough out onto a lightly floured board and knead about 10 minutes. The dough should not be sticky. Add a litle more flour if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the dough into a ball. Lightly oil the inside of a mixing bowl, place the dough in it and cover closely with a sheet of clear plastic wrap. Let the dough stand in a reasonably warm place until it is doubled in bulk, 45 minutes to an hour. Punch the dough down, shape into a ball and return it to a clean, lightly oiled bowl. Let stand again until doubled in bulk, 30 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel the pears and rub them with the lemon to prevent discoloring. Cut the pears in half lengthwise and remove the cores with a melon-ball cutter. Cut the pear halves into the thinnest possible slices. There should be about six cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down and divide it into thirds. Roll out each third into a 10- to 11-inch circle. Sprinkle three pizza tins or baking sheets lightly with cornmeal and place a circle of dough on each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a first layer of pear slices close together in concentric circles on each round, leaving a margin of about one inch from the outer rim of dough. Scatter a third of the grated Gruyere over each. Cover with a slightly smaller portion of pear slices and sprinkle with crumbled blue cheese. Brush the rim of each pizza with melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pizzas on a rack in the oven and bake 10 to 12 minutes."}], "link": "https://cooking.nytimes.com/recipes/2782-blue-cheese-and-pear-pizza"}