{"@context": "http://schema.org", "@type": "Recipe", "name": "Pot-Au-Feu Menagere", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings plus leftovers", "recipeCuisine": "french", "recipeCategory": "soups and stews", "keywords": "appetizer, beef, carrot, leek, winter", "aggregateRating": null, "recipeIngredient": ["6 quarts of water", "1 marrow bone", "3 pounds brisket", "1 pound large carrots peeled and cut into big chunks", "1 pound leeks, whites sliced lengthwise, green ends chopped", "1 whole onion, peeled", "2 whole garlic cloves, peeled", "1 large slice (1 inch thick) of celery root or yellow turnip, peeled", "1 to 2 tablespoons salt", "Freshly ground black pepper to taste", "3 leaves of savoy cabbage", "4 potatoes, peeled and sliced in two lengthwise", "1 1-inch-thick slice of stale bread for each serving", "1 cup grated Gruyere cheese", "Coarse (kosher) salt, horseradish or mustard as condiments"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-quart stock pot, bring water to boil with the marrow bone in. When the water is boiling add the meat. As the gray scum starts to rise, skim it from the surface of the water. Continue skimming periodically until the water is clear. This may take as long as one hour. While skimming, peel and prepare the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After stock has cooked one hour and 15 minutes, add carrots, leeks, onion, garlic, celery root or turnip, salt and pepper. Let simmer partly covered for 20 minutes. Then add cabbage leaves and potatoes and continue simmering for 20 minutes or until potato is just tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a slice of bread in each soup plate. Sprinkle 1/4 cup of Gruyere on each slice. Place hot bouillon with one or two carrot slices and one or two potatoes in a tureen. Ladle hot bouillon over the bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As a second course, serve the meat surrounded with the vegetables. Pass a small bowl of coarse salt; Americans may prefer to serve horseradish or mustard."}]}