{"@context": "http://schema.org", "@type": "Recipe", "name": "Nasi Goreng (Indonesian Fried Rice With Vegetables)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT15M", "recipeYield": "Eight or more servings", "recipeCuisine": "indonesian", "recipeCategory": "", "keywords": "bok choy, rice, vegetables, dairy-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 238, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "573 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 cups cold, cooked rice (preferably cooked a day in advance)", "1/4 pound long Chinese green beans, available in Oriental markets, cut into 3-inch lengths, or use regular green beans, stringed as necessary and cut into 3-inch lengths", "Salt to taste, if desired", "3 tablespoons corn, peanut or vegetable oil", "1 cup celery cut on the diagonal into thin slices", "1 1/2 cups carrot cut into thin, julienne strips, each about 2 inches long", "1 cup broccoli cut or broken into small, bite-size pieces", "2 cups finely shredded bok choy or Chinese cabbage", "1 cup snow peas cut lengthwise into thin, julienne strips", "1/3 cup shredded scallions or green onions cut into 2-inch lengths", "3 tablespoons hot green or red pepper, cored and seeded and cut into very thin, julienne strips", "3 eggs", "3 tablespoons ketjap manis, a sweet Indonesian soy sauce, or use an equal amount of soy sauce blended with 3 tablespoons sugar", "1/4 pound bean sprouts", "1/2 cup finely chopped scallions or green onions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice as indicated and have it ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a kettle, bring enough water to the boil to cover the green beans when they are added. Add salt to taste. Add the beans and cook about two minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a wok or skillet until it is almost smoking. Add the celery and carrot and cook, stirring, about 45 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the broccoli and the drained long beans and cook about 15 seconds, stirring. Add the bok choy and snow peas and cook about 30 seconds, stirring. Add the scallions or green onions and the pepper. Cook 10 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice, stirring rapidly, and cook until thoroughly heated without browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do the following as quickly as possible: Make a well in the center of the rice and add the eggs, stirring rapidly and constantly. When they are barely scrambled, start stirring the rice into the eggs, stirring in a circular fashion, incorporating all of the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with ketjap manis and salt, add the bean sprouts and cook, stirring and tossing, about 30 seconds. Sprinkle with the chopped scallions and serve immediately."}]}