{"@context": "http://schema.org", "@type": "Recipe", "name": "Huevos Rancheros", "description": "", "author": {"@type": "Person", "name": "Robert Clark"}, "image": null, "totalTime": "PT45M", "recipeYield": "Four servings", "recipeCuisine": "southwestern", "recipeCategory": "breakfast", "keywords": "black beans, eggs, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1202, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "93 grams", "fiberContent": "16 grams", "proteinContent": "33 grams", "saturatedFatContent": "52 grams", "sodiumContent": "1486 milligrams", "sugarContent": "12 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["1 1/2 cups dried black beans", "3 large cloves garlic", "1 dried chipotle chili", "Sea salt, to taste", "5 tablespoons lard, goose or duck fat, or corn oil", "6 large, ripe tomatoes (about 2 1/2 pounds)", "2 serrano chilis", "2 poblano chilis", "1 large white onion", "1 bunch cilantro, plus a bit for garnish", "Butter, for frying", "8 large eggs", "Sour cream, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans, two of the garlic cloves and the chipotle chili in a saucepan, cover with water in a saucepan and simmer until the beans are very soft. Drain, season with salt to taste, and discard the chili. (The beans may be prepared in advance and refrigerated, but should be allowed to return to room temperature prior to frying.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt three tablespoons of the lard over medium heat in a heavy bottomed frying pan. Mash the cooked beans with a potato masher or large spoon, to prevent spattering, and add to the pan. Fry until the beans have a firm but fairly smooth consistency; set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes in a heavy pan or on a griddle, either under the broiler or on top of the stove, and roast until the skin blisters and blackens. Do not peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over an open flame or under the broiler, roast the poblano and serrano chilis until their skin blisters and starts to blacken. Peel the poblanos and slice them into long, thin strips. (The smaller serranos need not be peeled.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop the onion and the remaining garlic, melt the remaining lard in a heavy-bottomed frying pan, and add the onions and garlic to it. Cook over medium to low heat until cooked through but not browned. Core the roasted tomatoes. In a food processor or mill, make a rough puree of the tomatoes, with their skins, and the roasted serrano chilis. Add the puree to the cooked onion and garlic. Firmly tie the bunch of fresh cilantro and add it. Cook for 15 minutes over medium heat, or until the sauce thickens a little. Season to taste with salt. Remove and discard the cilantro."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the eggs sunnyside up in a little butter. Spoon generous quantities of salsa ranchero onto plates and place two fried eggs on top of each serving. Criss-cross strips of roasted poblano chili on top of the eggs. Serve the beans on the side and garnish with a spoonful of sour cream and a sprig of cilantro."}]}