{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage Packets Stuffed With Shrimp And Salmon", "description": "", "author": {"@type": "Person", "name": "Bryan Miller And Pierre Franey"}, "image": null, "totalTime": "PT45M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cabbage, salmon, shrimp, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 385, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "34 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1277 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium-sized head of green or Savoy cabbage, cored and trimmed of loose outer leaves", "1/2 pound skinless salmon fillet", "1 pound medium-sized shrimp, shelled, deveined and chilled", "1/8 teaspoon Tabasco sauce", "Salt and freshly ground white pepper to taste", "1 teaspoon freshly grated ginger", "1 egg yolk", "4 egg whites", "1/2 cup fish stock, approximately (<a href=\"http://cooking.nytimes.com/recipes/2816-fish-stock\">see recipe</a>)", "1/3 cup chopped scallions", "1 tablespoon unsalted butter", "1 tablespoon olive oil", "2 tablespoons minced shallots", "3 tablespoons minced onions", "2 sprigs thyme, or a pinch of dried thyme", "3/4 pound plum tomatoes, cubed, about 1 3/4 cups", "1/2 teaspoon minced garlic", "1 bay leaf", "2 whole cloves", "1 cup dry white wine", "1 1/2 cups homemade or good-quality canned chicken stock", "Salt and freshly ground white pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of lightly salted water to a boil and immerse the cabbage head. After a few minutes the outer leaves will begin to soften and separate; as they do, remove them from the water with a wooden fork and drain in a colander. Continue cooking until all the leaves are loose, about 10 minutes. Rinse the cabbage leaves under cool water and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the salmon fillet into eight strips, about one-half-inch wide and two inches long, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mousse, combine the shrimp, Tabasco sauce, salt, pepper, ginger and egg yolk in the container of a food processor or blender and puree for five seconds. Add the egg whites and puree for about 45 seconds, or until the mixture is smooth. Add one-half cup of the fish stock in a steady stream while pureeing and continue blending for another minute or so until the mousse is very smooth. (You can test the consistency by dropping a teaspoonful of the mousse into simmering, salted water and poaching for a minute. If the texture is too watery, add more shrimp; if too firm and tough, add more fish stock.) Stir in the scallions. There should be about two cups of filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the cabbage packets, place three medium-sized cabbage leaves on a thin cotton cloth or on a double layer of cheesecloth in a circular pattern. The top edges of the leaves should overlap and the three stem sides should face away from the center. Cut out the tough white stem sections. Salt and pepper the cabbage generously. Place one-third cup of mousse in the center of each set of leaves and lay a strip of salmon over each mound of mousse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully fold the cabbage leaves over the filling, overlapping them to form a complete seal. Lift the edges of the cloth to encircle the packet and very slowly twist the cloth, over a sink, exerting a gentle pressure on the cabbage packet. The pressure should be sufficient to squeeze liquid from the cabbage packet without breaking the leaves. Carefully open the cloth and set aside the packet, seal side down. Repeat to make a total of eight packets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, combine the butter, oil, shallots and onions in a pot over high heat and cook for a minute, stirring well. Add the remaining ingredients and cook for another minute, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently place the cabbage packets in the pot, seal side down. Salt and pepper them generously, cover, and braise over medium-high heat for 10 minutes. To serve, place two cabbage packets on each of four plates and spoon some sauce around them."}]}