{"@context": "http://schema.org", "@type": "Recipe", "name": "Asparagus Tart", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H35M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, asparagus, half and half, pastry, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "recipeIngredient": ["Unbaked pastry for a 9-inch tart shell", "2 tablespoons sweet butter", "1/4 cup chopped onions", "4 to 5 medium asparagus spears", "1 tablespoon minced chives", "Salt and freshly ground black pepper", "3 eggs", "1 1/2 cups half and half", "2 tablespoons grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Roll out pastry, line tart pan with the pastry and cover the pastry with foil. Weigh down with dry beans or pastry weights. Place in the oven and bake 10 to 12 minutes, until the pastry looks dry. Remove foil and weights and continue baking until the pastry is golden, about 15 minutes longer. Remove pastry from the oven and increase oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a skillet, add the onions and saute slowly until they are transluscent and tender. Snap the ends off the asparagus and peel them about half way up from the bottom. Cut the asparagus into half-inch-thick slices on a sharp slant. You should have about one cup of cut asparagus. Add to the skillet with the onions, toss in the butter and add the chives. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the asparagus mixture in the baked pastry shell. Whisk the eggs and half and half together and pour into the shell. Sprinkle with the cheese. Place in the oven and bake until set and golden brown, about 40 minutes."}], "link": "https://cooking.nytimes.com/recipes/2820-asparagus-tart"}