{"@context": "http://schema.org", "@type": "Recipe", "name": "Vitello Giardino(Veal Cutlets With Salad)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT30M", "recipeYield": "Four servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "arugula, radicchio, veal, main course", "aggregateRating": null, "recipeIngredient": ["1/4 pound arugula", "1/4 pound endive", "2 red, ripe tomatoes, about 1 1/2 pounds, cored", "2 small heads radicchio, about 6 ounces", "1/4 pound red onion, peeled and thinly sliced", "1/2 cup olive oil", "1/2 cup balsamic vinegar", "4 lean loin veal chops, about 1/2 pound each", "1 cup flour", "4 eggs", "Salt to taste, if desired", "Freshly ground pepper to taste", "3 cups fine fresh bread crumbs", "1 cup olive oil, approximately"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away and discard any tough bottom stems of the arugula leaves. Rinse and pat dry or use a spin-dryer. There should be about eight cups loosely packed. Cut away and discard the bottom ends of the endive. Separate the leaves. There should be about six cups loosely packed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tomatoes into one-inch cubes. There should be about four cups. Put the pieces in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the cores of the radicchio. Separate the leaves. There should be about six cups loosely packed. Put the radicchio in the bowl. Add the arugula and endive."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the onion slices in half. There should be about one and a third cups loosely packed. Add the onion to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the olive oil and vinegar over the salad mixture. Toss to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partially scrape away the meat from the chops but leave the meat attached at the largest portion of each bone. Place the meat, bones attached, between two sheets of clear plastic wrap. Use a flat mallet and pound the meat on one side. Turn the plastic-enclosed meat and pound on the other side. Take care not to pound holes in the meat. Ideally, you should have rounds of meat about eight to nine inches in diameter and about a quarter-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dredge each chop on both sides in flour, pressing all over with the fingers to make the flour adhere. Shake off excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs with salt and pepper. Dip the chops on all sides in the beaten egg. Dredge the chops on all sides in bread crumbs, pressing with the fingers to make the crumbs adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat three-quarters of a cup of oil in a heavy 10-inch skillet almost to the smoking point. Add one veal chop and cook about one and a half minutes or until golden brown on one side. Turn the chops and reduce the heat to medium. Cook on the second side about one minute or until golden brown. Drain each cooked chop on absorbent paper toweling and top with another layer of toweling. Press to extract excess oil. Continue cooking one chop at a time, adding a little more oil as necessary, until all the chops are cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer each chop to an individual plate, top with an equal portion of the salad and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/2831-vitello-giardino-veal-cutlets-with-salad"}