{"@context": "http://schema.org", "@type": "Recipe", "name": "A La Cote Saint-Jacques's Gazpacho With Shrimp And Zucchini Mousse", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT15M", "recipeYield": "Four servings", "recipeCuisine": "spanish", "recipeCategory": "", "keywords": "appetizer, shrimp, tomato, zucchini, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 164, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "735 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 clove garlic", "5 small tomatoes (about 1 pound), cored and quartered", "1 small red bell pepper, stem and seeds removed, quartered", "1 small cucumber, ends trimmed and quartered lengthwise", "1 medium-size onion, peeled and quartered", "2 tablespoons best-quality red-wine vinegar", "Salt and freshly ground pepper to taste", "1 medium-size zucchini, quartered", "1/4 cup heavy cream, preferably not ultra-pasteurized", "Salt and freshly ground black pepper to taste", "20 large, peeled prawns or 30 to 35 shrimp", "1 tablespoon extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the gazpacho: In the bowl of a food processor fitted with a metal blade, mince the garlic. Add the remaining ingredients, process until thoroughly blended and season to taste with salt and pepper. The soup will be fairly thick. Refrigerate until just before serving. The soup should be consumed the day it is made."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the mousse: Just before the soup is to be served, bring a small pot of water to the boil. In the bowl of a food processor fitted with a metal blade, finely chop the zucchini. Blanche the zucchini for several minutes in the boiling water, drain and rinse with cold water to retain the green color. Whip the cream until quite stiff, then fold the zucchini into the cream. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the prawns with oil and broil or grill just until they are opaque and still resilient but not too firm, about two minutes on each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, fill four chilled, shallow soup bowls with the gazpacho. Arrange five prawns in a circle on top of the soup. With a melon baller (or pastry bag and large round tip), form the zucchini mousse into rounds and arrange them in between the prawns. Serve immediately. If any zucchini mousse remains, pass it in a small bowl for additional servings."}]}