{"@context": "http://schema.org", "@type": "Recipe", "name": "Hostellerie Du Cerf's Salmon With Lentils, Bacon And Horseradish Cream", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "bacon, lentils, salmon, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 712, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "7 grams", "proteinContent": "46 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1353 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup dried green lentils", "2 tablespoons unsalted butter", "1 carrot, peeled and very finely minced", "1 onion, very finely minced", "1 branch celery, very finely minced", "1 leek, cleaned and very finely minced", "Bouquet garni (parsley, thyme, bay leaf)", "3 cups chicken stock, preferably homemade, or water", "1 cup dry white wine, such as Riesling", "Salt and freshly ground black pepper to taste", "3/4 cup creme fraiche", "3 tablespoons prepared horseradish", "6 ounces slab bacon or side pork, rind removed, cut into bite-size cubes", "1 pound thick-cut salmon filets, cut into 4 equal rectangular portions", "Fresh herbs, minced, for garnish, preferably a mix of chervil and flat parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the lentils: Rinse lentils and sort carefully, discarding any pebbles you may find. In a medium-size saucepan, melt the butter over medium-low heat. Add the carrot, onion, celery and leek and cook, covered, stirring occasionally, until soft, three to four minutes. Add the lentils, bouquet garni, chicken stock or water and wine. Bring to a boil, reduce heat and simmer until tender, about 40 minutes. Season with salt and pepper, discard bouquet garni and keep lentils warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the horseradish cream: In a small saucepan, combine the cream and the horseradish and simmer gently until mixture is well blended. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the bacon: Place the bacon in a large skillet. Using no additional fat, turn the heat to medium-high and cook, turning and stirring frequently, until crisp. Pour off and discard the fat. Drain the bacon on paper towels and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the salmon: Brush a ribbed cast-iron stove-top grill with oil. Heat over medium-high heat. Season salmon with salt and pepper on both sides. Grill fish just until the flesh turns opaque and is still resilient, not soft or overly tough, about four minutes per side, depending upon the thickness of the fish. (The fish may also be grilled under a broiler or on an outdoor grill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, divide the lentils among four heated dinner plates. Place a piece of salmon on top and spoon the sauce all around the lentils. Sprinkle the salmon with the bacon and shower each plate with herbs. Serve immediately."}]}