{"@context": "http://schema.org", "@type": "Recipe", "name": "American Berry Tart", "description": "", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT3H", "recipeYield": "Eight to 10 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "almonds, berries, pastry crust, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 407, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "11 grams", "sodiumContent": "48 milligrams", "sugarContent": "25 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups flour", "1/8 teaspoon salt", "3 tablespoons sugar", "10 tablespoons sweet, unsalted butter, chilled and cut into 1- tablespoon chunks", "2 tablespoons shortening, chilled", "3 tablespoons ice-cold water", "3 egg yolks", "7 tablespoons sugar", "1 cup milk", "4 tablespoons flour", "3 tablespoons sweet, unsalted butter", "1 1/2 teaspoons vanilla extract", "1/2 teaspoon almond extract", "8 tablespoons blanched, pulverized almonds", "1 quart strawberries, hulled and rinsed", "1 pint blueberries, rinsed", "1/4 cup red currant jelly"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, place the flour, salt and sugar. Process by pulsing on and off once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add to that mixture the butter and shortening. Process, pulsing on and off about eight times, or until the mixture looks like lumpy cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the water evenly around the butter-flour mixture and process, pulsing, for five seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the mixture out onto a pastry board or work surface. With the heel of your hand, start working the dough together by pushing it against the board and away from you bit by bit. Do this two or three times, or until the dough blends together and does not stick to the board. Be careful not to overwork the dough, which will make it tough. Gather the dough together in a ball, wrap the ball loosely with plastic wrap, then flatten it slightly to form a thick disk. Refrigerate the dough for at least one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the dough and place in a 10-inch tart shell. Refrigerate for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Prick the pastry here and there with a fork or knife tip. Line the pastry shell with foil, then fill with weights or dried beans to keep the dough from rising."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pastry shell for eight minutes, or until it is set. Then remove the weights and the foil, and return the pastry to the oven. Bake an additional eight to 12 minutes, or until the pastry is golden. Let cool on a cake rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the almond pastry cream by beating the egg yolks with the sugar, using an electric mixer or whisk. Beat until the mixture is pale, thick and forms a ribbon. As you do this, put the milk in a medium-sized pot over medium heat and bring to the boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour to the egg mixture, stirring gently until smooth. Then add the hot milk to the egg mixture, whisking vigorously all the time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the mixture to the pot and heat over a medium flame, whisking continuously. Be sure to scrape the bottom of the pan. Continue whisking until the mixture thickens, almost to the consistency of a pudding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the mixture from the heat. Stir in the butter, vanilla extract, almond extract and the pulverized almonds. Rub the top of the pastry cream with a bit of softened butter to prevent a skin from forming on the surface. Let the pastry cream cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the pastry cream into the baked tart shell. Arrange the strawberries - either whole, with the tips up, or sliced - into a star pattern. Fill in the corners with the blueberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt the currant jelly. Paint the berries with the jelly to give them a nice glaze."}], "link": "https://cooking.nytimes.com/recipes/2916-american-berry-tart"}