{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Chicken With Cornmeal", "description": "", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "Eight to 10 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "chicken, cornmeal, lemon juice, main course", "aggregateRating": null, "recipeIngredient": ["3 3 1/2-pound chickens, fryers, each cut into 8 pieces, backs removed", "1 cup lemon juice", "1 teaspoon kosher salt", "1 teaspoon Louisiana Gem hot sauce, or Tabasco sauce", "1 1/2 cups yellow cornmeal", "1 teaspoon salt", "Vegetable oil", "1 tablespoon fresh marjoram, chopped", "Sprigs of fresh rosemary for garnish", "1 lemon, thinly sliced, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the chickens of as much obvious fat as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large shallow pan, stir together the lemon juice, kosher salt and hot sauce. Add the chicken pieces to the mixture and marinate, refrigerated, for at least two hours. Turn the chicken at least three times during the marination."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a doubled-up, large paper bag, mix together the cornmeal and salt. Put three or four pieces of chicken in the bag and shake until they are completely coated. Remove to a platter and continue until all the pieces are coated. Shake off excess cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, oblong, deep roasting pan, pour in a half inch of vegetable oil. Put the pan in the preheated oven. After about 15 minutes, when the oil is hot, use tongs to gently place the chicken pieces in the pan, being careful not to crowd them. Cook on one side, about 15 to 20 minutes. Then turn on the other side and cook for about 15 to 20 minutes. Make sure that the chicken is thoroughly cooked. Repeat this step, frying batches, until all the chicken is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a large platter and keep warm in a 250-degree oven. Before serving, sprinkle with fresh, chopped marjoram. Decorate the platter with sprigs of rosemary and thin slices of lemon."}], "link": "https://cooking.nytimes.com/recipes/2918-fried-chicken-with-cornmeal"}