{"@context": "http://schema.org", "@type": "Recipe", "name": "Concord Pickled Lox", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT35M", "recipeYield": "12 or more servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "appetizer, lox, pickling spices, vinegar", "aggregateRating": null, "recipeIngredient": ["3 pounds filleted, skinless brined salmon (belly lox), in one piece", "4 cups white vinegar", "1 cup water", "1 1/2 tablespoons pickling spices (see note)", "1 cup plus 1 teaspoon sugar", "2 Bermuda onions, sliced", "4 cups sour cream", "1 tablespoon marinade from the fish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place salmon in a glass, stainless steel or ceramic dish and cover with cold water. Cover the dish with plastic wrap and refrigerate 48 to 60 hours to freshen. Change water several times during soaking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain fish well. Trim away any cartilage and make sure no bones are still imbedded in the flesh. You can detect bones by running your fingers over the fish; pull them out with tweezers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine vinegar, water, pickling spice and 1 cup of sugar in a glass or stainless steel saucepan. Bring to a boil and simmer 20 minutes. Allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the fish into 1/2-inch thick diagonal slices and layer the slices and onions in a glass, stoneware or pottery dish. Strain cooled marinade and pour over the fish and onions, completely immersing them. Either use a 4-quart dish or divide the fish, onions and marinade between two containers. Cover with plastic wrap, refrigerate and allow to marinate 24 to 36 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk sour cream, remaining teaspoon of sugar and 1 tablespoon of the fish marinade until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove salmon and onions from the brine and drain well. Gently layer the drained salmon and onions with the sour cream sauce. For best results, cover and refrigerate overnight before serving. Prepared pickled lox will keep five to seven days under refrigeration and actually improve during this period."}], "link": "https://cooking.nytimes.com/recipes/2949-concord-pickled-lox"}