{"@context": "http://schema.org", "@type": "Recipe", "name": "Apricot Gratin with Almonds and Kirsch", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 sevings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "almonds, apricot, honey, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 713, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "96 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "14 grams", "sodiumContent": "23 milligrams", "sugarContent": "88 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup sugar", "1/2 cup honey", "1 vanilla bean", "2 1/2 cups water", "2 1/4 pounds apricots", "3/4 cup powdered sugar", "1 1/4 cups ground almonds", "10 tablespoons unsalted butter, softened", "2 egg yolks", "1 whole egg", "1/4 cup slivered almonds", "3 tablespoons apricot brandy or kirsch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before, combine the sugar, honey, vanilla bean and water in a saucepan and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the whole apricots in a large saucepan. Pour the boiling syrup over them and bring back to a boil over medium-high heat. Remove from the heat; the apricots should be completely submerged in the syrup. If not, they will discolor. If necessary, invert a saucer over the top of the fruit to keep it submerged. Cover the saucepan and let stand for 24 hours. During this overnight marinating, the pits will impart an almond flavor to the apricots and their syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the fruit, reserving the syrup and being careful not to crush the apricots. Halve the apricots. Remove and discard the pits. Place four or five apricot halves in the bottom of six gratin dishes that are four-inches in diameter, arranging the fruit just to cover the bottom of the dishes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining apricots in a food processor or food mill with a little of the syrup and process to a thick puree. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the topping, combine one-half cup of the powdered sugar, the ground almonds, butter, egg yolks and whole egg in a mixing bowl and whisk until thoroughly blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter among the six gratin dishes, spreading it evenly over the top of the apricots. (If the batter is too thick, heat it slightly to soften.) Sprinkle the top of the batter with slivered almonds. Sprinkle the remaining one-fourth cup of powdered sugar over the top of the gratin dishes with a sugar sifter or fine sieve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Forty-five minutes before serving, preheat the oven to 425 degrees. Twenty minutes later, place the gratins in the oven and bake for 15 to 20 minutes, until lightly browned on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, place the apricot puree in a small saucepan and warm over low heat. Add the apricot brandy or kirsch and pour the sauce into a warm sauce boat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the gratins on dessert plates lined with paper doilies or folded linen napkins. Pass the apricot topping separately."}], "link": "https://cooking.nytimes.com/recipes/3041-apricot-gratin-with-almonds-and-kirsch"}