{"@context": "http://schema.org", "@type": "Recipe", "name": "Oeufs en cocotte forestière (Eggs in ramekins with mushrooms)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT35M", "recipeYield": "Six servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, eggs, french bread, mushroom, vegetarian, winter", "aggregateRating": null, "recipeIngredient": ["3/4 pound fresh mushrooms", "Juice of 1/2 lemon", "1/4 cup heavy cream", "4 tablespoons butter", "3 tablespoons finely chopped shallots", "Salt to taste, if desired", "Freshly ground pepper to taste", "12 eggs", "French bread or buttered toast"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the mushrooms and sprinkle with lemon juice. Chop finely. Blend with the cream. This may be done in a food processor or electric blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the butter in a saucepan and add the shallots. Cook, stirring, about one minute and add the mushroom mixture. Cook about five minutes. There should be about two cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease 12 ramekins, about 1 1/2 inches deep and 3 inches in diameter, with the remaining three tablespoons of butter. Sprinkle the bottoms with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon an equal portion of the mushroom mixture into the bottom of each ramekin, but reserve a small portion to use as garnish. Keep it warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break one egg into each ramekin and sprinkle lightly with salt and pepper. Arrange the ramekins in a baking dish and pour boiling water around them. This will keep them from baking too rapidly. Bake 10 to 12 minutes. When cooked, the whites should be firm and the yolks liquid or just starting to firm. Do not overcook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon a little of the reserved mushroom mixture on top of each serving. Serve two to each guest along with French bread or buttered toast. The traditional method of serving dishes in ramekins is to cover a small plate with a napkin, then place the ramekin on the napkin. Provide each guest with a salad fork and a small spoon."}], "link": "https://cooking.nytimes.com/recipes/3073-oeufs-en-cocotte-forestiere-eggs-in-ramekins-with-mushrooms"}