{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Cake", "description": "This is a traditional hard, flat cake like a large cookie, served with ice cream in Italy. It is also served with sweet white wine, such as Vin Santo, at the end of a meal. It is never cut with a knife, but broken into pieces by hand. It is best served the day after baking. The shortbread also keeps crisp and fresh for a long time in an airtight tin box or wrapped in aluminum foil.", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "almonds, butter, flour, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 267, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "11 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 2/3 cups all-purpose flour", "1 1/4 cups finely chopped almonds", "Pinch coarse salt", "1 cup, plus 1 tablespoon unsalted butter, at room temperature, cut into small pieces", "1 cup sugar", "2 tablespoons grappa", "Grated zest of one lemon", "2 tablespoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Butter a round, 12-inch pie tin with low sides, then flour lightly, shaking out the excess flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using an electric mixer, put all the ingredients in the large mixer bowl. Using either the paddle or the dough hook, mix until the dough masses. Wrap a tea towel around and over the top of both mixer and bowl to keep the flour from scattering. The mixture should be crumbly, not smooth. If mixing by hand, use a large spoon and mix all ingredients to the crumbly stage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the mixture into the prepared tin, smoothing the top with a spatula or with your hands. Bake for about an hour. Check the cake after 50 minutes. It should be light brown, darker around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place on a rack and remove from the tin before completely cooled, after about 10 minutes. Replace on the rack to cool completely."}]}