{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel Soup", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, fall, fennel, leek", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "recipeIngredient": ["1 onion, peeled, finely minced", "2 small leeks, white parts only, carefully cleaned and finely minced", "1 sprig fresh thyme", "1/2 teaspoon salt", "1/2 teaspoon freshly ground pepper", "6 cups chicken broth, either fresh or low-sodium canned", "3 bulbs fennel, trimmed and finely chopped, tops reserved for garnish", "2 tablespoons low-fat milk", "4 sprigs flat parsley leaves, rinsed and finely chopped", "Red-pepper mousse (optional) (<a href=\"http://cooking.nytimes.com/recipes/3104-red-pepper-mousse\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a nonstick pot over low heat. Add the onion, leeks, thyme, salt, pepper and 1/4 cup of the broth, cover the pan and cook over low heat until the vegetables are soft, about 10 minutes. Add the fennel, cover, and continue to cook until the fennel is tender, about 15 minutes. Add the remaining chicken stock and bring it to a boil. Cover, lower the heat and simmer gently for 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the soup in a blender until smooth. Strain it through a fine-mesh strainer. Return any of the puree that does not pass through the sieve to the blender, puree again and re-strain, repeating until all the soup has been used. The soup can be refrigerated at this point for up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, slowly bring the soup to a simmer, remove from the heat and whisk in the milk. Ladle into bowls. The soup can be garnished simply with the reserved fennel tops and chopped parsley. For a more festive -- and flavorful -- dish, add a dollop of red-pepper mousse."}], "link": "https://cooking.nytimes.com/recipes/3103-fennel-soup"}