{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Grilled Duck With Spinach And Poached Apples", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT8H30M", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "duck, spinach, vegetables, fall, main course", "aggregateRating": null, "recipeIngredient": ["1 9-to-10-pound moulard duck or 2 4 1/2-pound Long Island ducks (see note)", "1/2 teaspoon kosher salt", "1/2 teaspoon freshly ground pepper", "1 onion, peeled and quartered", "1 leek, white part only, carefully cleaned and cut into large pieces", "2 small carrots, peeled and chopped", "1 teaspoon whole black peppercorns", "1 bouquet garni (1 bay leaf, 1 sprig fresh thyme, 2 sprigs parsley, 1 small stalk celery with leaves -- all tied together with a string)", "6 mushrooms, trimmed, stems discarded", "1 quart duck broth", "1 small leek, white part only, carefully cleaned, or 1 small white onion, finely minced", "1 small carrot, peeled, finely diced", "1/4 cup finely diced sweet red pepper, seeded", "1/4 cup finely diced yellow pepper, seeded", "1 to 1 1/4 pounds spinach, leaves only, rinsed well", "Spicy poached apples (<a href=\"http://cooking.nytimes.com/recipes/3106-spicy-poached-apples\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Use a sharp knife to remove any excess fat from the duck. Remove the neck, cut in half and place in a shallow roasting pan. Remove the wings, being careful not to cut into the breast. Place the wings in the roasting pan. Cut along one side of the ridge of the breastbone, then scrape the knife against the side of the breastbone, gently freeing one half of the breast from the cavity. Repeat on the other side. Remove as much fat as possible from the meat and discard the fat. Remove the loose, sinewy flap of meat from the underside of both breast pieces. Set aside. Blend the salt and pepper and rub the mixture into the skin side of the breasts. Cover and refrigerate. Remove the duck legs and use the back of the knife to break up the carcass. Add the carcass to the roasting pan and roast in the oven along with the neck and wings for 20 to 25 minutes, turning frequently until evenly browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the browned duck parts, onion, leek, carrots, peppercorns and bouquet garni -- and enough water to cover, about 6 quarts -- in a stockpot over low heat. Bring to a boil and reduce the heat to a simmer. Add the legs, the flaps of meat from the breast and the mushrooms, cover partially and simmer for 4 hours to get about 2 1/2 to 3 quarts. Skim any foam as it rises to the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth and discard the solids. Strain again through a fine sieve or a large strainer lined with cheesecloth. Cool and then refrigerate overnight to chill completely. Skim and discard the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the spicy poached apples. They can be kept at room temperature for up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "An hour before serving, begin making the sauce. Put the duck broth in a saucepan over medium heat and cook until it has reduced to 1 1/4 cups, about 35 minutes. (Freeze the remaining broth to make soup.) Add the leek or onion and simmer for 5 minutes. Add the carrot, remove from heat and set aside for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy skillet over medium-high heat until it is hot, but not smoking. Lay the breasts skin side down, and cook until brown, about 4 to 5 minutes. Turn them over and cook until done, about 3 to 5 minutes, depending on the thickness of the breasts. Pour out the fat as it accumulates in the pan. Remove the breasts to a tray, cover loosely with foil and allow to rest for at least 5 minutes and up to 15 minutes before slicing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Five minutes before you are ready to serve the duck, return the sauce to the heat and bring it to a simmer. Add the peppers and set aside for 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the spinach until just wilted and drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a sharp knife to slice the duck breasts thinly. Lay out 4 warmed plates. Place a mound of steamed spinach in the center of each plate and fan the duck slices around the spinach. Spoon the sauce over the meat, garnish with the spiced apples and serve."}], "link": "https://cooking.nytimes.com/recipes/3105-pan-grilled-duck-with-spinach-and-poached-apples"}