{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish and Chips", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "british", "recipeCategory": "dinner", "keywords": "fish, potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["1 cup flour", "1 tablespoon corn, peanut or vegetable oil", "1 large egg, separated", "3/4 cup beer at room temperature", "1/4 cup warm water", "Salt to taste if desired", "12 to 16 Maine or Idaho potatoes, about 4 pounds", "Fat for deep-frying", "4 skinless, boneless dogfish (sand shark) fillets, about 1 1/2 pounds (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour in a mixing bowl and make a well in the center. Put the oil and egg yolk in the well. Add the beer, stirring with a wire whisk. Stir in the water and salt. Cover and let stand an hour or longer in a warm place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes and cut them into sticks that resemble french fries. Each stick should measure about half an inch thick, half an inch wide and two inches long. As the potatoes are cut, drop the sticks into cold running water. There should be about eight cups of potato sticks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the fish crosswise into pieces about five inches long. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, drain the potatoes well and pat them dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil to 325 degrees in a deep fryer; this heat is for preliminary cooking. Add the potato sticks and let cook about four minutes or slightly less. The sticks will not yet be browned and crisp. Lift them from the fat and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil to 375 degrees. Return the potatoes and cook until they are crisp and golden brown, about two minutes. Remove the potatoes from the oil and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg white until stiff, and fold it into the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat of the fat to 360 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip one piece of fish fillet at a time in the batter, then drop it into the oil. Cook two or three pieces at a time but don't crowd the cooker. Cook until one batch is crisp and golden brown, about three minutes, then remove and drain on paper towels. Continue cooking until all the pieces are done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the hot fish with the potatoes. In England fish and chips are traditionally served with a bottle of vinegar - preferably malt vinegar - and salt to be sprinkled on both the fish and potatoes."}], "link": "https://cooking.nytimes.com/recipes/3111-fish-and-chips"}