{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry-Pecan Cobbler", "description": "This recipe came to The Times in a 1999 article by Florence Fabricant in which she argued for replacing the ubiquitous Thanksgiving pie with a cobbler. Why? The pastry stays crisp, there's a greater fruit-to-crust ratio and perhaps most importantly, it's easier. Here, two Thanksgiving favorites – cranberries and pecans – are piled into a baking dish, topped with cornmeal biscuits then baked until golden. (This can be made early in the day and reheated to serve warm. Or it can be frozen, then defrosted and warmed, but is best if not refrigerated overnight.)", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-CRANBERRYPIE/19COOKING-CRANBERRYPIE-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cranberry, pecan, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "recipeIngredient": ["3 tablespooons melted unsalted butter", "4 1/2 cups cranberries", "1/2 cup coarsely chopped pecans", "1 1/3 cups light brown sugar", "1 1/2 tablespoons flour, plus flour for work surface", "1/3 cup fresh orange juice", "1/2 teaspoon ground cinnamon", "Cornmeal biscuit dough (<a href=\"http://cooking.nytimes.com/recipes/317-cornmeal-biscuit-dough\">see recipe</a>)", "2 tablespoons granulated sugar", "Whipped cream or vanilla ice cream for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Use one tablespoon butter to brush a nine-inch square or 10-inch round baking pan one and a half to two inches deep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine berries, pecans, sugar, one and a half tablespoons flour, orange juice, cinnamon and remaining butter in a bowl. Transfer mixture to baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On floured work surface pat dough into an eight-inch square about a half-inch thick. Use cutter or knife to cut small rounds, squares or one-inch wide strips of dough and arrange in pattern over cranberry filling. Dust with sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake about 45 minutes, until topping has browned and filling is bubbly. Allow to cool until just warm before serving, or cool completely and reheat in oven to serve. Serve with whipped cream or ice cream."}], "link": "https://cooking.nytimes.com/recipes/315-cranberry-pecan-cobbler"}