{"@context": "http://schema.org", "@type": "Recipe", "name": "Retsina Fish Stew", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, soups and stews", "keywords": "fish, retsina, squid, main course, winter", "aggregateRating": null, "recipeIngredient": ["5 pounds of selection of firm-fleshed white fish such as sea bass, whiting, monkfish, hake, haddock or cod", "8 ounces squid", "1 head Florence fennel, sliced", "4 stalks celery, sliced", "1 medium onion, chopped", "1 clove garlic, minced", "1 cup extra-virgin olive oil", "1 cup retsina", "4 tomatoes, peeled, seeded and diced", "6 ounces potatoes, peeled and sliced", "2 teaspoons tomato puree", "8 cups fish stock", "Coarse salt to taste", "1 tablespoon chopped fennel herb", "1 medium eggplant, thinly sliced", "Milk and seasoned flour for coating the eggplant", "About 1/2 cup olive oil for sauteing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the heads and bones from the fish and add them to the fish stock. Clean the squid and slice it into rounds, the tentacles into strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pan, cook the fennel, celery, onion and garlic in olive oil over medium heat so that the flavor is drawn out of the vegetables but they are not burned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all but about three tablespoons of the retsina, and add the tomatoes, potatoes and tomato puree and cook for about three minutes. Add the fish stock and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat down to slow simmer and add the salt, half the chopped fennel herbs and the fish fillets. The fillets can all go in at the same time if they are roughly the same thickness, but if some are much thicker than others put them on a couple of minutes before the rest. If any of the fish is particularly soft, like hake or whiting, put it in a couple minutes after the rest. Poach the fillets for five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully strain the fish and vegetables through a large collander over a large bowl and put them into a warm serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the stock to the original pan and boil it fiercely while you fry the squid and eggplant. The object of this boiling is to amalgamate the oil and fish stock and also to reduce the volume to concentrate the flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour two tablespoons of oil in a frying pan and when it is hot, quickly saute the squid and remove. Dip the eggplant in milk and seasoned flour, add more oil to the pan and quickly fry the eggplant. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the boiling stock over the fish and vegetables and splash the last of the retsina over all. Arrange the squid and eggplant on top. Finally sprinkle on the rest of the chopped fennel. Serve with skorthalia."}]}