{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Stuffed Pumpkin", "description": "The quantity of rice specified in the recipe is what I needed for the pumpkin I stipulate, but I should say two things here. One is that you might not find (or want) a pumpkin of exactly the same weight. The other is that different pumpkins have different-size cavities. The easiest way to find out how much rice you need is as follows:\n\nWhen you have cut the top off and scraped out the seeds, take a plastic freezer bag and line the cavity with it. Pour rice into the bag to about halfway up the cavity, then pour out the rice into a measuring cup. Double the measurement to determine how much stock or water to cook the rice in. The plastic liner is not a hygiene thing: it is just that if you don't use it, you will spend ages scraping out the rice. I know whereof I speak.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/05/15/dining/Roasted-Stuffed-Pumpkin/Roasted-Stuffed-Pumpkin-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "basmati rice, dried cranberries, pumpkin, fall, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 28}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 234, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "718 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 6 1/2- to 7-pound sugar pumpkin, or other pumpkin suitable for eating", "1 tablespoon vegetable oil", "1 onion, finely chopped", "3 cloves garlic, 2 minced, 1 halved", "1 cup dried cranberries", "1 teaspoon ground ginger", "1 teaspoon allspice", "1/4 teaspoon saffron threads", "Finely grated zest of half an orange", "2 cups basmati rice", "4 cups vegetable stock", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Fill a kettle with water, and bring to a boil. About an inch below the top of the pumpkin's ''shoulders,'' about where it would be cut to carve a jack-o'-lantern, slice a lid from top of pumpkin, and set it aside. Remove seeds and fibrous flesh from inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan over medium-low heat, heat the oil, and sauté the onion until it is softened. Add 2 minced garlic cloves, and sauté for 30 seconds. Stir in the cranberries, ginger, allspice, saffron and orange zest. Add the rice, and stir until it is glossy. Pour in stock, and bring to a boil. Cover, and reduce heat as low as possible. Cook for 15 minutes. Meanwhile rub the inside of pumpkin with cut garlic clove, and rub with some salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When rice has cooked for 15 minutes, it will be damp and not very fluffy. Adjust seasoning to taste, and spoon into pumpkin cavity. Press lid firmly on top. It may sit above stuffing a bit like a jaunty cork. Wrap bottom two to three inches of pumpkin in a double layer of foil to protect it from contact with water during baking. Place in a roasting pan, and add about 1 inch of boiling water to pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pumpkin until it is tender when pierced with a knife, about 1 1/2 hours. (If there is resistance when pumpkin is pierced, allow more baking time.) To serve, remove pumpkin from pan, and allow it to rest for about 10 minutes. Discard foil, and place pumpkin on a serving platter. Slice into segments like a cake. Place a wedge of pumpkin on each serving plate, and mound with rice stuffing."}]}