{"@context": "http://schema.org", "@type": "Recipe", "name": "Jack Czarnecki's Veal With Two Mushroom Sauces", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "main course, mushroom, veal", "aggregateRating": null, "recipeIngredient": ["1 ounce dried boletes (cepes or funghi porcini)", "1 1/2 cups water", "1 small sliced onion", "1 teaspoon soy sauce, or to taste", "1/4 pound small, fresh wild mushrooms, trimmed, cleaned and sliced", "1 teaspoon arrowroot, mixed with 1/3 cup water", "Salt and freshly ground pepper to taste, if desired", "2 cups rich veal stock, made only from meat and bones", "6 ounces fresh chanterelles", "1 teaspoon soy sauce, or to taste", "2 tablespoons sifted flour", "2 tablespoons melted butter", "2 tablespoons apricot preserves", "Salt and freshly ground pepper to taste", "4 thick veal chops", "Salt to taste as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "The bolete sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse dried mushrooms thoroughly under running water in a colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, bring water to a boil. Add mushrooms, and reduce heat so that liquid barely simmers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions and soy sauce to taste. Let mixture simmer 10 minutes, then remove from heat. Strain through cheesecloth or a fine sieve. Set aside mushroom-onion mixture, and reserve the liquid -there should be approximately 1 cup. The mixture can be added to the finished sauce, as described below, or it can be saved and used to make a wild mushroom puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Three or 4 minutes before the veal is done, bring the mushroom liquid to a boil. Add the mushroom-onion mixture, if desired, and the fresh wild mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir arrowroot and water until well mixed. Slowly add to the lightly boiling liquid, stirring continuously. When sauce is thickened, the whiteness of the arrowroot will have disappeared. Adjust seasonings, adding salt and pepper if desired."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "The chanterelle sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring stock to a boil. Add mushrooms and soy sauce, and simmer 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine flour and butter, and whisk over low heat until a smooth paste (roux) is formed; the color should be golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock mixture to the roux, and stir over medium heat for about 5 minutes. Add apricot preserves, and continue to stir 2 minutes. Remove from heat. Adjust seasonings, adding salt and pepper if desired. If sauce is too thick, thin by adding more stock."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "The veal:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly salt veal chops, and roast in 425-degree oven. Allow about 20 minutes of roasting time for each 3/4 inch of thickness. 2. When done, place each chop on a warm dinner plate. Serve with bolete sauce on one side of plate and chanterelle sauce on the other."}]}], "link": "https://cooking.nytimes.com/recipes/3211-jack-czarneckis-veal-with-two-mushroom-sauces"}