{"@context": "http://schema.org", "@type": "Recipe", "name": "Artichoke-Parmesan Sauce", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT25M", "recipeYield": "1 1/2 to 2 cups", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "artichoke hearts, crème fraîche, parmigiano-reggiano, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 406, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "22 grams", "sodiumContent": "344 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 14-ounce can artichoke hearts", "1/4 teaspoon cayenne", "1/4 cup creme fraiche or sour cream", "1/3 cup chopped fresh dill leaves", "2 egg yolks", "1 1/2 tablespoons lemon juice", "1 stick frozen butter, cut into 6 or 8 pieces", "1/2 cup finely grated Parmigiano Reggiano cheese", "Herbs, chopped chives and edible flowers for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and rinse artichoke hearts, squeezing them to remove excess water. Place in bowl of food processor, together with cayenne, creme fraiche and chopped dill. Process until artichokes are finely pureed. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water to boil in lower half of a double boiler. Turn heat down to just barely simmering. Have a bowl of cold water with a few ice cubes in it standing by. In top half of boiler, place egg yolks and lemon juice. Whisk slightly to combine, then place over, but not in, the barely simmering water. Stir constantly with a wire whisk. Place a piece of butter in the eggs and continue stirring until eggs are warm and butter has melted. Then add another piece of butter and continue in the same manner until all the butter is used. If eggs start to curdle, immediately plunge the top boiler in bowl of icy water, still whisking. (This is an emergency procedure to lower the temperature rapidly.) Return the top boiler to the simmering water and continue adding butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the butter has been added, sauce should be quite thick. Add grated cheese and whisk to mix well. Place boiler in icy water to reduce temperature slightly, then stir in artichoke mixture. Use this sauce to nap the mushroom roulade. May be served immediately or held for an hour or so, but do not refrigerate as it will make the sauce granular."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve garnished with herbs, chives and edible flowers, passing remaining sauce."}], "link": "https://cooking.nytimes.com/recipes/3234-artichoke-parmesan-sauce"}