{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot-Cross Buns", "description": "A hot-cross bun is essentially what the English call a Chelsea bun, a confection sold all year. The difference is that for Good Friday, a cross is traced on the top of the bun. Unlike their American counterparts who use frosting, English bakers create the cross by slashing the dough or by laying strips of pastry across the top of the bun. \n\nWhile these are at their best when served warm, preferably soon after they have been baked, a quick toasting and a slather of butter would more than salvage a day-old bun.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/03/06/dining/hot-cross-buns/hot-cross-buns-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "2 dozen", "recipeCuisine": "british", "recipeCategory": "", "keywords": "currants, eggs, flour, dessert, nut-free, vegetarian, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 199}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 135, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "108 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 package active dry yeast", "1 cup warm milk", "5 tablespoons butter, softened", "1/2 cup brown sugar", "2 large eggs", "1/2 teaspoon ground nutmeg", "1/2 teaspoon ground cloves", "1/2 teaspoon ground cinnamon", "1 teaspoon salt", "3 1/2 cups, approximately, all-purpose flour", "3/4 cup dried currants", "3 tablespoons milk mixed with 3 tablespoons granulated sugar", "1 tablespoon cold milk (optional)", "1 cup sifted confectioners' sugar (optional)", "1/2 teaspoon lemon juice (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the yeast with 4 tablespoons of the warm milk in a small bowl and set aside about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cream 4 tablespoons of the butter and brown sugar and beat in the eggs. When yeast mixture becomes frothy, stir it in, along with the spices, salt and remaining warm milk. Beat in the flour a cup at a time until a soft ball of dough can be gathered together. Dough can be mixed by machine if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough on a floured work surface and lightly knead in the currants, adding more flour as necessary to keep dough from sticking. Kneading should take no more than a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using some of the remaining butter, grease a bowl. Place the dough in the bowl and turn to butter all sides. Cover and set aside to rise until doubled, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter two baking sheets with the remaining butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down, divide it in half, then divide each piece in half again. Divide each portion of dough into six equal pieces and shape each into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place balls of dough on baking sheets, leaving about 2 inches between them. Set aside, covered lightly with waxed paper, to rise until they have doubled in size, 45 minutes to an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully slash a cross into the top of each bun, using a very sharp razor blade and cutting through the skin of the dough at least one-quarter inch deep. Or snip a small cross in the top with sharp scissors. Try not to compress the bun as you cut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake buns about 20 minutes, until they are lightly browned. Just before they come out of the oven, bring milk and sugar mixture to a boil. As soon as buns are done, brush them with milk and sugar glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the buns to cool for 30 minutes, then serve while still warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If desired, or if you have not cut the cross into the tops of the buns, the cross can be applied with icing. The buns must be completely cooled before the icing is applied. Mix the confectioners' sugar with the cold milk and lemon juice and, using the handle of a spoon or a chopstick, spread the icing to form a cross on top or to fill the cross-shaped cut."}]}