{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Sautéed Shrimp, Tomatoes and Peppers", "description": "Here's a weeknight classic from Pierre Franey’s “60 Minute Gourmet” column that was published in 1991. The recipe may be close to 30 years old, but its flavors and ease of preparation are timeless. First, a quick sauce is made of chopped garlic, red and green bell peppers, canned tomatoes and oregano. As that simmers away, the linguine is dropped into briskly boiling water and cooked for about nine minutes. While the pasta is cooking, the shrimp is sautéed with a pinch of crushed red pepper flakes in a little olive oil until it just turns pink. When the shrimp is cooked through, it's combined with the sauce and a handful of chopped fresh basil or Italian flat-leaf parsley then tossed with the linguine.", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": "https://static01.nyt.com/images/2017/06/30/dining/30COOKING-SHRIMP-PASTA1/30COOKING-SHRIMP-PASTA1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "dairy-free, nut-free, vegetarian, linguine, shrimp, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 156}, "recipeIngredient": ["1 1/4 pounds medium-size shrimp", "3 quarts water", "Salt to taste", "4 tablespoons olive oil", "1 tablespoon finely chopped garlic", "1 medium-size red sweet pepper, cored, seeded and cut into 1-inch cubes", "1 medium-size green pepper, cored, seeded and cut into 1-inch cubes", "3 cups canned crushed tomatoes", "Freshly ground pepper to taste", "1 teaspoon dried oregano", "3/4 pound imported linguine", "1/4 teaspoon red-pepper flakes", "4 tablespoons chopped fresh basil, if available, or chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and devein shrimp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water with salt to a boil in a large kettle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the oil in a large saucepan over medium-high heat and add the garlic and red and green peppers. Cook briefly without browning. Add the tomatoes, salt, pepper and oregano. Bring to a simmer and cook, stirring, 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, drop linguine into boiling water and cook about 9 minutes or until it reaches a degree of doneness. Drain quickly and reserve about 1/2 cup of the cooking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While linguine cooks, heat remaining oil in a saucepan over medium-high heat. Add shrimp, pepper flakes, salt and pepper. Cook, stirring, about a minute. Add to tomato sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add linguine, reserved cooking liquid and the basil to mixture. Heat thoroughly. Toss well and serve immediately."}]}