{"@context": "http://schema.org", "@type": "Recipe", "name": "Gratine of Eggs and Spinach", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT35M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "eggs, milk, spinach, nut-free, vegetarian, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 203, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "12 grams", "saturatedFatContent": "6 grams", "sodiumContent": "400 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 large eggs", "1 1/2 tablespoons olive oil", "1 pound spinach, washed and drained", "1/4 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1 1/2 tablespoons unsalted butter", "1 1/2 tablespoons all-purpose flour", "1 1/2 cups cold milk", "1/4 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1 1/2 tablespoon freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the gratine, place the eggs in a saucepan and cover with warm tap water. Bring to a boil over high heat, reduce the heat, and boil gently for approximately 8 minutes. Pour off the hot water, and shake the eggs in the pan to crack the shells. Add some ice to the pan, and fill it with cold water. Set aside until the eggs are cool enough to handle, and then shell them. Return the eggs to the cool water, and set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a skillet. When hot, add the spinach, still wet from washing, and press it into the skillet. Add salt and pepper, and cook until the spinach is soft and wilted, about 3 minutes. Arrange evenly in a gratin dish. Slice the eggs with an egg slicer or by hand, and arrange them in one layer on top of the spinach."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, melt the butter in a small saucepan. Add the flour, and mix it in with a whisk. Add the milk, bring to a boil, stirring (especially in the corners, where the mixture tends to stick and burn), until it comes to the boil. Stir in the salt and pepper, and continue to boil for about 10 seconds. Pour the sauce over the eggs, coating them with the cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the gratine dish about 6 inches from heat under a hot broiler for about 5 minutes, until the surface is nicely browned. If the gratine is assembled ahead and cooled, first place it in a 425-degree oven for about 7 to 8 minutes, then slide it under the broiler for about 5 minutes to heat the eggs and brown the top."}]}