{"@context": "http://schema.org", "@type": "Recipe", "name": "Choux a la Creme", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "all-purpose flour, eggs, heavy cream, dessert, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 589, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "23 grams", "sodiumContent": "139 milligrams", "sugarContent": "37 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup water", "1 tablespoon unsalted butter", "1/8 teaspoons salt", "3/4 cup all-purpose flour (approximately 3 3/4 ounces)", "3 large eggs", "1 teaspoon confectioners' sugar to dust the tops of the choux puffs", "1 1/2 cups heavy cream", "1/4 cup confectioners' sugar", "2 teaspoons pure vanilla extract", "4 tablespoons blackberry preserves", "8 ounces bittersweet or semisweet chocolate", "1 1/4 cups milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. To make the choux, place the water, butter and salt in a saucepan, and bring the mixture to the boil over high heat. Immediately remove from the heat, and add the flour in one stroke. Mix in the flour with a sturdy wooden spatula, and return the pan to the stove over medium heat to high heat, stirring until the mixture comes up the sides of the pan and is almost the texture of modeling clay. Cook for about 20 to 30 seconds, still stirring, to dry the mixture further. Remove from the heat and transfer to the bowl of a food processor. Process for 4 to 5 seconds to cool the mixture slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, beat the eggs with a fork until well mixed. Reserve 1 tablespoon of the beaten eggs to brush on the choux later, and add a third of the remaining egg mixture to the food processor bowl. Process for 5 to 6 seconds, just long enough to incorporate the eggs into the flour mixture. Repeat with the remainder of the eggs, adding and incorporating half of them at a time. After the final addition, process the mixture for about 10 seconds, until very smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter a cookie sheet. Spoon 6 rounds of the dough, each about the size of a golf ball (approximately 3 tablespoons), onto the sheet, spacing them evenly to allow for expansion. Brush with the reserved tablespoon of beaten egg to smooth the tops and coat the surface of the balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cookie sheet in the oven for about 40 minutes, until the choux are nicely developed, lightly browned, and cooked through. Set aside in a draft-free spot on top of the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, place the cream, confectioner's sugar, and vanilla in a bowl, and whip until firm. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The dessert can be completed a few hours before serving. Remove and reserve the top of each choux puff, cutting around each about a quarter of the way down and lifting off the resulting &quot;cap.&quot; Remove and discard some of the soft insides, or press this soft membrane against the walls of the choux. Spoon 2 teaspoons of the blackberry preserves into the base of each choux."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the reserved cream mixture into a pastry bag fitted with a star tip, and pipe it into the choux. Replace the &quot;caps,&quot; and sprinkle with the reserved teaspoon of confectioners' sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the chocolate sauce, heat the chocolate and milk in a saucepan over low to medium heat just until the chocolate melts. Mix well with a whisk, transfer to a bowl, and allow to cool off in the refrigerator, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a choux on each of 6 individual dessert plates. Serve with the chocolate sauce."}]}