{"@context": "http://schema.org", "@type": "Recipe", "name": "Chez Panisse Meyer Lemon Meringue Pie", "description": "This adaptation of Alice Waters’s lemon meringue pie came to the Times in a 1987 article in the Sunday magazine. It takes a little time, but your efforts will be rewarded with a spectacular centerpiece dessert to be proud of: a cloud of toasted meringue atop a pool of buttery and bright lemon curd in a light and flaky crust. If you can't find Meyer lemons, regular supermarket lemons will make a worthy substitute.", "author": {"@type": "Person", "name": "Leslie Land"}, "image": "https://static01.nyt.com/images/2015/06/24/dining/24MERINGUEPIE/24MERINGUEPIE-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, eggs, meyer lemon, pie shell, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 559}, "recipeIngredient": ["Flaky pie crust, enough for a 9-inch shell <a href=\" http://cooking.nytimes.com/recipes/3305-flaky-pie-crust \">(see recipe)</a>", "2 Meyer lemons or other large lemons", "2 eggs", "3 egg yolks", "6 tablespoons sugar", "3 tablespoons salted butter, cut in 3 pieces", "3 tablespoons unsalted butter, cut in 3 pieces", "3 egg whites, at warm room temperature", "1/4 teaspoon cream of tartar", "6 tablespoons superfine sugar", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the shell. Roll the pastry into a 12-inch circle, 1/8-inch thick, and fit gently into the pan. Tri the edge a half-inch beyond the rim, fold under and crimp or pinch to make a decorative edge. Prick the bottom with a fork. Freeze the shell for 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling. Grate the zest from the lemons into a small, noncorrodable bowl. Strain in the lemon juice, then press through as much lemon pulp as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy, noncorrodable saucepan, beat the eggs, yolks and sugar until just mixed. Stir in the lemon juice and pulp, then the six tablespoons of butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, stirring constantly, over low to medium heat, until the mixture comes together and thickens enough to coat a spoon. Remove from heat, allow to stand five minutes, then whisk briefly to smooth. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Line the frozen shell with aluminum foil, weight with beans or pie weights and bake for 20 minutes, or until set and dry looking. Remove the weights and foil, turn the heat down to 350 and continue baking until shell is golden brown, about 12 to 15 minutes. Set aside and allow to cool slightly, but leave the oven on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the prepared filling in the shell and bake for 10 to 15 minutes or until the filling is just set. Remove pie and turn oven to 375."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meringue. Beat the egg whites until frothy, add the cream of tartar and continue beating until rounded peaks form. Beat in sugar and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the meringue over the filling, making sure it meets the edges of the crust to make a seal. Swirl in a design with a knife or spatula and bake for about 10 minutes, or until the meringue is lightly browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow to cool completely, from one to two hours, but do not refrigerate."}], "link": "https://cooking.nytimes.com/recipes/3304-chez-panisse-meyer-lemon-meringue-pie"}