{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttered Apple Pie", "description": "This is a modern reading of the ''Buttered Apple Pie'' from Amelia Simmons's ''American Cookery,'' the first American cookbook, published in Hartford in 1796.", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT2H10M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, nut-free, vegetarian, pie dough, tart apples", "aggregateRating": null, "recipeIngredient": ["1 batch flaky pie crust, divided into 2 unequal halves", "1/4 to 1/3 cup sugar, depending on sweetness of apples", "1/2 teaspoon cinnamon", "1/4 teaspoon mace", "6 large, tart cooking apples, such as Cortlands or pippins, peeled, cored and cut in 6ths", "1 to 1 1/2 tablespoons rosewater, depending on taste", "4 tablespoons melted butter", "Cream for brushing the crust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the larger piece of dough to a 1/8-inch thickness and use it to line a deep 9-inch pie pan. Do not trim overhang yet. Roll the other piece between sheets of wax paper into a rectangle roughtly 12 inches long and 1/8-inch thick. Refrigerate shell and rolled dough for at least a half hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine sugar, cinnamon and mace. Toss apples with rosewater, then with butter. Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a third of the sugar mixture over the bottom of the shell. Arrange a layer of apples on it and sprinkle with another third of the sugar. Add the remaining apples, rounded sides up, and sprinkle with the remaining sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the rim of the pie with cream and return it to the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, peel wax paper from one side of the reserved sheet of dough, replace it lightly, flip dough and remove paper from the other side. Working on the wax paper, create a decorative open-work crust either by cutting 1/3-inch strips and weaving a lattice or by using a knife or cookie cutter to make a pattern that allows the apples to show. Stop and refrigerate if the dough starts to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully flip top crust onto pie. Press around the edges to seal and trim overhang to a half-inch beyond rim. Fold it over the top crust edges and crimp up into a decorative rim."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie 10 minutes, reduce the heat to 375 and bake 50 minutes more, or until the apples are very tender and the crust is a rich brown. Allow to cool 10 to 15 minutes and serve while still warm."}], "link": "https://cooking.nytimes.com/recipes/3306-buttered-apple-pie"}