{"@context": "http://schema.org", "@type": "Recipe", "name": "Soy-Sauce Chicken", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "chicken, scallion, tomato, dairy-free, gluten-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 502, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "1 gram", "proteinContent": "39 grams", "saturatedFatContent": "9 grams", "sodiumContent": "397 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 chicken (about 4 pounds)", "2 tablespoons peanut or corn oil", "1 tablespoon dark soy sauce", "1/2 teaspoon Tabasco sauce", "12 scallions, damaged leaves removed and discarded, cut into 1-inch pieces (1 1/2 cups)", "18 cherry tomatoes", "2 tablespoons water", "1/4 teaspoon freshly ground black pepper", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the legs from the chicken and remove all the surrounding skin. Cut each leg into two pieces, separating the drumstick from the thigh. Set the pieces aside. Cut the two wings from the chicken at the shoulder joints and set them aside. Pull off the skin from the chicken breasts and remove them from the carcass. Set them aside. (Freeze the chicken neck and carcass bones for use in stock; either discard the skin or make it into crackling by spreading it out on a cookie sheet and cooking it in a 400-degree oven for 20 to 25 minutes, until crisp.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the chicken liver and place the pieces with the drumsticks, thighs, breasts, wings and gizzard in a dish. Add the oil, soy sauce and Tabasco sauce. Mix well and let it marinate until cooking time, at least three hours. (The recipe can be completed to this point up to one day ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the drumsticks, thighs, wings and gizzard to a large nonstick skillet (reserving the marinade), and cook them, covered, over medium heat for about 12 minutes, turning the pieces occasionally so they brown uniformly on all sides. Add the chicken breasts and cook, covered, for an additional 6 to 7 minutes, turning the breasts after about 3 minutes. Remove the skillet from the heat and set the chicken aside, covered, until serving time. (Although it is preferable to cook the dish just before serving, the cooking in this step can be done up to 30 minutes before.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add the scallions, tomatoes, remainder of the marinade, water, the chicken livers, pepper and salt. Cook, covered, for 2 1/2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the four pieces of dark meat and two wings among six plates, one piece per plate. Cut each of the breasts into three pieces and add one piece of breast meat to each plate along with a small piece of the liver. Spoon some of the tomatoes and marinade over the chicken and serve with the baked yams."}], "link": "https://cooking.nytimes.com/recipes/3308-soy-sauce-chicken"}