{"@context": "http://schema.org", "@type": "Recipe", "name": "Soba Noodles With Shiitakes And Broccoli", "description": "", "author": {"@type": "Person", "name": "Sara Ann Friedman"}, "image": null, "totalTime": "PT25M", "recipeYield": "Four servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "broccoli, shiitake, soba noodles, dairy-free, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "recipeIngredient": ["1 pound fresh shiitake mushrooms, cleaned with a damp paper towel (or 2 ounces dried shiitakes soaked in warm water for 30 minutes)", "1 bunch broccoli, about 1 1/2 pounds", "4 quarts water", "1 pound soba noodles", "1/4 cup peanut oil", "2 cloves garlic, crushed", "1 tablespoon freshly grated ginger", "1/2 cup water or beef stock", "1/2 cup dry sherry", "2 cups beef stock", "1/4 cup low-sodium soy sauce", "1/4 cup Worcestershire sauce", "1 bunch scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the stems from the shiitakes and discard. (Though edible, the stems are usually tough.) Slice the mushrooms lengthwise into 3/4-inch pieces. Cut off the broccoli stems, then peel and slice them thinly. Break up the clusters of broccoli florets into small pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring four quarts of water to a boil. Add the soba noodles and cook for three to four minutes. Drain, rinse in cold water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour one-eighth cup of oil into a wok or large skillet, add half the garlic and ginger and stir-fry for about 30 seconds. Add the broccoli stems and stir-fry for one to two minutes, then add the florets and cook for one minute more. Pour in one-half cup of water or beef stock, cover and cook over medium-high heat until the broccoli is tender but crisp, about three to four minutes. Remove from the skillet and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour one-eighth cup of oil into the skillet and turn the heat up to high. Add the remaining garlic and ginger and all the shiitakes. Stir-fry for about five minutes, then add the sherry. Once the sherry evaporates, add the beef stock, soy sauce and Worcestershire sauce and bring to a boil. Turn the heat down to low and return the broccoli mixture and noodles to the skillet, gently tossing them with the other ingredients until they are hot. Sprinkle with scallions. Serve hot or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/3342-soba-noodles-with-shiitakes-and-broccoli"}