{"@context": "http://schema.org", "@type": "Recipe", "name": "Roti", "description": "The roti is designed to be eaten on the move with fillings like <a href=\"https://cooking.nytimes.com/recipes/3355-channa-curried-chickpea-filling-for-roti\">channa</a>, <a href=\"https://cooking.nytimes.com/recipes/3353-spicy-pumpkin-roti-filling\">pumpkin</a> or <a href=\"https://cooking.nytimes.com/recipes/3354-shrimp-and-potato-curry-roti-filling\">shrimp</a>, but it's a rare non-Trinidadian who can negotiate its juicy, turmeric-laced perils without embarrassment or a good dry cleaner. Roti-making, like roti-eating, is tricky, but gets easier with practice. Once I spent an entire Sunday afternoon with a roti genius, Mrs. Debideen of Couva, Trinidad, as she prepared lunch for her husband, 12 children and their various spouses and grandchildren. In her enormous kitchen, she patiently led me through every step -- the gentle, steady blending of the flour and water, the kneading, the resting of the dough -- and demonstrated the technique of pressing oil into the bread with the back of a wooden spoon while it is cooking. After 30 rotis, I was sure I had it. But it wasn't until my fifth attempt back in Brooklyn that I was able to turn out a bread with the texture of a damp cloth, instead of a rubber bathmat.", "author": {"@type": "Person", "name": "Daisann Mclane"}, "image": null, "totalTime": "PT40M", "recipeYield": "Four rotis", "recipeCuisine": "indian", "recipeCategory": "", "keywords": "flour, ghee, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 351, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "260 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups flour", "1 teaspoon salt", "1/2 teaspoon baking powder", "1/2 to 2/3 cup of water", "About 8 tablespoons vegetable oil or ghee (clarified butter) for frying", "About 4 teaspoons ghee, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the dry ingredients"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With one hand, slowly drizzle 1/2 to 2/3 cup of water into the bowl, a few tablespoons at a time. With your other hand, mix the water into the flour in a circular motion; then, begin kneading the dough as it starts to form. Stop adding water when the dough is stiff and elastic but not sticky (more flour may be added if the dough gets too wet)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the dough into four balls, cover with a dish towel and let rest on a floured board for 15 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fillings are ready (the recipes follow), roll out one dough ball into a 10-inch round on a well-floured surface. The rolled-out roti should have the feel of a damp washcloth. (If it doesn't, then the dough hasn't set long enough. Punch the round back into a ball and let rest for an additional 15 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a flat iron griddle or skillet with 1 to 2 tablespoons of the oil or ghee. Place over high heat until a drop of water sizzles when dropped in the pan. Reduce the heat to medium high and place the dough on the griddle or skillet. Moving from the edges of the roti inward, spread 1 teaspoon of the melted ghee onto the dough, rubbing the oil in with the back of a wooden spoon. The dough will begin to bubble and release steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 1 minute, turn the roti over and cook the other side for about 1 additional minute. The finished roti will be floppy, and a light golden color. Place on a warm platter and cover with a towel. Repeat with remaining three dough balls, adding additional ghee to the pan as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make a roti sandwich, place the bread on a plate and add a generous portion of filling (each recipe below divides equally into 4 rotis) to the middle. Fold up the top and bottom ends of the bread till they meet, then fold up the two side flaps to form a square envelope. Serve immediately."}]}