{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp And Potato Curry Roti Filling", "description": "The <a href=\"https://cooking.nytimes.com/recipes/3352-roti\">roti</a>, the delectable, fat, folded-up curry sandwich that is Indian Trinidad's main contribution to world cuisine, is a thoroughly creole invention that has no equivalent in India. (The word roti, in India, describes a kind of griddle bread.) Trinidad's roti begins with an enormous, almost pizza-sized flat bread that's often layered with a thin coating of powdery ground yellow peas. In Trinidad's top roti shops along El Socorro and the Eastern Main Road, the bread is slapped on the griddle when you order; you can watch it hiss and bubble as you wait. Then it's tucked like a blanket around a meat, fish or vegetable curry, wrapped in wax paper and foil, and the hot square package placed in a paper bag with a stack of napkins.", "author": {"@type": "Person", "name": "Daisann Mclane"}, "image": null, "totalTime": "PT2H", "recipeYield": "Filling for 4 rotis", "recipeCuisine": "caribbean, indian", "recipeCategory": "", "keywords": "garlic, potato, shrimp, gluten-free, nut-free, vegetarian, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 350, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "31 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1137 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 to 2 pounds medium shrimp", "Juice of one lime", "1 tablespoon chopped coriander stems or shadowbene (Trinidadian chives)", "2 tablespoons vegetable oil or ghee", "2 large onions, chopped", "10 cloves garlic, peeled, mashed and chopped", "2 1/2 tablespoons Trinidadian or Guyanese curry powder (preferably Turban, Indi or Chief brand)", "1 pound potatoes, peeled and chopped into 1/2-inch dice", "1/2 yellow Scotch bonnet pepper", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and clean the shrimp, reserving shells. Put the shrimp in a bowl and mix in the lime juice and chopped coriander stems (or shadowbene). Set aside for at least 1/2 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the reserved shrimp shells in a large stockpot and cover with a quart of water. Simmer over medium heat for 1 hour. Strain and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep skillet, heat the oil or ghee over medium high heat and saute the onions, stirring constantly, for 4 to 5 minutes, or until they begin to stick to the pan and turn light brown. Add the garlic and saute for 2 minutes. Add the curry powder and stir for 1 minute, taking care not to burn the spice. Add the chopped potatoes, stirring to coat with the curry-onion-garlic mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the Scotch bonnet pepper and 2 cups of the shrimp stock. Stir and bring to a simmer. Cover, and simmer slowly for about 40 to 45 minutes, or until the potatoes soften and begin to thicken the sauce. (If the mixture becomes too dry, add additional shrimp stock.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the marinated shrimps. Cook, uncovered, over medium heat for 10 minutes. Add salt to taste. Let cool a few minutes before adding to roti."}], "link": "https://cooking.nytimes.com/recipes/3354-shrimp-and-potato-curry-roti-filling"}