{"@context": "http://schema.org", "@type": "Recipe", "name": "Channa (Curried Chickpea Filling for Roti)", "description": "The <a href=\"https://cooking.nytimes.com/recipes/3352-roti\">roti</a>, the delectable, fat, folded-up curry sandwich that is Indian Trinidad's main contribution to world cuisine, is a thoroughly creole invention that has no equivalent in India. (The word roti, in India, describes a kind of griddle bread.) Trinidad's roti begins with an enormous, almost pizza-sized flat bread that's often layered with a thin coating of powdery ground yellow peas. In Trinidad's top roti shops along El Socorro and the Eastern Main Road, the bread is slapped on the griddle when you order; you can watch it hiss and bubble as you wait. Then it's tucked like a blanket around a meat, fish or vegetable curry, wrapped in wax paper and foil, and the hot square package placed in a paper bag with a stack of napkins.", "author": {"@type": "Person", "name": "Daisann Mclane"}, "image": null, "totalTime": "PT45M", "recipeYield": "Filling for 4 rotis", "recipeCuisine": "caribbean, indian", "recipeCategory": "", "keywords": "chickpea, curry powder, onion, gluten-free, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["1 tablespoon vegetable oil or ghee", "2 large onions, chopped", "4 to 5 cloves garlic, peeled and chopped", "1 tablespoon curry powder (preferably Turban or Indi brand)", "1 heaping teaspoon amchar powder (available in West Indian markets, such as Kalpana Indian and International Groceries at 2528 Broadway in Manhattan)", "1 16-ounce can chickpeas, drained and rinsed well", "1/2 Scotch bonnet pepper", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil or ghee in a skillet and saute the onions over medium high heat, stirring constantly, for about 6 minutes, or until they are golden brown. When the onions are almost done, add the garlic and saute 2 minutes more. Add the curry and amchar powders and stir for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the onion mixture to a cast iron or other heavy pot and add the chickpeas. Stir over medium heat until chickpeas are coated with the spices and onions. Add 1 cup of water, the Scotch bonnet pepper and salt to taste; stir. Bring to a simmer, cover and let simmer over low heat for 1/2 hour. (If the mixture dries out, add a little more water; the finished channa should be slightly thicker than a thick bean soup.) Let cool for a few minutes before adding to the roti."}], "link": "https://cooking.nytimes.com/recipes/3355-channa-curried-chickpea-filling-for-roti"}