{"@context": "http://schema.org", "@type": "Recipe", "name": "Alfredo Viazzi's Spaghettini Cacio e Pepe", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "butter, cheese, spaghettini, main course, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 909, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "86 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "14 grams", "proteinContent": "30 grams", "saturatedFatContent": "30 grams", "sodiumContent": "516 milligrams", "sugarContent": "1 gram", "transFatContent": "2 grams"}, "recipeIngredient": ["1 pound caciotta cheese, preferably rather dry (see note)", "1 1/2 sticks (6 ounces) unsalted butter", "1 tablespoon black peppercorns", "1 dozen or more fresh basil leaves", "1 tablespoon salt", "1 tablespoon cooking oil if needed", "1 1/2 pounds spaghettini, preferably whole wheat, or other thin pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the largest holes of a grater, grate the cheese. (This may also be done with a Cuisinart, using a rapid on-off motion, but be careful not to puree or process the cheese.) The grated cheese should be pelletlike in consistency. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rolling pin and a wooden chopping board, crack the peppercorns as you would in making steak au poivre. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 6 quarts of water to a rapid rolling boil. While waiting for the water to boil, wash and dry the basil leaves and cut into thin ribbons. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, add salt and, if you are using whole- wheat pasta, a tablespoon of cooking oil to prevent it from sticking. Add pasta to rapidly boiling water and stir with a long-handled wooden spoon or fork to separate the pasta and bring the water rapidly back to a boil. Leave to cook at a rapid boil for 5 to 7 minutes, adjusting cooking time according to the type of pasta you are using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pasta is cooking, melt the butter in a small saucepan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have ready a warm serving bowl and when the pasta is done, drain quickly and turn into the bowl. Add the melted butter and toss thoroughly. Add the grated cheese and toss with the pasta. Finally add the cracked pepper and mix again. Serve immediately on warm plates and sprinkle each serving with the ribbons of basil."}]}