{"@context": "http://schema.org", "@type": "Recipe", "name": "Piquant Spaghetti With Peppers, Onion And Tomato Sauce", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "bell pepper, spaghetti, tomato, main course, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 438, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "771 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extravirgin olive oil", "3 large onions, thinly sliced", "3 cups canned Italian imported tomatoes, drained, or 1 1/2 to 2 pounds very ripe plum tomatoes, seeded and chopped", "4 medium size sweet red or green peppers, seeded and cut into thin 2-inch strips", "1/4 cup chopped fresh basil leaves (or 1 tablespoon dried basil)", "2/3 cup pitted Italian or Greek olives, chopped", "1/4 cup capers, drained and chopped if very large", "Salt", "Freshly ground black pepper", "1 pound spaghetti", "Freshly grated Parmesan cheese, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large saucepan or in a flame-proof casserole that will hold all ingredients, including cooked spaghetti, and can go to the table. Add onions and cook over medium heat, stirring constantly, until soft but not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes. If using canned tomatoes, break up with a fork. Cook for 3 minutes. Add peppers and basil and cook over low heat, stirring frequently, for about 15 minutes, or until peppers are almost but not quite tender. Stir in olives and capers, cover and cook for 5 more minutes. Taste and season with salt and pepper if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 quarts of water to a rolling boil and add 1 tablespoon salt. When water reboils, add pasta and stir vigorously with a long-handled wooden spoon or fork to separate pasta strands and bring water quickly back to a boil. Cook until pasta is al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain pasta and turn into the casserole with the sauce. Toss to mix and serve immediately, passing the Parmesan separately if desired."}]}