{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Cake", "description": "", "author": {"@type": "Person", "name": "William Grimes"}, "image": null, "totalTime": "PT1H", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, eggs, pear, dessert, fall, winter, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "recipeIngredient": ["2 tablespoons butter, plus additional butter for the pan", "1/2 cup dry, fine, unflavored bread crumbs", "2 eggs", "1/4 cup milk", "1 cup granulated sugar", "Tiny pinch salt", "1 1/2 cups flour", "2 pounds ripe pears"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Grease a 9-inch-round layer-cake pan with butter and sprinkle with the bread crumbs. Turn the pan upside down and tap it or shake it lightly to get rid of all the loose crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, beat together the eggs and milk. Add the sugar and salt and continue beating until well combined. Add the flour, mixing thoroughly with the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the pears, slice in half and scoop out the seeds and core. Cut lengthwise into thin slices. Add to the bowl, mixing them well with the other ingredients; the batter will be very thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the batter into the pan, leveling it off with the back of a spoon or a spatula. Dot the surface with the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake in the top rack of the preheated oven for 45 minutes, or until the top is lightly golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove it from the pan as soon as it is cool and firm enough to handle. It may be served lukewarm or cold."}]}