{"@context": "http://schema.org", "@type": "Recipe", "name": "Harvest Foccacia", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "Four to six servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "all-purpose flour, raisins, red grapes, appetizer, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 628, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "97 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "7 grams", "proteinContent": "17 grams", "saturatedFatContent": "4 grams", "sodiumContent": "571 milligrams", "sugarContent": "27 grams", "transFatContent": null}, "recipeIngredient": ["2 cups milk", "2 packages active dry yeast", "1 tablespoon sugar", "1 cup all-purpose flour", "1/4 cup olive oil", "2 tablespoons chopped fresh rosemary", "1 cup seedless red grapes, halved", "1 cup golden raisins", "2 tablespoons grated lemon zest", "2 3/4 cups all-purpose flour, plus additional for kneading", "2 1/2 teaspoons salt", "3 tablespoons olive oil", "Cornmeal for pans", "1 egg yolk", "1 teaspoon salt", "1 tablespoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sponge, warm the milk slightly. Place in a bowl and whisk in the yeast until dissolved. Whisk in the sugar and flour. Cover with plastic wrap and set aside in a warm place until bubbly and doubled in bulk, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the fruit, heat the olive oil in a small saucepan over low heat. Add the chopped rosemary and cook just until it begins to crackle. Remove from heat and stir in the grapes, raisins and lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough, stir the flour, salt and 2 tablespoons of the olive oil into the sponge. Stir in half of the fruit mixture; the dough will be wet and slack. Heavily flour the dough, a work surface and your hands, turn the dough out and knead until smooth and elastic; the dough should still be very soft. Place in a lightly oiled bowl, cover with plastic and let rise until doubled in bulk, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle 2 baking sheets lightly with cornmeal. Punch the dough down and divide it in half. Sprinkle a work surface and the dough with flour and shape each half into a round. Roll each into a 10-inch circle and place on the prepared baking sheets. Brush with the remaining tablespoon of olive oil, cover loosely with a kitchen towel and let rise until doubled in bulk, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Polk the dough all over with your fingertips. Bake for 25 minutes. Remove the breads from the oven and lower the temperature to 360 degrees. Brush the tops of the breads with the egg yolk and divide the remaining fruit mixture between them. Sprinkle with the remaining salt and sugar. Bake until golden brown, about 10 minutes longer. Remove from the oven and let cool before serving."}], "link": "https://cooking.nytimes.com/recipes/3429-harvest-foccacia"}