{"@context": "http://schema.org", "@type": "Recipe", "name": "Seafood And Pasta Salad", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT40M", "recipeYield": "Forty servings", "recipeCuisine": "", "recipeCategory": "pastas, salads and dressings", "keywords": "dairy-free, nut-free, vegetarian, herbs, pasta, shellfish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 204, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "371 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds creste di gallo, small penne or bow-tie pasta", "2 cups, plus 2 tablespoons, extra-virgin olive oil", "4 pounds mussels", "1 cup dry white wine", "1 1/2 pounds sea scallops", "1 1/2 pounds medium shrimp, shelled", "2 cups shellfish cooking juices (from above)", "2 quarts mixed fresh herbs (basil, parsley, chives and tarragon), stemmed and lightly packed", "1/2 cup Dijon mustard", "1/4 cup red-wine vinegar", "1 cup commercial mayonnaise or 2 egg yolks (see note)", "1 tablespoon Tabasco sauce", "1 1/2 tablespoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 10 quarts of water in a large stockpot and bring to a rolling boil. Add the pasta and bring the water back to a boil (this will take about 5 minutes). Cook the pasta until done to your liking, but take care not to undercook it. Drain in a colander and cool under a spray of cold water. Drain again and toss in a container with 2 tablespoons of the olive oil. Cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the mussels carefully under cool water and place them in a large pot with the wine. Cover, bring to a boil and cook, covered, for 5 minutes, shaking the pan occasionally, until all the mussels have opened. Drain, reserving the cooking juices (about 1 1/2 cups) in a bowl. When cool enough to handle, shell the mussels, removing and discarding any beards. Set the mussels aside. Return the cooking juices to the saucepan, pouring them in slowly to avoid adding any sandy residue from the bottom of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the scallops and cut them into 1/2-inch pieces. Cut each of the shrimp into 3 pieces. Add the scallops and shrimp to the saucepan containing the mussel cooking juices and bring to a boil. Remove from the heat and drain, again reserving the juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the scallops, shrimp and mussels. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the herb sauce, place 1 cup of the reserved cooking juices and the herbs in the bowl of a food processor and process until pureed. Add the mustard, vinegar, mayonnaise or egg yolks, Tabasco and salt. Process until well mixed. With the machine running, add the remaining 2 cups of olive oil. Transfer the mixture to a large bowl and stir in the remaining 1 1/2 cups of shellfish cooking juices (adjust with water if necessary). The pasta, shellfish and sauce can all be prepared a day ahead and refrigerated until ready to assemble."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the pasta, shellfish and herb sauce. Mix well. To serve, arrange on large platters or in bowls for serving as part of a buffet."}]}