{"@context": "http://schema.org", "@type": "Recipe", "name": "Cod in Pacific Rim Glaze", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy", "keywords": "cod, garlic, ginger root, dairy-free, low calorie, low-fat, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 290, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "40 grams", "saturatedFatContent": "1 gram", "sodiumContent": "714 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["4 cloves garlic, crushed, peeled and cut into medium pieces", "2 ounces fresh ginger root, peeled and cut across the grain in thin slices", "1 fresh jalapeno, cut in half, seeded, deveined and cut into medium pieces", "2 tablespoons soy sauce, preferably tamari", "2 tablespoons mirin", "3 tablespoons dark corn syrup", "1/4 cup rice-wine vinegar", "1 tablespoon olive oil", "1 cod fillet, 1 3/4 to 2 pounds (1 3/4 inches at thickest point), at room temperature", "3/4 cup water, wine or fish stock", "1/2 bunch fresh cilantro, washed well, with leaves removed from half and other half left in sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put rack in center of oven. Heat oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put garlic, ginger and jalapeno in a blender. Add soy sauce and mirin. Blend to a smooth puree. Scrape down sides of blender with a rubber spatula. Add syrup and vinegar. Blend until smooth. Using the spatula, scrape into a small bowl. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour olive oil into a roasting pan 18 by 12 by 2 inches. Using your hands, rub the oil all over the bottom of the pan and up the sides. Put the fillet in the pan. Pour half the sauce over the fillet; rub into all parts of the fillet. Turn fillet over, pour on remaining sauce and rub in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange fillet in pan with the side that was attached to the skin facing up. Fillet should touch sides of pan as little as possible; put on the diagonal if necessary. (Use a larger pan if doubling recipe.) Cook 17 minutes, checking after 12 minutes to see if there is liquid left in pan. If not, add 1/3 cup warm water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using two very large spatulas, transfer fillet to serving platter. Put the roasting pan on top of the stove over medium-high heat. Add 3/4 cup water, wine or fish stock to the pan. As it begins to bubble, scrape the bottom of the pan with a wooden spoon. Scrape up all the dark crispy bits. Reduce liquid by half, to use as a sauce with the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour sauce over fish on serving platter. Decorate top of fish with cilantro leaves. Arrange sprigs around sides of platter."}], "link": "https://cooking.nytimes.com/recipes/3443-cod-in-pacific-rim-glaze"}