{"@context": "http://schema.org", "@type": "Recipe", "name": "Brook Trout Meuniere With Ginger Stuffing", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "ginger root, shrimp, trout, main course, nut-free", "aggregateRating": null, "recipeIngredient": ["1/4 pound shrimp, peeled, deveined and cut into small pieces", "1/4 cup heavy cream", "1 tablespoon grated fresh ginger", "1 tablespoon chopped shallots", "Dash Tabasco", "Salt and freshly ground white pepper to taste", "4 brook trout (about 1/2 pound each when cleaned), bones removed but with heads left on", "1/4 cup milk", "4 tablespoons flour for dredging", "2 tablespoons vegetable oil", "4 tablespoons butter", "1 tablespoon fresh lemon juice", "4 slices lemon", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shrimp, cream, ginger, shallots, Tabasco, salt and pepper in the bowl of a food processor. Process until the mixture is smooth and thick. This should take 30 to 40 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the trout, divide the stuffing into four equal portions, and spread the mixture evenly on one side of the open trout. Fold over the other side to enclose the stuffing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the milk onto a shallow platter, and mix the flour with salt and pepper in a flat dish. Dip each trout in the milk, shaking off any excess, and dredge each in the flour mixture, patting it to be sure the flour adheres."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a nonstick skillet large enough to hold the trout in one layer without crowding. Add the trout, and brown thoroughly on one side. Then turn the trout with a spatula, and brown the other side. The process should take about 4 minutes per side. While the fish are browning on the second side, baste the tops with hot oil from the pan to prevent the trout from drying out. When the fish are done, transfer them to a warm platter, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pan with a paper towel, and return it to medium heat. Melt the butter, and cook until it is hazelnut in color. Stir in the lemon juice. Pour the butter mixture in equal portions over the trout. Garnish with the lemon slices, and sprinkle the parsley over all. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/3466-brook-trout-meuniere-with-ginger-stuffing"}