{"@context": "http://schema.org", "@type": "Recipe", "name": "Lettuce Leaves Stuffed With Fish and Shrimp", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 - 6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "flounder, lettuce, shellfish, gluten-free, nut-free, vegetarian, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "11 grams", "sodiumContent": "740 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound spinach in bulk or 10-ounce package", "12 large Boston lettuce leaves", "16 littleneck clams", "1/2 cup dry white wine", "1/2 pound skinless, boneless fillet of flounder or sole", "1/2 pound very small shrimp, about 36, peeled and deveined", "4 tablespoons butter plus butter for greasing pan", "1 teaspoon finely chopped scallions", "1 teaspoon finely minced garlic", "Salt, if desired, and freshly ground pepper to taste", "2/3 cup fish stock", "6 tablespoons heavy cream", "1/4 cup peeled white turnip cut into julienne strips", "1/2 cup celery rib cut into julienne strips 2 inches long", "1/2 cup scraped carrot cut into julienne strips 2 inches long"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over spinach to remove tough stems and blemished leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring quantity of water to boil and add spinach. Cook, stirring occasionally, 2 minutes. Drain well and when cool enough to handle squeeze to remove excess liquid. There should be slightly less than 1/2 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop lettuce leaves into boiling water and stir down gently until all are immersed. Let simmer minute or two or until leaves are wilted. Drain. Arrange on kitchen towel to dry briefly. Cut away small portion of tough center section at stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put clams into small saucepan and add wine. Cover and bring to boil. Let simmer until clams are opened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut fish fillet lengthwise in half. Lightly score on each side using sharp knife. Cut halves diagonally into one-inch-wide pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut shrimp in half crosswise. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons butter in skillet and add scallions and garlic. Cook briefly, stirring, without browning. Add fish and shrimp and cook, stirring gently. Sprinkle with salt and pepper and cook 3 minutes. Remove from heat. Remove 5 clams from shells and add to fish and shrimp. Leave remaining clams on half shell and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put spinach in food processor or blender and add 1/4 cup of fish stock. Blend thoroughly. Add remaining stock and 1/4 cup of cream and blend. Pour mixture into saucepan and add remaining cream. Bring to boil. Add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open lettuce leaves and fill centers with fish mixture. Fold leaves over gently to make neat packages."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter baking dish large enough to hold packages in one layer. Arrange close together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 2 tablespoons butter in skillet and add turnip, celery and carrot. Cover and cook, stirring occasionally, 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour spinach sauce over filled lettuce leaves. Drain julienne vegetable strips and sprinkle over lettuce leaves. Arrange clams on half shell on top, shell side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the dish with foil and bake until heated through, 10 to 15 minutes. Do not overcook or fish and seafood will dry out."}], "link": "https://cooking.nytimes.com/recipes/3479-lettuce-leaves-stuffed-with-fish-and-shrimp"}