{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Almonds and Eggs, Penaflor Style", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "almonds, chicken, egg yolks, dairy-free, main course", "aggregateRating": null, "recipeIngredient": ["1 chicken, 3 pounds cleaned weight", "Salt, if desired, and freshly ground pepper to taste", "Flour for dredging", "1 1/2 cups olive oil", "3 whole cloves garlic, peeled", "3 sprigs fresh parsley", "1 1/2 cups rich chicken broth", "1 hard-cooked egg yolk", "2 raw egg yolks", "30 blanched toasted almonds", "1 tablespoon finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut chicken into following: 2 thighs, 2 main wing joints, 2 second wing joints and breast into 4 pieces. (Save rest of chicken for other uses.) Sprinkle with salt and pepper and dredge in flour. Shake off excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in large skillet almost to smoking point and add garlic. Cook, stirring, until garlic is golden brown. Remove and reserve garlic. Reduce heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken pieces and cook, turning so that pieces brown evenly, about 8 minutes. As pieces brown transfer to heatproof casserole. Add parsley sprigs to skillet and cook briefly. Remove and reserve parsley sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line bowl with fine sieve and pour hot fat into it. Save any crisp bits and add to chicken. Add 1 tablespoon of oil to chicken. Bring broth to boil and pour over chicken. Bring to boil and let simmer gently 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crush garlic, parsley sprigs and hard-cooked egg yolk to a paste. This should be done with mortar and pestle but can be done in electric blender. Scoop 2 tablespoons of broth from around simmering chicken. If blender is used, add while blending garlic mixture. If mortar and pestle are used, add to paste and blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put raw egg yolks in small bowl and start beating. Add 2 tablespoons of hot broth from simmering chicken. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour garlic mixture into sauce around chicken. Pour in raw egg yolk mixture and cook over very low heat, shaking casserole and stirring. Take special care not to let sauce boil or it will curdle. Let simmer only until yolks thicken sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put almonds into food processor or blender and blend to coarse meal. Take care not to overblend. Sprinkle almonds and chopped parsley over chicken and serve."}]}