{"@context": "http://schema.org", "@type": "Recipe", "name": "Oustau De De Baumaniere's Lobster With Ratatouille", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "eggplant, lobster, zucchini, gluten-free, nut-free, vegetarian, main course", "aggregateRating": null, "recipeIngredient": ["2 small zucchini", "2 medium eggplants (about 2 pounds)", "2 onions", "1 red pepper", "2 ripe tomatoes, quartered, or 1 pound can of plum tomatoes, drained and chopped", "4 tablespoons virgin olive oil", "Handful of mixed fresh herbs, preferably basil, chervil, thyme, and flat-leaf parsley, minced", "1 garlic clove, minced", "Pinch of sugar", "Salt and freshly ground pepper to taste", "4 1-pound chicken lobsters", "2 shallots", "1 carrot", "6 tablespoons virgin olive oil", "1 cup white wine", "2 cups fish stock", "2 fresh tomatoes, peeled and seeded", "1 tarragon branch", "2 cups heavy cream", "1 tablespoon unsalted butter", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the ratatouille, dice separately the zucchini, eggplants, onions and the red pepper in quarter-inch cubes. Peel, remove seeds and chop the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy skillet, saute separately the zucchini, eggplant, onions and pepper, using a tablespoon of olive oil for each vegetable. Combine, with the tomatoes, a garlic clove and the fresh herbs. Season with salt and pepper to taste, let simmer a half hour until the liquid evaporates. Adjust seasoning, adding a speck of sugar if needed. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the lobster: On a butcher block, twist the tail of the live lobsters at the top of the body, bend in two, removing the little green pocket found at the bottom of the head containing the green sac which is the roe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the roe in a pan and heat it in the oven until it turns red, about three minutes. Remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely dice the shallots and carrot and saute with the lobster claws, tail (which has been sliced crosswise), and simmer in very hot olive oil in a large skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the end of a few minutes, the lobster shell will take on a bright red color. Add the white wine, one cup of the fish stock and the fresh tomatoes. Let cook, uncovered, about four to five minutes for the tail and seven to eight minutes for the claws. When cool enough to handle remove the lobster meat from the tail and claws and reserve. Crush the shells and add them to the sauce. Add the tarragon and cream and simmer for a few minutes until slightly thickened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the coral with the tablespoon of butter. Add this to the sauce and mix. Remove shell. Strain the sauce through a fine chinoise or other strainer and adjust the seasoning. Reheat the lobster meat in the extra cup of fish stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With two soup spoons, make small quenelles of ratatouille that you will place on the plate. Cut the lobster tail into medallions and place with the claw meat on the plate. Spoon the sauce over the medallions and serve."}], "link": "https://cooking.nytimes.com/recipes/3495-oustau-de-de-baumanieres-lobster-with-ratatouille"}