{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H", "recipeYield": "about 1 pound", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "all-purpose flour, eggs, dairy-free, nut-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 268, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "218 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups flour, approximately", "Salt to taste if desired", "4 eggs, about 1 cup", "1 tablespoon water, approximately"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 1/2 cups of the flour and the salt onto a flat surface. Make a well in the center of the flour, and add the eggs. Blend with the fingers, working the flour gradually into the eggs. Add up to 1/2 cup more flour to make a very stiff, kneadable dough. Add a small amount of water as necessary. Knead for about 10 minutes. Shape the dough into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the dough in plastic wrap or wax paper, and chill for 30 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dough, and cut it in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour the work surface. Roll the dough out as thinly as possible into a rectangle or, preferably, put it through the flat rollers of a ravioli machine. If the machine is used, start rolling with the largest opening of the rollers, gradually decreasing the size of the opening."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the dough over itself and roll it out again into a very large thin rectangle. Or, preferably, fold the dough over itself and put it through the flat rollers of the ravioli machine. Put the dough through each setting about four or five times. Do not use the setting for the thinnest sheet of pasta. Use the next-to-the-last setting for the final pass-through. If you use the ravioli machine, turn the dough once it is folded before putting it through the rollers. Lightly flour the surface of the dough as you work. When the first half of the dough is rolled out and ready to fill, it should measure about 4 1/2 by 6 inches. When finished, arrange the sheet of dough on kitchen toweling until ready to fill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the rolling out with the second half of the dough. At this point you must assemble the tortelloni quickly to prevent the layers of dough from drying out."}], "link": "https://cooking.nytimes.com/recipes/3504-pasta"}