{"@context": "http://schema.org", "@type": "Recipe", "name": "Composed Salad With Green Olive and Garlic Vinaigrette", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "artichoke, chicory, zucchini, dairy-free, nut-free, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "13 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1232 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 artichokes", "1 lemon, halved", "4 medium zucchini, cut into 1/4-inch rounds", "16 cups stemmed chicory", "1/2 teaspoon olive oil", "4 red bell peppers, roasted, peeled, seeded and cut into 1/4 inch strips", "12 1/4-inch slices baguette, toasted", "1/2 cup pitted and chopped green olives", "4 cloves garlic, peeled and minced", "2 tablespoons plus 2 teaspoons fresh lemon juice", "2 tablespoons plus 2 teaspoons olive oil", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salad, cut the stems off the artichokes so they will stand straight. Remove the tough outer leaves and cut 1 1/2 inches off the top of each artichoke. Rub all surfaces with the lemon halves. Bring a large pot of water to the boil. Place the artichokes in a steamer basket and steam until the bottoms are tender when pierced with a knife, about 30 minutes. Set the artichokes aside and reserve 1/2 cup of the steaming liquid. When the artichokes are cool enough to handle, scoop out the choke."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler. Place the zucchini slices on a baking sheet and broil just until the tops are browned, about 1 minute. Set aside. Wash but do not dry the chicory. Heat the olive oil in a large skillet over medium-high heat. Add the chicory, toss for a few seconds, cover with a lid and immediately remove from the heat. Let stand for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the vinaigrette, whisk together the olives, garlic, lemon juice and olive oil in a small bowl. Whisk in the reserved artichoke steaming liquid. Season with salt and pepper. Divide the chicory among 4 large plates, mounding it in the center of each. Arrange the artichokes, zucchini and red peppers around the chicory. Spoon the vinaigrette over all, place 3 toast slices on each plate and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/3510-composed-salad-with-green-olive-and-garlic-vinaigrette"}