{"@context": "http://schema.org", "@type": "Recipe", "name": "Marinated Lamb Chops With Fennel And Black Olives", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Four servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, nut-free, fennel, lamb chops, olives, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1107, "unsaturatedFatContent": "51 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "94 grams", "fiberContent": "4 grams", "proteinContent": "38 grams", "saturatedFatContent": "37 grams", "sodiumContent": "1264 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup olive oil", "2 large cloves garlic, peeled and minced", "1/2 teaspoon freshly ground black pepper, plus more to taste", "8 rib lamb chops, bones scraped of fat", "2 medium fennel bulbs, tops removed and finely chopped, bulbs very finely shaved", "1 cup white wine", "2 cups chicken broth, homemade or low-sodium canned", "2 tablespoons pitted and chopped Nyons olives", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the olive oil, garlic and pepper in a shallow baking dish large enough to hold the lamb chops. Place the lamb chops in the dish and coat well with the marinade. Cover and refrigerate overnight. Let stand at room temperature for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the oil off the lamb chops. Heat a large, nonstick skillet over medium-high heat, add the chops and sear until medium rare, about 30 seconds per side. Remove the chops from the skillet and wrap in foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to very low. Add the shaved fennel, cover the skillet with a lid and cook until the fennel is soft, about 20 minutes. Remove the fennel from the skillet with a slotted spatula and divide among 4 warmed plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat and add the white wine and chicken broth. Cook, stirring occasionally, until reduced to 1/2 cup, about 15 minutes. Stir in the olives and season with salt and pepper to taste. Place 2 lamb chops over the fennel on each plate, spoon the sauce over the top, sprinkle with the fennel tops and serve immediately."}]}