{"@context": "http://schema.org", "@type": "Recipe", "name": "John Martin Taylor's Shrimp Perloo", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H25M", "recipeYield": "Six servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, nut-free, long-grain rice, shrimp, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 476, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "32 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1698 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds very fresh, heads-on medium shrimp (see note below)", "2 small carrots", "2 celery stalks", "3 tablespoons chopped fresh thyme (or 1 1/2 teaspoon dried thyme)", "1 medium onion", "3 quarts water", "4 thick slices of bacon", "1 large onion chopped", "4 red, ripe tomatoes (about 1 1/2 pounds), peeled, seeded and chopped, or four well-drained canned tomatoes", "1/2 teaspoon crushed red pepper", "3 tablespoons fresh parsley, finely chopped, plus additional chopped parsley for garnish", "2 cups long-grain rice", "1 teaspoon salt, or to taste", "3 cups hot shrimp stock (see above)", "shrimp bodies from two pounds of heads-on shrimp (see above) or one and a half pounds of headless shrimp"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the stock:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the shrimp, breaking off the heads. Place heads and shells in an enamel or stainless steel stockpot. Place the bodies in a bowl, cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly chop the carrots and celery and add to shrimp shells. Add thyme. Peel and quarter the onion and add to stockpot. Add water and bring to a boil. Reduce heat to low and cook stock uncovered at a steady simmer for about 45 minutes, or until vegetables are soft and stock has been reduced by about one-third. (The stockpot may be covered if the stock appears to be reducing too much.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and strain through cheesecloth or a fine-mesh sieve. Discard the solids. You will need three cups of shrimp stock for the perloo. Freeze the rest."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the perloo:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven with a tight-fitting lid, saute the bacon over medium-low heat until crisp. Remove bacon, set aside to drain and pour off all but about three tablespoons of bacon grease - enough to cover the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chopped onion to bacon grease and saute over medium-low heat 5 to 10 minutes, until onion is transparent. Add tomatoes, red pepper and parsley, stir to mix well and cook another five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice, salt and shrimp stock, raise heat slightly just to bring the stock to a simmer, then lower heat, cover pot and leave to simmer 20 minutes. Do not remove lid while cooking rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 20 minutes, lift the lid and fluff the rice with a big fork while tossing in the shrimp. Cover the pot again and turn off the heat. The perloo will be ready in 5 to 10 minutes and the shrimp will not overcook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble reserved bacon and sprinkle over the top of the perloo with the additional chopped parsley. Serve immediately."}]}], "link": "https://cooking.nytimes.com/recipes/3543-john-martin-taylors-shrimp-perloo"}