{"@context": "http://schema.org", "@type": "Recipe", "name": "John Martin Taylor's Huguenot Torte", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "Six to eight servings", "recipeCuisine": "french, southern", "recipeCategory": "", "keywords": "dessert, pecans, tart apples, walnut, vegetarian", "aggregateRating": null, "recipeIngredient": ["2 cups chopped nuts, pecans and walnuts in combination", "2 good-sized tart, firm apples", "4 eggs plus one yolk, at room temperature", "1 and 3/4 cups sugar", "3/4 cup all-purpose flour", "A little butter and flour for preparing the cake pans", "1/2 pint whipping cream", "Toasted pecans or walnuts for garnishing, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Butter two nine-inch cake pans. Cut circles of parchment paper for the bottom of each one, place in the bottom and butter again. Sprinkle a little flour in each pan and shake to coat bottom and sides thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the nuts to a fine meal or place in a food processor and process in short bursts. Do not overprocess; the nuts will become oily."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and core the apples and mince. (Measure and use one and three quarter cups of chopped apples.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs and the egg yolk in a bowl for about five minutes or until the eggs have expanded greatly in volume. Continue beating and add the sugar, little by little, beating well after each addition. When all the sugar has been incorporated, beat an additional two to three minutes, until the eggs are very thick and have turned a pale cream color. Sift the flour over the eggs and sprinkle the chopped nuts and apples over the flour. Using a spatula, quickly turn and fold the mixture together. The batter should be thoroughly mixed: use your spatula to reach down to the bottom of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter between the two cake pans and place them in a preheated oven. Bake for approximately 35 minutes or until tops are brown and edges have started to pull away. Remove from oven and place on a rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When they are thoroughly cool, invert the cakes, remove the paper from the bottoms and turn them right side up again. Beat the whipped cream until it is stiff. Sandwich the cakes with whipped cream and spoon whipped cream over the top. Garnish, if desired, with toasted pecan or walnut halves. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/3547-john-martin-taylors-huguenot-torte"}