{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Rack of Venison With Cranberry Chutney", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "dairy-free, gluten-free, nut-free, dried cranberries, spices, venison, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 259, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "415 milligrams", "sugarContent": "31 grams", "transFatContent": null}, "recipeIngredient": ["2 cups dry red wine", "2 cloves garlic, crushed", "1 teaspoon whole black peppercorns, crushed", "2 bay leaves", "Juice of 1 lemon", "2 tablespoons extra-virgin olive oil", "Salt and freshly ground pepper to taste", "1 loin rack of venison, 4 to 5 pounds, with the bones cracked to permit easy carving", "1 cup dried cranberries", "1/2 cup red wine vinegar", "1/2 cup sugar", "1 tablespoon chopped fresh ginger", "1/2 teaspoon Chinese 5-spice powder", "1/2 cup beef broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the wine, garlic, half the peppercorns, the bay leaves, lemon juice, olive oil and salt and pepper to taste in a deep dish that will hold the venison. Place the venison in the bowl, turn it to coat all sides, cover it and refrigerate overnight. Turn the meat a few times while it is marinating."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cranberries in a non-reactive saucepan. Stir in the vinegar, sugar, ginger, five-spice powder and remaining peppercorns. Bring to a simmer and cook slowly, stirring from time to time, about 20 minutes. The cranberries should be soft and there should be enough liquid in the pan just to moisten them. Remove from the heat and set aside until serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About two hours before serving remove the venison from the marinade and place it in a roasting pan so it comes to room temperature. Strain the marinade, place it in a saucepan and cook over high heat until the marinade is reduced to about three-fourths cup. Add the beef broth, cook the mixture down until there is about three-fourths cup, then season with salt and pepper. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Place the venison in the oven and roast it about 12 minutes per pound for medium rare. It should register 120 degrees when an instant-read thermometer is inserted in the thick part of the meat, not touching any bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat from the oven and allow it to stand at room temperature 20 minutes before carving. Warm the dried-cranberry mixture and transfer it to a serving dish. Reheat the sauce made from the marinade. Check the seasonings again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the venison into individual chops. If the butcher has cracked the large bone between the chops, cutting the chops should be extremely easy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the venison moistened with some of the reheated sauce and with the cranberry mixture on the side."}], "link": "https://cooking.nytimes.com/recipes/3599-roast-rack-of-venison-with-cranberry-chutney"}