{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Tenderloin With Pears and Ginger-Beer Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, nut-free, fall, ginger beer, pear, pork tenderloin, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["1 teaspoon vegetable oil", "2 pork tenderloins", "2 teaspoons salt", "Freshly ground pepper to taste", "8 medium-size red-skinned potatoes, quartered", "15 Seckel pears, peeled, stemmed and cored through the bottom", "2 cups ginger beer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Heat the oil over medium-high heat in a flameproof, ovenproof roasting pan. Season the pork with 1 teaspoon of the salt and pepper, and place in the pan. Cook until browned on all sides, about 6 minutes. Remove the pork from the pan and set aside. Add the potatoes to the pan and season with the remaining teaspoon of salt and pepper to taste. Roast for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pears to the pan and roast with the potatoes for 5 minutes longer. Push the potatoes and pears to the edge of the pan and place the pork tenderloins in the center. Roast until the pork is only slightly pink in the center, about 15 minutes. Remove the pork, potatoes and pears from the pan and place the pan over medium heat. Add the ginger beer and cook, stirring and scraping the bottom of the pan. Let reduce to 1/2 cup, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the pork into inch-thick slices. Divide the pork, potatoes and pears among 4 plates and spoon sauce over each. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/3618-pork-tenderloin-with-pears-and-ginger-beer-sauce"}