{"@context": "http://schema.org", "@type": "Recipe", "name": "Poached Poulet With Brown Rice", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "brown rice, chicken, vegetables, dairy-free, gluten-free, nut-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 883, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "4 grams", "proteinContent": "62 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1313 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 chickens (about 3 pounds each, minus neck and gizzard)", "2 large onions (about 1 pound), peeled and cut into 1/4-inch pieces (4 1/2 cups)", "3 carrots (8 ounces), peeled and cut into 1/4-inch pieces (2 cups)", "2 ribs celery (4 ounces), peeled and cut into 1/4-inch pieces (1 1/2 cups)", "3 teaspoons salt", "1 teaspoon dried thyme", "4 bay leaves", "2 teaspoons black peppercorns", "1 1/4 cups brown short-grain rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chickens breast side down and side by side in a pot just large enough to hold them snugly. Add the onions, carrots, celery, 2 teaspoons salt and 9 cups of cold tap water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the thyme, bay leaves and peppercorns together in a small piece of cheesecloth and tie the ends of the package together securely with string. Add the pouch to the pot containing the chickens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place an overturned ovenproof dinner plate (a little smaller than the cooking pot) on top of the chickens to hold them under the water. Bring the mixture to a boil (it should take 12 to 15 minutes), reduce the heat to low, cover with a lid, and boil the chickens gently for 20 minutes. Turn off the heat and let the chickens remain in the pot, covered, to continue cooking in the residual heat of the stock for 30 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chickens from the stock and place them on a platter. You should have about 12 cups of stock and vegetables remaining. Using a ladle, skim and discard as much or as little of the fat from the surface of the liquid as you like. Set aside 2 cups of the stock and vegetables and leave the remaining 10 cups in the cooking pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chickens are cold enough to handle, remove their skins and separate each chicken into four pieces. Leave on the bones or pull the meat in large chunks from the bones. Place the chicken in a gratin dish and cover it with 2 cups of the reserved stock and vegetables. Cover with plastic wrap and set aside until ready to reheat, or cover with foil and keep warm in a 130-degree oven until the rice is prepared."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the rice: Combine the rice, a teaspoon of salt and the remaining 10 cups of stock and vegetables together in the pot used to cook the chickens. Bring the mixture to a boil, stirring occasionally. When the liquid is boiling, reduce the heat to medium or low, cover with a lid and boil gently for 45 minutes, until the rice is cooked but the mixture is still slightly runny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the rice with pieces of the chicken on top and about 2 tablespoons of rice cooking liquid spooned over each serving."}], "link": "https://cooking.nytimes.com/recipes/3624-poached-poulet-with-brown-rice"}