{"@context": "http://schema.org", "@type": "Recipe", "name": "Jicama Relish In Chilpotle Marinade", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT25M", "recipeYield": "About six cups", "recipeCuisine": "mexican", "recipeCategory": "condiments", "keywords": "chipotle chilies, jicama, vegetables, dairy-free, gluten-free, nut-free, vegan, vegetarian, side dish", "aggregateRating": null, "recipeIngredient": ["1 medium jicama, about 1 pound (see note)", "1 large carrot", "1 medium zucchini", "1 to 3 pickled chilpotle peppers in an adobo sauce with their liquid (see note)", "1 cup finely chopped onion", "4 garlic cloves, peeled and minced", "1 bay leaf", "6 whole black peppercorns", "1/2 cup white vinegar", "1/2 cup water", "1/3 cup olive oil", "2 tablespoons chopped cilantro", "1 teaspoon good-quality dried oregano", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a knife, remove the skin from the jicama. Cut the flesh into half-inch dice. Place in a glass or earthenware bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the carrot. Bring a pot of water to a rolling boil and drop the carrot in. Let the water return to the boil, then remove the carrot and discard the water. When the carrot is cool enough to handle, cut it into half-inch dice. Add to the bowl with the jicama."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrub the zucchini well but do not peel it. Trim, then cut it into half-inch dice and add it to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the chilpotles, reserving the pickling sauce (use one chili for a relatively mild marinade; three will be stinging hot). Cut the chilies open lengthwise and scrape out the seeds (if your fingers are sensitive, you may want to wear rubber gloves). Finely chop the chilies and place them in a separate, medium-sized bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, garlic, bay leaf, peppercorns, vinegar, water, olive oil and cilantro to the chilpotle in the bowl. Blend in the reserved chilpotle sauce. Crumble the oregano between your fingers into the bowl. Whisk all the ingredients together, then pour the marinade over the jicama mixture. Toss the vegetables with the marinade to coat them completely. Add salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the relish and refrigerate for at least four hours, preferably overnight. Serve as an accompaniment to grilled meats or fish."}], "link": "https://cooking.nytimes.com/recipes/3631-jicama-relish-in-chilpotle-marinade"}