{"@context": "http://schema.org", "@type": "Recipe", "name": "Zarela Martinez's Ropa Vieja", "description": "Sometimes the most humble ingredients make for the finest of meals, as Regina Schrambling wrote in 1988. Growing up in a tiny Arizona town among many Mexican neighbors, Ms. Schrambling learned early on of the rich flavors that can be coaxed from the simplest food. This ropa vieja, from the chef Zarela Martinez, embodies that philosophy. Garlic and peppercorns infuse a flank steak with flavor, which is then cooked shortly with a mixture of sautéed garlic, onions and poblano peppers. Hot, tucked into a tortilla, it’s a testament to the power of a long cook.", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": "https://static01.nyt.com/images/2014/05/12/dining/Ropa-Vieja/Ropa-Vieja-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "cuban", "recipeCategory": "dinner", "keywords": "dairy-free, nut-free, flank steak, poblano pepper, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 85}, "recipeIngredient": ["3 pounds flank steak", "1 1/2 cups water", "8 cloves garlic (6 whole and peeled, 2 sliced and peeled)", "6 whole black peppercorns", "Salt to taste", "8 fresh poblano peppers", "1/3 cup lard, bacon drippings or vegetable oil", "1 large onion, halved and sliced 1/8-inch thick", "Flour tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the flank steak in half horizontally so it will fit into a large Dutch oven. Place it in the pot and cover it with the water. Add the six whole cloves of garlic, along with the peppercorns and salt as desired. Place over low heat and bring the liquid to a simmer. Cover the Dutch oven and continue cooking over low heat, turning the meat occasionally, until it is tender and well done, about 1 1/2 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the meat is stewing, heat the broiler. Rinse and dry the peppers. Arrange them in a broiler pan about four inches from the flame. Roast them, turning frequently, until they are evenly blistered and charred on all sides. Transfer to a paper bag, seal it and let the peppers sit until cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cooled peppers from the bag and slice off the top of each. Scrape out the seeds and slip off the skins with your fingers (wear rubber gloves if your hands are sensitive). Slice each pepper lengthwise into strips an eighth of an inch wide. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the meat is tender, remove the Dutch oven from the heat and let the meat cool in its own broth. When it cools enough to handle, remove it from the broth and place it on a cutting board. Slice the meat across the grain into strips about two inches across. Using your fingers, pull the meat into fine shreds. Return it to the cooking broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the lard or other fat in a large heavy skillet over medium heat until it is rippling. Crush the sliced garlic cloves and add to the hot fat. Saute for one minute, stirring frequently. Add the sliced onion and saute, stirring frequently, until it is somewhat soft, about three minutes. Add the reserved pepper strips to the pan and continue sauteing and stirring for about two minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer the peppers, onion and garlic to the Dutch oven. Cook the meat mixture, uncovered, over medium heat, stirring frequently, until the flavors are blended, about 10 to 15 minutes. Serve the meat hot, rolled up in heated flour tortillas."}]}