{"@context": "http://schema.org", "@type": "Recipe", "name": "Au Gratin", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 7 cups of mix", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, dairy-free, french baguette, potato, salted cod", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 303, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "289 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound salted codfish", "2 large Idaho potato (about 1 pound)", "8 cloves garlic, peeled", "1 large lemon", "1 1/2 cups hot milk", "1/2 teaspoon freshly ground black pepper", "1/8 teaspoon cayenne pepper", "3/4 cup virgin olive oil, plus oil for dish", "2 baguettes (8 each), cut into about 50 rounds, each about 1/2-inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the cod under cold running water, and place in a large bowl containing about 5 quarts of cold water. Let soak about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, wash the potatoes, place them in a saucepan, and cover them with cold water. Bring to a boil, reduce the heat, and boil the potatoes gently about 45 minutes, until tender. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After two hours, drain the cod and place in a saucepan with 2 quarts of cold water. Bring to a light boil (this will take 10 to 12 minutes), drain immediately, rinse the pot and return the cod to the pot with 1 quart of cold water. Bring to a boil, reduce the heat, and boil gently about 10 minutes. Remove from the heat, cover, and let the cod steep for about 5 minutes. Drain the cod in a colander and transfer it to a plate, removing and discarding any bones or pieces of skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cod and the garlic in the bowl of a food processor and process about 15 seconds, until smooth. Peel the potatoes and cut them into 2-inch pieces. Grate the skin of the lemon (you should have about 1 tablespoon of grated lemon rind), and squeeze the lemon to obtain about 1/4 cup of lemon juice (adding vinegar, if necessary to bring it to this level)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rind, potatoes and hot milk to the cod, and process about 1 minute, until smooth, stopping to clean the mixture off the sides and push it down into the bottom of the bowl midway through the processing. Add the lemon juice, black pepper and cayenne pepper, and process briefly to incorporate. Then, with the machine still running, add the oil slowly and continue processing until the mixture is very smooth. (You should have 6 to 7 cups of the brandade.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a 8-cup gratin dish and transfer the contents of the processor bowl into the dish, spreading it out evenly. Cover with plastic wrap and set aside until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the brandade is still slightly warm at serving time, remove the plastic wrap and place it in the oven for 10 to 15 minutes, until the top is lightly browned and it is hot throughout. If the brandade is cold, increase the cooking time about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the rounds of bread in a single layer on a cookie sheet. Place in a 400-degree oven about 10 minutes or until nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound some of the brandade on each of six individual plates. Serve with the croutons."}]}