{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Scallops On Asparagus", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "asparagus, mushroom, sea scallop, main course, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 277, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "17 grams", "saturatedFatContent": "5 grams", "sodiumContent": "369 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces common mushrooms", "1 1/4 pounds slender asparagus spears, to make 3 1/2 cups when prepared", "2 1/2 teaspoons fragrant mild honey, preferably lavender honey", "2 teaspoons lime juice", "2 scant teaspoons minced fresh tarragon", "1 teaspoon minced fresh thyme", "1 scant tablespoon dark green olive oil", "2 tablespoons light olive oil", "12 large sea scallops, 12 to 14 ounces, halved horizontally", "2 tablespoons seasoned instant flour (see note)", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the mushrooms and combine them in a large, non-reactive saucepan with five cups of water. Simmer gently for about one-and-a-half hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the liquid, pressing to get all possible juice. Discard mushrooms or reserve. Return the liquid to the pan and boil over high heat until reduced to about a half cup. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break off the woody asparagus bottoms and peel the lower third. Remove the heads and halve them the long way, then slice the stems across into coins about one-eighth-inch-thick. Combine the honey, lime juice, tarragon and thyme in a small cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the dark olive oil in a wide, nonreactive skillet over medium-high heat. When it is hot, add the asparagus pieces and stir-fry for one-and-a-half minutes, or just until they start to change color. Stir in the honey mixture and cook one minute more, then remove the asparagus with a slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mushroom essence to the asparagus pan, raise the heat to high and reduce to a generous quarter cup. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Right before serving, put one tablespoon of the light olive oil in a wide, nonstick skillet over medium-high heat. Dust half the scallop pieces with seasoned flour (see note), place them in the pan and add one tablespoon of the butter. Cook the scallops about one-and-a-half minutes per side, basting with the fat. They should be golden, barely cooked. Set aside, uncovered, and repeat with the remaining oil, butter and scallops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the reduced mushroom essence to the scallop pan and bring to a boil, scraping. Stir in the asparagus, plus any escaped juices, and reheat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a nest of the asparagus on each plate and pour the juices over them. Arrange six scallop pieces on each nest and serve at once."}], "link": "https://cooking.nytimes.com/recipes/3677-sea-scallops-on-asparagus"}