{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Smoked Fish", "description": "", "author": {"@type": "Person", "name": "Trish Hall"}, "image": null, "totalTime": "PT12H20M", "recipeYield": "About 1 1/2 pounds smoked fish", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, nut-free, fish, main course", "aggregateRating": null, "recipeIngredient": ["2 fish fillets weighing approximately 1 pound each (bluefish, mackerel, salmon, haddock)", "1 quart liquid brine or 4 table spoons dry cure (<a href=\"http://cooking.nytimes.com/recipes/3682-phillip-schulzs-brine-cure-for-smoked-bluefish\">see recipe</a>)", "4 or 5 hardwood chunks, shavings or sawdust (see note)", "Charcoal, if necessary (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using liquid brine, place the fish fillets in a ceramic, glass or stainless-steel (not aluminum) bowl with the brine. If using dry cure, rub each fillet top and bottom with the dry mixture and place in a ceramic, glass or stainless-steel (not aluminum) baking dish. Cover and refrigerate about 6 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove fillets from bowl or dish and rinse them under running water quickly to remove surface salt. If using dry cure, do not rub off all the seasonings. Place fillets on a cake rack or raised grid surface that allows air to circulate beneath them. Leave to dry about 3 hours, or until a dry shiny surface forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When fillets are sufficiently dry, build a charcoal fire, if necessary (it will take about 30 minutes for the charcoal to reach the desired state). If using wood chunks, let them soak in a bucket of water for half an hour. If using an electric smoker, turn it on just before using and place sawdust or wood shavings in the smoking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place fillets on the smoker grid. Close vents, or place lid on smoker. Regulate vents, if possible, so that heat stays at around 110 to 120 degrees Fahrenheit. Leave the fish 1 to 2 hours or longer, checking periodically and, if possible, replenishing fuel or smoking medium as necessary. The fish will be done more quickly at higher temperatures. At temperatures of 175 to 200 degrees, for example, fish will be done in about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove fillets from smoker when they are dry and yellowish in color. Serve immediately, or refrigerate and serve cold or as an ingredient in other recipes."}], "link": "https://cooking.nytimes.com/recipes/3680-basic-smoked-fish"}