{"@context": "http://schema.org", "@type": "Recipe", "name": "Flaky Sweet Pastry", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Pastry for one large tart", "recipeCuisine": "provencal", "recipeCategory": "", "keywords": "all-purpose flour, butter, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1255, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "116 grams", "cholesterolContent": null, "fatContent": "82 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "51 grams", "sodiumContent": "306 milligrams", "sugarContent": "9 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["1 to 1 1/4 cups all-purpose flour (do not use unbleached)", "7 tablespoons (3 1/2 ounces) unsalted butter, chilled and cut into pieces", "2 teaspoons sugar", "1/8 teaspoon salt", "3 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one cup of flour, the butter, sugar and salt in the bowl of a food processor fitted with a metal blade. Process just until the mixture resembles coarse crumbs, about 10 seconds. Add the water and pulse just until the pastry begins to hold together, about six to eight times. Do not let it form a ball. Turn the pastry out onto waxed paper and flatten the dough into a circle. If the dough is excessively sticky, sprinkle it with several tablespoons of flour. Wrap in waxed paper and refrigerate for at least one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, carefully roll out the dough to a 12-inch circle and transfer the dough to a 10 1/2-inch tart pan, preferably black tin, with a removable bottom. With your fingertips, carefully press the pastry into the pan and up the side, trying not to stretch it. Trim the overhang, leaving about a one-inch edge. Tuck this overhang inside the pan, pressing gently against the side to create a sturdy, double-sided shell. If you build the pastry a bit higher than the height of the pan, you have less problem with shrinkage. Prick the bottom of the shell with the tines of a fork and chill for at least 20 minutes (or up to 24 hours, well wrapped)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the shell loosely with heavy-duty foil, pressing well into the edges so the pastry does not shrink while baking. Fill with weights of rice or dried beans - making sure you get all the way into the edges - to prevent shrinkage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For a partially baked shell, bake just until the pastry begins to brown around the edges and seems firm enough to stand up by itself, about 20 minutes. Remove the foil and weights and continue baking until it is thoroughly, lightly and evenly brown, about 10 more minutes. (For a fully baked shell, bake the pastry for 30 minutes after removing the foil and weights.)"}], "link": "https://cooking.nytimes.com/recipes/370-flaky-sweet-pastry"}