{"@context": "http://schema.org", "@type": "Recipe", "name": "Chopped Liver", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT40M", "recipeYield": "8 to 10 servings", "recipeCuisine": "eastern european, jewish", "recipeCategory": "", "keywords": "appetizer, chicken fat, chicken liver, eggs, dairy-free, gluten-free, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "recipeIngredient": ["5 tablespoons rendered chicken fat (following recipe)", "2 cups sliced onions", "1 pound chicken livers", "3 hard-cooked eggs", "Cracklings left from rendering chicken fat (following recipe)", "Kosher salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt all but one tablespoon of the chicken fat in a large, heavy skillet. Add the onions and saute over medium-low heat until they are golden and just beginning to brown around the edges. Stir the onions frequently so they will cook evenly. Remove the onions from the pan and set aside in a dish, draining as much of the fat as possible back into the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the chicken livers of any connective tissue or membranes and pat them dry with paper towels. Saute the livers in the fat left in the pan over medium heat until they are lightly browned on the outside and no longer pink in the middle. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the livers, including all the pan drippings, with the onions, hard-cooked eggs and cracklings (if you are using them) in a bowl. Finely chop all the ingredients either by hand, by putting them through a meat grinder or by placing them in a food processor and pulsing them briefly to a medium-coarse texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the mixture to taste with salt and pepper and add the remaining tablespoon of chicken fat. Cover and serve within two hours or refrigerate but allow to come to room temperature before serving."}], "link": "https://cooking.nytimes.com/recipes/3700-chopped-liver"}