{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Carrots And Lemon-Thyme Butter", "description": "", "author": {"@type": "Person", "name": "Bryan Miller And Pierre Franey"}, "image": null, "totalTime": "PT1H25M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "carrot, chicken, thyme, gluten-free, nut-free, main course", "aggregateRating": null, "recipeIngredient": ["2 whole chickens, 3 pounds or more each", "8 tablespoons butter, soft", "1/2 cup small celery cubes", "1 cup white onions, chopped", "3/4 cups small carrot cubes", "1 clove garlic, chopped", "1/3 cup white wine", "3 cups chicken broth (fresh or canned)", "1 bay leaf", "3 sprigs fresh thyme (or 1 1/2 teaspoons dried)", "1/4 teaspoon sugar", "1 pound whole large carrots, scraped and sliced into very thin rounds", "Salt and freshly ground black pepper to taste", "Juice of 1 lemon", "1 teaspoon grated lemon zest", "White pepper to taste", "4 cups corn oil for frying", "4 large carrots, peeled -- about 3/4 pound -- cut into long threads (it's best to use a mandoline or some other mechanical vegetable slicer), about 4 cups loosely packed", "4 tablespoons chopped Italian parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove breasts from chickens, skin on, and include the first joint of the wing. (The legs will not be used.) Using a cleaver or heavy knife, hack the remaining carcasses into 1-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of butter in a saucepan over medium-heat until slightly brown. Add the pieces of chicken carcasses and cook, stirring, until well browned, about 10 minutes. Pour off all the fat. Lower heat to medium and add the celery, 1/2 cup of the onions, all the cubed carrots and the garlic. Cook, stirring, for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine. Then add the chicken broth, 1 cup water, bay leaf and 2 sprigs thyme (or 1 teaspoon dried). Bring to a boil, then reduce heat to low. Simmer uncovered for 45 minutes, occasionally skimming fat from the top. Strain. You should have about 1 3/4 cups of chicken broth. Set aside. (This broth can be made in advance and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pan, melt 1 tablespoon of butter over medium heat and add the remaining 1/2 cup of onions and the sugar. Cook the onions, stirring, until wilted, about 2 minutes. Add carrot rounds and chicken broth. Bring to a boil, reduce heat and simmer, covered, for about 10 minutes, or until al dente. Remove from heat and set aside, with cooking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Salt and pepper the chicken breasts. In a large, ovenproof skillet melt 1 tablespoon butter and add the chicken breasts, skin side down. Cook over medium-high heat for about 5 minutes, or until well browned. Flip the chicken. Reduce heat to medium and cook for about 6 minutes more. Remove from heat and place in oven for about 6 more minutes, or until done. Remove the breasts from the skillet and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon butter to the chicken pan juices and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small mixing bowl, make the lemon butter by combining 4 tablespoons of soft butter, lemon juice, leaves from 1 sprig thyme ( 1/2 teaspoon dried), lemon zest, salt and white pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently remove the carrot rounds and set aside, keeping them warm. Stir lemon butter into the cooking liquid from the carrots. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the corn oil in a large pot. Heat to 340 degrees, or until it is just beginning to smoke. Place a handful of carrot threads in the hot oil. Cook for about 30 to 40 seconds. Remove with slotted spoon to paper towels. When the carrots are cool enough to handle, mold into a loose ball. Repeat with the rest of the carrots for a total of four balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the carrot rounds into the middle of 4 large warmed plates. Slice each chicken breast into 3 pieces, on a slight angle, and arrange the slices over the carrot rounds. The wing joint should be facing tip up. Ladle some of the chicken-pan juices over the chicken, and then some of the lemon-butter sauce. Place a deep-fried carrot ball on top of the chicken. Garnish all with parsley leaves and serve."}]}