{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Lasagnas With Monkfish and Shallot Vinaigrette", "description": "", "author": {"@type": "Person", "name": "Bryan Miller And Pierre Franey"}, "image": null, "totalTime": "PT45M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "gluten-free, nut-free, vegetarian, main course, monkfish, potato, shallot", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 556, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "5 grams", "proteinContent": "29 grams", "saturatedFatContent": "13 grams", "sodiumContent": "939 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 large Idaho potatoes (about 1 pound each, skins removed)", "4 6-ounce pieces of center-cut monkfish", "1 1/2 tablespoons olive oil", "Salt and freshly ground pepper", "5 tablespoons clarified butter", "1 tablespoon balsamic vinegar", "3 tablespoons olive oil mixed with 1 tablespoon water", "2 tablespoons chopped chives", "3 teaspoons shallots", "1 cup mixed salad greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each potato into a brick, 3 by 1 3/4 inches. Place in cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the monkfish fillets with the undiluted olive oil and season with salt and pepper. Lay a fillet on the edge of a sheet of aluminum foil. Roll the fillet tightly in the foil to form a cylinder and twist the ends tightly to secure. Repeat with the other fillets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each potato brick into 20 thin slices (roughly 1/8-inch thick). Brush the slices with clarified butter and place on a cookie sheet that has been lined with wax paper and greased with clarified butter. Season well with salt and pepper. Cover tightly with aluminum foil. Place the potatoes on the bottom shelf of the preheated oven. Bake for 12 to 15 minutes (they should still be slightly undercooked). Brush again with clarified butter. Set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil water in the bottom of a steamer. Place the monkfish rolls on the top rack of the steamer. Cover and cook for about 15 minutes, turning the rolls 3 times. Remove from the steamer rack and let sit for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, whisk together the vinaigrette ingredients: balsamic vinegar, olive oil with water, chives, shallots and salt and pepper to taste. Toss well with greens, and taste for seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the dish, unwrap the monkfish fillets. Slice each fillet widthwise into four equal pieces. Lay 1 rectangle of potato on a warm serving plate. Place a slice of fish over it. Lay another potato slice on top, followed by another slice of fish. Repeat until you have 5 potato slices holding 4 layers of fish. Repeat with rest of the potatoes and fish. Garnish with mixed greens tossed in vinaigrette."}], "link": "https://cooking.nytimes.com/recipes/3716-potato-lasagnas-with-monkfish-and-shallot-vinaigrette"}