{"@context": "http://schema.org", "@type": "Recipe", "name": "Fillet of Salmon With Vegetable Bouillon And Littleneck Clams", "description": "", "author": {"@type": "Person", "name": "Bryan Miller And Pierre Franey"}, "image": null, "totalTime": "PT40M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "clams, salmon fillet, vegetables, dairy-free, gluten-free, low calorie, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 599, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "49 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1000 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons olive oil", "3 tablespoons chopped shallots", "2 cloves garlic, peeled", "3/4 cup white wine", "24 littleneck clams, rinsed under cold water", "1/2 cup fennel, chopped", "1/2 cup chopped red onions", "1/2 cup chopped celery", "1/2 cup leeks, trimmed, washed and cubed (the white, and a little of the green)", "2 sprigs fresh thyme (or 1/2 teaspoon dried)", "1 bay leaf", "4 salmon fillets, 6 ounces each, skinless and boneless", "Salt and pepper to taste", "3/4 cup sliced scallions", "4 plum tomatoes, peeled, seeded and diced ( 3/4 cup)", "10 leaves fresh basil, shredded ( 1/3 cup)", "1/3 cup chopped chives", "1 teaspoon balsamic vinegar", "1/2 cup light-colored celery leaves for garnish", "Sea salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot, combine 1 tablespoon of olive oil, 2 tablespoons shallots and 1 garlic clove (sliced thinly) over medium heat. Cook briefly until the shallots are wilted, then add 1/2 cup of white wine and the clams. Cover, bring to a boil, reduce to simmer, and cook for 5 minutes, stirring. As the clams open, remove them immediately with a slotted spoon. Remove meat from the shell and set aside. Strain the broth through a very fine sieve, return to the pan over medium heat and reduce to 1 cup (if the clams yield a cup of broth or less, there is no need to reduce)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To another saucepan over medium heat, add 2 tablespoons of olive oil. Add the fennel, red onions and celery. Cook for 1 minute, stirring. Add the leeks and stir. Add the remaining wine, 3/4-cup water, thyme, bay leaf and whole clove of garlic. Do not add salt yet because the clam base is salty. Cook over high heat until the vegetables are only slightly crunchy and most of the liquid has evaporated. Cover, remove from heat, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the salmon fillets on a steamer rack. Season with salt and pepper to taste. Place water in the bottom of the steamer, bring to a boil, and place the salmon rack over it, covered with foil. Cook over high heat for about 5 minutes; do not overcook. Remove from heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to the vegetable saucepan, add the clam broth, scallions, tomatoes, remaining chopped shallots, basil, salt and pepper to taste, chives and the balsamic vinegar. Bring to a boil over medium-high heat and cook for about 5 minutes or until the liquid has reduced by about half. Remove the bay leaf and the thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each salmon fillet on the center of a warm plate. Arrange the vegetables and sauce over and around the fish. Garnish with celery leaves and sprinkle with sea salt."}], "link": "https://cooking.nytimes.com/recipes/3717-fillet-of-salmon-with-vegetable-bouillon-and-littleneck-clams"}