{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Lamb Sausage With Green Lentils", "description": "", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six to eight servings", "recipeCuisine": "mediterranean, middle eastern", "recipeCategory": "dinner", "keywords": "dairy-free, nut-free, green lentils, lamb, spices, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 509, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "5 grams", "proteinContent": "28 grams", "saturatedFatContent": "10 grams", "sodiumContent": "758 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound lean lamb (leg or shoulder), trimmed of sinew and cut into 1-inch cubes", "1/4 pound pancetta, cut into 1-inch cubes", "1/4 pound fatback, cut into 1-inch cubes", "1 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1 teaspoon cayenne pepper", "1/2 teaspoon cinnamon powder", "1 pinch dried oregano", "1 pinch dried thyme", "1 pinch ground clove", "1 pinch ground cardamom", "3 tablespoons fresh flat-leaf parsley, chopped", "3 tablespoons fresh coriander, chopped", "1 1/2 cups green lentils (or substitute brown lentils)", "2 tablespoons rendered duck fat (or substitute lard or vegetable oil)", "6 shallots, peeled and left whole (separate cloves)", "2 medium carrots, cut into 3/8-inch pieces (approximately 1 1/2 to 2 cups)", "6 cups chicken stock, preferably homemade and unsalted", "1 bouquet garni: 1 whole clove, 1 bay leaf, 2 sprigs parsley, 1 sprig thyme, all wrapped in cheesecloth", "1 teaspoon coarse salt", "1/4 teaspoon freshly ground black pepper", "1/4 cup fresh bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the sausages, in a mixing bowl, combine the lamb, pancetta, fatback, salt and pepper and the dried herbs and spices, except for the parsley and coriander. Stir to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a third of the sausage mixture into the bowl of a food processor and process until it is very finely chopped but not pureed. Do the same with the second third of the meat mixture. Process the last third, leaving it chunkier. In a large bowl, combine by hand the three batches of meat until the larger chunks are evenly distributed. Allowing the sausage mixture to stand overnight, covered in the refrigerator, enhances the flavor, but it is not crucial."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the same day you are serving the dish, chop and add the parsley and coriander. Mix well and form into eight patties about two-and-a-half-inches in diameter and one-inch thick. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the lentils, rinse them under water and remove any stones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a three-to-four-quart heavy-bottomed saucepan, melt the duck fat over a medium flame. Add the peeled shallots and saute for approximately five minutes, or until slightly golden. Add the carrot pieces and saute an additional five minutes, stirring occasionally. Add the lentils, stir to coat with fat and continue cooking for three minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the six cups of stock, salt, pepper and bouquet garni. Bring to a boil, then lower the flame. Simmer until the lentils are tender and most of the liquid has been reduced to a thin syrup. Discard bouquet garni. This should take about one hour. The lentils may be prepared up to this point one to two days in advance. Store, covered, in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the lentil mixture into a two-quart shallow baking dish and evenly space the eight raw sausage patties on top. Sprinkle with the bread crumbs. Bake on the middle rack of the oven until the sausages are browned and the lentils are bubbly hot, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately, with warm bread and roasted beets dressed with Sherry vinegar and walnut oil."}], "link": "https://cooking.nytimes.com/recipes/3740-spiced-lamb-sausage-with-green-lentils"}