{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Glow Chiffon Cake", "description": "", "author": {"@type": "Person", "name": "Richard Flaste"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "Fourteen servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cake flour, eggs, orange juice, dairy-free, nut-free, vegetarian, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "181 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups sifted cake flour", "2 teaspoons baking powder", "1/2 teaspoon salt", "1 1/2 cups sugar", "1/2 cup safflower oil", "7 large eggs, separated, plus 3 egg whites", "3/4 cup freshly squeezed orange juice", "2 tablespoons grated orange zest", "1 teaspoon vanilla", "1 1/4 teaspoons cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine the flour, baking powder, salt and all but 2 tablespoons of the sugar and beat 1 minute to mix. Make a well in the center. Add the oil, egg yolks, orange juice, orange zest and vanilla and beat with electric mixer 1 minute or until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another large mixing bowl, beat the egg whites until frothy, add the cream of tartar and beat until soft peaks form when the beater is raised. Beat in the remaining 2 tablespoons of sugar until stiff peaks form when the beater is raised slowly. Gently fold the egg whites into the batter with a large balloon wire whisk or slotted skimmer until just blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour into a 10-inch, 2-piece ungreased tube pan (the batter will come to 1 inch from the top) and bake for 55 minutes or until a cake tester inserted in the center comes out clean and the cake springs back when lightly pressed in the center. Invert the pan, placing the tube opening over the neck of a soda or wine bottle to suspend it well above the counter, and cool the cake completely in the pan (about 1 1/2 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the bottle, loosen the sides with a long metal spatula and remove the center core of the pan. (Dislodge the bottom and center core with a metal spatula or thick sharp knife. A wire cake tester works well around the core. To keep the sides attractive, press the spatula against the sides of the pan and avoid any up-and-down motion.) Invert onto a greased wire rack and reinvert onto a serving plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the cake so that it is airtight. It will store 3 days at room temperature, 10 days refrigerated and 2 months frozen."}]}