{"@context": "http://schema.org", "@type": "Recipe", "name": "Fettuccine With Shiitakes, Tomatoes And Rosemary Cream", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT30M", "recipeYield": "Six first-course servings", "recipeCuisine": "italian", "recipeCategory": "pastas", "keywords": "appetizer, fettuccine, shiitake, tomato, nut-free, vegetarian, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 607, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "3 grams", "proteinContent": "18 grams", "saturatedFatContent": "21 grams", "sodiumContent": "669 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces fresh shiitake mushrooms, cleaned, stems removed and thickly sliced", "2 tablespoons fresh lemon juice", "1 1/2 cups heavy cream", "2 sprigs fresh rosemary, each approximately 4 inches long", "3 tablespoons unsalted butter", "1 tablespoon vegetable oil", "1 medium onion, peeled and finely chopped", "1 small clove garlic, peeled and minced", "Salt and freshly ground black pepper to taste", "2 large, ripe tomatoes, peeled, seeded and coarsely chopped", "1 pound fresh fettuccine", "1 cup freshly grated Parmesan cheese", "6 small sprigs of rosemary, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, toss the mushrooms with the lemon juice and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size saucepan, combine the cream with the rosemary, bruising the rosemary in several places with a wooden spoon. Bring to a simmer, cover and cook gently for 15 minutes over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with water and bring it to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium-size skillet, heat the butter and oil over medium-high heat just until the butter foams. Stir in the onion and saute it for five to six minutes until soft and translucent. Add the garlic and cook for 30 seconds longer. Stir in the mushrooms and cook over medium heat for three to four minutes. Season with salt and plenty of fresh pepper. Add the chopped tomatoes and cream and leave on low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt to the boiling water, then cook the fettuccine until it is al dente, approximately one minute, and drain. Transfer the pasta to a warmed serving platter, ladle on the rosemary-cream mixture and about half the grated cheese. Toss and taste, adding more pepper if needed. Divide the fettuccine equally among six heated plates, placing plenty of the mushroom-tomato mixture and a small sprig of rosemary in the center of the pasta. Serve at once. Pass the remaining cheese and a pepper mill at the table."}], "link": "https://cooking.nytimes.com/recipes/3748-fettuccine-with-shiitakes-tomatoes-and-rosemary-cream"}