{"@context": "http://schema.org", "@type": "Recipe", "name": "Sugarsweet Tomato Nut Torte", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, tomato, walnut, dessert, summer, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "271 milligrams", "sugarContent": "24 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups walnuts", "1 cup fresh tomato puree (made from about 3/4 pound very ripe tomatoes)", "1 1/2 cups unbleached all-purpose flour", "1 tablespoon cider vinegar", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 teaspoon cinnamon", "1/2 teaspoon nutmeg", "4 eggs", "1 1/4 cups dark brown sugar", "2 teaspoons grated orange rind", "1 teaspoon vanilla extract", "1/3 cup melted sweet butter, tepid", "Confectioners' sugar or sweetened whipped cream, for decoration"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. Butter a nine-inch springform pan. Cut a round disk of baking parchment to fit the bottom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the walnuts and a half-cup of unsifted flour in the bowl of a food processor fitted with a metal blade. Pulse until the nuts are chopped to a medium size. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the tomato puree with the vinegar and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the remaining flour with the baking powder, salt and spices in a triple sifter and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the eggs into the large bowl of an electric mixer. Beat on high speed until thickened and light in color - about two minutes. Gradually add the brown sugar and beat for five minutes longer. The mixture will be very thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the speed to medium-high and blend in the orange rind and vanilla. Add the dry ingredients alternately with the tomato puree, dividing the flour into three parts and the puree into two parts. Start and end with flour. Scrape down the sides of the bowl as needed. The batter will be very loose. Pour in the butter and quickly add the chopped nuts. Beat just to blend, then immediately pour it into the prepared pan. Bake for 55 to 60 minutes. The cake is done when the top is golden brown, springy to the touch, and the sides come away from the pan. Test by inserting a toothpick into the center. It should come out dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and set on a cake rack to cool completely. Just before serving, dust the top with confectioners' sugar. Or, if desired, split the torte into two or three layers, using a long serrated bread knife, and fill and frost with sweetened whipped cream. Garnish with a few chopped walnuts."}], "link": "https://cooking.nytimes.com/recipes/3750-sugarsweet-tomato-nut-torte"}