{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Medallions Of Venison With Black-Bean Pancakes", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT25M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "black beans, venison, main course, nut-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "52 grams", "saturatedFatContent": "4 grams", "sodiumContent": "564 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup plain yogurt", "1/4 cup hoisin sauce", "2 large cloves of garlic, peeled and crushed", "1 tablespoon minced gingerroot", "Freshly ground black pepper to taste", "1 3/4 to 2 pounds venison or lamb medallions, cut from the leg, about 1-inch thick and 3-inches in diameter", "Vegetable oil to grease the skillet", "1 cup cooked black beans (soaked and cooked until tender, according to package directions)", "1/4 cup water", "2 tablespoons dry Sherry", "2 beaten eggs", "1/4 cup minced scallions, white and light green parts, reserving the tops for the garnish", "1 medium clove garlic, peeled and crushed", "2 tablespoons toasted sesame seeds", "2 tablespoons sesame oil", "2 tablespoons minced gingerroot", "12 drops Tabasco sauce, or to taste", "3/4 teaspoon salt", "3 tablespoons all-purpose flour", "Vegetable oil to grease the skillet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a nonreactive dish large enough to accommodate the meat in one layer, combine the yogurt, hoisin sauce, garlic, gingerroot and pepper, and add the medallions, turning to coat them on all sides. Cover and refrigerate for two to three days, turning twice during this time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pancakes, place half of the beans in the bowl of a food processor fitted with a steel chopping blade. Pour in the water and Sherry and process until smooth. Add the eggs, process until blended, then scrape the mixture into a bowl. Stir in the remaining beans, scallions, garlic, sesame seeds, oil, gingerroot, Tabasco sauce and salt. Sprinkle the flour onto the mixture, a tablespoon at a time, beating it with a fork until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn your oven to warm. Lightly grease a large, heavy skillet with oil and heat until it is hot. Pour in one tablespoon of the batter for each pancake. Cook them over medium-high heat until the edges begin to brown, about 30 to 45 seconds. Turn with a spatula and cook the second side for 30 seconds. Transfer the cooked pancakes to a warm plate, loosely cover it and place it in the oven. Continue until all the batter has been used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a well-seasoned cast-iron or heavy skillet until it is very hot. Add enough oil to lightly film the pan. Place only as many medallions in the pan as will fit comfortably without crowding. Cook the meat over high heat for about four to four-and-a-half minutes on the first side, turn and cook three-and-a-half to four minutes on the second side for medium-rare. Transfer the meat to heated plates. Serve with three to four pancakes. Slice the reserved scallion tops and use them as garnish."}], "link": "https://cooking.nytimes.com/recipes/3755-grilled-medallions-of-venison-with-black-bean-pancakes"}