{"@context": "http://schema.org", "@type": "Recipe", "name": "All-American Paella", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT1H", "recipeYield": "Six to eight servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "dairy-free, gluten-free, nut-free, main course, meat, rice, seafood", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 906, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "74 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "2 grams", "proteinContent": "46 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1398 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup California virgin olive oil (or other strong-flavored olive oil)", "1 pound chicken-wing drumsticks", "8 small breakfast sausages (8 ounces total)", "1/2 cup minced onion", "2 teaspoons minced garlic", "2 ripe tomatoes, peeled, seeded and roughly chopped", "2 red bell peppers, peeled, seeded, membranes removed and pureed", "1 dried long purple chili pepper (ancho), pulverized and seeds removed, optional", "3 cups Texmati rice (see note)", "5 1/4 cups chicken broth, canned or homemade, heated to boiling", "3/4 cup dry white wine", "2 tablespoons freshly squeezed lemon juice", "2 tablespoons chopped flat-leaf parsley", "2 tablespoons chopped chives", "1 medium-size bay leaf", "2 teaspoons kosher salt", "3/4 teaspoon freshly ground black pepper", "1/2 teaspoon Louisiana hot-pepper sauce", "1 1 1/4-pound live Maine lobster, cut into 10 pieces (cut in half length-wise down the middle, remove claws and cut each half into 4 pieces)", "8 ounces baked ham, smoked over hard wood (or any other ham that has not been cured or baked with sweet ingredients), cut into 3/4-inch cubes (including rind)", "8 Long Island mussels", "4 squid (about 6 ounces), cut into 1/2-inch rings", "1/2 pound whole sugar snap peas, strings removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large skillet (at least 14 inches in diameter), or in a 15-inch paella pan, heat three-quarters of a cup of the olive oil over high heat until very hot, about two minutes. Add the chicken-wing drumsticks and the sausages and saute, turning frequently, for about five minutes, until the meats are nicely browned. Remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the oil in the skillet and add the remaining quarter cup of olive oil; heat over medium-high heat for 30 seconds. Add the onion and garlic and saute for five minutes, stirring frequently, or just until the onion begins to turn golden brown. Add the chopped tomatoes, pureed red peppers and pulverized chili pepper, and simmer over medium-high heat for five minutes, stirring frequently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice to the skillet and stir over medium-high heat for two minutes. Add the hot chicken broth, white wine, lemon juice, parsley, chives, bay leaf, salt, pepper and hot-pepper sauce. Stir over medium-high heat for five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and add to the skillet the reserved chicken wings and sausages, the lobster, ham, mussels, squid and sugar snap peas. Stir once, carefully, and place the skillet, uncovered, in the preheated oven. After 20 minutes, taste the rice to make sure it is completely cooked. If so, remove from oven and cover loosely with foil. Let rest for 10 minutes before serving."}]}