{"@context": "http://schema.org", "@type": "Recipe", "name": "Original Plum Torte", "description": "The Times published Marian Burros’s recipe for Plum Torte every September from 1983 until 1989, when the editors determined that enough was enough.  The recipe was to be printed for the last time that year. “To counter anticipated protests,” Ms. Burros wrote a few years later, “the recipe was printed in larger type than usual with a broken-line border around it to encourage clipping.” It didn’t help. The paper was flooded with angry letters. “The appearance of the recipe, like the torte itself, is bittersweet,” wrote a reader in Tarrytown, N.Y. “Summer is leaving, fall is coming. That's what your annual recipe is all about. Don't be grumpy about it.” We are not! And we pledge that every year, as summer gives way to fall, we will make sure that the recipe is easily available to one and all. The original 1983 recipe called for 1 cup sugar; the 1989 version reduced that to 3/4 cup. We give both options below. Here are <a href=\" http://www.nytimes.com/interactive/2016/09/14/dining/marian-burros-plum-torte-recipe-variations.html\">five ways to adapt the torte</a>.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": "https://static01.nyt.com/images/2019/09/07/dining/plumtorte/plumtorte-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, easy, weekday, times classics", "keywords": "dessert, flour, plum, unsalted butter, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 4318}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 350, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "63 milligrams", "sugarContent": "42 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 to 1 cup sugar", "1/2 cup unsalted butter, softened", "1 cup unbleached flour, sifted", "1 teaspoon baking powder", "Pinch of salt (optional)", "2 eggs", "24 halves pitted purple plums", "Sugar, lemon juice and cinnamon, for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cream the sugar and butter in a bowl. Add the flour, baking powder, salt and eggs and beat well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the batter into a springform pan of 8, 9 or 10 inches. Place the plum halves skin side up on top of the batter. Sprinkle lightly with sugar and lemon juice, depending on the sweetness of the fruit. Sprinkle with about 1 teaspoon of cinnamon, depending on how much you like cinnamon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 hour, approximately. Remove and cool; refrigerate or freeze if desired. Or cool to lukewarm and serve plain or with whipped cream. (To serve a torte that was frozen, defrost and reheat it briefly at 300 degrees.)"}]}