{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Whole Cod Tonnato", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT1H", "recipeYield": "Eight to 10 servings", "recipeCuisine": "italian", "recipeCategory": "brunch, dinner", "keywords": "anchovy fillets, canned tuna, cod, appetizer, main course, dairy-free, gluten-free, nut-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 632, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "71 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1161 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cups mayonnaise, preferably thick and homemade with a fruity olive oil or a combination of olive and vegetable oils", "1 6-ounce can imported tuna packed in olive oil, drained", "1/2 2-ounce can anchovy fillets, rinsed and patted dry", "1/4 cup small capers", "1/4 cup fresh lemon juice", "3/4 cup fruity olive oil", "1 8-pound cod, whole, with head on, cleaned, gilled and gutted with the center blood vein and sound removed", "12 cups water", "1 bottle dry white wine", "3/4 cup white-wine vinegar", "3 large onions stuck with 3 whole cloves each", "4 carrots, chopped", "2 ribs celery with leaves, chopped", "1 bay leaf", "1 teaspoon dried thyme", "6 parsley sprigs", "6 peppercorns", "1 tablespoon salt, or to taste", "2 large cucumbers, washed", "1 slice pimento-filled olive"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the tuna mayonnaise, place the mayonnaise in a medium bowl. In the bowl of a food processor fitted with a steel blade, combine the tuna, anchovies, capers and lemon juice, and process until a smooth paste is formed. With the processor on, pour the olive oil through the feed tube in a slow, steady stream. (If doing this by hand, mash the tuna, anchovies, capers and lemon juice with a fork. Slowly whisk in the oil.) Fold the tuna mixture into the mayonnaise and blend well. Cover and refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, make a court bouillon by combining the water, white wine, vinegar, onions, carrots, celery, bay leaf, thyme, parsley sprigs, peppercorns and salt. Bring just to the boil and simmer one hour. To poach the cod, place the fish on its side and measure the height at its thickest point. Figure eight to nine minutes poaching time per inch of thickness once the poaching liquid returns to a boil. Wrap the fish in a couple of layers of cheesecloth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a fish poacher or shallow pan large enough to accommodate the fish with enough court bouillon to cover the fish. Bring the liquid to a boil, then lower the fish into the pot. Once the liquid returns to a boil, adjust the heat down so the liquid barely simmers. Time as directed in Step 2."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cooked, remove the fish from the liquid to a large platter and let it cool for a few minutes. Carefully cut open the cheesecloth with scissors. Remove the top layer of skin and the head if it has fallen apart, or if you do not wish to serve it. Leave the tail intact. Slide the cheesecloth out from under the cod, using a wide spatula to help. Drain off and blot any liquid on the platter with paper towels, cover loosely with foil and refrigerate until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make sure all liquid is removed from the platter. Spoon enough tuna mayonnaise over and around the cod to cover generously. Leave the tail uncovered. Re-cover the platter and refrigerate for at least four to six hours, or preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the fish, remove the fish from the refrigerator no more than two hours before serving. Smooth the mayonnaise, adding more if needed to fill in any cracks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run the tines of a fork along the length of the cucumbers to score them. Cut them in half lengthwise and scrape out the seeds with a spoon. Cut the cucumber into very thin slices. Beginning at the tail end, lay the slices in an overlapping pattern to create a scale pattern. If the head has been discarded, stop the scale pattern about two and a half inches from the front end and re-create a head by changing direction of the scales. Use an olive slice for the eye. Serve the top half of the fish, then remove the bones before serving the bottom. Pass the extra mayonnaise at the table."}], "link": "https://cooking.nytimes.com/recipes/3788-chilled-whole-cod-tonnato"}