{"@context": "http://schema.org", "@type": "Recipe", "name": "Wolfgang Puck's Salmon With Celery-Root Puree", "description": "", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT50M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "celery root, salmon fillet, gluten-free, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["6 tablespoons unsalted butter", "1 shallot, chopped", "1 clove garlic, minced", "1 tomato, peeled, seeded and chopped", "1/2 bottle cabernet sauvignon", "2 tablespoons balsamic vinegar", "1 cup chicken stock", "Salt and freshly ground pepper to taste", "1 medium-sized baking potato, peeled", "1 celery root, peeled", "1/2 cup heavy cream", "2 tablespoons butter", "Salt and freshly ground pepper to taste", "1 1/2 tablespoons fresh ginger, finely minced", "1 1/2 tablespoons black pepper, chopped or roughly cracked", "4 salmon fillets, Alaskan King or other, each about 6 ounces", "Olive oil for grilling or sauteing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, heat two tablespoons of the butter in a large saute pan until the butter is foamy. Add the shallot, garlic and tomato and saute at medium-low heat for about five minutes, or until the shallot is translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine and vinegar and cook over medium-high heat until reduced by half. Add the chicken stock and reduce again by half. Finish the sauce by stirring in the remaining four tablespoons of butter, one tablespoon at a time. Season with salt and freshly round pepper to taste. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the celery-root puree by chopping the potato and celery root into one-inch cubes. Put in a medium-sized pot and cover with lightly salted cold water. When the water comes to a boil, cook for 15 to 20 minutes, or until soft. Drain and return the potato and celery root to the pot. Heat briefly until the excess moisture evaporates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pass the celery Root-potato mixture through the small disk of a food mill or a ricer. (Do not use a food processor; it will make a gluey puree.) Return to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cream and cook, stirring, over medium heat for about three minutes, or until thickened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat. Stir in the butter and the salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the ginger and black pepper. Season the salmon with salt and coat with the ginger-pepper mixture. If grilling or broiling the salmon, sprinkle the fillets with olive oil and cook two minutes on each side. If sauteing the salmon, heat one tablespoon of olive oil in a large saute pan. When the pan is very hot, add the salmon and cook two minutes on each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the sauce among four warm dinner plates. Spoon equal amounts of celery-root puree on the center of each plate. Place salmon on top."}], "link": "https://cooking.nytimes.com/recipes/3829-wolfgang-pucks-salmon-with-celery-root-puree"}