{"@context": "http://schema.org", "@type": "Recipe", "name": "Gordon Hamersley's Boned Stuffed Leg Of Lamb", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "dairy-free, gluten-free, nut-free, lamb, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 916, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "4 grams", "proteinContent": "70 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1668 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 8-pound (approximately) leg of lamb (weighed with the bone), boned and butterflied", "Bones from the lamb", "1/2 large onion, unpeeled", "2 carrots, scrubbed but unpeeled", "2 stalks of celery, with leaves", "1 1/2 tablespoons tomato paste", "1 1/2 cups dry red wine", "Approximately 3 cups water or chicken stock", "4 cloves garlic", "1 bay leaf", "6 whole peppercorns", "1 bunch green kale", "3 tablespoons, plus 1/4-cup, olive oil", "3 sweet red peppers", "3 ounces jumbo Kalamata olives, pitted (about 18 olives)", "1 shallot", "1 teaspoon dried thyme", "1 teaspoon dried oregano", "Kosher salt", "Cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Place the lamb bones in a roasting pan and roast for about 45 minutes. Roughly chop the unpeeled onion, the carrots and the celery and add to the roasting pan with the tomato paste. Mix to distribute the vegetables and coat them with tomato paste and fat from the lamb. Return to the oven and roast an additional 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove bones and vegetables from the pan and place them in a stock pot that is just large enough to hold them comfortably. Deglaze the roasting pan with the red wine over high heat and add to the stock pot. Then add enough chicken stock or water to just cover the bones in the pan. Bring to a boil, skim any scum that rises and add a pinch of salt, two cloves of garlic, the bay leaf and peppercorns. Lower the heat to simmering, partially cover the stock pot and simmer for at least two hours. At the end of this time, the stock should have a destinctive lamb flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove stock from the heat and strain through a coarse sieve. Return strained stock to the pan and cook briskly to reduce and thicken the stock. You should have about four cups of sauce when it is reduced."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce is cooking, clean and rinse the kale, stripping the leaves from the ribs. Discard the ribs. In a saute pan over medium high heat saute the kale in three tablespoons of olive oil until it is softened but still a little crisp to the bite. (You may need to add a bit of water to keep the kale from burning.) Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the red peppers over a gas flame, an electric grill or in a preheated broiler, turning until the outsides are blackened. Place in a paper bag for about 15 minutes to soften the skins. Then peel the peppers, discard the seeds and inner membranes and cut in thick slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly chop the olives together with the peeled shallot and remaining garlic cloves. Mix in dried herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the butterflied lamb out on a countertop, skin side down. If the butcher has left the nugget of fat on the inside of the leg, remove and discard it. Layer the kale over the lamb, then layer the strips of red pepper over that. Sprinkle the olives, garlic and shallot pieces over the pepper strips, then sprinkle salt and cracked black pepper and about half the one-quarter cup of olive oil over the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the lamb leg, securing the stuffing, and tie it in several places with butcher's twine, tucking in the loose flaps at both ends. The result will be a long cylinder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Place the lamb roll on a rack in a roasting pan and roast for exactly one hour. Remove from the oven and set aside to rest for 15 minutes. Carve in thick (one-half to three-quarter-inch) slices and serve on heated plates with a little of the hot sauce. Pass the rest of the sauce in a sauce boat."}]}