{"@context": "http://schema.org", "@type": "Recipe", "name": "Lucky's Chicken Roasted With Vermicelli And Garlic", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas, roasts", "keywords": "chicken, vermicelli, dairy-free, nut-free, main course", "aggregateRating": null, "recipeIngredient": ["1 cup water", "3 teaspoons kosher salt", "1/2 cup virgin olive oil, plus oil for brushing the chicken", "1/4 cup minced fresh garlic", "1 pound fresh egg vermicell (see note)", "3 roasting chickens, each weighing 2 to 3 pounds, halved", "Freshly ground black pepper, as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one teaspoon of the salt to the cup of water and set aside. In a small saucepan, heat the half-cup of olive oil over medium-low heat. Add the minced garlic to the warm oil and saute very gently until the garlic starts to brown. Watch carefully, because the minced garlic can quickly turn from &quot;starting to brown&quot; to burned - and the acrid taste and flavor of burned garlic is undesirable. As soon as the garlic starts to brown, add the salted water and cook over medium heat until almost all the water has evaporated. Remove from the heat and set aside to cool for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water large enough to contain the egg vermicelli to a boil. Add 1 teaspoon of salt and the pasta. Cook for just 30 seconds. Drain immediately and refresh the pasta under cold running water. Drain well and combine the pasta with the garlic mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the vermicelli into six equal mounds in a roasting pan just large enough to accommodate all the chicken halves. Brush the chicken halves with virgin olive oil and sprinkle with the remaining salt and freshly ground black pepper. Place a chicken half on top of each mound of vermicelli and roast for 30 to 35 minutes, until the chicken is golden and cooked through, and the edges of the vermicelli are browned and crispy. If vermicelli does not brown sufficiently on the edges, remove the excess chicken fat from the roasting pan and place the pan under a preheated broiler for one to three minutes to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a slotted spatula, lift each chicken half with its vermicelli onto a heated serving dish. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/3867-luckys-chicken-roasted-with-vermicelli-and-garlic"}