{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Clams and Green Beans", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "cherrystone clams, green beans, spaghetti, main course, nut-free, vegetarian", "aggregateRating": null, "recipeIngredient": ["18 cherrystone clams, shucked, with clam juice reserved, about 2 cups", "1 pound green beans", "12 cups water", "Salt to taste", "1 pound imported spaghetti", "2 tablespoons olive oil", "1 tablespoon finely chopped garlic", "5 ripe plum tomatoes, about 1 pound, cut into 1/2-inch cubes", "1/8 teaspoon red hot-pepper flakes", "1/3 cup Absolut lemon vodka or regular vodka flavored with the juice of 1/2 lemon, optional", "1/3 cup heavy cream", "Freshly ground pepper to taste", "1/2 cup coarsely chopped fresh basil leaves or 1/2 cup chopped Italian parsley", "Freshly grated peccorino or Parmesan cheese, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the clams coarsely; there should be about 1 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim or break off the ends of the beans and remove the strings. Cut the beans into 2-inch lengths."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water, salted to taste, to a boil in a kettle and add the green beans. Bring to a simmer and cook for 6 to 7 minutes. Do not overcook; the beans should remain crisp. Drain and reserve the cooking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the reserved cooking liquid to a boil. Add the spaghetti, stir and cook for about 6 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oil in a large skillet. Add the garlic and cook briefly, stirring, without browning. Add the tomatoes, pepper flakes and the reserved clam juice. Cook, stirring, over medium heat until the liquid has been reduced to about 2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the drained spaghetti, beans, vodka, if desired, cream and freshly ground pepper. Bring to a simmer. Cook until the spaghetti is al dente, stirring, and add the clams and basil. Toss and cook 1 minute. Serve immediately with peccorino or Parmesan cheese, if desired."}], "link": "https://cooking.nytimes.com/recipes/3944-spaghetti-with-clams-and-green-beans"}