{"@context": "http://schema.org", "@type": "Recipe", "name": "Sugar Pie", "description": "This recipe came to The Times in a 1991 profile of Laurent Comeau, the kitchen manager of Cirque du Soleil. In his role managing the meals of the performers, he often had to scramble to find ingredients like Canadian maple syrup for the Québécois in the troupe, who expected it on or in everything from pancakes to maple mousse pie. Mr. Comeau thought Vermont maple syrup is just as good, \"but try explaining it to them,\" he said. \"The contortionists, it's like wine to them. They'll taste it and know right away if it's not from Quebec.\" This sugar pie, sweetened with brown sugar and sweetened condensed milk, tastes like pure butterscotch.", "author": {"@type": "Person", "name": "Alison Leigh Cowan"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "canadian, french", "recipeCategory": "breakfast", "keywords": "brown sugar, sweetened condensed milk, dessert, nut-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 744, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "96 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "16 grams", "sodiumContent": "220 milligrams", "sugarContent": "62 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 3/4 cups flour", "1/2 teaspoon salt", "1/2 pound lard, cut into small pieces and chilled", "1/2 cup ice water", "1 1/2 tablespoons butter, cut into small pieces and chilled", "2 cups brown sugar", "14 ounces sweetened condensed milk", "1 tablespoon flour", "1 tablespoon butter, softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, combine the flour and salt in a large bowl. Add the lard, and with a pastry cutter or two forks, cut the lard into the flour until the mixture resembles small peas. Add the ice water, 2 tablespoons at a time, and mix with two knives. Add just enough water so that all the flour is incorporated and the dough pulls together into a rough ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out onto a lightly floured board, and with a rolling pin flatten the dough into a 6-inch square. Scatter the butter pieces all over the dough, then fold the dough in half. Roll the dough back out into a 6-inch square, then fold and roll out again. Repeat once more, then cover the dough with plastic wrap, and refrigerate for an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dough from the refrigerator, and allow to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, combine the sugar, condensed milk, flour and butter in a medium-size bowl. Stir until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured board roll out the dough until it is 1/4 inch thick. Gently lift the dough, and put it in a 9-inch pie pan. Trim the edges, then pour in the filling. Bake for 15 minutes, then reduce the heat to 325 degrees, and continue baking for another 25 minutes. The filling will look cracked and bumpy. Do not overbake."}]}