{"@context": "http://schema.org", "@type": "Recipe", "name": "Marinated Tuna on a Bed of Bitter Greens", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT5H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, main course, bitter greens, tuna, dairy-free, gluten-free, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 437, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "10 grams", "proteinContent": "52 grams", "saturatedFatContent": "1 gram", "sodiumContent": "3886 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds yellowfin tuna steaks, 2 to 2 1/2 inches thick", "1 cup soy sauce", "Juice of 1 lemon", "1/4 cup dry sherry", "2 tablespoons finely chopped fresh ginger", "1/4 cup chopped scallions", "1 clove garlic, minced", "Pinch of crushed chili pepper", "1 teaspoon freshly ground black pepper", "4 pounds any or all of the following bitter greens: broccoli rabe, kale, red or green chard, turnip greens, dandelion greens", "2 tablespoons extra-virgin olive oil", "Salt and freshly ground black pepper to taste", "1 lemon, quartered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tuna into 4 or 8 equal portions, depending on whether it will be served as an appetizer or a main course. Put the fish in a shallow dish made of a noncorrodible material (glass, clay, stainless steel or enameled iron). Make a marinade by combining the soy sauce, lemon juice, sherry, ginger, scallions, garlic, chili pepper and black pepper. Pour the marinade over the tuna, cover and refrigerate for 5 to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the tuna has marinated, prepare the greens. Tear the leaves into bite-sized pieces. Wash the leaves well under running water and place them in a large pot. Cover and steam over a high heat for about 5 minutes, adding a little boiling water if necessary to keep the greens from burning. When the greens are tender, drain them in a colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are using a gas grill to cook the fish, preheat it to the highest setting. If you are using a charcoal grill, give the coals enough time to become red hot. The tuna can also be broiled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the olive oil in a pan and, when the oil sizzles, add the greens. Saute for no more than 2 minutes. Taste the greens and add salt and freshly ground black pepper if desired. Set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fish from the marinade and reserve the marinade. Grill or broil the steaks until they are lightly charred on the outside and opaque in the center. (Tuna should not be eaten rare because of the danger of parasites.) While cooking the steaks, baste them frequently with the marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fish is thoroughly cooked, arrange the greens on a warm platter or individual plates. Place the tuna on the greens, garnish with lemon quarters and serve immediately."}]}