{"@context": "http://schema.org", "@type": "Recipe", "name": "Gratin Of Fennel And Potatoes", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H", "recipeYield": "Eight servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "fennel, red potato, nut-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 132, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "505 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound fennel bulbs", "3 to 4 cups chicken stock", "4 large cloves garlic, peeled", "2 teaspoons lemon juice", "Salt to taste", "1 pound red potatoes", "1/4 cup freshly grated Parmesan cheese", "Freshly ground black pepper to taste", "3/4 cup fresh bread crumbs, preferably sourdough bread", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the roots off the fennel. Discard the tough, stringy or discolored outer leaves. Chop the feathery leaves and set them aside to use as a garnish. Slice the bulbs lengthwise into 1/8-inch-thick pieces and place them in a 2-quart saucepan. Add 3 cups of stock and the garlic, lemon juice and salt (if desired). Bring the broth to a boil, then immediately reduce the heat and simmer for 15 minutes. Remove the fennel slices and set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes and slice them into 1/8-inch-thick rounds. Put them in the broth and, if necessary, add more stock or water if the broth has cooked down too far. Bring to a boil, then immediately reduce the heat and simmer for 5 to 8 minutes, or until the potatoes just lose their crunch. Do not allow them to soften beyond this point. Lift the potatoes out of the pot and set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the broth over medium-high heat until it is reduced by a little more than half, to approximately 1 1/4 cups. Force the broth through a medium sieve into a bowl, using a spatula to push through the garlic cloves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Cover the bottom of an 8-inch baking dish or gratin dish with several spoonfuls of the strained broth. Make a layer of fennel and potatoes, arranging the slices so that fennel alternates with potato; use up all the fennel. Spoon on a little more broth and sprinkle with one-third of the Parmesan cheese and some freshly ground black pepper. Put the remaining potato slices on top - they should overlap slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly press the potatoes with the palm of your hand so that the layer is even. Pour the remaining broth over the potatoes, grind pepper on top and sprinkle with the rest of the Parmesan cheese. Bake for an hour and 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the gratin is baking, saute the bread crumbs in the butter until they are golden-brown. Five minutes before the gratin is done, sprinkle the bread crumbs over the top with about a tablespoon of the chopped fennel leaves. Let the dish cool slightly before serving."}], "link": "https://cooking.nytimes.com/recipes/3990-gratin-of-fennel-and-potatoes"}