{"@context": "http://schema.org", "@type": "Recipe", "name": "Three-Cheese Ravioli", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "appetizer, main course, cheese, herbs, pasta, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 808, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "4 grams", "proteinContent": "29 grams", "saturatedFatContent": "26 grams", "sodiumContent": "1259 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 ounces fresh goat cheese", "2 ounces blue cheese", "1/3 cup grated Parmesan cheese", "Pulp of 1 small baked potato, mashed", "3 eggs", "3 tablespoons chopped fresh chervil", "2 tablespoons chopped fresh chives", "Salt and freshly ground white pepper to taste", "Semolina flour", "1 pound fresh egg pasta dough (see note)", "1 tablespoon olive oil", "1 cup chicken stock", "8 tablespoons unsalted butter, at room temperature", "1 teaspoon chopped fresh sage", "1 teaspoon chopped fresh marjoram", "Chervil sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl combine goat cheese, blue cheese, 1/4 cup of Parmesan cheese, the potato and two eggs. Mix well and add 2 tablespoons each of chervil and chives. Season to taste with salt and pepper and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust a work surface with semolina flour and roll out half the pasta dough by hand or by machine, making a strip about 30 inches long and 5 inches wide. Lightly beat the remaining egg and brush the strip halfway along its length with half the beaten egg. Put heaping teaspoons of the cheese mixture on the dough that has been brushed with the egg, making 12 mounds of the mixture about 2 1/2 inches apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with the plain half of the dough by folding it back along its length and press the dough down around each mound. Using a cookie cutter or a knife, cut 3-inch rounds or squares and arrange the cut ravioli on a tray dusted with semolina. Repeat with the remaining dough and filling. Cover and refrigerate until ready to use. (The ravioli may be frozen.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and add the olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While water is coming to a boil, bring chicken stock to a simmer in a medium to large saucepan and season with pepper. Whisk in the butter and cook about 5 minutes, until slightly thickened. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a little salt to the boiling water; add the ravioli, reduce heat to medium and cook ravioli for 5 minutes. Remove ravioli with a slotted spoon and drain on clean towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the sauce and stir in the sage, marjoram and remaining chervil. Stir in the remaining Parmesan cheese and season to taste with salt and pepper. Add the cooked, drained ravioli to the sauce; simmer a minute or two, and then spoon the ravioli into four warm bowls, spooning the sauce over each. Garnish with a sprig of chervil and serve at once."}]}