{"@context": "http://schema.org", "@type": "Recipe", "name": "Beefsteak Minced Pie", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef, pastry, main course, nut-free", "aggregateRating": null, "recipeIngredient": ["4 cups all-purpose flour", "2 teaspoons salt", "1/2 pound butter, cut in pieces", "10 tablespoons ice water", "2 cups dried beans or rice", "2 shallots, minced", "1/2 teaspoon minced garlic", "1 tablespoon butter", "1/2 pound raisins, chopped", "2 tart apples, peeled, cored and chopped fine", "Zest of 1 lemon", "Zest of 1 orange", "1/4 teaspoon ground cinnamon", "1/8 teaspoon ground mace", "1/8 teaspoon ground cloves", "1 cup sherry", "1/2 cup sugar", "2 pounds beef sirloin, trimmed and cubed", "1 cup all-purpose flour", "4 tablespoons lard or butter", "1 cup pearl onions, peeled and chopped", "1 teaspoon fresh thyme", "2 cups beef broth", "2 teaspoons salt", "1/4 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make crust, combine flour and salt in a large bowl. Add butter, and with a pastry cutter or two forks, cut butter into flour until the mixture resembles coarse cornmeal. Add ice water spoon by spoon, mixing between additions, only until the dough holds together. Remove from bowl, cut in half and cover one piece with plastic wrap and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured board, roll the other half into a circle large enough to fit a 9-inch deep-dish pan. Place the dough in pan, line with foil and weigh down with beans to keep crust from puffing up. Bake until light golden brown, about 30 minutes. Remove from oven, remove beans and set aside. Keep oven on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make filling, brown shallots and garlic in butter in large skillet over medium heat. Add raisins, apples, lemon and orange zest, and cook 3 minutes. Add cinnamon, mace, cloves and sherry. Bring to boil. Add sugar, stir well, cook 5 minutes and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the refrigerated pie dough and allow it to soften. Dredge beef in the flour, then set it aside on wax paper. Reserve any remaining flour to thicken gravy, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the lard in a large skillet. When hot, brown the beef. Add the onions and cook over medium heat until they are slightly golden. Add the thyme, broth and the reserved fruit mixture and simmer for 7 minutes, or until the mixture begins to thicken. Add two tablespoons flour if the gravy is too thin. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon mixture into baked pie shell. Roll out remaining dough and cut into strips 9 by 1 1/2 inches. Cover pie in a lattice pattern. Bake 35 minutes, or until top is golden."}]}