{"@context": "http://schema.org", "@type": "Recipe", "name": "Cooked Turkey Soup", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "pastas, soups and stews", "keywords": "fall, pastina, turkey bones, turkey leftovers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 442, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "3 grams", "proteinContent": "60 grams", "saturatedFatContent": "2 grams", "sodiumContent": "225 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds, approximately, bones from a cooked turkey, with any leftover juices and cooked garnishes like pieces of carrot, onion or garlic", "3 carrots, peeled and cut into 1/2-inch pieces (1 1/2 cups)", "1 leek, cleaned and cut (2 1/2 cups)", "2 cups diced celery, zucchini or green beans (or a mixture of these and other vegetables)", "3 to 4 cups coarsely chopped outer lettuce leaves or leftover salad greens", "1 cup (about 6 ounces) pastina (any tiny pasta in alphabet, star or square shapes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove all the skin from the turkey carcass (my turkey yielded 5 ounces of skin) and reserve it for making turkey cracklings. Place all the turkey bones, juice and cooked garnishes in a large, stainless-steel stockpot with 5 quarts tap water. Bring the water to a strong boil, then skim off and discard as much of the fat and scum from the surface of the mixture as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat and boil mixture gently, uncovered, for 2 hours. Strain. You should end up with 3 quarts of stock. If your yield is greater, boil stock until it is reduced to 3 quarts; if your yield is less, add water to bring the yield to 3 quarts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the stockpot and place the stock back in the pot with the vegetables. Bring the stock to a boil, reduce the heat, cover, and boil gently for 20 minutes. Add the pastina and continue to boil gently, covered, for 10 more minutes. Serve immediately, or cool completely and refrigerate, or freeze for later use."}], "link": "https://cooking.nytimes.com/recipes/402-cooked-turkey-soup"}