{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Custard", "description": "", "author": {"@type": "Person", "name": "Joan Acocella"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Six to eight servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, eggs, milk, gluten-free, nut-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 259, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": null, "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "97 milligrams", "sugarContent": "37 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup sugar, plus 3/4 cup", "3 3/4 cups milk", "1 vanilla bean, or 1 1/2 teaspoons vanilla extract", "5 large eggs", "4 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1/2 cup sugar and 2 1/2 tablespoons water to boil in a small, heavy saucepan, slowly swirling the pan by its handle until sugar has dissolved completely and liquid is perfectly clear. Continue to boil, swirling the pan frequently, until sugar turns a caramel brown, about 3 to 5 minutes. Immediately pour the hot caramel into a 6-cup charlotte mold or souffle dish and turn in all directions to film bottom and sides. Set aside until ready for use. If desired, individual ramekins may be used. When the sugar is caramelized, pour into 6 individual ramekins and swirl to coat as above."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the milk to simmering in a small, heavy saucepan. Slit the vanilla bean (if using) with a knife and scrape the seeds into the milk. Add the shell to the milk and allow to steep for 10 minutes. Strain and discard the bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a 2 1/2-quart mixing bowl, beat the eggs and the yolks with a wire whisk or electric mixer; gradually beat in the remaining sugar. When mixture is light and foamy, beat in milk in a very thin stream (beat in vanilla extract if using). Strain through a fine sieve into the prepared mold or souffle dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set in a hot-water bath and bake in lower third of the oven for 40 minutes, or until a knife comes out clean when stuck in the center of the custard. Check the water from time to time to make sure it never comes to a boil; adjust heat if necessary. This will insure a smooth custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve warm, let settle for 10 minutes in a pan of cold water. Turn a warm serving dish upside down over custard, then reverse to unmold. To serve cold, let cool to room temperature; chill several hours, then unmold."}], "link": "https://cooking.nytimes.com/recipes/4037-caramel-custard"}