{"@context": "http://schema.org", "@type": "Recipe", "name": "Old-Fashioned Yeast Doughnuts", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H", "recipeYield": "12 doughnuts", "recipeCuisine": "", "recipeCategory": "", "keywords": "active dry yeast, eggs, flour, dessert, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 149, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "39 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup warm water", "1 package active dry yeast", "1/4 cup warm milk", "1/4 cup sugar plus extra for dusting doughnuts", "Pinch of salt, or to taste", "1 large egg, lightly beaten", "3 tablespoons vegetable oil plus additional for frying", "2 1/2 cups unbleached flour, approximately", "1/2 teaspoon ground nutmeg or mace"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the water in a large bowl or in the bowl of an electric mixer. Sprinkle the yeast over it and stir it in. Add the milk, quarter-cup sugar, salt, egg and three tablespoons vegetable oil and mix. Beat in one cup of the flour until the mixture is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift another cup of flour with the nutmeg or mace and stir it into the batter mixture with a wooden spoon. Add enough of the remaining flour to make a soft but manageable dough. Cover and set aside to rise until doubled, about one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down and turn it out onto a well-floured surface. Dust it liberally with flour and knead 8 or 10 times, until elastic and smooth. Cover dough with large inverted bowl and rest for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a floured rolling pin to roll the dough to one-half-inch thickness. Cut with a floured three-inch doughnut cutter and, using a spatula, carefully place the cut doughnuts on a floured cloth or surface. Reroll the scraps and cut more doughnuts. Cover the cut doughnuts with a cloth and allow to rise until doubled, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour at least two inches of oil into a deep pan and bring it to 375 degrees over moderate heat. When the doughnuts have risen, slide them into the oil with a spatula and fry them, two or three at a time a minute or so on each side, until golden brown. Lift them out of the oil with a slotted spoon and place them on several thicknesses of paper towel to drain. Dust them with sugar while they are still warm."}], "link": "https://cooking.nytimes.com/recipes/4049-old-fashioned-yeast-doughnuts"}