{"@context": "http://schema.org", "@type": "Recipe", "name": "Ciamotta (Stewed Mixed Vegetables)", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H", "recipeYield": "Six servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, casseroles", "keywords": "dairy-free, gluten-free, nut-free, vegan, vegetarian, eggplant, summer vegetables, side dish", "aggregateRating": null, "recipeIngredient": ["1 large eggplant of about 1 pound, washed", "1 pound of large firm ''white'' waxy type potatoes, washed", "4 bell peppers, washed, red and green mixed, if possible", "1 pound of ripe, firm tomatoes (you can use canned if necessary)", "Virgin olive oil for frying", "2 large cloves of garlic, peeled and crushed almost to a puree", "Salt to taste", "7 or 8 grindings of fresh black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the stem and leaves from the eggplant. Cut it crosswise into quarter-inch-thick slices. Peel the potatoes and cut them crosswise into eighth-inch-thick slices. Core the peppers and discard the seeds. Cut the peppers in half and then into quarter-inch-thick slices lengthwise. Peel and core the tomatoes and crush them very well with your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large frying pan, pour olive oil to make a depth of about an eighth of an inch. When the oil is very hot, fry the eggplant slices. When they are nicely browned on both sides, put them into a large casserole that eventually will hold everything. Add more oil to the pan if necessary and fry the sliced potatoes until they are golden. When they are nicely browned on both sides, drain on paper towels, then put them into a large casserole that eventually will hold everything. Add more oil to the pan if necessary and fry the sliced potatoes until they are golden. When they are done, drain on paper towels, then add them to the eggplant. Saute the peppers until they are just barely soft, adding a bit of olive oil if you think they need it. When the peppers are soft, put them into the casserole with the other cooked ingredients. Meanwhile, preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Distribute the crushed tomatoes onto the ingredients in the casserole and put in the crushed garlic. Gently mix all the ingredients. Add some salt and fresh ground pepper and stir again. Put the casserole into the oven for about 30 minutes. It should be bubbling. This dish is intentionally well cooked. Serve it hot from the casserole."}]}