{"@context": "http://schema.org", "@type": "Recipe", "name": "Insalata Di Arancio E Limone (Orange And Lemon Salad)", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H25M", "recipeYield": "Four to six servings", "recipeCuisine": "italian", "recipeCategory": "salads and dressings", "keywords": "blood orange, lemon, red onion, dairy-free, gluten-free, nut-free, vegan, vegetarian", "aggregateRating": null, "recipeIngredient": ["4 medium navel oranges (blood oranges are preferred, but very difficult to find in this country)", "2 medium, very ripe lemons", "1 small red onion (Bermuda), peeled and thinly sliced or finely chopped", "6 leaves of fresh mint finely chopped (fresh sweet basil may be used instead, or in combination with the mint)", "Several grindings of fresh black pepper", "2 tablespoons virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the oranges and lemons, totally removing the pith. This is best done by slicing the peels off, including the white part, with a sharp paring knife. With a little practice, you will find that this is quite easy and does not take much time. Peel them over a dish, to catch the juice. Reserve for later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the oranges about a quarter-inch thick. Slice the lemons about an eighth-inch thick. Sometimes the lemons have seeds in them. Cut through the lemons' seeds with a very sharp knife as you slice. (Italians are used to eating fruit with seeds in it; the seeds can be scraped out by the eater later.) Spread the sliced oranges on a platter with low sides and then place the sliced lemons on them in a neat pattern. Pour on the juices that resulted from the peeling and slicing. Put the sliced or chopped onion atop the sliced oranges and lemons, then scatter on the chopped mint and/or basil. Grind on the fresh black pepper and drizzle the entire surface with the olive oil, using a bit more if you like. Let the platter stand for about two hours at room temperature. The salad should be served at room temperature."}]}