{"@context": "http://schema.org", "@type": "Recipe", "name": "Bozeman Flank And Beans", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H", "recipeYield": "Six servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, nut-free, flank steak, pinto beans, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 466, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "15 grams", "proteinContent": "34 grams", "saturatedFatContent": "3 grams", "sodiumContent": "792 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dry pinto beans, rinsed", "6 plum tomatoes, cut in half lengthwise", "4 frying peppers, cut in half lengthwise, cored, deribbed and seeded", "1 hot red pepper, seeded and cut across in 1/4-inch slices", "1 teaspoon dry mustard", "3 tablespoons molasses", "4 teaspoons salt, plus more to taste", "1 teaspoon freshly ground black pepper", "1 teaspoon olive oil or bacon fat", "1 medium onion, minced", "1 1-pound flank steak", "2 teaspoons kosher salt", "1 teaspoon coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans in a large, heavy-bottom pot. Cover with 2 inches of water. Bring to a boil for 3 minutes. Remove from heat. Cover and let stand for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Place the tomatoes and frying peppers, skin side up, on a baking sheet. Roast for 25 minutes. Carefully transfer the vegetables with their juices to a food processor or blender. Add the hot red pepper. Puree until smooth. Set aside. In a small bowl, stir together the mustard, molasses, salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain beans, discard liquid and dry the pot. Set beans aside. Place the olive oil or bacon fat in the pot and warm over medium heat. Add the onion and cook until soft, about 5 minutes. Add the beans to the onion. Pour in enough water to barely cover the beans. Stir in the tomato-pepper puree and the molasses mixture. Cover. Bake until tender, about 1 3/4 hours, adding water as needed to keep beans very moist but not soupy. Add salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fifteen minutes before serving, season the steak with 1 teaspoon salt and pepper. Set aside. 10 minutes before serving, place a cast-iron skillet over high heat. Add the remaining salt to the skillet. Heat until hot. Quickly sear the steak, allowing it to cook 2 to 3 minutes on each side, depending on its thickness and how you like your steak cooked. Remove from pan. Let stand for 5 minutes. Slice and serve around beans."}], "link": "https://cooking.nytimes.com/recipes/4084-bozeman-flank-and-beans"}