{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey With Prune Walnut and Celery Stuffing", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "8 - 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "fall, main course, prune, turkey, walnut", "aggregateRating": null, "recipeIngredient": ["Turkey neck and giblets", "1 small onion, coarsely chopped", "1 carrot, sliced", "2 stalks celery, sliced", "4 sprigs parsley", "1 bay leaf", "1 10- to 12-pound turkey", "1/2 pound sweet Italian sausage, casing removed", "4 slices white bread", "3/4 cup milk", "1/2 pound pitted prunes", "1 cup dry red wine", "2 tablespoons unsalted butter", "1 tablespoon safflower or peanut oil ", "1 large onion, chopped ", "2 cloves garlic, minced", "4 stalks celery, finely chopped ", "1 teaspoon dried thyme ", "Coarse salt and freshly ground pepper to taste", "1/3 cup parsley, chopped ", "1 cup walnuts, chopped ", "2 tablespoons melted butter for basting", "8 strips of bacon", "1 cup red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Combine the ingredients for the turkey broth and simmer for one hour. Strain and reserve the broth. Wipe the turkey inside and out with paper towels and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Saute the sausage meat over medium heat, separating it with a fork. Drain off the fat and put the sausage meat into a mixing bowl. Meanwhile, soak the bread and the milk in a small bowl. Simmer the prunes in the wine for 20 minutes, covered. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a paper towel, wipe out the frying pan in which you sauteed the sausage. Add the butter and oil and cook the onion, garlic and celery until soft. Sprinkle with thyme, salt and pepper and add to the sausage meat with the parsley and walnuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the bread from the milk, squeeze it and add it to the sausage meat. Add the prunes with their cooking juices and mix thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season both cavities in the turkey with salt and pepper and fill with the stuffing. Truss with skewers or needle and thread. Tie legs together and tuck in wings. Place turkey breast-side-up in roasting pan. Brush generously with melted butter and place the bacon strips on top. Cover breast with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast turkey two hours, basting every 30 minutes with pan drippings. Uncover and continue roasting for one to two hours longer, depending on size of turkey, until a thermometer inserted into the thickest part of the thigh registers 170 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place turkey on a serving dish and cover loosely with foil. Pour the fat from the roasting pan. Add two cups turkey broth to the pan and bring to boil, scraping up any cooked particles. Add the wine and bring to boil, stirring. Reduce to one-and-a-half cups. Season with salt and pepper and serve separately in a warm sauce boat."}], "link": "https://cooking.nytimes.com/recipes/413-turkey-with-prune-walnut-and-celery-stuffing"}