{"@context": "http://schema.org", "@type": "Recipe", "name": "Poussins or Cornish Hens With Rosemary, Orange And Shallots", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "P1DT4H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cornish hen, fresh herbs, gluten-free, nut-free, main course", "aggregateRating": null, "recipeIngredient": ["4 pounds veal bones", "2 pounds chicken necks and wings", "1 large onion", "3 cloves garlic", "3 carrots, sliced", "2 leeks, sliced, including green part", "3/4 bottle dry white wine", "2 cups chopped plum tomatoes, with their juice", "1 tablespoon tomato paste", "1 teaspoon whole black peppercorns", "6 sprigs fresh thyme", "8 sprigs parsley", "8 quarts water", "1 orange", "8 poussins or Cornish hens, air-dried overnight in refrigerator", "2 bunches fresh rosemary", "4 tablespoons olive oil", "Coarse salt and freshly ground pepper to taste", "16 large shallots", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before, start the stock. Roast the veal bones, chicken necks and bones, onion, garlic and carrots in the oven until well browned. Place in a stock pot with leeks, wine, tomatoes, tomato paste, peppercorns, thyme, parsley and water. Simmer uncovered, for four hours, adding water if necessary (cook for a half-hour after adding extra water). Strain the stock and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Cut the orange in half and cut one half in four slices. Place half a slice inside each poussin; squeeze the juice from the remaining orange half over each poussin. Place some rosemary leaves inside, leaving plenty for the garnish. Sprinkle with oil, season with salt and pepper and truss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the poussins on their side in a roasting pan with the shallots. Roast for 15 minutes, turn on the other side and roast a further 15 minutes. Finish breast-up, place in a serving dish and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove stock from refrigerator and take off the fat, which will be solid. Put the stock in a saucepan and reduce to one-and-a-half cups. Remove the shallots from the roasting pan and keep warm. Degrease the cooking juices from the poussins and add to the stock. Reduce to one-and-a-half cups and correct seasoning. Just before serving, swirl in the butter. Place in a heated sauce boat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the poussins on a serving dish and then arrange shallots around them and garnish liberally with sprigs of rosemary. Pass the sauce separately."}]}