{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Duck With Figs", "description": "", "author": {"@type": "Person", "name": "Bryan Miller And Pierre Franey"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "duck, figs, port, gluten-free, nut-free, main course", "aggregateRating": null, "recipeIngredient": ["2 5 1/2-pound ducks, trussed and tied with string", "Salt and freshly ground pepper to taste", "2 tablespoons vegetable oil", "2 cups coarsely sliced onions (about 2 medium onions)", "1 1/2 cups coarsely sliced carrots (about 3 medium carrots)", "1 1/2 cups coarsely sliced celery (about 3 large stalks)", "5 cloves garlic, halved with skins on", "1 sprig fresh rosemary or 1 tablespoon dried", "2 sprigs fresh thyme or 1 tablespoon dried", "1/4 cup honey", "2 cups red Port", "2 tablespoons butter", "12 large fresh figs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a pan over high heat. Sear the ducks all around (about 2 minutes a duck). Place them in the roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt and pepper in the duck cavities and skin, brush with oil, and arrange the ducks breasts down. Roast for 15 minutes. Turn the ducks breast side up, and roast for 30 minutes more. Remove them from the oven, and pour off any fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the onions, carrots, celery, garlic, rosemary and thyme around the ducks. Increase oven temperature to 500 degrees; then, return the ducks to the oven. Cook for 30 minutes more. Brush the duck breasts and legs with honey. Cook for 30 minutes, brushing on more honey from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the ducks from the oven, place on a platter and keep warm. Strain the vegetables, and place them in a saucepan. Add the Port, bring to a simmer and reduce by about one-quarter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the butter in a skillet over medium-high heat, add figs and cook about 2 minutes. Add sauce from ducks, cover and simmer for 10 more minutes. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, carve the breasts and legs from the ducks. In the center of four large, warm plates, place a breast and a leg, reserving the rest of the duck for other uses. Add three figs on one side and the spinach timbale on the other. Pour the sauce evenly over the meat."}], "link": "https://cooking.nytimes.com/recipes/4192-roasted-duck-with-figs"}