{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Paris-Brest", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, ground almonds, heavy cream, strawberry, summer, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "17 grams", "sodiumContent": "53 milligrams", "sugarContent": "25 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Small amount of butter and flour for preparing baking sheet", "1 cup water", "1/4 pound unsalted butter, in small pieces", "1 teaspoon almond extract", "3/4 cup sugar", "3/4 cup flour", "1/2 cup finely ground blanched almonds", "4 large eggs, at room temperature", "1/4 cup water", "1 cup heavy cream", "2 to 2 1/2 pints ripe strawberries, hulled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Lightly butter a baking sheet and dust it with flour. Mark a circle nine inches in diameter in the flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water to a boil in a medium-sized saucepan. Add the butter, one-half teaspoon of the almond extract and 1 tablespoon of the sugar. When the butter has melted, lower the heat and add the flour and ground almonds all at once, stirring vigorously, until a smooth mass forms that leaves the sides of the pan. Continue beating over low heat a minute or so longer, until the mixture begins to film the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and beat in the eggs one at a time, beating each until it has been thoroughly incorporated in the paste before adding the next. Beat until the mixture is smooth and glossy. If desired, the cooked water, butter, flour and almond mixture can be transferred to a food processor and the eggs added one at a time through the feed tube with the machine running, until a smooth, glossy mixture forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a large spoon, drop high mounds of paste next to each other just inside the circle traced on the baking sheet, forming a ring 9 inches in diameter, about 2 inches wide and 2 inches high. Gently smooth the top with a knife dipped in water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake for one hour, until the ring is brown and there are no beads of moisture on the surface. Using a sharp knife, pierce the finished ring in several places along the side to allow steam to escape. Shut off the oven and return the ring to the oven for 20 minutes to dry. Transfer it to a rack and allow it to cool to room temperature. Place the rack on a sheet of foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix one-half cup of the sugar with one-fourth cup of water in a skillet. Boil over medium-high heat, swirling the pan until the sugar dissolves, until the syrup becomes a rich honey color. Immediately dribble the caramel syrup over the top of the ring in an irregular pattern and allow the syrup to harden for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully split the ring in half horizontally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream until softly peaked. Add the remaining sugar and almond extract and whip until stiff. Spread half the whipped cream over the bottom half of the ring. Arrange the strawberries in a single layer on the cream. Top with the remaining whipped cream and cover with the top half of the ring. If desired, fill the center of the ring with more strawberries, and serve."}]}