{"@context": "http://schema.org", "@type": "Recipe", "name": "Cod and Mashed Potatoes", "description": "", "author": {"@type": "Person", "name": "Dena Kleiman"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cod, leek, mashed potatoes, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["6 medium-size potatoes, scrubbed", "4 tablespoons butter", "1/4 cup milk", "1/2 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "2 tablespoons minced chives", "3 tablespoons olive oil", "1 large onion, peeled, cut in half lengthwise and sliced thin", "3 garlic cloves, minced", "2 ripe tomatoes, peeled and diced", "4 cups dry white wine", "2 cups chicken broth", "1 bouquet garni (1 sprig thyme, 1 sprig parsley, 2 bay leaves, tied together)", "1 pound leeks, green part and roots discarded", "1 quart peanut oil", "2 tablespoons olive oil", "1 tablespoon butter", "4 8-ounce cod fillets", "1/2 teaspoon salt", "1/4 teaspoon freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the potatoes, place them in a large heavy pot and cover with cold water. Bring to a boil, then reduce to a simmer and cook, uncovered, until tender, about 30 minutes. Remove with a slotted spoon, peel potatoes and mash in a bowl with butter, milk, salt, pepper and chives. Cover with foil and keep warm in a low oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce. In a saucepan warm the olive oil over medium-low heat. Add onion and saute until onion caramelizes, turning light golden, about 15 minutes. Add garlic and tomatoes and saute until liquid evaporates, about 5 minutes. Add wine and cook until sauce reduces by half. Add chicken broth and bouquet garni, then simmer on low heat uncovered for 20 minutes, or until sauce is thick. Cover and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If desired, cut leeks in half lengthwise, then halve again into quarters. Wash with cold water and dry completely. Heat peanut oil in a large heavy pot or straight-sided saucepan until the oil registers 275 on a deep-fry thermometer (the oil should not be so hot that it is close to smoking). Fry leeks a few at a time, until golden brown, about 5 minutes a batch. Remove with slotted spoon to drain on paper towels or paper bags."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook fish, heat the olive oil and butter in a saucepan, preferably nonstick, over medium. Season fish with salt and pepper and fry 3 minutes a side, turning once. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat sauce over medium heat until hot. Remove bouquet garni. To serve, mound mashed potatoes on platter, top with fish fillets, sauce and leeks."}], "link": "https://cooking.nytimes.com/recipes/4220-cod-and-mashed-potatoes"}