{"@context": "http://schema.org", "@type": "Recipe", "name": "Cod Papillote", "description": "", "author": {"@type": "Person", "name": "Dena Kleiman"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "clams, cod, mixed lettuces, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 336, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "34 grams", "saturatedFatContent": "5 grams", "sodiumContent": "673 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 6-ounce cod fillets", "4 sheets parchment paper or foil", "1 medium-size yellow onion, sliced thin", "1 tablespoon plus 4 teaspoons butter", "2 tablespoons olive oil", "Salt and freshly ground pepper to taste", "4 teaspoons honey", "4 tablespoons Madeira", "4 cups, lightly packed, salad greens (like red leaf and bibb lettuce, arugula, radicchio, endive, mache)", "Juice of 1 lemon", "4 littleneck clams", "4 sprigs thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees or prepare a grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Check cod and remove any remaining bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold parchment sheets in half. Cut out half-heart shape so that when the sheet is opened there will be a full heart shape, at least 16 inches wide at its widest point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over medium heat, cook onion in 1 tablespoon of butter and the olive oil, until golden brown, 12 to 15 minutes. Stir regularly. Add salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When onion is cooked, stir in honey and Madeira. Cook for 1 to 2 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting with a fully opened heart shape, place 1 cup of salad greens on one side of the parchment, near the center fold line. On top of the greens add 1 cod fillet, 1 teaspoon butter, one quarter of the cooked onion mixture, one quarter of the lemon juice and 1/4 teaspoon salt and a pinch of pepper. Then place one clam alongside the fillet. (During cooking the clam will open. Its juices become part of the sauce, helping to steam the fish.) Garnish with a sprig of fresh thyme. Repeat to assemble the remaining three papillotes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the other side of the parchment paper over the ingredients. And, starting at the fold at the top of the heart, fold the two edges over several times to seal the papillote. (This seam should be on top of the papillote.) Continue this around the entire papillote until you reach the fold at the bottom of the heart. Tuck the very end underneath the papillote to form a tight seal. If grilling, assemble ingredients in center of a double layer of foil. Fold widthwise, crimping edges lightly, then roll and crimp lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 12 to 15 minutes, or grill 10 minutes."}], "link": "https://cooking.nytimes.com/recipes/4222-cod-papillote"}