{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Grilled Salmon With Mustard and Dill", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT45M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, salmon", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 188, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "0 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "162 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup finely chopped fresh dill", "1/3 cup whole-grain mustard", "2 tablespoons white-wine vinegar", "1 salmon about 4 1/2 pounds, boned with head and tail left on", "1/2 cup extra-virgin olive oil", "1/4 cup fresh lemon juice", "1 1/2 teaspoons sugar", "Salt and freshly ground black pepper to taste", "Dill sprigs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together one-half cup of the dill, two tablespoons of the mustard and the vinegar. Spread the fish open and rub this mixture over the flesh. Close the fish up and secure the edge, using slender skewers or sewing it with heavy thread. Rub the skin of the fish with one tablepoon of the oil, cover loosely and allow to marinate in the refrigerator for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile prepare the sauce. Combine the remaining dill and mustard in a small mixing bowl. Beat in one-third cup olive oil, the lemon juice and sugar. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat grill to very hot. Oil a fish basket large enough to hold the fish or oil your racks. If you do not have this equipment you can also use a well-oiled double-sheet of heavy-duty foil into which you have punched holes with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the fish 10 minutes on each side, or a little longer, depending on the intensiy of the heat. For best results, you should cook the fish with the grill covered for about half the cooking time. You will be able to turn the fish only once either by turning the basket or by lifting the fish off the rack with a couple of large spatulas. You can also turn it by just turning the foil package. Before turning it, brush some oil on the skin. After turning it, you may find that some of the skin has stuck to the grill despite your best efforts. Don't worry. The second side, which will be turned up for serving should brown nicely and not stick at all. The fish is done when a wooden skewer or toothpick inserted in the center meets little or no resistance. Do not overcook the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fish is done, place it on heavy-duty foil. Roll it onto a serving plate so the bottom side of the fish is on top. Remove the skewers or trussing and decorate with sprigs of dill. Serve the fish hot or at room temperature with the sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/4231-whole-grilled-salmon-with-mustard-and-dill"}