{"@context": "http://schema.org", "@type": "Recipe", "name": "Giblet Gravy", "description": "While the turkey is in the oven, get some rest — and make the gravy. Giblet gravy requires the cook to use the neck, gizzard and heart of the bird to make deeply flavored stock, which is then combined with the pan drippings, a bit of flour and wine or brandy. Finally, the cooked neck, gizzard and heart are finely chopped and added to the rich, savory gravy, to make for a more interesting texture.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/10/26/dining/26COOKING_GRAVY1/26COOKING_GRAVY1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "2 cups", "recipeCuisine": "american", "recipeCategory": "sauces and gravies", "keywords": "turkey gizzard, turkey heart, turkey necks", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 74}, "recipeIngredient": ["2 large onions, peeled", "Turkey neck, gizzard and heart", "1 carrot, peeled and cut in half", "1 stalk celery, cut in halves", "A few sprigs of parsley", "6 whole peppercorns", "3 cups of water", "1 to 1 1/2 tablespoons flour", "Salt and freshly ground black pepper to taste", "2 tablespoons white wine or brandy (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "After turkey has been roasting for about an hour, slice one of the onions and scatter slices in roasting pan with turkey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the other onion, cut in half, in a saucepan. Add turkey neck, gizzard and heart, the carrot, celery, parsley and peppercorns. Cover with water and bring to boil. Skim surface, lower heat and allow to simmer at least 30 minutes. Strain and reserve the stock. You should have about 2 cups of stock. Dice meat from neck, gizzard and heart, and set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When turkey has finished roasting and is resting on the carving board place the roasting pan on top of the stove, over two burners if necessary. Skim off all but a few tablespoons of fat from pan. Sprinkle the bottom of the pan with the flour (the more used the thicker the gravy), and whisk it vigorously and thoroughly, scraping up any particles clinging to the pan. Gradually add the stock, whisking constantly over medium heat until the mixture has thickened and is smooth. Strain into a sauce pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add any juices from carving board and the reserved giblets. Season with salt and pepper. Add wine or brandy and bring to a simmer, and serve."}], "link": "https://cooking.nytimes.com/recipes/427-giblet-gravy"}