{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash Risotto With Sage", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 - 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, one pot", "keywords": "arborio rice, butternut squash, sage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 381, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "10 grams", "saturatedFatContent": "6 grams", "sodiumContent": "868 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium butternut squash (about 1 pound)", "About 24 sage leaves", "Coarse sea salt and freshly ground pepper to taste", "7 to 8 cups chicken stock", "1 medium onion", "5 1/2 tablespoons unsalted butter", "2 cups Arborio rice", "1/2 cup dry white wine", "1/2 cup grated Reggiano Parmesan, plus extra for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, clean and dice the squash. Put the squash into a heavy-bottom pot and cook it with a few whole leaves of sage, salt, pepper and one cup of chicken stock. Cook 5 to 10 minutes, until tender but not too soft. Meanwhile, chop six sage leaves fine and dice the onion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the rest of the chicken stock and hold at a low simmer. In a heavy-bottom saucepan, heat three tablespoons of the butter, add the chopped sage and cook a minute or two. Add the onion and continue to cook over medium heat until it is translucent, about five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice and a pinch of salt and cook over low heat about three minutes, stirring often, until the rice has turned slightly opaque. Turn up the heat and pour in the white wine. When the wine has been absorbed, add just enough stock to cover the rice, stir well and reduce the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep the rice at a gentle simmer and continue to add more stock, a ladle or two at a time, letting each addition become absorbed by the rice. While the rice is cooking, saute the remaining sage leaves in butter until crisp. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 15 minutes, the rice will be nearly cooked. Stir in the cooked squash, the rest of the butter and the cheese. Continue cooking three to five minutes. Taste for texture and consistency, adding a little more of the stock as needed. Adjust the seasoning. When the rice is done, serve it in a warm bowl and garnish with extra cheese and sauteed sage leaves."}], "link": "https://cooking.nytimes.com/recipes/428-butternut-squash-risotto-with-sage"}