{"@context": "http://schema.org", "@type": "Recipe", "name": "Cherry-Cheese Strudel", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "austrian, eastern european, german", "recipeCategory": "breakfast", "keywords": "almonds, phyllo, sour cherry, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 558, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "16 grams", "saturatedFatContent": "10 grams", "sodiumContent": "380 milligrams", "sugarContent": "40 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups plain low-fat yogurt", "1 1/2 cups pitted sour cherries", "1/2 cup sugar", "1/2 cup sliced almonds, toasted", "1/2 cup bread crumbs, toasted", "2 eggs, separated", "2 teaspoons grated lemon zest", "1 teaspoon vanilla extract", "4 tablespoons unsalted butter, melted", "7 sheets phyllo dough, covered with a damp towel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sieve with 2 layers of cheesecloth and place over a bowl. Place the yogurt in the sieve and refrigerate until the liquid has dripped out of the yogurt, several hours or overnight. Discard the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. In a small bowl, combine the cherries and 2 tablespoons of the sugar. Let stand for 10 minutes. Drain well and set aside. Place the almonds, bread crumbs and 2 tablespoons of the sugar in a food processor and pulse until the almonds are finely ground. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the yogurt in a mixing bowl and whisk in the egg yolks, lemon zest, vanilla extract and the remaining 1/4 cup of sugar. Beat the egg whites by hand or with an electric mixer until soft peaks form. Fold the beaten whites into the yogurt mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter a baking sheet and set aside. Place a kitchen towel on a work surface and place 1 sheet of the phyllo on the towel, with the long side facing you. Keep unused phyllo sheets covered with a damp towel as you work. Brush the phyllo lightly with butter and sprinkle with 2 tablespoons of the crumb mixture. Repeat with 5 more sheets of phyllo. Top with the last phyllo sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving a 1-inch border, spread half of the yogurt mixture in a 3-inch-wide strip along the side nearest you. Combine the remaining crumb mixture with the cherries and place on top of the spread filling. Spread the remaining filling over the cherries. Fold the sides of the phyllo in over the filling. Starting from the bottom, roll the strudel up like a jelly roll. Place, seam side down, on the prepared baking sheet. Brush with the remaining butter. Make 4 short diagonal slices through the phyllo for steam vents. Bake until crisp and golden brown, about 40 minutes. Allow to cool slightly, cut into quarters and serve."}]}