{"@context": "http://schema.org", "@type": "Recipe", "name": "Oyster Mushroom Timbales With Smoked Duck And Hazelnuts", "description": "", "author": {"@type": "Person", "name": "Betty Fussell"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "hazelnut, mushroom, smoked duck breast, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 394, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "26 grams", "saturatedFatContent": "8 grams", "sodiumContent": "699 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 smoked (or regular) duck breasts", "2 tablespoons butter", "2 tablespoons olive oil", "Salt and freshly ground pepper to taste", "2 cups brown duck stock (or use half chicken, half beef stock)", "1/2 cup Marsala wine", "1/4 cup chopped shallots", "1 tablespoon fresh thyme, chopped", "2 tablespoons butter", "Salt and freshly ground pepper to taste", "3/4 cup half-and-half", "1/2 cup brown duck stock (or use half chicken, half beef stock)", "4 large eggs", "Salt and freshly ground pepper to taste", "1 1/2 cups chopped oyster mushrooms, browned in 2 tablespoons of butter", "3 cups whole oyster mushrooms, trimmed and cleaned", "3/4 cup hazelnuts, toasted, skinned and chopped", "Sprigs of fresh herbs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin the duck breasts and remove all fat and connective tissues. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, mix the stock, wine, shallots and thyme in a saucepan and reduce by about two-thirds, or until the mixture coats a spoon evenly. Remove from the heat and whisk in two tablespoons of butter. Season with salt and pepper. Strain through a fine mesh and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the timbales, preheat the oven to 350 degrees and butter the interiors of eight muffin cups. Whisk together the half-and-half, stock and eggs, season with salt and pepper and strain. Place a tablespoon of the chopped mushrooms in each of the muffin cups and press down. Fill the cups with the timbale mixture. Cover the entire muffin tin with a sheet of buttered foil. Place the muffin tin inside a larger pan and fill with hot water to a level halfway up the sides of the cups. Bake for 20 to 30 minutes, or until a thin knife inserted near the center of a timbale comes out clean. Remove the timbales from the oven and let stand for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat two tablespoons of butter and the oil in a skillet over high heat and saute the duck breasts, browning them on both sides until medium rare, or about five minutes a side. Season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, saute the whole mushrooms. Season them and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, run a knife along the edge of each timbale and unmold by inverting onto a cookie sheet. Place each timbale in the center of a plate. Cut the duck breasts into thin strips lengthwise and wrap them around the outer edge of each timbale. Ladle the sauce in a circle around the strips of duck. Garnish with mushrooms, hazelnuts and herbs."}], "link": "https://cooking.nytimes.com/recipes/4295-oyster-mushroom-timbales-with-smoked-duck-and-hazelnuts"}