{"@context": "http://schema.org", "@type": "Recipe", "name": "Fettuccine With Sausage and Fried Sage", "description": "Sage is not just for stuffing, or so Moira Hodgson argued in a 1997 article that extolled the many virtues of the leafy herb. Frying sage leaves in olive oil or butter, as is done in Italy, tones down their strong earthy flavor, leaving behind just a hint. In this recipe, once the leaves are crisped and set aside, a pound of hot Italian sausage and a bit of garlic are browned in the fragrant oil. A cup of cream is added to the pan to deglaze. Finally, the cream, sausage and a generous grating of Parmesan are tossed with a pile of fettuccine and topped with a scattering of delicate sage leaves. It's an elegant, satisfying 30 minute meal.", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": "https://static01.nyt.com/images/2018/01/25/dining/25COOKING-FettageLeaves1/25COOKING-FettageLeaves1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "fettuccine, italian sausage, sage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 269}, "recipeIngredient": ["1 pound fettuccine", "1 pound hot Italian sausage", "About 24 sage leaves", "3 to 4 tablespoons olive oil", "1 clove garlic, minced", "About 1 cup heavy cream", "Coarse sea salt and freshly ground pepper to taste", "Freshly grated Reggiano Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring four quarts of water to a boil for the fettuccine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the sage leaves in the olive oil in a skillet until they are crisp. Drain them on paper towels, leaving the oil in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the sausages in chunks and sauté them in the oil until the pieces are browned, adding the garlic toward the end so that it gets golden but not burned. Remove the sausage from the pan and set aside. Meanwhile, cook fettuccine until al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off the fat from the skillet (preserving the garlic) and add the cream. Bring it to a boil, scrape up cooking juices and return the sausage to heat through. Season with salt and pepper, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta and put it in a heated serving bowl. Pour the sauce on top. Toss and sprinkle with sage leaves. Serve with Parmesan passed separately at the table."}]}