{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Tatin", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H25M", "recipeYield": "Six servings", "recipeCuisine": "french", "recipeCategory": "brunch", "keywords": "all-purpose flour, pear, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 236, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "5 grams", "sodiumContent": "6 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup sugar", "3 tablespoons water", "3 Bosc pears (about 1 1/2 pounds)", "2 tablespoons unsalted butter", "2 tablespoons sliced almonds", "2 tablespoons golden raisins", "2/3 cup of water", "1/2 cup all-purpose flour", "2 tablespoons unsalted butter", "2 teaspoons sugar", "1 1/2 tablespoons milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the caramel: Place the sugar and 3 tablespoons water in a heavy 10-inch skillet. Cook over medium-to-high heat for about 5 minutes, until the mixture turns a light caramel color. Remove from the heat and swirl the caramel in the skillet to cool and harden it. (If the caramel darkens too much as it continues to cook in the pan's residual heat, place the base of the skillet in cool water to stop the cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pears: Peel the pears, cut them in half lengthwise and core them. Arrange the pear halves, cut side up, on the caramel so that the pointed ends of the pears meet in the center. Add the butter and 2/3 cup water. Bring to a boil (the caramel will melt). Cover the skillet with a lid, reduce the heat to low and cook gently for about 20 minutes, checking occasionally, until all the water has evaporated and the mixture in the pan has caramelized again. (By then, the pears should be partly cooked.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pears are cooking, make the dough: place the flour, butter and sugar in the bowl of a food processor. Process for about 10 seconds. Add the milk and process for another 10 seconds. Transfer the unformed dough onto a sheet of plastic wrap and press on it until it forms a cohesive ball. Place another piece of plastic wrap on top of the dough and roll it with a rolling pin between the two plastic sheets to create a circle about the diameter of your skillet. Refrigerate the dough (still encased in plastic) to firm it slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the pears have cooked for 20 minutes fill their hollow centers with the almonds and raisins. Remove the dough from the refrigerator, peel off the top sheet of plastic wrap and invert the dough on top of the pears. Peel off the remaining plastic sheet. Place the skillet in a preheated 400-degree oven for about 30 minutes. (By then, the dough should be nicely browned on top, and when you tilt the pan, there should be a rich layer of caramel in the bottom.) Set the skillet aside until serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the pear Tatin has cooled beyond lukewarm at serving time, rewarm it on top of the stove until the caramel is soft again (the whole mixture will move in the pan when you shake it). Not more than 30 minutes before serving, invert a serving plate on top of the dough and turn the warm tart out onto the plate. Slice into portions, serving half a pear per person."}], "link": "https://cooking.nytimes.com/recipes/4313-pear-tatin"}