{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven Baked Griddle Corn Bread", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT23M", "recipeYield": "2 to 4 servings", "recipeCuisine": "southern", "recipeCategory": "quick", "keywords": "cornmeal, salt pork, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 193, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "341 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup minced lean salt pork", "3/4 cup white cornmeal", "1/4 cup flour", "1/2 teaspoon baking soda", "1 cup buttermilk, approximately", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Place salt pork in 11-inch cast-iron skillet and render it over medium heat until the bits turn crispy and are etched with brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a mixing bowl, stir together cornmeal and flour. Put baking soda into palm of hand and rub out any lumps. Then brush it evenly over surface of flour-cornmeal mixture and stir in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a smaller bowl, whisk 1 cup buttermilk with egg until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When salt pork is cooked as directed, remove pan from flame and carefully scrape all the bits of pork and most of the fat into cornmeal-flour mixture, reserving a little fat in skillet. Place skillet in preheated oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix salt pork bits into cornmeal-flour mixture and then, with spatula, gently turn in the liquid, mixing only enough so there are no large dry lumps left in batter. Batter should be molten but not liquid (pourable but not runny). If necessary, gently work in a little more buttermilk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When fat on griddle begins to smoke, remove griddle from oven (protect hands well; it will be very hot). Scrape batter into center of griddle, letting it spread out of its own accord. It will not quite cover the surface. The batter should sizzle when it hits the hot iron."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately put griddle back in oven and bake 8 to 10 minutes, the length of time depending on whether you like a slightly custardy center. Corn bread is done when golden on top and the center does not quiver when gently shaken. Remember to protect hands when handling skillet. The bottom of the pancake is especially crusty. Invert whole cake onto a plate or cutting board so it is served with crust on top. Eat with butter if you like, but it is delicious as is."}], "link": "https://cooking.nytimes.com/recipes/4323-oven-baked-griddle-corn-bread"}