{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Broccoli Pesto", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, pastas", "keywords": "broccoli, linguine, potato", "aggregateRating": null, "recipeIngredient": ["1 1/2 cups broccoli flowerets (about 1/2 bunch broccoli)", "Salt", "1 clove garlic", "3 tablespoons pine nuts or walnuts", "1/3 cup extra-virgin olive oil", "Freshly ground black pepper", "2 medium-sized boiling potatoes, peeled and cut in 1-inch chunks", "1 pound linguine", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the broccoli flowerets about three minutes, until tender but still bright green. Rinse under cold water, then drain and set aside. Put a large pot of salted water on the stove to boil for the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the broccoli is done, reserve four small flowerets for garnish and place the rest in the food processor along with the garlic and nuts. Process until finely ground."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the machine running, pour the olive oil into the food processor through the feed tube. Stop the machine, scrape the sides, season with salt and pepper and process briefly. Transfer the mixture to a dish and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water is boiling, place the pototoes in the pot and boil for five minutes. Add the pasta, stir to separate the strands and cook until the pasta is al dente, about eight minutes. Drain potatoes and pasta together and transfer to a warm serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the pasta and potatoes with the pureed broccoli mixture. Divide the pasta among four shallow bowls and garnish each serving with a reserved broccoli floweret and serve immediately with Parmesan cheese on the side."}], "link": "https://cooking.nytimes.com/recipes/4326-pasta-with-broccoli-pesto"}