{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Yams And Sage", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "sage, yams", "aggregateRating": null, "recipeIngredient": ["1 gallon chicken broth, homemade or low-sodium canned", "3 medium yams, about 1 pound total, peeled, cut in half", "1 carrot, peeled, cut into 1-inch pieces", "1 stalk celery, cut into 1-inch pieces", "1/2 teaspoon olive oil", "1 teaspoon water", "1/4 teaspoon kosher salt", "1/8 teaspoon cayenne pepper", "1 cup shaved almonds", "1 tablespoon unsalted butter", "1 white onion, minced", "3 cups Arborio rice", "10 cups broth (see above)", "1/2 cup fresh minced sage leaves", "1 tablespoon minced fresh chives", "1 tablespoon grated Parmesan cheese", "1/2 teaspoon salt", "1 teaspoon freshly ground pepper", "2 cups bitter greens, like mustard or dandelion, rinsed and shredded", "1 cup fresh mozzarella, cut into 1/4-inch dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the chicken broth, yams, carrot and celery in a large pot and bring to a boil. Lower heat and simmer until reduced to 10 cups, about 30 minutes. With a slotted spoon remove 1 yam, cut it into 1/2-inch dice and set aside to use in preparing the rice. Remove the broth and remaining vegetables from the heat, puree in a blender and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the garnish. Preheat the oven to 350 degrees. Combine the olive oil, water, salt and cayenne in a bowl. Add the almonds and toss to coat them. Spread the almonds on a baking sheet and bake until golden, about 15 minutes. Remove from the sheet and set aside. The recipe can be done ahead to this point for up to 3 days before serving; refrigerate the broth and the diced yam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Forty minutes before serving, warm the yam broth over low heat and bring the reserved yam to room temperature if necessary. In a heavy pot, melt the butter over low heat. Add the onion, cover and cook until soft, about 5 minutes, stirring to avoid browning. Add the rice and stir well. Ladle in 1/2 cup of the broth and stir. Increase the heat to medium-high and for the next half hour continue ladling in the broth and stirring the rice to help it absorb the liquid and to prevent it from sticking. After 20 minutes, add the diced yam. When 1 cup of yam broth remains, the rice should be tender. If it is not, add simmering water and continue stirring until it is. Remove from the heat immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Vigorously stir in the remaining yam broth. This should make a very soupy porridge. Quickly stir in half the minced sage and chives and the Parmesan. Adjust seasoning with salt and pepper to taste. Stir in the greens and carefully stir in the mozzarella. Divide among bowls. Garnish with a sprinkling of the spiced almonds and the remaining fresh sage and chives and serve immediately."}]}