{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel-Seed Gnocchi", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "Four to six first-course servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "fennel seeds, flour, prosciutto, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 675, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "31 grams", "sodiumContent": "574 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup milk", "8 tablespoons (1 stick) unsalted butter", "Salt and freshly ground black pepper to taste", "1 cup flour", "2 large eggs", "2 tablespoons fennel seeds, toasted and lightly crushed", "1/2 cup cornmeal", "1 tablespoon butter", "1 tablespoon olive oil", "1 large clove garlic, minced", "1 medium shallot, minced", "1/4 cup brandy", "1/2 cup dry white wine", "2 cups heavy cream", "4 thin slices prosciutto", "8 large leaves fresh basil", "3 tablespoons freshly grated Parmigiano-Reggiano cheese, plus extra for garnish", "1 large ripe tomato", "Minced fresh parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the milk, butter, a half teaspoon of salt and three or four grinds of fresh black pepper in a deep, heavy saucepan. Have the flour ready at the side of the stove. Bring the mixture to a boil, remove from the heat and add the flour all at once. Stir vigorously with a wooden spoon to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pot to the stove over medium heat and cook, stirring constantly, until the mixture leaves the sides of the pan and forms a sleek ball, about two minutes. Remove from the heat and let cool for five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the eggs, one at a time, beating vigorously with a wooden spoon after each addition. The dough should be smooth and satiny. Beat in the fennel seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust a large baking sheet lightly with cornmeal. Pinch off hazelnut-size pieces of dough, roll them into balls and then form into almond shapes. Arrange on the baking sheet and chill for two to three hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, heat the butter and oil in a medium saucepan. Add the garlic and shallot and cook over medium-low heat until they are soft, about five minutes. Raise the heat and add the brandy. Cook until reduced to a glaze. Add the wine and cook until reduced by half. Add the cream and cook until thickened and reduced by about one-third. The sauce can be made ahead to this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the prosciutto into julienne strips. Stack the basil leaves and cut crosswise into very thin julienne. Cut the tomato in half, remove the seeds and dice the flesh. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, bring a large pot of salted water to a rolling boil. Lower the heat slightly and add the gnocchi in batches. Cook seven to 10 minutes, until the gnocchi are light and floating. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the sauce, if necessary, and stir in the cheese. Gently stir in the basil and tomato. Separate the prosciutto strips and gently stir into the sauce. Season with salt, if needed, and pepper to taste. Very gently add the gnocchi and heat until warmed through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the gnocchi and sauce into warmed soup bowls. Sprinkle with additional cheese if desired, along with parsley and fresh pepper."}]}