{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic Chicken Soup", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, one pot, pastas, soups and stews", "keywords": "broccoli rabe, garlic, orecchiette, low-fat, main course", "aggregateRating": null, "recipeIngredient": ["1 head garlic", "2 tablespoons extra-virgin olive oil", "3 quarts water", "1/2 bunch broccoli rabe", "1/2 pound orecchiette pasta (small shells can be substituted)", "8 cups unsalted chicken broth", "1/4 teaspoon hot red pepper flakes, or to taste", "Salt to taste", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Put the garlic on a piece of foil, brush it with 1 tablespoon of the oil, enclose it in the foil and bake for about 30 minutes, until it is just tender. Unwrap it and let it cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring the water to a boil in a pot. Coarsely chop the rabe and add it to the water; when the water returns to a rolling boil, remove the rabe with a slotted spoon. Set the rabe aside and add the pasta to the water. Boil until tender, about 8 minutes; drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the garlic is cool enough to handle, peel and chop it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining tablespoon of oil in a heavy 3-quart saucepan. Add the garlic and cook over medium heat, stirring, about 2 minutes, until the garlic begins to coat the bottom of the pan. Pour about 1/2 cup of the broth into the pan, bring to a simmer and stir to dissolve the garlic. Add the remaining broth and the hot pepper. Stir in the rabe and the pasta. Season with salt and serve with Parmesan cheese on the side."}], "link": "https://cooking.nytimes.com/recipes/4397-garlic-chicken-soup"}