{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roasted Fish", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, roasts", "keywords": "main course, rosemary, striped bass", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "recipeIngredient": ["1 large whole striped bass or salmon, 5 to 8 pounds", "2 tablespoons extra-virgin olive oil", "Salt and freshly ground black pepper", "1 large bunch fresh rosemary", "Several large sprigs fresh coriander for garnish", "1 1/2 to 2 cups sauce chien or romesco sauce (recipes follow)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The fish should be cleaned and gutted but left whole. For flavor and dramatic presentation, the head should be left on the fish but you may have to remove it if the fish will not fit in your oven with the head. You will need an oven at least 20 inches wide to accommodate a whole fish larger than 6 pounds. You will also need a very large pan to hold the fish. You can improvise one using a standard 17-inch baking sheet, wrapping it in several thicknesses of heavy-duty foil and extending the foil beyond the ends of the baking sheet to create a surface that will fit the fish. Turn up the edges of the foil to catch pan juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the fish inside and out with the olive oil. Season the cavity of the fish with salt and pepper and stuff it with the rosemary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the fish on the prepared pan, place it in the oven and roast it 5 minutes per pound. Remove the fish from the oven and turn off the oven. Cover the fish loosely with a tent of foil and allow it to rest at least 15 minutes. It can rest for up to one hour and then be served at room temperature. Alternatively, after the resting period, the fish can be returned to the oven set at the lowest possible temperature (140 to 150 degrees) and kept warm without overcooking for up to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At serving time, transfer the fish to a platter and garnish with the fresh coriander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, peel off the top layer of the skin of the fish, then, using a large fork and a spatula, carefully lift sections of the fish off the bone. When all the exposed flesh has been removed from the bone, lift off the skeleton in one piece to expose the flesh underneath. Serve portions of it, lifting it off the skin, with sauce on the side."}]}