{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Pudding", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT30M", "recipeYield": "8 servings", "recipeCuisine": "british", "recipeCategory": "brunch", "keywords": "berries, bread, heavy cream, dessert, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 481, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "74 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "11 grams", "sodiumContent": "306 milligrams", "sugarContent": "45 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 one-pound loaf day-old, thin-sliced, white sandwich bread", "1 1/4 cups sugar (approximately)", "Juice of one lemon", "2 1/2 pints mixed fresh berries (strawberries, blueberries, raspberries, blackberries, currants)", "1 1/2 cups heavy cream, softly whipped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the crusts from the bread. Arrange the slices, trimming them to shape where necessary, to line the inside of a two-quart mixing bowl completely. Reserve enough remaining bread to cover the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one cup of the sugar in a heavy saucepan over low heat and stir in the lemon juice. When the sugar has dissolved, gently stir in the berries and cook just until they have started giving up their juices, about 5 minutes. The berries should be soft but still hold their shape and be in a rich purplish syrup. Taste the syrup and, if necessary, add additional sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a slotted spoon to transfer the berries to the bread-lined bowl. Pour all but one-half cup of the syrup over the berries. The bowl should be nearly full. Cover the top with the reserved bread, then place a piece of plastic wrap loosely over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a china plate that will fit into the bowl on top, then weight it down with something heavy like a two-pound can of tomatoes. Some of the juices will begin to ooze up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the weighted pudding in the refrigerator at least eight hours. Refrigerate the reserved syrup as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving run a knife around the inside of the bowl and unmold the pudding onto a plate that has enough of a rim to catch any excess syrup. Use the reserved syrup to paint any places where the syrup has not completely soaked through the bread. Serve with whipped cream on the side."}], "link": "https://cooking.nytimes.com/recipes/4434-summer-pudding"}