{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Grain Stuffing With Kale and Dried Fruit", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/10/dining/ricestuffing-still/ricestuffing-still-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 cups, enough for a 12-pound bird", "recipeCuisine": "", "recipeCategory": "casseroles", "keywords": "dried fruit, kale, whole-grain bread, fall, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 272, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "243 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound whole-grain bread (stale is fine), thickly sliced", "Salt", "1 pound kale", "1/2 cup extra virgin olive oil, more for greasing baking dish", "1/4 cup balsamic vinegar", "1/2 cup chopped dried figs (about 10 to 12 depending on size)", "1/2 cup chopped pitted dates (about 4)", "1 shallot, chopped", "2 tablespoons chopped fresh sage, or 2 teaspoons dried", "1/2 cup chopped hazelnuts", "Freshly ground black pepper", "1/4 cup butter, optional, more for greas-ing pan, if cooking outside bird"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Put bread on a baking sheet and toast, turning once or twice, until golden and dry, 10 to 20 minutes. Remove from oven and cool a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While bread toasts, put a large pot of water to boil and salt it. Fill a large bowl with ice water. When pot comes to a boil, add kale; let it wilt for about a minute, then drain and plunge it into ice water. When cool, squeeze kale dry and roughly chop. Put kale, oil, vinegar, figs, dates, shallot, sage and nuts in a large salad bowl. Sprinkle with salt and lots of pepper and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with tap water and soak bread for about 3 minutes. Gently squeeze a slice dry and crumble it into salad bowl. Repeat with remaining slices. Toss well to combine stuffing and let sit for 15 to 20 minutes or cover and refrigerate for up to a day. Before finishing, taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place stuffing in bird and bake. Or to bake it outside of bird, grease a 2-quart or 9-by-13-inch baking dish and fill it with stuffing. Dot top with bits of butter if you like. Cover with foil and bake for 20 minutes; then uncover and finish baking until crisp, another 10 to 15 minutes more."}]}