{"@context": "http://schema.org", "@type": "Recipe", "name": "Andrea da Merano's Semifreddo di Amaretti With Fresh Peaches", "description": "This recipe came to The Times in 1987 from the chef Andrea de Merano, who was cooking then at Palio in Manhattan. It is more like a frozen mousse than ice cream, and is served at a higher temperature than a typical American frozen dessert. Make sure the peaches are really ripe for this, and wait until serving to add the crumbled amaretto cookies. Take heart: This recipe might take some time, but it will keep up to a week in the freezer. (The New York Times)", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "amaretto cookie, heavy cream, peach, dessert, raw, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "9 grams", "sodiumContent": "91 milligrams", "sugarContent": "23 grams", "transFatContent": null}, "recipeIngredient": ["6 egg yolks", "1/2 cup amaretto cookie crumbs", "1 tablespoon amaretto liqueur", "3 egg whites", "1 cup sifted confectioners' sugar", "1 1/2 cups heavy cream", "2 pounds ripe peaches", "1 tablespoon lemon juice", "Lightly crushed amaretto cookies for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer, beat the egg yolks until they thicken. Add the amaretto cookie crumbs and continue beating 5 minutes, scraping the sides of the bowl periodically, until the mixture becomes quite light in color and very thick. Stir in the liqueur."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean, dry bowl beat the egg whites until they foam. With the mixer at high speed continue beating, gradually adding 1/2 cup of the confectioners' sugar. Beat until the egg whites hold firm peaks, about 3 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a chilled bowl beat the cream until it holds soft peaks. Fold the egg whites and cream together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold one-quarter of the cream and egg white mixture into the egg yolk mixture until well blended. Gently fold in the remaining cream and egg white mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the mixture in 12 individual 1/2-cup custard cups or 8 six-ounce custard cups or molds or a 6-cup loaf pan or mold; cover with plastic wrap and freeze several hours or overnight. The semifreddo will keep at least a week in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, plunge the peaches into boiling water 15 seconds, rinse under cold water, peel, pit and cut them into thin slices. Toss with remaining 1/2 cup of confectioners' sugar and the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip the mold or molds briefly into hot water and turn out onto individual chilled plates or a serving platter. Surround with peach slices. Sprinkle the semifreddo with crumbled amaretto cookies and serve."}], "link": "https://cooking.nytimes.com/recipes/4472-andrea-da-meranos-semifreddo-di-amaretti-with-fresh-peaches"}