{"@context": "http://schema.org", "@type": "Recipe", "name": "Biba Caggiano's Semifreddo di Nocciole Al Cioccolato", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT55M", "recipeYield": "8 to 12 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, hazelnut, heavy cream, semisweet chocolate, raw, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 388, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "17 grams", "sodiumContent": "31 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces shelled hazelnuts", "7 large egg yolks", "1/2 cup sugar", "1/4 cup hazelnut liqueur", "2 cups heavy cream", "Butter for greasing pan", "1/3 cup milk", "4 ounces semisweet baking chocolate, cut into chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a broiler or a toaster oven. Spread the hazelnuts on a baking pan and toast until dark brown and the skins have blistered. Put the nuts in a large kitchen towel or a plastic bag and rub them against each other to remove the skins. Put the skinned, toasted nuts in a food processor or electric blender and process until finely chopped but not pulverized. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the egg yolks and sugar in the top of a large (about 3-quart) double boiler or in a bowl that can sit in a saucepan of simmering water without touching the bottom. Beat the egg yolks and sugar until pale yellow and thick. Beat in the liqueur. Place the pan over the bottom of the double boiler or the saucepan containing simmering water. Using a large wire whisk, continue beating the mixture until it has warmed, doubled in volume and is thick. Do not overcook, or the eggs will scramble. This is a zabaglione."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and set the bowl in a pan of ice and water. Stir with a whisk until the zabaglione cools completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream until nearly stiff and fold into the zabaglione. Fold in the chopped hazelnuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter the bottom and sides of a 6-cup loaf pan and line with plastic wrap, allowing the plastic to overhang the sides. Spread the mixture in the pan, cover with the overhanging plastic wrap and freeze overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One hour before serving unmold the semifreddo onto a chilled serving dish, remove the plastic wrap and return to the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the milk and chocolate in the top of a double boiler and cook over simmering water, stirring constantly, until the chocolate has melted and the sauce is smooth. Serve the semifreddo sliced, with warm chocolate sauce."}]}