{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Duck With Asian Vegetables and Sweet Potato Puree", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four servings", "recipeCuisine": "asian", "recipeCategory": "dinner, roasts", "keywords": "duck, ginger, sweet potato, main course", "aggregateRating": null, "recipeIngredient": ["1 duck, about 3 1/4 pounds", "1/2 teaspoons salt, plus more to taste", "Freshly ground pepper to taste", "5 teaspoons canola oil", "5 1/4-inch rounds peeled fresh ginger", "1 large daikon radish, peeled and cut into 1/2-inch-thick slices", "1 pound water chestnuts, peeled if fresh; drained and dried, if canned", "8 large shiitake mushrooms, stemmed", "2 bunches scallions, green part trimmed to 2 inches", "1 1/4 cups port", "1 cup low-salt chicken broth", "2 large sweet potatoes, peeled and cut into 1-inch disks", "1 cup milk", "1/2 teaspoon ground cinnamon", "1 orange, juiced; peel removed in strips", "1 1/2 teaspoons unsalted butter", "1/2 medium apple, diced", "1/2 banana, sliced", "1 tablespoon sugar", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the duck, preheat the oven to 450 degrees. Place 1/2 teaspoon salt, pepper and 3 rounds of ginger in the duck cavity. Season the outside with salt and pepper. Heat 1 tablespoon oil in a large skillet over high heat, and sear the duck until browned on all sides. Place the duck in a large roasting pan and roast for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour the fat from the skillet, add 1 teaspoon oil and place over high heat. Season the radish, water chestnuts, mushrooms and scallions with salt and pepper. Add the radish to the skillet and cook 1 minute. Add water chestnuts and saute until vegetables are well browned, about 10 minutes. Scatter in the roasting pan around the duck. Add 1 teaspoon oil to the skillet, add the mushrooms and scallions and saute until browned, about 5 minutes. Place in the roasting pan. Pour the fat from the skillet and set the skillet aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sweet potatoes, place in a large saucepan with the milk, cinnamon and orange peel. Cover with water. Simmer over high heat until tender, about 10 minutes. Drain, leaving 3 strips of orange peel in the pan. Add the butter, apple and banana and saute 2 minutes. Add the sugar and orange juice and stir until caramelized. Remove the fruit with a slotted spoon, add the cream and cook, scraping the bottom of the pot, for 30 seconds. Strain through a fine sieve. Place the sweet potatoes, fruit and strained cream mix in a food processor and puree. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, add port to skillet, place over high heat and reduce for 2 minutes. Add 2 rounds of ginger. Simmer until reduced to a glaze, about 10 minutes. Stir in broth and simmer for 5 minutes. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the duck stand for 10 minutes; carve into serving pieces. Place the pieces in the center of a large platter and surround with the vegetables. Pass the sweet potatoes and the sauce separately."}], "link": "https://cooking.nytimes.com/recipes/4489-roast-duck-with-asian-vegetables-and-sweet-potato-puree"}