{"@context": "http://schema.org", "@type": "Recipe", "name": "Tea-Smoked Duck Breast", "description": "", "author": {"@type": "Person", "name": "Susan Herrmann Loomis"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 appetizer servings", "recipeCuisine": "chinese", "recipeCategory": "", "keywords": "appetizer, black tea, duck breast, sichuan peppercorns", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 321, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "6 grams", "sodiumContent": "32 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["The breasts from 2 fresh ducks, whole and boned, with skin left on", "1 teaspoon Roasted Sichuan Pepper-Salt (<a href=\"http://cooking.nytimes.com/recipes/4532-roasted-sichuan-pepper-salt\">see recipe</a>)", "Grated zest from a small, well-scrubbed orange", "1 scallion, trimmed, the white and green parts minced", "1 teaspoon minced fresh ginger", "1 tablespoon peanut oil", "1/4 cup dry black tea leaves", "1/4 cup packed brown sugar", "1/4 cup dry rice", "1 tablespoon Sichuan peppercorns", "4 4-inch-long cinnamon sticks, broken into several pieces", "4 1/2-inch-by-4-inch pieces of home-dried orange zest (take the zest from an orange with a vegetable peeler, set the strips on a cooling rack in a warm spot until they are dry, but not brittle, overnight.)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the duck breasts in half, lengthwise. Trim away any cartilage or membrane, and remove the fillet (a small strip of meat and tendon on the meat-side of the breast that comes off easily; some butchers may have already removed this when boning the duck). Sprinkle equal amounts of the Sichuan pepper-salt on all sides of the duck breasts, then rub with equal amounts of the orange zest. Pat equal amounts of the scallions and the ginger onto the duck breasts, then lay them in a nonaluminum dish, cover tightly and refrigerate overnight. Bring to room temperature before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy-bottomed skillet over medium-high heat until nearly smoking. Sear the duck breasts on the skin side only until dark golden brown. Remove from the heat and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix all of the smoking ingredients in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To smoke the duck breasts, prepare a wok (or Dutch oven) by lining it and the lid with two layers of heavy-duty aluminum foil, leaving an overhang of about five inches. Spread the smoking ingredients in the bottom of the wok and place a round cooling or steaming rack about one inch above the smoking mixture, propping it up if necessary with balls of aluminum foil set under the four corners of the rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the uncovered wok over high heat and cook until wisps of smoke come from the smoking mixture. Place the duck breasts, skin side down, on the rack. Cover the wok, and crimp the foil edges together, leaving a small escape valve for the smoke. Smoke the duck breasts for four minutes, turn off the heat and let them sit for an additional three minutes before removing the lid. If the duck is too rare for your taste, add a tablespoon of dry rice to the smoking mixture, return the breasts to the rack and smoke for an additional two or three minutes. Let the duck breasts cool, then slice them in thin diagonal slices and serve."}]}