{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Herb Focaccia", "description": "", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": null, "totalTime": "PT35M", "recipeYield": "8 pieces", "recipeCuisine": "italian", "recipeCategory": "project", "keywords": "all-purpose flour, fresh herbs, yeast, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 263, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "225 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 cake yeast or 1 envelope active dry yeast", "1 cup warm water", "1 1/2 teaspoons sugar", "2 tablespoons olive oil, plus 2 to 3 tablespoons for greasing and brushing", "3 to 3 1/4 cups all-purpose flour", "2 to 3 cloves garlic, peeled", "1/4 cup mixed chopped fresh herbs, including basil, marjoram and thyme", "1 tablespoon cracked black peppercorns", "1 tablespoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the yeast, water and sugar in a bowl, and let stand for 5 minutes, or until foamy. Stir in the oil and 3 cups of the flour. Knead the dough by hand for 6 to 8 minutes until smooth and elastic, or use a food processor or a mixer fitted with a dough hook. If necessary, add more flour; the dough should be soft and pliable but not sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough in an oiled bowl, brush the top with oil, cover with plastic wrap, and let rise in a warm place for 1 hour or until doubled in bulk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down, and form it into a long 2-inch-thick roll. Cut the roll into 2-inch pieces. Form each piece into a ball, and keep covered with a damp dish towel. Roll out each ball as thinly as possible to make a flat bread 6 to 8 inches in diameter and 1/8-inch thick. Lightly dust each round with flour, and stack, separated by pieces of wax paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grill until it is medium-hot. Mince the garlic, and combine with the herbs in a small bowl. Combine the cracked peppercorns and salt in another small bowl. Lightly brush each round with olive oil, sprinkle with herbs and the salt mixture, and place, oiled side down, on the grill. Cook for 30 to 60 seconds, or until slightly puffed and blistered. Lightly brush the top with oil, and sprinkle on more herbs and the salt mixture. Turn the focaccia, and cook another 30 seconds or until lightly browned. Cook all the dough the same way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, sprinkle each focaccia with a few more herbs and the salt mixture."}], "link": "https://cooking.nytimes.com/recipes/4543-grilled-herb-focaccia"}