{"@context": "http://schema.org", "@type": "Recipe", "name": "Fruit And Nut Stuffing", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Enough for a 10-pound turkey", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, chestnut, dried apricots, fall, side dish", "aggregateRating": null, "recipeIngredient": ["2 cups fresh chestnuts", "1 cup dried apricots", "1 1/4 cup plump raisins (3/4 cup sultanas and 1/2 cup regular variety)", "1 cup minced yellow onions", "1 clove garlic, minced", "3 tablespoons extra-virgin olive oil", "1 cup chopped, unpeeled apples (Granny Smith, Wolf River or any tart cooking apples)", "1 cup chopped celery", "2 cups croutons made of stale or toasted whole-wheat bread", "Rind of one orange, minced", "1 cup minced parsley", "1 tablespoon minced fresh thyme, or more to taste", "1 teaspoon freshly ground black pepper, or more to taste", "1 cup defatted stock made from turkey giblets", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Score the chestnuts and place them on a baking sheet in the oven for approximately 20 minutes, or until they have opened and the tough outer shells have loosened. Then peel the chestnuts, being careful to remove the fuzzy inner membrane. If they are difficult to peel, return them to the oven for 5 to 10 minutes. When all the chestnuts are peeled, blanch them in a small pan of boiling water for 5 to 10 minutes, or until they start to soften. Drain immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the apricots and raisins in separate bowls and cover them with boiling water. Set aside for at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over low heat, gently saute the minced onions and garlic in 2 tablespoons of olive oil until they are soft and just starting to change color; this will take about 25 minutes. Place the onions and garlic in a mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon of olive oil to the pan along with the chopped apples. Turn the heat up to medium and stir continuously. When the apples brown along the edges and start to soften, transfer them to the bowl with the onions and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the chestnuts coarsely and add them to the bowl. Drain the apricots and cut them into bite-sized pieces. Then drain the raisins and put them and the apricots in the bowl. Add the celery, croutons, orange rind, parsley, thyme and pepper. Pour in half of the turkey stock, mix, then stir in the remaining stock. Taste and season with salt and more pepper or thyme if desired. Set aside until you are ready to stuff the turkey."}], "link": "https://cooking.nytimes.com/recipes/455-fruit-and-nut-stuffing"}