{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Surprise Cake", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bittersweet chocolate, butter, whiskey, dessert", "aggregateRating": null, "recipeIngredient": ["9 ounces bittersweet chocolate", "11 tablespoons unsalted butter plus soft butter for greasing molds", "3 tablespoons heavy cream", "2 tablespoons Jack Daniel's whisky or other bourbon", "3 large eggs", "3 egg yolks", "1/2 cup sugar", "1/3 cup all-purpose flour", "Whipped cream or coffee ice cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 4 ounces of the chocolate in the top of a double boiler over simmering water. Remove from heat and stir in 1 tablespoon of the butter. Transfer to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine cream and whisky in a small saucepan. Bring to a boil, then pour over the melted chocolate. Stir with a wooden spoon to combine. Place in the refrigerator and allow to cool, stirring occasionally, until the mixture is firm enough to handle, about an hour. Using a melon baller or a teaspoon, quickly form the chocolate mixture into eight truffle-sized balls. Place on a pan or plate lined with waxed paper and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Butter a muffin tin or tins with 8 cups that are each 4 inches in diameter, preferably of 1-cup capacity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining 5 ounces of chocolate and 10 tablespoons butter in the top of a double boiler over simmering water; stir and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs, egg yolks and sugar together until the mixture thickens, triples in volume and forms a ribbon. Fold in the melted chocolate. Sift the flour over the mixture and quickly fold it in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter evenly among the prepared cups. Insert a chilled truffle in the center of each, place in the oven and bake 12 minutes, until the top springs back when touched lightly. Do not insert a cake tester."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold the cakes: run a knife around the edges, then place a baking sheet over the tin and, holding both together, invert, then carefully lift off the muffin tin. Serve at once with whipped cream or ice cream."}]}