{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Pot Pie", "description": "", "author": {"@type": "Person", "name": "Trish Hall"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, casseroles", "keywords": "chicken, flour, parsnip, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["8 cups chicken stock", "1 tablespoon black peppercorns", "4 sprigs thyme", "2 sprigs rosemary", "3 cloves garlic, crushed", "1 bay leaf", "Salt to taste", "2 chicken breasts, split", "4 chicken legs", "4 chicken thighs", "4 small carrots, peeled and chopped coarse", "2 small sweet potatoes, peeled and chopped coarse", "1 medium-size leek, sliced and rinsed", "4 small parsnips, peeled and chopped coarse", "2 ribs celery, chopped coarse", "1 fennel bulb, chopped coarse", "4 tablespoons butter", "3 tablespoons flour", "1/4 teaspoon chili powder", "1/4 teaspoon cayenne", "Soy sauce to taste", "Tabasco to taste", "Freshly ground pepper to taste", "2 1/2 cups flour", "2 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup unsalted butter, melted", "2/3 cup buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken stock in a large pot and add the peppercorns, thyme, rosemary, garlic, and bay leaf. Add salt if using unsalted chicken stock. Bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken pieces and lower the heat, simmering the chicken for about 25 minutes, until it is tender and comes easily off the bone. The legs may take longer to cook than the breasts. Remove the chicken from the liquid and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the stock through a fine strainer, then return to the pot and put over high heat. When the stock is boiling, add the carrots, sweet potatoes and leek and cook for five minutes. Then add the parsnips, celery and fennel. Return to a full boil and cook for a minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the vegetables by passing the stock again through a strainer. Return the stock to the pot and simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cooled chicken from the bones, tearing into bite-sized pieces and discarding the skin. Put the chicken and vegetables in a large overproof casserole and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a small pan. When it starts to foam, add the flour, chili powder and cayenne and cook for several minutes, stirring constantly. Then, slowly, add one cup of the hot chicken stock. Add to the rest of the chicken stock and bring to a boil. Season with soy sauce, Tabasco, pepper and salt, taking into consideration that the flavors will soften when added to the chicken and vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sauce to the vegetables and chicken, generously covering. At this point, the casserole can be refrigerated for up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Put the casserole in the oven while you make the biscuit topping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the topping, mix the flour, baking powder, baking soda and salt, then add melted butter. Mix with fingers. Add buttermilk, continuing to mix the ingredients by hand. Make eight ball-shaped biscuits, then flatten slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove casserole from the oven. Place the biscuits around the top of the surface of the casserole. Bake until biscuits are golden brown, about 25 minutes."}], "link": "https://cooking.nytimes.com/recipes/4651-chicken-pot-pie"}