{"@context": "http://schema.org", "@type": "Recipe", "name": "Fiery Chili With Red Beans", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "12 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner, soups and stews", "keywords": "main course, onion, red kidney beans, stewing beef, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "recipeIngredient": ["2 pounds dried red kidney beans", "12 cups cold water", "3 teaspoons salt", "2 pounds stewing beef (chuck, shoulder or shank)", "1/2 pound ham rind or bacon, cut into 1/2-inch pieces", "1 pound onions, peeled and cut into 1-inch pieces, and for garnish, 1 cup chopped onion, washed in a sieve and pressed in a kitchen towel to prevent discoloration", "8 cloves garlic, crushed, peeled and chopped (2 tablespoons)", "2 tablespoons chopped jalapeno pepper (more or less to taste)", "1 large (1-pound, 12-ounce) can whole Italian tomatoes in juice", "2 teaspoons coriander seeds", "2 teaspoons cumin powder", "2 teaspoons dry mustard", "1 teaspoon red pepper flakes", "4 tablespoons chili powder", "Tabasco sauce", "1 cup grated Cheddar cheese", "Corn tortillas or tacos", "1 cup chopped onion, washed in a sieve and pressed in a kitchen towel to prevent discoloration"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the beans under cool water, removing and discarding any damaged beans and any foreign material. Place the beans in a large pot with the cold water and 1 teaspoon of the salt, and bring to a boil. Cover, reduce the heat, and cook gently for 1 1/4 to 1 1/2 hours, until the beans are tender but not mushy. Set aside; do not drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the beef into 1-inch pieces, and then chop coarsely by hand or in a food processor. When using a food processor, place about 1/2 pound of the chuck in the bowl at a time, and pulse the motor for about 10 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pieces of ham rind or bacon in a saucepan, and cook over medium heat for about 10 minutes, until most of the fat has been rendered and the rind is dry and brown. Add the 1 pound of onion pieces and the beef, and cook, stirring, for about 5 minutes, until the meat separates and loses its red color. Stir in the garlic, jalapeno pepper and tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mini-chopper or small coffee grinder, process the coriander seeds, and add them to the saucepan, along with the cumin powder, mustard, red pepper flakes, chili powder and the remaining 2 teaspoons of salt. Bring the mixture to a boil. Combine the meat mixture and the beans (liquid and all), return to a boil, cover, reduce the heat to low, and simmer for 1 hour. (The mixture will be soupy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon over boiled rice, and garnish with the Cheddar cheese and the chopped onion. Pass the Tabasco sauce and the corn tortillas or tacos."}]}