{"@context": "http://schema.org", "@type": "Recipe", "name": "Regina Schrambling’s Shaker Lemon Pie", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "One 9-inch pie, about eight servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, lemon", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 496, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "8 grams", "sodiumContent": "330 milligrams", "sugarContent": "50 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 small lemons", "2 cups sugar", "2 cups flour", "1 teaspoon salt", "1/3 cup shortening, chilled and cut into pieces", "1/3 cup butter (about 5 1/3 tablespoons), chilled and cut into pieces", "1/4 to 1/3 cup ice water", "4 large eggs", "1 tablespoon heavy cream", "Unsweetened whipped cream, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the lemons, then cut in half lengthwise. Cut the halves into paper-thin slices, rind and all. Remove the seeds and place the slices in a glass bowl. Add the sugar and mix well. Cover, and let stand overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour and salt in a mixing bowl. Add the shortening and the butter. Using a pastry blender or two knives, cut in the butter and shortening until the mixture resembles coarse crumbs. Sprinkle the ice water over the flour a tablespoon at a time, tossing until the ingredients cling together. Turn out onto a lightly floured board and press the dough together. Cut off one-third of the dough. Wrap both pieces in plastic wrap and chill at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. On a lightly floured board, roll out the larger portion of the dough into a circle large enough to fit in a 9-inch pie pan. Press the dough into the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the eggs in a bowl and beat until they are frothy. Pour them over the lemon mixture and blend well. Pour the mixture into the pie pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the remaining pie dough out into a circle large enough to fit over the pie. Place the dough on top of the lemon mixture. Trim off all but 1/2 inch of the excess dough. Pinch the top and bottom layers of the dough together, crimping the edges. Using a sharp knife, cut a few slits across the center of the pie so that the steam can escape. Brush the crust lightly with the heavy cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pie on the lower rack of the oven and bake for 15 minutes. Move the pie to the center rack and lower the oven setting to 350 degrees. Bake 30 to 35 minutes longer, until the crust is lightly browned and the filling is set. Remove and cool completely before slicing. Serve with the whipped cream, if desired."}], "link": "https://cooking.nytimes.com/recipes/466-regina-schramblings-shaker-lemon-pie"}