{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Fritters", "description": "Apple fritters make a delightful dessert. The fritters are made with a simple batter consisting of a cup of flour, a cup of ice-cold water and one egg.\n\nUse the least expensive apples you can find for the fritters; any variety works well in this recipe. Notice that the apples are not peeled. They are stood upright and cut on all sides into 1/2-inch-thick slices as far as the core, which is then discarded. The apple slices are then stacked and cut into sticks, and these sticks are mixed into the batter. Large spoonfuls of the mixture cook in just a few minutes in hot oil.\n\nIf the fritters are made ahead, be sure to cook them until they are crisp and well browned. Then reheat and recrisp them in a toaster oven or under the broiler just before serving. Dust them heavily with granulated sugar.", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT12M", "recipeYield": "about 12 fritters", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "apple, eggs, flour, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 336, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "7 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour", "1 egg", "1 cup ice-cold water", "1 pound apples (about 3), any variety", "1 1/2 cup canola oil", "1/2 cup granulated sugar for dusting the fritters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, egg and a third of the water into a bowl, and mix vigorously with a whisk. The mixture will be fairly thick. When smooth, add the remaining water, and mix again until the water is incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stand the unpeeled apples upright on a board, and cut them vertically into 1/2-inch-thick slices, stopping when you reach the core. Pivot the apple, and cut again, until only the core remains. Discard the core, stack the apple slices, and cut them into 1/2-inch-wide sticks. You should have 4 cups. Stir the apple sticks into the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy skillet heat the oil to 375 degrees. When hot, pour about 1/3 cup of the batter into the pan for each fritter, making four or five at a time. Using two forks, spread the batter so that it is not more than 1/2 inch thick. Cook for about 3 minutes on each side, until brown and crisp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the fritters on paper towels, and transfer them to a rack. Sprinkle liberally with the sugar, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/4660-apple-fritters"}