{"@context": "http://schema.org", "@type": "Recipe", "name": "Salade Niçoise With Fresh Tuna", "description": "In this elegant variation of the classic French salad, seared fresh tuna stands in for the conventional canned sort. The rest of the salad can be assembled a few hours ahead, but the tuna should be cooked and placed on top of the salad just before it is served.", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": "https://static01.nyt.com/images/2016/02/22/dining/22COOKING-NICOISETUNASALAD1/22COOKING-NICOISETUNASALAD1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "salads and dressings", "keywords": "red potato, string beans, tuna", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 246}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 350, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "5 grams", "proteinContent": "22 grams", "saturatedFatContent": "3 grams", "sodiumContent": "991 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound red potatoes", "1 1/2 tablespoons Dijon mustard", "5 cloves garlic, peeled, crushed and chopped (1 1/2 tablespoons)", "1 1/2 tablespoons red-wine vinegar", "7 tablespoons extra-virgin olive oil", "2 teaspoons salt", "3 teaspoons freshly ground pepper", "1 1/2 cups water", "3/4 pound string beans (preferably haricot verts), tips and strings snapped off", "1 yellow pepper", "2 very ripe medium-size tomatoes ( 3/4 pounds)", "1 1/2 cups sliced red onions", "1 cup nicoise or black oil-cured olives", "1 pound fresh tuna", "1 teaspoon canola oil", "About 1 dozen red lettuce leaves", "1 cup (loose) basil leaves, shredded into large pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a saucepan, cover with cool water and bring the water to a boil over high heat. Cover, reduce the heat to low and boil gently for 25 to 35 minutes, until the potatoes are tender but still firm when pierced with a fork. Drain off the water and set the potatoes aside until cool enough to slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the dressing. In a large bowl, mix together the mustard, garlic, vinegar, olive oil, 1 teaspoon of salt and 1 teaspoon of pepper. Whisk until it comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes, if desired, and cut into 1/2-inch slices. Toss with the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the 1 1/2 cups of water to a boil in a saucepan. Add the beans, cover and return to a boil. Boil over high heat for 1 to 3 minutes (less for haricot verts and more for larger beans) until just tender but slightly firm to the bite. Drain and run under cold water for a few seconds to stop the cooking and preserve the bright green color. Cut the beans in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the yellow pepper as best you can with a vegetable peeler (much easier to do if the pepper is firm and thick-walled). Then cut the pepper through the pleats, remove and discard the seeds and continue peeling the skin from the pieces. Pile up the peeled pepper wedges and cut them into thin julienne strips (about 1 1/2 cups). Cut the tomatoes in half crosswise, press out the seeds and cut the unpeeled flesh into 1-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "No more than 1 hour before serving, add the beans, yellow pepper, red onions, tomatoes and black olives to the potatoes. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When almost ready to serve, heat 1 large cast-iron or heavy skillet over high heat for about 2 minutes, until very hot. Sprinkle the tuna with the remaining 2 teaspoons of black pepper and 1 teaspoon of salt and then roll in the canola oil. Place the tuna steak in the hot skillet and sauté over high heat for about 2 minutes, turning once, until lightly browned on the outside and cooked until rare on the inside. Cut into 1/2-inch slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, line a large platter with the lettuce leaves. Mound the salade niçoise in the center of the platter and place the sliced tuna and the basil leaves on top. Serve immediately."}]}