{"@context": "http://schema.org", "@type": "Recipe", "name": "Khachapuri (Georgian Cheese Bread)", "description": "In Georgia, this bread is filled with a cheese called sulguni. The substitute here is a mixture of fresh mozzarella and goat cheese.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT4H", "recipeYield": "Twelve to 14 small pieces", "recipeCuisine": "eastern european", "recipeCategory": "dinner, project", "keywords": "flour, goat cheese, mozzarella, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 411, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "20 grams", "saturatedFatContent": "15 grams", "sodiumContent": "415 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup milk", "2 packages active dry yeast", "1/2 teaspoon, plus 1 tablespoon, sugar", "3 to 4 cups flour", "1/4 pound unsalted butter, cut into 8 pieces and softened to room temperature", "1 1/4 pounds fresh mozzarella cheese", "3/4 pound fresh tangy goat cheese", "1 egg", "Melted butter to brush on top"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the milk to lukewarm (110 to 115 degrees)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a half cup of lukewarm milk in a small bowl and sprinkle the yeast and a half teaspoon of sugar over the milk. Stir to dissolve. Allow to sit for 10 minutes. Stir in the remaining milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon three cups of the flour into a large bowl and make a well in the center. Add the yeast sponge, the remaining sugar and the butter. Stir with a wooden spoon until it is formed into a firm ball of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather up the dough and scraps in the bowl and turn out onto a floured wooden board. Knead for about 10 minutes, adding more of the remaining flour to the surface as needed to prevent the dough from sticking. When the dough is elastic and no longer sticky, place in a greased bowl, turning the dough to grease it. Cover loosely with a kitchen towel and allow to rise until doubled in bulk in a draft-free place, one to one-and-a-half hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down with your fist and allow it to rise again until double in bulk, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough is rising, prepare the cheeses. Grate the mozzarella coarsely, either in a food processor or with a hand grater. Crumble the goat cheese. Mix with egg, slightly beaten."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Punch the dough down and roll out on lightly floured surface to a circle about 20 inches in diameter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the dough in quarters and place the point of the dough in the center of a nine-inch pan with an inch-and-a-half to two-inch sides. Unfold the dough, letting the excess hang over the sides. Spoon the cheese mixture onto the dough. Pick up the excess dough hanging over the edges and begin to pleat over the cheese. Make sure all pleats go in the same direction. Gather the ends of the dough in the center and twist into a small knob. Allow the dough to rest 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top of the dough with melted butter and bake in the center of the oven for about one hour, or until golden. Allow the bread to cool in the pan, on a cake rack, before serving. The bread may be served warm or at room temperature."}]}