{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Quail Gumbo", "description": "John Folse, a chef and educator in Louisiana, taught Craig Claiborne how to make this gumbo in the late 1980s. Instead of being served separately, as tradition dictates, the gumbo garnishes — rice, oysters and sausages — are used to stuff small, whole, boned roast quail; the slices of andouille floating in the gumbo are blanched to rid them of excess fat.", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H35M", "recipeYield": "4 servings", "recipeCuisine": "cajun", "recipeCategory": "dinner, project, soups and stews", "keywords": "andouille sausage, oyster, quail, main course", "aggregateRating": null, "recipeIngredient": ["4 boned quail, about 3/4 pound total", "Salt to taste, if desired", "Freshly ground pepper to taste", "1/2 teaspoon, approximately, file powder (ground dried sassafras leaves)", "16 tablespoons (1 cup) cooked white rice", "8 thin slices smoked sausage, preferably andouille, although kielbasa may be used", "4 tablespoons melted butter", "4 oysters, shucked", "1/4 cup melted butter", "1 cup finely chopped onion", "1/2 cup finely chopped green pepper", "1/2 cup finely chopped celery", "1 tablespoon finely minced garlic", "1 cup corn, peanut or vegetable oil", "1 1/2 cups flour", "8 cups rich chicken broth", "1/4 cup oyster liquor", "2 bay leaves", "2 sprigs fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put quail on a flat surface and sprinkle cavity of each with salt and pepper and a pinch of file powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put rice in a bowl and add salt, pepper and a pinch of file powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open up cavity of each quail and spoon 2 level tablespoons of rice in. Place one slice sausage and one oyster on the layer of rice. Spoon 2 more tablespoons rice into each cavity, pressing down with fingers. Press all around openings of cavities to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange quail breast up and close together in one layer in a baking dish. Sprinkle breasts with salt, pepper and a pinch of file powder. Spoon 1 tablespoon of the melted butter on top of each quail."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine onion, green pepper, celery and garlic in a mixing bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring enough water to boil in a saucepan to cover four remaining slices of sausage. Add sausage slices and simmer gently about 10 minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a wide, heavy skillet and add the flour, stirring rapidly all around bottom with a wire whisk. Cook, stirring constantly, until flour turns light caramel in color. Reduce heat and continue stirring. Pay strict attention to the color, which will now deepen rapidly. The flour, when ready, should be dark brown; it should not blacken. Total cooking time is about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately add onion mixture and continue stirring vigorously 3 to 4 minutes. Add broth while stirring rapidly. Bring to boil and cook, stirring, about 3 minutes. Add the oyster liquor, bay leaves and thyme sprigs and let simmer about 35 minutes. Be sure to scrape bottom of pan to prevent sticking and lumping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place quail in oven and bake 30 minutes or until breasts are nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer quail to the simmering liquid and continue cooking 5 minutes. Remove bay leaves. Serve one quail and one slice of sausage with equal amounts of the gumbo liquid in four soup bowls."}], "link": "https://cooking.nytimes.com/recipes/4721-stuffed-quail-gumbo"}