{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Stew With Chickpeas and Butternut Squash", "description": "There is no high drama about simmering a stew. However fine, stew is a homey, intimate exchange, a paean to the way living things improve when their boundaries relax, when they incorporate some of the character and flavor of others. Soulful, a word inextricably linked with a good sturdy stew, is the payoff to the cook who plans a little and has the patience to abide. Here, long-simmered lamb combines with chickpeas and butternut squash to yield a stew rich with the flavors of cumin, cardamom and coriander, that can help keep a chilly night at bay.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2014/01/21/dining/recipes-lambstew/recipes-lambstew-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot, soups and stews, times classics", "keywords": "butternut squash, lamb, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 503}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 543, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "11 grams", "proteinContent": "41 grams", "saturatedFatContent": "4 grams", "sodiumContent": "975 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon ground cumin", "1/2 teaspoon ground cardamom", "1/2 teaspoon ground coriander", "1/4 teaspoon turmeric", "1/4 teaspoon freshly ground pepper, plus more to taste", "Pinch of cayenne pepper", "1/2 teaspoon salt, plus more to taste", "1/4 cup plus 2 tablespoons all-purpose flour", "1 pound lamb stewing meat, trimmed and cut into 1-inch cubes", "5 teaspoons vegetable oil", "1 small onion, peeled and thinly sliced", "2 large cloves garlic, peeled and minced", "3 cups chicken broth, homemade or low-sodium canned", "1 small butternut squash, peeled, seeds and fibers scooped out, cut into 3/4-inch cubes", "1 19-ounce can chickpeas, drained and rinsed", "1 tablespoon chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the spices and salt in a bowl. In a large bowl, stir together 1/4 cup flour and 1 1/2 teaspoons of the spice mixture, add the lamb and coat well. Heat 3 teaspoons of oil in a large pot. Add lamb a few pieces at a time; don't overcrowd. Turn the pieces until lamb is browned on all sides, about 5 minutes per batch; add a teaspoon of oil as needed between batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lamb and set aside. Add the remaining teaspoon of oil and the onion to the pot. Cook for 2 minutes. Stir in the garlic and cook for 15 seconds. Stir in the lamb and remaining spice mixture. Stir in the chicken broth and bring to a boil, then reduce to a slow simmer. Cover and cook until the lamb is tender, about 1 hour. Stir in the squash and chickpeas and cook, covered, for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir 3 tablespoons of the cooking liquid into 2 tablespoons of flour to make a smooth paste. Stir the paste into the stew and cook until the broth thickens and the squash is tender, about 10 minutes longer. Add salt and pepper to taste. Divide among 4 bowls, garnish with cilantro and serve."}], "link": "https://cooking.nytimes.com/recipes/4737-lamb-stew-with-chickpeas-and-butternut-squash"}