{"@context": "http://schema.org", "@type": "Recipe", "name": "Gypsy's Arm Cake", "description": "", "author": {"@type": "Person", "name": "Susan Herrmann Loomis"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Ten to 12 servings", "recipeCuisine": "spanish", "recipeCategory": "project", "keywords": "dessert, eggs, flour, milk", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 240, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "210 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 egg yolks", "6 tablespoons sugar", "1/4 cup all-purpose flour", "Pinch of salt", "1 1/2 to 1 3/4 cups milk", "1 cinnamon stick", "7 large eggs, at room temperature, separated", "1 cup granulated sugar", "1 1/4 cups cake flour", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 teaspoon vanilla", "3 tablespoons confectioners' sugar", "1/4 teaspoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry cream, whisk the egg yolks with the sugar in a medium-sized bowl until they are thick and lemon colored. Whisk in the flour and the salt and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one-and-a-half cups of the milk and the cinnamon stick in a medium-sized saucepan over medium-high heat. Scald, remove from the heat, cover and let stand for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cinnamon stick from the milk and discard. Return the milk to the scalding point over medium-high heat and gradually whisk it into the egg yolk and flour mixture. Return this mixture to the saucepan and cook, stirring constantly, until the mixture comes to a boil. Continue cooking for at least two minutes, until the pastry cream thins slightly and the flour taste has cooked out of it. Remove from the heat, transfer to a bowl, cover and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 17-by-11-by-1-inch jellyroll pan with parchment paper. Brush with oil or melted butter and dust with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the cake, beat the egg yolks with three-quarters of the cup of sugar in the bowl of an electric mixer, using the whisk attachment, until the mixture is thick and lemon colored. Sift together the dry ingredients. Remove the whisk attachment and, using the mixer attachment, add the dry ingredients at low speed, mixing until just incorporated. Add the vanilla, mix quickly and thoroughly and reserve. The mixture will be quite thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk the egg whites with the pinch of salt until they form stiff points. Add the remaining sugar and whisk until the egg whites become glossy, an additional 30 seconds. Fold one quarter of the egg whites into the flour and egg yolk mixture, then fold the remaining egg whites in, working quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the cake mixture in the prepared pan and bake until the cake is golden and the top springs back when lightly pressed, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake is baking, sift one tablespoon of the confectioners' sugar on a clean tea towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cake from the oven and immediately turn it over on top of the sugar-dusted towel. Peel the parchment paper from the cake and, working from the long side, gently roll the cake in the towel. Cool for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cake has cooled, unroll it. Trim off the edges of the cake. If necessary, thin the pastry cream slightly with additional milk, to easy spreading consistency. Spread an even layer on the cake. Carefully reroll the cake and place it seam-side down on a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the remaining confectioners' sugar and the cinnanmon and sift it over the top of the cake. Serve immediately."}]}