{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatball and Sausage Casserole", "description": "As the grandfather of six oft-hungry children, Pierre Franey sought to develop dishes that would “capture their attention.” This hearty, kid-friendly casserole of meatballs, sausage, onions, peppers and mushrooms did not disappoint. It's sort of a cross between a casserole and a stew, and can be served over pasta or polenta, or with a huge hunk of bread to sop up the herb-y tomato sauce. \n\nIf you'd like, you can easily substitute ground chicken, turkey, pork or veal for the beef in the meatballs (or any combination of them all). The meatballs are seasoned with Parmesan cheese, nutmeg, cumin, garlic, parsley, salt and pepper. Depending on the composition of the meatballs, you might want to try other favorite spices, too, like ginger, coriander seed or fennel.", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": "https://static01.nyt.com/images/2016/11/30/dining/30COOKING-MEATBALL-CASSEROLE1/30COOKING-MEATBALL-CASSEROLE1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, one pot", "keywords": "ground meat, italian sausage, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 496}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 760, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "5 grams", "proteinContent": "42 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1292 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound ground turkey, chicken, beef, pork or veal or any combination", "1/2 cup fresh bread crumbs", "1/4 cup grated Parmesan cheese", "1 egg", "1/4 cup fresh or canned chicken broth", "1/8 teaspoon freshly grated nutmeg", "1/8 teaspoon ground cumin", "1 teaspoon plus 1 tablespoon chopped garlic", "4 teaspoons chopped parsley", "Salt and freshly ground pepper to taste", "2 tablespoons vegetable oil", "4 sweet or hot Italian sausages, 1 pound", "1 cup chopped onions", "1/4 pound mushrooms, sliced", "1 large green pepper, cored, seeded and cut into 1-inch pieces", "2 cups crushed canned tomatoes", "2 teaspoons chopped fresh rosemary or 1 teaspoon dried", "1/2 cup dry white wine", "1 bay leaf", "4 tablespoons chopped fresh basil or Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the meat in a mixing bowl and add the bread crumbs, cheese, egg, broth, nutmeg, cumin, 1 teaspoon of the garlic, parsley, salt and pepper. Blend well and shape the mixture into 24 small meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large nonstick or enamelware skillet and add the meatballs. Cook, turning often, until browned on all sides, about 10 minutes. Remove the meatballs and set aside. Prick the sausages with a fork and add them to the pan. Cook, turning often, until lightly browned on all sides, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the onions, mushrooms, green pepper and remaining 1 tablespoon garlic around the sausages, and sauté, about 5 minutes. Add the meatballs and the accumulated juices back to the pan (the pan will be crowded)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes, rosemary, wine and bay leaf and stir to dissolve any browned particles on the bottom of the skillet. Cover closely and simmer for 15 minutes. Remove the bay leaf and sprinkle with basil when served."}], "link": "https://cooking.nytimes.com/recipes/4766-meatball-and-sausage-casserole"}