{"@context": "http://schema.org", "@type": "Recipe", "name": "Seafood Gumbo", "description": "Here is a real heartwarmer for sweater season. It calls for a lot of ingredients, but don’t be dismayed. You can easily eliminate some or make substitutions. Don’t like shrimp? Go with 100 percent fish. Or vice versa. You can also add ham or sausage (like tasso ham or andouille sausage) for a bit more heartiness. Historically, the word gumbo denotes the presence of okra (also called gumbo), and it’s used here. Another conventional gumbo component and important ingredient in African-based Creole cooking is filé powder, the crushed leaves of the sassafras tree. Then, there is usually a dark roux made of vegetable oil and flour in authentic New Orleans gumbo. All three of these ingredients – okra, filé powder and the dark oil-and-flour roux – are the thickening agents for this fairly spicy dish.", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": "https://static01.nyt.com/images/2017/02/17/dining/17COOKING-PEPIN-SEAFOODGUMBO2/17COOKING-PEPIN-SEAFOODGUMBO2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "creole", "recipeCategory": "dinner, one pot, seafood, soups and stews", "keywords": "main course, okra, shrimp, white fish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 350}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 307, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "21 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1057 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 quarts water", "3/4 pound fish fillets (cod, pollock or another variety of fresh white fish), cut into 1-inch pieces", "1/2 pound (about 26) small peeled fresh or frozen shrimp", "1/4 cup canola oil", "1/3 cup flour", "2 onions, peeled and sliced (about 2 1/2 cups)", "1/2 cup long-grain rice", "About 7 scallions, damaged leaves removed and discarded; cut into 1/2-inch pieces (about 1 1/2 cups), both white and green parts", "5 cloves garlic, peeled, crushed and chopped (about 1 tablespoon)", "2 tomatoes, cut into 1-inch pieces", "1 cup sliced celery", "1 green pepper, seeded and cut into 1/2-inch pieces (about 1 1/2 cups)", "1/2 pound okra, ends trimmed, cut into 1 1/2-inch-long rounds", "2 teaspoons salt", "1 teaspoon dried thyme", "1 jalapeno pepper, seeded and chopped fine (about 1 tablespoon)", "1/4 teaspoon cayenne pepper", "1 tablespoon  filé powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan or stockpot, bring the water to a boil. Add the fish and shrimp, stir, and cook over high heat for about 4 minutes. (The water will not have returned to a boil.) With a slotted spoon remove the seafood; place in a bowl, cover, and set aside. Reserve the poaching liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small skillet mix the oil and flour together, and cook over high heat for about 1 minute, until it sizzles. Reduce the heat to low, and cook for about 15 minutes, stirring every minute or so, until the roux is a deep mahogany color. Add the sliced onions to the mixture, stir, and then add the roux and onions to the reserved poaching liquid, stirring constantly. Bring to a boil, still stirring, and add the rice, stirring well to incorporate it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining ingredients except for the reserved fish and shrimp and the  filé powder. Stir, bring the mixture to a boil, then reduce the heat to low. Cover, and boil gently for 20 minutes. Stirring, sprinkle the  filé powder on top, mix and cook for another 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving immediately, add the cooked fish and shrimp, return to a boil, and serve. If serving later, reheat at serving time, adding the cooked fish and shrimp at the last minute to warm them through."}]}