{"@context": "http://schema.org", "@type": "Recipe", "name": "Brick Chicken", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "dinner, project, roasts", "keywords": "chicken, lemon, olive oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 459, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "3 grams", "proteinContent": "37 grams", "saturatedFatContent": "9 grams", "sodiumContent": "807 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 2 1/2-pound chicken, split in half as for broiling", "4 thin slivers of garlic", "6 small sprigs fresh rosemary", "6 small sprigs fresh thyme", "Salt to taste, if desired", "Freshly ground pepper to taste", "2 tablespoons lemon juice", "1/2 cup, plus 6 tablespoons, olive oil", "6 thin lemon slices, seeds removed", "1 peeled garlic clove, thinly sliced", "1/4 teaspoon finely minced rosemary leaves", "1/4 teaspoon finely minced thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off or have the backbone of the chicken cut off. Make a small incision through the flesh at the base of each chicken half. Push the leg end of each chicken half through this incision to hold the leg in place. Place each chicken half skin-side up on a flat surface and pound all over forcefully with a flat mallet or the bottom of a clean heavy skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the chicken halves skin-side down, and with a small paring knife make one small incision in the breast portion. Make one more small incision in the leg portion. Insert one sliver of garlic, one small rosemary sprig and one small thyme sprig in each incision."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken pieces in a flat dish. Sprinkle the chicken pieces on all sides with salt and pepper. Sprinkle with one tablespoon of lemon juice and a half cup of olive oil, turning the pieces to coat well. Arrange the pieces skin-side up in the dish and arrange the lemon slices evenly over the skin. Scatter the remaining two rosemary sprigs and two thyme sprigs over the chicken. Cover with plastic wrap and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, preheat the oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off and reserve the liquid from around the chicken pieces. Discard lemon slices and herb sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large heavy skillet, preferably of black iron, until almost smoking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the reserved liquid into the skillet. Immediately add the chicken pieces skin-side down. Scatter the garlic slices all around the chicken. Cover the chicken pieces with one heavy skillet that will fit comfortably inside the skillet in which they cook. (Chef Boulud uses bricks covered with foil to weight his chicken pieces.) If necessary, add more weights to the upper skillet to make the chicken lie as flat as possible. Cook over high heat about five minutes, until the skin is darker than golden brown. As the chicken cooks, lift the pieces to check the color of the skin. After five minutes, reduce the heat slightly and continue cooking about one minute. Remove the weights and turn the chicken pieces. Replace the weights and place the chicken in the oven. Bake 17 minutes. Remove the weights and turn the chicken pieces once more. Continue cooking about three minutes, or until the chicken is cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine the remaining one tablespoon of lemon juice, six tablespoons of olive oil, the minced rosemary and thyme leaves and salt and pepper to taste. Blend well and heat gently. Cut the chicken into serving pieces and serve the sauce on the side."}]}