{"@context": "http://schema.org", "@type": "Recipe", "name": "Scrambled Eggs In Potato Shells", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "breakfast", "keywords": "chicken broth, eggs, potato, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "9 grams", "sodiumContent": "758 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 oval-shaped potatoes, about 1/2-pound each", "3 tablespoons, plus 2 teaspoons, butter", "Salt to taste, if desired", "8 tablespoons fresh or canned chicken broth", "4 eggs", "Freshly ground pepper to taste", "2 tablespoons heavy cream", "1 tablespoon finely chopped chives", "4 teaspoons caviar or 12 chive stems, each about 3 inches in length"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes, trimming them to make each as smooth and oval as an egg. As the potatoes are prepared, drop each into cold water to cover to prevent discoloration. Cut off a small slice from the top and bottom of each ''egg.'' Reserve four of the cut-off slices. Using a melon-ball cutter, start at one end of each potato and scoop out the inner flesh to make a cavity for filling with scrambled eggs. The outer and bottom of each shell should be about a quarter-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt one tablespoon of butter in a heat-proof saucepan and arrange the potatoes hollowed-out side up in the saucepan. Arrange the four reserved cut-off pieces around the potatoes. Sprinkle the inside of each potato with salt. Add one-half teaspoon of butter to the center of each potato. Spoon one tablespoon of broth inside each potato. Pour the remaining four tablespoons of broth around the potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover closely with foil and place in the oven. Bake about 35 minutes. As the potatoes cook, test them often by piercing them with a small pointer. When ready, the potatoes should be tender, but not overcooked, or they may collapse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into a mixing bowl. There should be about one cup. Add salt and pepper to taste and beat thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining two tablespoons of butter in a saucepan and cook over very low heat or, preferably, on a metal flame guard. Add the eggs and cook, stirring briskly with a wire whisk, about five minutes, or until they have the consistency of a thick custard. Off the heat, beat in the cream and the chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, drain the liquid from the potatoes into a saucepan. Bring the liquid to the boil and cook until reduced to about two tablespoons. Brush the outside of the potatoes with this buttery liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange each potato on a small serving dish and use a small spoon to fill the cavities of each with an equal portion of the scrambled eggs. Garnish each serving with a topping of one teaspoon of caviar or with three chive stems inserted into the eggs. Arrange the reserved cut-off portions on the plate or neatly place them on top."}], "link": "https://cooking.nytimes.com/recipes/4776-scrambled-eggs-in-potato-shells"}