{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Lemon Tart With Plum Tomatoes And Verbena", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H40M", "recipeYield": "Six to eight servings", "recipeCuisine": "french", "recipeCategory": "brunch", "keywords": "flour, lemon, tomato, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 490, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "12 grams", "sodiumContent": "51 milligrams", "sugarContent": "52 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups all-purpose flour", "1/4 teaspoon baking powder", "7 tablespoons unsalted butter, chilled and cut into small pieces", "3/4 cup confectioners' sugar", "1 egg, lightly beaten", "1 cup sugar", "1 1-inch piece lemon peel", "1 verbena tea bag", "1/2 cup water", "6 fresh, ripe plum tomatoes, about 1 1/2 pounds, peeled, cored, seeded and quartered lengthwise", "3 lemons, peeled to the pulp, seeded and cut into thick slices", "1 egg yolk", "2 whole eggs", "1/2 cup sugar", "3/4 cup heavy cream", "1 tablespoon grated lemon rind"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the flour and baking powder. Set aside. Put the butter and confectioners' sugar in the bowl of an electric mixer and beat until smooth. Add the egg, beat for a few seconds, then add the flour mixture all at once. Beat the ingredients until just incorporated, about 1 minute. Shape the dough into a flat disk, cover with plastic wrap and refrigerate for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the sugar, lemon peel and verbena tea bag in a saucepan, add the water and bring to a boil. Add the tomatoes and simmer gently over medium-low heat until they are soft, about 20 minutes. With a slotted spoon, remove the tomatoes to a plate covered with paper towels. Pat dry and set aside. Let the syrup simmer gently until reduced to 1/3 cup, about 10 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Sprinkle a handful of flour onto a flat surface. Roll the dough into a large circle, 1/8-inch thick, and gently press it into a 10-inch tart pan. Prick the bottom with a fork, line the shell with wax paper, fill with pie weights or dried beans and bake until golden, about 15 to 20 minutes. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the lemon slices, egg yolk, whole eggs, sugar and cream in a blender and puree until smooth. Strain, and stir in the lemon rind. Pour 1/4 cup of the lemon custard into the tart shell. Arrange the tomato wedges, cut side down, in a circle at the center of the tart and slowly pour in the remaining custard. Bake until the custard sets, about 30 to 40 minutes. Set aside to cool. Cut into slices and drizzle 2 teaspoons of syrup around each slice."}], "link": "https://cooking.nytimes.com/recipes/4779-sweet-lemon-tart-with-plum-tomatoes-and-verbena"}