{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Red Snapper With Lemon- Zest Butter Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 517, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "2 grams", "proteinContent": "46 grams", "saturatedFatContent": "16 grams", "sodiumContent": "771 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 lemons", "1/4 cup lemon juice", "1/4 cup orange juice", "1 shallot, finely chopped", "1 1/2 teaspoons whole peppercorns", "8 tablespoons very cold butter, cut into 16 chunks", "2 tablespoons olive oil", "4 7-to 8-ounce red snapper fillets", "Salt and freshly ground black pepper to taste", "2 tablespoons parsley, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate the zest from 1 of the lemons, carefully avoiding the pith. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paring knife, remove the peel in long strips from the second lemon, scraping off any pith. Cut the peel into a fine julienne. Bring a small saucepan half full of water to a boil and add the strips. Boil 1 minute. Drain and rinse the strips under cold water. Drain on paper towels. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small heavy saucepan, simmer the lemon juice, orange juice, shallot, peppercorns and grated zest, uncovered, until the mixture is reduced by half, about 5 minutes. Strain through a fine-mesh sieve, pressing on the solids to extract as much liquid as possible. Discard the solids and return the liquid to the pan and set it over very low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk chunks of cold butter into the sauce one at a time, whisking continuously. When all the butter has been incorporated, immediately remove the pan from the heat. (The sauce will separate if it becomes too hot.) Transfer the sauce to a small thermos or to a glass cup set inside a bowl of very warm water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large skillet over medium-high heat. When hot, add the oil. Add salt and pepper to snapper fillets taste. Place the snapper fillets in the pan and cook, turning once, until they are lightly browned and just cooked through, about 3 minutes per side. Transfer the fillets to 4 warm plates. Coat with the sauce, garnish with parsley and lemon-zest strips and serve."}], "link": "https://cooking.nytimes.com/recipes/4825-pan-seared-red-snapper-with-lemon-zest-butter-sauce"}