{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn-Crusted Jumbo Sea Scallops With Bourbon Sauce", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "bourbon, cornmeal, sea scallop, main course", "aggregateRating": null, "recipeIngredient": ["2 1/2 cups cornmeal", "1/2 cup grated Parmesan cheese", "3 eggs", "Dash of salt", "2 cups all-purpose flour", "16 jumbo sea scallops, side muscle removed, patted dry", "2 large Granny Smith or other tart green apples", "2 ounces unsalted butter, melted", "1 ounce bourbon", "3 ounces bourbon", "3 ounces cider", "3 ounces cider vinegar", "2 large shallots, chopped fine", "1 clove garlic, peeled and chopped fine", "Juice of 1/2 lemon", "8 ounces unsalted butter, chilled and cut into small pieces", "Salt to taste", "Freshly ground pepper to taste", "1/2 cup clarified butter (approximately) or vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the cornmeal and the Parmesan cheese and set aside. In a medium-size bowl, lightly beat the eggs with a dash of salt. Roll the scallops, one at a time, in the flour, shaking off any excess. Dip the scallops in the egg, allowing the excess egg to drip back into the bowl. Roll them in the cornmeal-cheese mixture, again shaking off the excess. Set them aside on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Peel and halve the apples lengthwise and remove the core. Thinly slice them lengthwise, about three-quarters of the way up the apple, keeping the halves intact. Spread the apples out on a baking sheet. Press down gently to make the slices fan out. Drizzle with the melted butter and bourbon. Broil the apples until the edges are brown, about 4 to 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, combine the bourbon, cider, cider vinegar, shallots and garlic in a nonreactive saucepan. Place over medium heat and cook to reduce the liquid until it is almost evaporated, about 10 to 12 minutes. Add the lemon juice and lower the heat. Whisk the chilled butter into the sauce one piece at a time. Do not allow the sauce to separate. Season with the salt and pepper and strain. Remove from the heat and set aside in a warm place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour clarified butter or oil into a heavy saute or frying pan to a depth of 1/2 inch. Heat until hot but not smoking. Place the scallops in the pan and fry for 2 to 3 minutes on each side, or until golden and crisp. Remove with tongs to a plate covered with 2 or 3 paper towels. Place in a warm oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place one of the cooked apple halves in the center of each of 4 plates, allowing the slices to fan out. Place 4 scallops on top of each apple half. Serve the sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/483-corn-crusted-jumbo-sea-scallops-with-bourbon-sauce"}