{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond-And-Hazelnut-Chip Macaroons", "description": "", "author": {"@type": "Person", "name": "Todd S. Purdum"}, "image": null, "totalTime": "PT1H", "recipeYield": "Sixteen 3-inch macaroons", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, hazelnut, sugar, whole almonds", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 208, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "10 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2/3 cup whole hazelnuts, shelled", "2 cups whole natural almonds, shelled", "1 1/4 cups sugar", "2 to 3 large egg whites", "2 tablespoons apricot jam", "1 teaspoon minced lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Spread hazelnuts across baking sheet, and bake until skins are lightly browned, about 5 minutes; do not turn off oven. Roll nuts in a clean kitchen towel. Pressing lightly on towel, roll back and forth to loosen skins of nuts. Transfer skinned nuts to a food processor. Chop until nuts are the size of chocolate chips. Transfer to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread almonds on a baking sheet and bake until lightly browned, about 5 minutes; remove from heat. Reduce oven to 350 degrees. Allow nuts to cool, and place in bowl of a food processor. Add sugar, and process until almonds are very finely ground, 30 to 40 seconds. Add 2 egg whites, jam and lemon zest. Pulse until blended; mixture should be thick and tacky when pressed with fingertip. If dry, add a teaspoon of remaining egg white, and pulse; repeat if necessary to reach desired consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a large bowl. Add hazelnuts, and knead by hand until blended. Lightly wet hands to prevent sticking. Divide dough in half, then divide each half into 8 pieces, for a total of 16 pieces. Shape pieces into balls, and place eight balls on each of two parchment-lined baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position oven racks in top and center thirds of oven. Bake macaroons until golden brown, 18 to 22 minutes, reversing baking sheets from front to back and top to bottom halfway through cooking time. Store for up to one week in an airtight container, or freeze for up to one month."}]}