{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Wild-Rice Salad In Baked Acorn Squash", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, salads and dressings", "keywords": "acorn squash, red onion, wild rice, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 369, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "711 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 acorn squash, halved, seeds removed and discarded", "1 tablespoon vegetable oil", "Kosher salt and freshly ground black pepper", "1/2 cup wild rice", "1/2 cup long-grain rice", "1 tablespoon salted butter", "1 tablespoon olive oil", "2/3 cup diced red onion", "1/4 cup golden raisins", "2 tablespoons chopped chervil or parsley, plus 4 sprigs for garnish", "1 teaspoon chopped tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Using a knife, cut a very thin disk from the bottom of each squash half so that they sit level. Using a pastry brush, coat the squash inside and out with vegetable oil. Place on a baking sheet, sprinkle the tops with salt and pepper and bake until tender when pierced with a fork, 45 to 55 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the wild rice in a small saucepan and add 3 cups water and 1/2 teaspoon of salt. Bring to a boil, lower to a simmer and cook, covered, until the grains just begin to pop open, 30 to 40 minutes. Drain and set aside. In another saucepan, bring 1 cup water and 1/2teaspoon of salt to a boil. Add long-grain rice, stir once, cover and simmer until tender, 15 to 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet set over medium heat, melt the butter. Add olive oil, onion and raisins and cook, stirring, until onion is soft, about 3 minutes. Add all the rice and cook, stirring, until heated through. Stir in the chopped chervil and tarragon, season with salt and pepper and remove from heat. Spoon mixture into the baked squash shells, mounding it slightly. Garnish with chervil sprigs and serve."}], "link": "https://cooking.nytimes.com/recipes/4848-warm-wild-rice-salad-in-baked-acorn-squash"}