{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Loin of Pork With Caraway, Lemon and Garlic", "description": "This recipe is a wonderful addition to a celebratory feast, or a weekend winter meal. Some advice if you can't find a loin on the bone: Buy a boneless rolled pork loin and stab it in several places with a knife, then push small amounts of the spice paste into the meat. Smear the rest all over. The aroma of caraway and clove sweetly permeates the meat alongside the sweet-sharpness of the garlic and the out-and-out sharpness of the lemon. The result is robust without being heavy, and the apples roasted alongside the pork provide a juicy edge and a beautiful accompaniment.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2015/12/09/dining/09COOKING-CARAWAYPORKLOIN1/09COOKING-CARAWAYPORKLOIN1-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "caraway seeds, lemon, pork loin, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 105}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 780, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "5 grams", "proteinContent": "65 grams", "saturatedFatContent": "15 grams", "sodiumContent": "553 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 6-chop loin of pork on the bone (about 5 1/2 pounds), rind scored and bone cracked so that chops cut off easily", "2 cloves garlic, peeled", "1 teaspoon kosher or Maldon salt, more as needed", "1/8 teaspoon ground cloves", "1/2 teaspoon caraway seeds", "1 tablespoon lemon juice", "1 teaspoon hot chili oil or olive oil", "Freshly ground black pepper", "2 bay leaves", "1 tablespoon olive oil", "1 onion, sliced into about 6 disks", "6 small eating apples"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Set pork aside at room temperature. Using a mortar and pestle, crush garlic with 1 teaspoon salt to make a paste. Add (but do not crush) cloves, caraway, lemon juice, chili oil and black pepper to taste. Crumble in bay leaves, and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pork loin rind-side down; there will be a groove running along its length where chops join with bone. Rub spiced garlic paste into groove. Rub any extra paste around pork, leaving rind dry. Coat bottom of a roasting pan with 1 tablespoon olive oil, and place onion disks in an overlapping line down length of pan. Place pork rind-side up on onion, and sprinkle lightly with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast pork for 1 1/2 hours. After 45 minutes of roasting, score apples around circumference, and if necessary, trim bottoms so they sit upright without wobbling. Arrange apples in roasting pan, and continue to cook everything together for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove pan from heat and allow to rest for 10 minutes. Transfer pork to a carving board, and slice into chops. Serve each chop with a baked apple."}], "link": "https://cooking.nytimes.com/recipes/4854-roast-loin-of-pork-with-caraway-lemon-and-garlic"}