{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Custard", "description": "This is a snap to make: you do no more than heat some milk with a vanilla pod, if you have one, and then beat the milk into some eggs and sugar. I don't split the pod, much as I love the sight of those aromatic little black seeds; I like the vanilla taste here to be delicate rather than perfumed. Certainly it's fine to use a good quality vanilla extract instead.\n\nThe custard must be cooked in a bain-marie or water bath. You place the dish of custard in a shallow baking dish. Fill this second dish with enough boiling water to come about halfway up the sides of the custard dish. The water bath stops the custard from splitting and keeps the texture perfectly silky and smooth.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/bakedcustard/bakedcustard-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dessert, eggs, milk, vanilla bean, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 140}, "recipeIngredient": ["2 1/2 cups whole milk", "1 vanilla bean or 2 teaspoons vanilla extract", "2 large eggs", "3 large egg yolks", "1/4 cup sugar", "Freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Fill a teakettle with water, and bring to a boil. Meanwhile, in a small saucepan, combine milk and vanilla bean, if using. Heat just until warm, then remove vanilla bean, and reserve for another use. If not using bean, add vanilla extract after milk is heated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the eggs, yolks and sugar. Pour in vanilla-infused milk, whisking until smooth. Strain mixture into a pie plate of 4 to 5 cups capacity (about 9 inches in diameter). Sprinkle with nutmeg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pie plate in a large shallow baking dish, and fill with boiling water to come halfway up side of pie plate. Place in oven and bake until custard is set, about 1 hour. Remove baking pan from oven, and transfer pie plate to a rack to cool for at least 10 minutes before serving. Serve while slightly warm, preferably about 30 minutes after removing from oven."}], "link": "https://cooking.nytimes.com/recipes/4855-baked-custard"}