{"@context": "http://schema.org", "@type": "Recipe", "name": "Rye Omelet With Duck Pastrami", "description": "", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": null, "totalTime": "PT25M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "breakfast, project", "keywords": "crispbread, duck pastrami, egg, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 747, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "6 grams", "proteinContent": "66 grams", "saturatedFatContent": "20 grams", "sodiumContent": "2628 milligrams", "sugarContent": "10 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound duck pastrami (see note)", "4 shallot lobes, peeled and thinly sliced crosswise", "3 tablespoons thyme leaves", "3 tablespoons butter", "4 large eggs", "2 Ryvita dark rye whole-grain crispbreads, crushed with a rolling pin in a bag or kitchen towel into pea-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pull at edge of duck skin to find where skin and white fat naturally separate from meat. Continue to pull gently, using a paring knife, to remove skin and fat in one piece. Place skin side down in a medium saut&eacute; pan, and place over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let fat render slowly, occasionally draining it off and reserving; this will take about an hour. When skin is shrunken and brown, turn and cook on the fat side. When all fat is rendered, remaining skin will be a thin, caramelized, very dark crackling. Chop into pebble-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. In a small saut&eacute; pan over medium heat, heat 1 tablespoon reserved fat. Add shallots and thyme, and brown lightly. Add crackling pieces, and saut&eacute; until shallots are completely soft, 2 to 3 more minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 12 thin, diagonal slices of duck pastrami, and place in a small baking dish; reserve remaining duck for another use. Place in oven while preparing eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium nonstick pan over medium-low heat, heat butter until foamy. Whisk eggs until frothy, and pour into pan. Using a wooden spoon, draw eggs in from sides to center in slow, gentle movements. When there are many folds in center and eggs are just wet on top, sprinkle with 1/2 cup crackling-shallot mixture and 1/4 cup rye cracker pieces. Continue cooking without stirring until bottom browns lightly, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slide omelet onto a cutting board and fold in half. Cut into four pie-shaped slices. Divide among two plates. Remove duck pastrami from oven, and arrange 6 slices on each plate. Serve immediately."}]}