{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Fresh Bacon", "description": "", "author": {"@type": "Person", "name": "William L. Hamilton"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, project", "keywords": "chicken stock, onion, pork belly, main course", "aggregateRating": null, "recipeIngredient": ["1 tablespoon peanut oil", "2 pounds pork belly, skin on", "Kosher salt and ground black pepper", "1 onion, peeled and coarsely chopped", "2 carrots, peeled and coarsely chopped", "2 celery stalks, peeled and coarsely chopped", "1 leek, white part only, trimmed, washed and chopped", "2 garlic cloves, peeled", "About 3 cups chicken stock or canned broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. In a large ovenproof skillet, heat oil until it shimmers. Season pork with salt and pepper to taste, and place it skin side down in skillet. Cook until skin is browned, about 15 minutes. Transfer to a plate, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but 2 tablespoons fat from skillet, and add onion, carrots, celery, leek and garlic. Cook, stirring occasionally, until vegetables are tender and beginning to brown, about 20 minutes. Return pork to skillet, skin side up, and add enough stock to surround but not cover meat, about 2 cups. Bring stock to a simmer, then transfer pan to oven. Bake, uncovered, for 1 hour. Add another cup of stock, and continue baking until pork is tender enough to cut with a fork, about another hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow pork to cool in braising liquid. Remove pork from liquid, then gently lift off and discard skin; use a small knife to separate any pieces that do not lift off easily. Score fat, making crosshatch incisions, then cut pork into four equal pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 400 degrees. Strain braising liquid, discarding solids. Return liquid to skillet, bring to a simmer and skim off fat. Return pork, fat side up, to skillet. Transfer skillet to oven, and bake, without basting, until pork is heated through and fat is well browned, about 20 minutes. Serve pork in shallow bowls topped with a bit of braising liquid."}], "link": "https://cooking.nytimes.com/recipes/4888-braised-fresh-bacon"}