{"@context": "http://schema.org", "@type": "Recipe", "name": "Pinot Noir Sauce", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT8H", "recipeYield": "1 1/2 cups", "recipeCuisine": "", "recipeCategory": "dinner, condiments, project", "keywords": "onion, pinot noir, veal marrow", "aggregateRating": null, "recipeIngredient": ["5 pounds veal marrow bones", "2 medium onions, coarsely chopped", "2 small celery stalks, chopped", "1 large carrot, peeled and chopped into 1-inch lengths", "1 head garlic, broken into cloves but not peeled", "2 tablespoons tomato paste", "1 tablespoon dried thyme", "1 Turkish bay leaf", "Handful parsley stems", "1 teaspoon olive oil", "1 small carrot, peeled and grated", "1 stick celery, grated", "1 tablespoon fresh thyme leaves", "1 1/4 cups pinot noir", "4 cups veal stock (see note)", "Salt and freshly ground black pepper", "2 tablespoons cold butter, cut into pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make stock, heat oven to 450 degrees. Place bones in a medium roasting pan, and roast, turning once or twice, until deeply browned, about 2 hours. Add onions, celery, carrots, garlic and tomato paste, and roast, stirring occasionally, until vegetables are deep golden brown, about 1 1/4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer bones and vegetables to a 2-gallon stockpot. Place roasting pan on stove, add 2 cups water and deglaze over high heat, stirring with a wooden spoon to scrape up brown bits. Transfer deglazing liquid into stockpot with bones. Add thyme, bay leaf, parsley stems and 2 1/2 quarts water. Bring to a simmer over high heat, reduce heat to low and simmer until stock is rich and flavorful, about 5 hours. Remove from heat, and strain into a deep saucepan; there should be 8 cups stock. Place saucepan in sink of ice water to cool stock; then refrigerate until ready to use. (While stock is cold, scoop hardened fat from surface, and discard it.) Freeze half the stock to use later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make sauce, heat olive oil in a medium saucepan over medium heat, and saut&#233; carrot and celery, stirring constantly, until lightly caramelized, about 3 minutes. Add thyme and pinot noir, bring to a simmer and simmer until reduced by half, 7 to 10 minutes. Strain into a clean saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 cups veal stock, bring to a simmer over medium heat, and simmer until sauce is reduced to about 1 1/2 cups. Season to taste with salt and pepper. Increase heat to high, and add butter piece by piece, whisking to emulsify. Sauce will become glossy and coat back of a wooden spoon. As soon as butter is incorporated, remove sauce from heat, and spoon onto meat."}], "link": "https://cooking.nytimes.com/recipes/4907-pinot-noir-sauce"}