{"@context": "http://schema.org", "@type": "Recipe", "name": "Apricot Steamed Pudding", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "bread crumbs, dried apricots, sugar, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 375, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "9 grams", "sodiumContent": "219 milligrams", "sugarContent": "35 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup dried apricots", "1 cup granulated sugar", "2 tablespoons fresh lemon juice", "1 stick plus 1 tablespoon unsalted butter, cut in small pieces", "2 large eggs", "2 cups very fine, fresh white bread crumbs (from 5 slices of bread)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 1 1/2-quart glass or ceramic souffle dish, stir together the apricots, 1 cup water and 1/2 cup sugar. Cover tightly with microwave plastic wrap. Cook at 100 percent power for 7 minutes. Prick plastic wrap to release steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven, and uncover. Scrape mixture into a blender, and puree. Scrape down sides of blender. Add lemon juice, and blend until smooth. Put puree into a medium bowl, and let stand 15 minutes or until cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 2-quart souffle dish on parchment paper. Lightly trace around the base with a pencil. Cut out the paper disk just inside the pencil marking. Grease the dish and both sides of the paper using 1 tablespoon of the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining sugar and butter in the work bowl of a food processor, and process until smooth. With processor running, add the eggs one at a time to combine. Add the apricot puree, and process until completely incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return apricot mixture to the bowl, and gently fold in the bread crumbs until well combined. Pour the mixture into the prepared souffle dish. To remove the air bubbles, firmly rap dish on counter. Cover tightly with microwave plastic wrap. Cook 12 minutes. Prick plastic to release steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven, and uncover. Cover with a heavy plate, and let stand for 15 minutes. Unmold; remove parchment paper, let cool about 5 minutes and serve."}]}