{"@context": "http://schema.org", "@type": "Recipe", "name": "North Carolina-Style Pulled Pork", "description": "", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": null, "totalTime": "PT5H", "recipeYield": "10 to 12 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, project, roasts", "keywords": "cider vinegar, pork shoulder, sugar, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "recipeIngredient": ["1 bone-in pork shoulder roast, 5 to 6 pounds", "1/4 cup basic rub (<a href=\"http://cooking.nytimes.com/recipes/4947-basic-rub-for-barbecue\">see recipe</a>)", "4 cups hickory chips, soaked in cold water for 1 hour and then drained", "1 1/2 cups cider vinegar", "2 tablespoons sugar, or to taste", "1 tablespoon hot pepper flakes", "2 teaspoons salt, or to taste", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat grill to 325 degrees, building fire on opposite sides of grill if using charcoal, or on one side or opposite sides if using gas. Season pork with rub."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using charcoal, every hour for first 4 hours add fresh coals and toss 1/2 cup wood chips on each mound of coals. If using gas, place wood chips in smoker box, and preheat until you see smoke (depending on model of gas grill, use all 4 cups at once or 1 cup every hour for first 4 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pork, fat side up, on grill over drip pan, away from fire. Barbecue until nicely browned and cooked through, for 4 to 6 hours, or until internal temperature is 195 degrees, so that the meat will shred properly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine ingredients for vinegar sauce in a bowl with 3/4 cup water, and whisk to mix. Add additional salt or sugar to taste, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cooked pork to cutting board, cover with foil, and let it rest until cool enough to handle, about 15 minutes. Pull meat into pieces, and discard any skin, bones or fat. With fingertips or a fork, pull each piece of pork into shreds about 2 inches long and 1/4 inch wide. (Or finely chop the meat with a cleaver.) Transfer to metal or foil pan, and stir in 1 cup vinegar sauce, or enough to keep meat moist and flavorful. Cover with foil, and place on grill to keep warm until serving. Serve on hamburger buns with cole slaw and remaining sauce on side."}], "link": "https://cooking.nytimes.com/recipes/4945-north-carolina-style-pulled-pork"}