{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio-Crusted Cheesecake With Orange-Caramel Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H10M", "recipeYield": "Twelve servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cream cheese, low-fat yogurt, pistachio, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 562, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "17 grams", "sodiumContent": "331 milligrams", "sugarContent": "52 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 8-ounce containers plain low-fat yogurt", "1 1/2 pounds cream cheese, at room temperature", "1 cup sugar", "1 teaspoon grated lemon zest", "4 eggs, at room temperature", "1/4 teaspoon kosher salt", "2 tablespoons all-purpose flour", "2 tablespoons plus 1 teaspoon fresh lemon juice", "2 teaspoons vanilla extract", "1 tablespoon honey", "1 cup shelled pistachios", "1 1/2 teaspoons grated orange zest", "1/8 teaspoon kosher salt", "1 teaspoon ground cinnamon", "5 tablespoons sugar", "4 tablespoons unsalted butter, melted and cooled, plus additional for greasing pan", "4 oranges", "1/4 cup orange juice", "1 cup sugar", "3 tablespoons water", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The cake must be made one day before serving. To begin making the filling, place a sieve over a bowl and line it with a double layer of paper towels. Spoon the yogurt into the sieve and let drain for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. To make the crust, place pistachios, orange zest, salt, cinnamon and sugar in a food processor and pulse until nuts are ground. Put in a bowl and stir in the melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 9-inch springform pan. Press the pistachio mixture into the bottom of it and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To continue making the filling, place the cream cheese in a large mixing bowl. Using an electric mixer, gradually add the sugar, beating until light. Stop and scrape down the sides and bottom of the bowl as necessary while incorporating ingredients. Add the lemon zest and the drained yogurt, then the eggs, one at a time. Mix in the salt and flour, then the lemon juice, vanilla and honey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan. Place in a large roasting pan. Add enough hot water to come halfway up the sides of the springform pan. Bake until the cheesecake is set, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cake from the water and let cool. Cover with plastic and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, use a paring knife to remove all peel and pith from the oranges, working over a bowl to collect any juice. Cut the orange sections out from between the membranes and place in the bowl. Add the 1/4 cup orange juice to the bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the sugar and water together in a medium saucepan. Use a pastry brush dipped in water to wash down any sugar crystals from the sides of the pan. Place over low-medium heat and cook without stirring until the sugar turns a nice caramel color. Remove from heat and carefully pour in the heavy cream, as the mixture may spatter. Return to the heat and stir until the caramel is dissolved. Remove from heat and stir in the oranges and juice. Set aside. (The sauce can be made ahead, refrigerated and warmed slightly before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Release the sides of the springform pan. To cut the cake, rinse a large sharp knife under hot water and cut a slice of cake. Wipe off the knife and reheat with hot water before slicing the next piece. Place on dessert plates and spoon a pool of sauce, with orange sections, beside each slice. Serve."}]}