{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan Seared Duck Breast With Pumpkin Polenta", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H40M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cornmeal, duck, pumpkin purée, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 363, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "8 grams", "proteinContent": "26 grams", "saturatedFatContent": "3 grams", "sodiumContent": "242 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup grated ginger", "1 clove", "1 vanilla bean, sliced in half lengthwise", "1/2 cup red wine", "4 shallots, peeled and minced", "2 magrets of duck, about 12 ounces each", "1 tablespoon, plus 1 teaspoon, canola oil", "2 cups chicken broth, homemade or low-sodium canned", "1/2 cup stone-ground cornmeal", "1 cup pumpkin puree", "1/4 cup minced sage leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the marinade, combine the ginger, clove, vanilla bean and wine in a saucepan. Bring to a boil over high heat. Add 2 of the minced shallots. Set aside until cool. Place the duck breasts in a large bowl. Add the marinade. Cover. Marinate in the refrigerator for 2 hours, turning once. Take the duck breasts out of the marinade. Pat dry and set aside until the breasts reach room temperature. Strain the marinade and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 200 degrees. Brush a pie plate with 1 teaspoon of the oil. Set aside. Pour 1 cup of the chicken broth in a large saucepan. Bring to a boil. Reduce the heat to medium low. Gradually add the cornmeal. Add the pumpkin puree. Whisk constantly until smooth, about 5 minutes. Spread the cornmeal into the pie plate. Place in the warm oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil in a heavy-bottom skillet. Add the duck, fat side down, and cook over medium-high heat until golden brown, about 5 minutes. Turn the duck over, lower the heat to medium and cook until medium rare, about 3 more minutes. Remove the duck and set aside. Pour the marinade into the pan. Add the remaining shallots. Simmer over high heat until reduced to 1/4 cup, about 5 minutes. Add the remaining broth and simmer until reduced to 1 cup, about 5 to 10 minutes. Strain. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the polenta from the oven. Cut into 8 wedges. Place 2 pieces on each of 4 plates. Cut the duck into thin strips crosswise and arrange around the polenta. Drizzle each plate with 2 tablespoons of sauce. Garnish with sage. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/496-pan-seared-duck-breast-with-pumpkin-polenta"}