{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Tuna In Black Pepper Crust", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "black peppercorns, spinach, tuna, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "8 grams", "proteinContent": "49 grams", "saturatedFatContent": "3 grams", "sodiumContent": "827 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon fresh lime juice", "1 tablespoon fresh marjoram or oregano (or 1 teaspoon dried)", "4 tablespoons olive oil", "1 1/2 pounds fresh tuna in one thick piece", "1 tablespoon cracked black pepper", "2 tablespoons canola oil", "1 pound fresh spinach, well rinsed, dried and trimmed of heavy stems", "1 cup cooked white beans (cannel- lini beans)", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the lime juice, marjoram and 2 tablespoons of the olive oil together. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim any dark areas from the tuna, then cut it into four equal pieces, trimming them a little if necessary to make four rectangular logs. Press the cracked black pepper over the outside of the pieces of fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat all but a teaspoon of the remaining olive oil plus the canola oil in a large, heavy skillet. When the oil is very hot, carefully place the fish in the skillet (to avoid splattering) and sear each piece for barely a minute, then turn and continue to sear the fish pieces briefly on each of the remaining three sides. Remove the fish to a warm plate. The fish should be rare in the middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the skillet and add the remaining olive oil. Add the spinach and saute it for a few minutes, until the spinach is barely wilted. Add the beans, season with salt and pepper and continue to saute until the spinach is wilted but is still a bright green and the beans are completely heated through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the spinach mixture equally among four dinner plates. Cut the blocks of seared tuna into slices one-half-inch thick and array the slices on top of the spinach. Briefly beat the vinaigrette, then drizzle the vinaigrette around the tuna and the spinach. The plates are now ready to be served."}], "link": "https://cooking.nytimes.com/recipes/4960-seared-tuna-in-black-pepper-crust"}