{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Lobster With Vanilla Sauce", "description": "", "author": {"@type": "Person", "name": "Karen Kochevar"}, "image": null, "totalTime": "PT50M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "lobster, vanilla bean, watercress, main course", "aggregateRating": null, "recipeIngredient": ["2 live lobsters, 1 1/4- to 1 1/2-pounds each", "1 tablespoon olive oil", "7 tablespoons plus 2 teaspoons unsalted butter", "3 shallots, peeled and finely chopped", "1/4 cup white wine", "1 1/2 tablespoons white wine vinegar", "1/2 vanilla bean, split lengthwise", "1/2 teaspoon kosher salt", "Freshly ground pepper to taste", "3/4 pound tender spinach, stemmed", "1 pound watercress, stemmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a roasting pan large enough to hold the lobsters in the oven and preheat to 450 degrees. With the tip of a sharp knife pierce lobsters between the eyes to sever the spinal cord. Crack claws using the blunt edge of a cleaver or a hammer. Place lobsters in the hot roasting pan, drizzle with oil and roast until red, about 15 minutes. Remove from oven, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 teaspoons of butter in a small saucepan, add the shallots and saute over low heat until soft and translucent, about 3 minutes. Add wine and vinegar, raise heat and cook at a moderate boil until the liquid is reduced to 1 tablespoon, about 5 minutes. Remove the pan from the heat, and whisk in 6 tablespoons of butter, about 1 tablespoon at a time until all is incorporated. Scrape the seeds from the vanilla bean into the sauce, stir to combine and strain into a clean saucepan. Season with 1/4 teaspoon salt and pepper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the lobsters are cool enough to handle, remove the meat from the claws. Detach the tails, and discard the heads. With a pair of scissors, cut the shell on the underside of each tail in half lengthwise, remove the meat and cut into 1/4-inch-thick slices. Loosely cover the meat with aluminum foil, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon of butter in a large pot, and add spinach and watercress. Stir until greens have melted down, and continue to cook, stirring occasionally, until greens are tender, about 5 minutes. Season with 1/4 teaspoon salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, reheat the sauce over low heat until warm, whisking constantly. Place a bed of greens on each plate, arrange the lobster meat on top and spoon the sauce over the lobster. Serve immediately."}]}