{"@context": "http://schema.org", "@type": "Recipe", "name": "Walnut, Cracked Coriander and Cumin Rolls With Stilton And Honey", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "brunch, project", "keywords": "all-purpose flour, coriander seeds, walnut, fall, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 543, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "11 grams", "sodiumContent": "656 milligrams", "sugarContent": "36 grams", "transFatContent": null}, "recipeIngredient": ["2/3 cup walnuts", "3/4 teaspoon coriander seeds", "3/4 teaspoon cumin seeds", "1 package active dry yeast", "1 cup warm water", "1/2 teaspoon sugar", "2 2/3 cups all-purpose flour, plus more for kneading dough", "1 1/4 teaspoons kosher salt", "2 tablespoons walnut oil, plus more for oiling bowl", "1 cup honey", "1 pound Stilton cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large heavy skillet over medium heat. Add the walnuts and toss frequently until toasted, about 8 minutes. Remove from the skillet and set aside. Place the coriander and cumin seeds in the skillet and stir constantly until toasted, about 1 1/2 to 2 minutes. Place the seeds on a work surface, cover with plastic wrap and crush with a rolling pin. Set aside. Chop the walnuts and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the yeast and water in a large bowl until the yeast is dissolved. Add the sugar and let stand for 5 minutes. Stir in 1 1/3 cups of the flour and the salt. Stir in the walnut oil, walnuts and spices. Gradually stir in the remaining flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a floured surface and knead until smooth, about 10 minutes. While kneading the dough, add as much additional flour as needed to keep the dough from sticking to your hands and the work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a large, clean bowl. Shape the dough into a smooth ball and place it in the bowl, turning it once to coat the top with oil. Cover with a clean kitchen towel and let stand in a warm place until dough has doubled in bulk, about 1 hour. Punch the dough down and reshape into a ball. Cover and let double again, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Punch the dough down and divide it into 16 equal pieces, using a scant 1/4 cup of dough for each. On a barely floured surface, roll each piece into a ball. Roll each ball into a rope about 9 inches long. Tie the ropes loosely into knots and place on 2 parchment-lined baking sheets. Cover each sheet with a towel and let stand until the rolls are doubled, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the rolls are golden brown, about 20 to 25 minutes. (Rolls can be made ahead and reheated.) Heat the honey in a small saucepan until hot and pour into a serving bowl or pitcher. Place 2 rolls on each of 8 plates and serve, passing the Stilton and honey separately."}], "link": "https://cooking.nytimes.com/recipes/5024-walnut-cracked-coriander-and-cumin-rolls-with-stilton-and-honey"}