{"@context": "http://schema.org", "@type": "Recipe", "name": "Loin of Pork With Peaches and Apricots", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "12 to 14 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "boneless pork loin, dried fruit, sage, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 297, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "26 grams", "saturatedFatContent": "2 grams", "sodiumContent": "496 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound dried peaches and apricots, soaked overnight in water to cover", "1 4-pound boneless loin of pork, rolled and tied", "Coarse salt and freshly ground pepper to taste", "3 cloves garlic, minced", "1 cup sage leaves", "1/2 cup white-wine vinegar", "1 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the dried fruits in their soaking liquid until they are tender (about 15 minutes) and allow them to cool. If the butcher has already tied the pork loin, untie it. Season the meat with salt and pepper, sprinkle with garlic and half the sage leaves and stuff it with peaches and apricots. Bind the meat again to form a roll."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Using a heavy Dutch oven or enameled casserole just large enough for the pork, brown the meat under a broiler on all sides or on top of the stove. Remove it from the casserole and add the vinegar and the wine, scraping up the cooking juices over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pork to the casserole and cover. Cook, basting from time to time, for about two hours, or until the temperature on a meat thermometer registers 155 degrees, which is high enough to kill any trichinosis bacteria. For the last 30 minutes, uncover the pork so that it browns. Do not overcook the pork or it will be dry and tough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pork from the cooking juices and put it on a platter. Keep it warm on the back of the stove. Bring the juices to a boil and skim off excess fat. Add any excess fruit to the sauce and heat through. To serve the pork, slice it thin and arrange it on a serving platter. Spoon on the sauce and decorate with chopped sage leaves."}], "link": "https://cooking.nytimes.com/recipes/5047-loin-of-pork-with-peaches-and-apricots"}