{"@context": "http://schema.org", "@type": "Recipe", "name": "Lora Brody's bete noire (A special chocolate cake)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six to eight servings", "recipeCuisine": "french", "recipeCategory": "brunch", "keywords": "butter, eggs, unsweetened chocolate, dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 632, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "27 grams", "sodiumContent": "62 milligrams", "sugarContent": "41 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 pound unsalted butter at room temperature, cut into small pieces, plus butter for greasing the pan", "8 ounces unsweetened chocolate", "4 ounces semisweet chocolate", "1/2 cup water", "1 1/3 cups sugar", "5 extra large eggs at room temperature, about one cup whites plus yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a nine-inch cake pan and place a neat circle of parchment or wax paper on the bottom, covering it completely. If wax paper is used, butter it. If parchment is used, it is not necessary to butter it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop both the chocolates into fine pieces and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the water with one cup of the sugar in a heavy two-quart saucepan. A large copper saucepan is ideal for this. Bring to the boil over high heat and cook about four minutes or to a temperature of 220 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the saucepan from the heat and immediately add the chocolate pieces, stirring until they are melted and smooth. The mixture may ''sieze'' but that is all right; it will blend when the butter is added. Immediately start adding the butter, stirring gently until all of it is used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the eggs and remaining sugar in the bowl of an electric mixer. Start beating on high speed and continue until they are quite thick and pale yellow, and tripled in volume. This may take about 15 minutes. It may be useful to place a dishcloth over the mixer and bowl to prevent splattering."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start mixing the egg and sugar mixture on slow speed. Add the chocolate mixture, stirring only until it is fully incorporated. Do not overbeat. This would cause air bubbles to form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon and scrape the mixture into the prepared cake pan. Set the pan in a slightly larger pan and pour boiling water around it. Do not allow the sides of the pans to touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 25 minutes. Insert the sharp point of a knife into the center of the cake; if it comes out clean, the cake is done. If it does not come out clean, continue cooking for up to 10 minutes. Do not cook longer than a total of 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool (see note) in the pan for 10 minutes. Run a sharp knife around the edge of the cake and unmold onto a cookie sheet. Invert a serving plate over the cake and turn it right side up onto the serving plate."}], "link": "https://cooking.nytimes.com/recipes/5066-lora-brodys-bete-noire-a-special-chocolate-cake"}