{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Fagioli", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas, soups and stews", "keywords": "arugula, orecchiette, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["1 tablespoon olive oil", "1 medium onion, peeled and diced", "1 large carrot, peeled and diced small", "2 ribs celery, diced small", "2 1/4 cups dried white beans, soaked overnight and drained", "3 to 4 quarts chicken broth, homemade or low-sodium canned", "4 1/2 cups water", "1 1/2 teaspoons kosher salt, plus more to taste", "Freshly ground pepper to taste", "3/4 pound small pasta, like orecchiette or elbow macaroni", "3 tablespoons chopped Italian parsley", "2 cups stemmed arugula, cut across into 1/4-inch-wide strips", "4 plum tomatoes, seeded and diced", "2 teaspoons extra-virgin olive oil", "2 teaspoons red wine vinegar", "1/4 teaspoon kosher salt", "18 1/4-inch-thick slices French baguette, about 1 inch in diameter", "1 tablespoon extra-virgin olive oil", "2 tablespoons freshly grated Parmesan cheese", "2 red and 2 yellow bell peppers, roasted, peeled, cored and cut into thin strips", "3/4 cup pine nuts, toasted", "3/4 cup oil-cured black olives, pitted and coarsely chopped", "Basil-flavored olive oil (available at specialty food stores)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the soup, heat the oil in a large saucepan. Add the onion, carrot and celery and saute over medium heat until the onion is soft, about 5 minutes. Stir in the beans, 1 quart of broth and the water. Bring to a boil, lower heat and simmer until the beans are soft, about 1 1/2 hours. Add 2 quarts of broth and season with the salt and pepper. Bring the soup to a boil, add the pasta and cook until al dente, about 8 minutes. Reheat before serving, adding more broth, if needed. Stir in the parsley and additional salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the condiments, preheat oven to 350 degrees. Toss together the arugula, tomatoes, 2 teaspoons of olive oil, vinegar and salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the bread rounds with 1 tablespoon of olive oil, sprinkle with Parmesan, place on a baking sheet and bake until the cheese is melted, about 5 minutes. Pile on a plate. Place the arugula salad, peppers, pine nuts and olives in separate bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into 6 bowls. Serve, passing the condiments, including the basil oil, separately."}]}