{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushrooms and Sour Cream With Fried Potatoes", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT40M", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "potato, sour cream, wild mushrooms, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 423, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "9 grams", "proteinContent": "6 grams", "saturatedFatContent": "6 grams", "sodiumContent": "863 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound fresh wild mushrooms (like chanterelles or small boletes)", "2 tablespoons unsalted butter", "4 1/2 tablespoons vegetable oil", "4 medium-size boiling potatoes, peeled and cut into 1 1/2-by- 1/4-inch sticks", "Coarse salt and freshly ground black pepper to taste", "1 cup finely chopped onions", "3 tablespoons sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the mushrooms with a damp cloth. Separate the stems from the caps. (The small chanterelles can be left whole.) Cut the stems in half crosswise. Cut the smaller caps in half and the larger ones in quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a medium-size skillet over medium heat. Add the mushrooms and cook them, tossing and stirring, until they throw off their liquid and then reabsorb it, about 12 minutes. Set them aside. Wipe out the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat three tablespoons of the oil in a large skillet over medium heat. Add the potatoes and cook them over medium heat for about five minutes. Scrape under the bottom layer with a wooden spoon and stir so that the cooked potatoes are on top. Cook the potatoes this way until they are cooked through and deep golden, about 20 minutes. If they stick to the bottom of the skillet, scrape them off. Season them with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are cooking, heat the remaining oil in another skillet. Add the onions and saute them over medium heat until deeply colored, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the mushrooms, onion and sour cream into the potatoes and toss everything well. Cook over low heat until the sour cream is heated through, two minutes. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/5109-mushrooms-and-sour-cream-with-fried-potatoes"}