{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Jack-Be-Little Pumpkins With Maple Panna Cotta", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, maple syrup, milk, pumpkin", "aggregateRating": null, "recipeIngredient": ["3 cups milk", "4 cinnamon sticks", "1 vanilla bean, split and scraped of pulp", "6 Jack-Be-Little pumpkins", "1 cup heavy cream", "1/2 cup dark amber maple syrup", "1 1/4-ounce envelope gelatin", "2 star anise", "3 cloves", "3 allspice berries", "2 cups mixed dried fruit (such as apricots, cranberries, prunes, cherries and figs)", "2 cups freshly squeezed orange juice", "1 cup Armagnac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. In a small pan, combine 2 cups milk, 2 cinnamon sticks and the vanilla bean. Bring to a boil, and immediately remove from heat. Allow to steep 10 minutes. Remove and discard cinnamon sticks and vanilla bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice tops from pumpkins, as close to the top as possible. Remove seeds and pulp. Place pumpkin bottoms cut side up in a roasting pan, and fill each pumpkin with heated milk, about 1/4 cup per pumpkin; reserve remaining milk. Place pumpkin tops in roasting pan cut side down. Cover pan with aluminum foil, and bake until tender, about 40 minutes. Remove from oven. When cool, discard liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pan, combine remaining milk, cream, maple syrup and gelatin. Bring almost to a boil; remove from heat, and allow to cool. Fill pumpkin shells with this mixture, cover with plastic wrap, and refrigerate at least 4 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place star anise, 2 remaining cinnamon sticks, cloves and allspice on a piece of cheesecloth. Tie securely with kitchen string. In a medium-size saucepan, combine the dried fruit, wrapped spices, orange juice, Armagnac and 2 cups water. Bring to a boil over high heat, and reduce heat to low. Simmer, stirring occasionally, until fruit is tender and there are about 6 tablespoons of liquid left in the pan. Discard spices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow pumpkins to come to room temperature before serving. Place a pumpkin in the center of each of 6 plates, with a pumpkin top leaning against it. Spoon a little fruit and juice around each pumpkin, and serve."}], "link": "https://cooking.nytimes.com/recipes/512-roasted-jack-be-little-pumpkins-with-maple-panna-cotta"}