{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Chowder With Mollet Eggs and Croutons", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "lunch, weekday, soups and stews", "keywords": "chicken stock, eggs, tomato, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 936, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "4 grams", "proteinContent": "69 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1110 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons virgin olive oil", "2 onions (8 ounces), peeled and coarsely chopped (1 1/2 cups)", "8 scallions, trimmed (but with green left on) and chopped (1 cup)", "2 carrots, peeled and coarsely chopped ( 3/4 cup)", "4 cloves garlic, peeled, crushed and chopped (1 tablespoon)", "3 tablespoons flour", "4 cups chicken stock (preferably homemade, unsalted and defatted) or 4 cups water and 2 cubes chicken bouillon", "1 pound cherry tomatoes", "1 can (28 ounces) plum tomatoes, preferably imported", "1 1/2 teaspoons salt", "1/2 teaspoon freshly ground pepper", "1 teaspoon dried thyme leaves", "1/2 teaspoon dried sage leaves", "6 slices country-style bread (6 ounces), preferably stale, for croutons", "1 tablespoon virgin olive oil", "1 clove garlic, peeled", "6 small eggs", "3/4 cup grated Swiss cheese (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the 3 tablespoons olive oil in a large, sturdy saucepan. When the oil is hot but not smoking, add the onions, scallions, carrots and chopped garlic, and cook over high heat, stirring constantly, for 6 to 8 minutes. Sprinkle the flour on top of the mixture, stir thoroughly and cook for 2 minutes longer, stirring. Mix in the stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the cherry tomatoes in the bowl of a food processor, and process until coarsely chopped. You should have about 2 cups. Add the can of plum tomatoes, and process for 5 seconds. Add to the soup with the salt, pepper, thyme and sage. Bring to a boil, stirring occasionally; then, cover, reduce heat to low and cook for 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup is cooking, prepare the garnishes: brush the bread slices with the tablespoon of oil, and bake them in a single layer on a cookie sheet in the 400-degree oven for 10 to 12 minutes, or until nicely browned. Rub one side of the croutons with the peeled garlic clove, and set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a thumbtack, make a hole in the rounded end of each egg. Lower the eggs gently into a pan containing enough boiling water to cover them, and cook the eggs for 5 minutes in barely boiling water. Drain the hot water from the pan, and shake the pan to crack the shells of the eggs on all sides. Fill the pan with ice and water, and set the eggs aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the eggs are cool, peel them carefully (so as not to damage the yolks, which are still runny) under cool running water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At serving time, bring the soup to a strong boil, and ladle about 10 ounces of it into each of six bowls. Place an egg in the center of each bowl, and wait for about 5 minutes for the eggs to warm in the center. Place a crouton in each bowl, and serve, sprinkled, if desired, with the cheese."}]}