{"@context": "http://schema.org", "@type": "Recipe", "name": "Fairly Classic Gefilte Fish", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "24 pieces, about 12 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "eggs, fish fillets, matzo meal, kosher, main course, spring", "aggregateRating": null, "recipeIngredient": ["3 pounds fish fillets, preferably", "1 pound each whitefish, pike and carp, cut in 1-inch squares", "", "", "1 cup finely chopped onion", "2 cloves garlic, minced", "2 tablespoons minced parsley", "1/3 cup matzoh meal", "Juice of 1 lemon", "1/2 cup dry white kosher for Passover wine, or water", "2 eggs, lightly beaten", "2 egg whites, lightly beaten", "2 teaspoons kosher salt or to taste", "1 1/2 teaspoons freshly ground pepper or to taste", "1 quart fish stock (see below)", "2 carrots, peeled", "Prepared horseradish", "3 pounds fish bones and heads", "8 cups water (approximately)", "1 large carrot, peeled", "1 large onion, peeled and quartered", "3 bay leaves", "1 teaspoon white peppercorns", "Kosher salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the fish, but not too finely. In a food processor it should be done in two batches, about 24 pulses each. Mix the fish with the onion, garlic, parsley, matzoh meal, lemon juice, wine or water and eggs. Season with salt and pepper. Do not underseason. The best way to check the seasonings is to poach a small amount of the mixture in simmering water and taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the stock, place the fish bones and heads in a stockpot. Cover with cold water, and bring to a boil. Boil about 5 minutes, skimming constantly. Lower heat to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining stock ingredients except the salt, and simmer gently about 1 1/2 hours, adding additional water as needed to keep the ingredients covered. Strain through a very fine strainer. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the stock into a large shallow saucepan. Add the carrots, and cook until tender, about 10 minutes. Remove the carrots, slice them and refrigerate. Add enough water to the stock so the liquid is about 3 inches deep. Bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keeping your hands wet with cold water, form the fish mixture into oval patties about 3 inches long. Slip as many as will fit comfortably into the pan, and poach for 30 minutes. Remove and drain them, and continue poaching the rest. When all the fish is cooked, transfer it to a bowl or serving dish, scatter the carrot slices over it and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil down the cooking liquid until it is reduced to about 3 cups. Strain through a fine strainer. Spoon some over the cooled fish. Refrigerate the rest. It should jell. Skim the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the fish cold with horseradish and jellied broth on the side."}], "link": "https://cooking.nytimes.com/recipes/5130-fairly-classic-gefilte-fish"}