{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Turkey With Maple Corn Sauce", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT4H", "recipeYield": "Twelve to 16 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "corn kernels, maple syrup, turkey, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 667, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "1 gram", "proteinContent": "80 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1132 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 12- or 13-pound turkey with neck", "1 onion, about 1/2 pound, peeled and cut into eighths", "1 tablespoon finely minced garlic", "1/4 pound coarsely chopped carrot", "Salt to taste, if desired", "Freshly ground pepper to aste", "3 tablespoons corn, peanut or vegetable oil", "3 cups rich turkey or chicken broth", "1/4 cup finely chopped onion", "2 cups corn kernels freshly scraped from the cob, or use drained, canned, whole-kernel corn", "1/4 cup bourbon whisky", "2 tablespoons cider vinegar", "1/4 cup maple syrup", "3/4 cup heavy cream", "1 teaspoon flour", "1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off and discard the wing tips of the turkey. Cut off and leave intact the main wing bone and the second wing joint. Set aside. Cut the neck crosswise into four pieces of equal length. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the cavity of the turkey with the onion pieces, garlic, carrot and salt and pepper to taste. Sprinkle the outside of the turkey with salt and pepper and rub the turkey all over with two tablespoons of the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the bottom of a large roasting pan with the remaining oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the turkey on one side in the roasting pan. Scatter the neck pieces and the cut-off wing portions around it. Place in the oven and roast about 40 minutes. Turn the turkey onto its opposite side. Place in the oven and roast another 45 minutes, basting often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the turkey and set aside briefly. Pour off one tablespoon of the fat from the pan and set it aside. Pour off and discard the remaining fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the turkey to the pan breast-side up and pour two cups of the broth around it. Bring to the boil on top of the stove and return the turkey to the oven. Bake about 30 minutes, turning the pan laterally so that it cooks evenly. Continue baking, basting occasionally, about one hour and 15 minutes. Remove the turkey from the pan and cover it loosely with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out the vegetables from the cavity of the turkey and add them to the liquid in the roasting pan. Add the remaining one cup of broth and bring to the boil. Cook until the liquid is reduced to about one and two-thirds cups. Strain this sauce, discarding the solids. Set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the reserved tablespoon of fat (or, if desired, you might substitute corn, peanut or vegetable oil) in a skillet. Add the quarter-cup of finely chopped onion and the corn and cook until the onions are wilted. Add the bourbon, vinegar and maple syrup and stir, cooking about two minutes or until the liquid in the skillet is reduced by half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the reserved turkey sauce to the corn mixture and bring to the boil. Cook about one minute and add the cream, salt and pepper to taste. Cook, stirring and skimming the surface often to remove any foam or scum. Blend the flour with the water and add this to the sauce, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the turkey and serve the sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/52-roast-turkey-with-maple-corn-sauce"}