{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Portobellos With Potatoes and Sour Cream", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, gold potatoes, portobello, sour cream, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "590 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds (4 medium) Yukon gold potatoes, peeled and thinly sliced", "2 tablespoons olive oil, plus more for brushing the mushrooms", "1 3/4 teaspoons salt, plus more salt to taste", "3 eggs", "1/3 cup sour cream, plus more for garnish", "1 teaspoon chopped thyme leaves", "Freshly ground black pepper", "2 cups Portobello Caviar, prepared without parsley (see above)", "4 medium (5-inch) portobello mushroom caps", "Chopped parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Toss the potatoes with the oil and 1 teaspoon of salt and transfer them to a greased baking sheet large enough to hold them in a single layer. Bake, turning the potatoes once, until lightly browned, 20 to 25 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower temperature to 400 degrees. Whisk together the eggs, 1/3 cup sour cream, thyme, 3/4 teaspoon salt and a few grinds of pepper. Stir in the portobello caviar. Brush the mushroom caps with olive oil, season them on both sides with salt and place them gill-side up on a greased baking sheet. Lay the potato slices over the mushrooms, letting some hang over the edges of the mushrooms like petals of a flower. Divide the caviar mixture evenly into 4 parts, mounding 1 part in the middle of each mushroom cap. Bake until the filling is set and the mushroom caps are very tender, about 30 minutes. Garnish each mushroom with a dollop of sour cream and parsley and serve."}]}