{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Duck Breasts With Nectarine- Green Grape Chutney", "description": "", "author": {"@type": "Person", "name": "John Willoughby"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "duck breast, grape, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 374, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "29 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1218 milligrams", "sugarContent": "34 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon olive oil", "1 large red onion, peeled and diced fine", "3 nectarines, pitted and diced", "1 cup green grapes, halved", "1 cup cider vinegar", "1/2 cup brown sugar", "Pinch ground allspice", "Pinch ground mace", "1 tablespoon roughly chopped fresh basil", "Salt and freshly ground black pepper", "4 duck breasts, 8 to 10 ounces each"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saute pan, heat the oil over medium heat until hot but not smoking. Add the onion and saute, stirring occasionally, until transparent, about 5 to 7 minutes. Add the nectarines and grapes, and cook, stirring, until the nectarines are a bit browned, about 4 minutes. Add the vinegar, sugar, allspice, mace, basil and salt and pepper to taste. Bring the mixture just to a boil, reduce the heat to low and simmer 10 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, build a small fire in one side of a grill, using enough coals to fill a shoe box. Salt and pepper the duck breasts well and place them on the grill, withy the fat side down, along the edge of the fire. Cook them for 6 minutes, being careful of flare-ups caused by fat dripping into the fire. If flare-ups do occur, move the breasts so that they are not directly over the flames. You want them to cook slowly, allowing the fat to drip off at an even pace and giving the skin time to crisp. Flip the breasts over and cook 5 to 7 minutes more. When the duck breasts are nicely browned and as firm to the touch as the heel of your hand, they are medium rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull the duck breasts off the fire, allow to cool for about 4 minutes, then slice them thinly on the bias and serve with the chutney."}]}