{"@context": "http://schema.org", "@type": "Recipe", "name": "Mussel and Chard Soup", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, blue crabs, mussels", "aggregateRating": null, "recipeIngredient": ["1/4 cup plus 1 tablespoon extra-virgin olive oil", "2 medium onions, chopped", "1 pound ripe tomatoes, chopped", "3 pounds mussels, scrubbed", "8 cups water", "1 pound bones and trimmings from a fresh fish", "4 small live blue crabs", "Large sprigs of fresh parsley, rosemary, sage and thyme", "1 dried red chili", "2 bay leaves", "8 black peppercorns", "2 pieces dried orange peel", "1 large pinch saffron", "4 star anise", "Salt and freshly ground black pepper", "2 1/2 tablespoons unsalted butter", "2 ripe medium tomatoes, peeled, seeded and chopped", "1 bunch fresh Swiss chard, leaves only, slivered", "2 ounces fresh goat cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the 1/4 cup oil in a 6-quart saucepan. Add the onion, and saute over medium heat until tender. Stir in the unpeeled tomatoes, and cook about 5 minutes, until the mixture is thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 pounds of the mussels, cover, and cook about 10 minutes, just until they open. Using a slotted spoon, remove the mussels, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the water, and bring to a simmer. Add the remaining mussels, fish trimmings, crabs, herbs, chili, bay leaves, peppercorns, orange peel, saffron and star anise. Simmer uncovered, skimming the surface from time to time, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the stock is cooking, remove the reserved cooked mussels from their shells, discard the shells, and refrigerate the mussels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the stock is done, drain it into a colander over a large bowl, and return the liquid to the saucepan. The cooked seafood and other solids should be discarded."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil down the liquid until it is reduced to 2 1/2 cups. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean saucepan melt the butter, and cook until it starts to brown. Add the chopped peeled tomatoes, and saute briefly. Add the reduced seafood stock, bring to a simmer, and add the chard. Simmer over medium heat for 10 minutes. Add the shucked mussels, and simmer briefly to reheat them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the soup among 4 bowls. Drop a piece of the goat cheese on top of each, and drizzle with the remaining olive oil. Serve at once."}]}