{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Soufflé", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dessert, eggs, lemon juice", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "102 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Softened butter for greasing dish", "5 tablespoons granulated sugar", "1 cup milk", "3 large egg yolks", "1 tablespoon vanilla", "1/4 cup all-purpose flour", "2 tablespoons finely grated lemon rind", "4 tablespoons fresh lemon juice", "1 tablespoon powdered sugar, plus more for sprinkling", "5 large egg whites", "Lightly whipped cream or cold crème anglaise for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Butter an 8-cup soufflé dish and dust the bottom and sides with 2 tablespoons of the granulated sugar, shaking out excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the milk to boiling in a heavy saucepan. Remove from heat. Whisk the egg yolks, vanilla and 1 tablespoon of the granulated sugar until well blended, then whisk in the flour. Whisk in the hot milk in a thin, steady stream and blend until smooth. Return the mixture to the saucepan and cook over medium-low heat, stirring constantly, until mixture is very thick, about 2 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the lemon rind, lemon juice and 1 tablespoon powdered sugar in a cup and whisk into the egg yolk mixture. (At this point, the soufflé base can be refrigerated, covered with plastic wrap directly on its surface, for up to a day.) If the soufflé base is still warm, whisk briefly until smooth. Otherwise, place over low heat, whisk until just warm, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until soft peaks form. Sprinkle in the remaining 2 tablespoons granulated sugar and beat until stiff and shiny. Fold 1/4 of the whites into the soufflé base. Gently fold in the rest, being careful not to deflate mixture. A few white streaks may remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the mixture into the prepared dish and place on the center rack in the oven. Immediately reduce oven temperature to 375 degrees. Bake until soufflé is puffed and brown, about 20 to 25 minutes. (It should still wobble a bit.) Sprinkle powdered sugar over the top and serve immediately with lightly whipped cream or very cold créme anglaise."}], "link": "https://cooking.nytimes.com/recipes/5275-lemon-souffle"}