{"@context": "http://schema.org", "@type": "Recipe", "name": "Long Island Country Samp", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Six or more servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, kielbasa, samp, side dish", "aggregateRating": null, "recipeIngredient": ["1 pound dried samp, about 2 1/2 cups", "Water", "1 pound Polish sausage, kielbasa", "2 long, mildly hot red or yellow peppers, about 1/4 pound, optional", "1 onion, about 1/4 pound, peeled", "Salt to taste, if desired", "1 sweet red pepper, about 6 ounces, cored, seeded and deveined (see note)", "4 tablespoons butter", "1/4 cup finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the samp in a mixing bowl and add cold water to cover to a depth of about one inch above the top of the samp. Let stand overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the samp. Pull off and discard any yellow ''kernels'' that may remain in each grain. Put the cleaned samp in a kettle and add 10 cups of cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off and discard the ends of each sausage. Cut the sausage crosswise into four pieces of equal length. Add these to the kettle. Add the peppers, onion and salt and bring to the boil. Cook 50 minutes to one hour or until the samp is tender. Remove from the heat and drain the mixture well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and reserve the sausage, mildly hot peppers and onion. Finely chop the onion. Core, seed and devein the cooked peppers and chop them. Cut the sausage into quarter-inch cubes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the uncooked sweet red pepper into fine dice. There should be about two-thirds of a cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a large, heavy skillet and add the diced sweet red pepper, onion, mildly hot peppers and cubed sausage. Cook, stirring, about one minute and add the drained samp. Cook, stirring, about one minute or until the samp is thoroughly hot. Stir in the parsley."}], "link": "https://cooking.nytimes.com/recipes/53-long-island-country-samp"}