{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Chops", "description": "When you think of finger foods, thoughts generally gravitate toward something small and wrapped in bacon. For a more elegant approach, roasted meat is the way to go. If you can get small lamb chops (teeny-tiny but not fussy), cover the bones in scallion ''sleeves” for a whimsical look and a practical touch. If your guests don’t mind, they’ll have a built-in utensil — something like a lamb lollipop.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2014/05/23/dining/Lamb-Chops/Lamb-Chops-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "8 appetizer servings, 4 dinner servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "appetizer, main course, lamb chops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 166}, "recipeIngredient": ["1 rack (8 ribs) New Zealand baby lamb, trimmed of excess fat and Frenched by your butcher", "Coarse sea salt and freshly ground black pepper", "1 cup extra-virgin olive oil", "3 cloves garlic, chopped", "Leaves from 2 sprigs rosemary, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a grill or grill pan until very hot. Preheat the oven to 350 degrees. Season the lamb with the salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the oil, garlic and rosemary. Spoon half on the lamb and grill 1 minute per side. Place on a sheet pan and cover with the rest of the marinade. Roast in the oven until an instant-read thermometer reaches 125 degrees for rare, 130 degrees for medium rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool for 5 minutes, then slice off individual chops and serve with sea salt for dipping. (S.R.O. uses tiny lamb chops, which fit into scallion ''sleeves.'' The racks generally sold by your butcher will be too big for this touch.)"}]}