{"@context": "http://schema.org", "@type": "Recipe", "name": "Carre d'Agneau a l'Estragon (Rack of lamb with tarragon)", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "lamb, tarragon, main course", "aggregateRating": null, "recipeIngredient": ["2 racks of lamb, about 5 pounds", "Salt to taste, if desired", "Freshly ground pepper to taste", "3 tablespoons olive oil", "3 tablespoons butter", "1/4 cup finely chopped onion", "1/4 cup dry white wine", "1 tablespoon finely chopped fresh tarragon or 1 teaspoon dry", "1 teaspoon tomato paste", "1/2 cup rich chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Each rack of lamb is coated with a fairly heavy covering of fat. This is easily removed with the fingers and a knife. Pull off all the fat from the meaty part of the racks. Using a sharp knife, cut away the fat from the top of the ribs, cutting close to the bone. Using a cleaver, hack the bones in two, leaving about two inches of bones extending from the meat part. Reserve these bones. Hack off the chine bone. Discard the chine bones. This may all be done by the butcher when you purchase the racks. Sprinkle the racks with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select a heavy skillet large enough to hold the racks and hacked-off bones in one layer. Heat the oil in the skillet and add the racks top side down. Cook, turning occasionally to brown all sides, for about 13 minutes. Transfer the pieces to a serving platter to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off the fat from the skillet and add two tablespoons of the butter. Add the onion and cook, stirring, until wilted. Add the wine and cook down almost completely. Add the tarragon, tomato paste and stir. Add the broth. Cook down quickly to about half a cup. Swirl in the remaining butter. Cut the rack between the ribs and serve with the sauce poured over them."}], "link": "https://cooking.nytimes.com/recipes/5337-carre-dagneau-a-lestragon-rack-of-lamb-with-tarragon"}