{"@context": "http://schema.org", "@type": "Recipe", "name": "Eric Ripert's Turkey Two Ways", "description": "The chef Eric Ripert brought The Times this French take on the traditional Thanksgiving centerpiece in 2002. The turkey is cooked in parts: the breasts are roasted in the oven, and the turkey legs and thighs are slowly braised and then baked in cabbage rolls.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "8 servings, with leftovers", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": null, "recipeIngredient": ["1 (12- to 14-pound) turkey", "2 bottles dry red wine", "1 medium onion, peeled and chopped", "1 medium carrot, peeled and chopped", "1 celery rib, trimmed and chopped", "1 clove garlic, sliced", "1 bouquet garni (see note)", "Fine sea salt and freshly ground white pepper to taste", "3 tablespoons canola oil", "2 tablespoons flour", "1 quart chicken stock", "1 large head green cabbage, cored and leaves separated", "1/2 pound butter to grease pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the legs from the turkey and separate into drumsticks and thighs. Remove the backbone and cut breast in half. Remove the wingtips. (If you are not adept at butchery, ask the butcher to do this.) Reserve neck, all bones and wings for stock. Cover and refrigerate the breast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the leg parts, wine, onion, carrot, celery, garlic and bouquet garni in a bowl. Marinate in the refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the legs, thighs and vegetables, then boil the wine and bouquet garni, skimming off any foam for 15 minutes, reducing it by one-third. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, separate the turkey leg pieces and vegetables. Place 2 tablespoons of the oil in a large pot over medium heat. Season the leg parts on both sides with salt and pepper. When the oil is hot, add the leg parts and sear until lightly browned, about 4 minutes each side. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining oil to the pot. Add the vegetables and cook until caramelized, about 8 minutes. Stir in flour and cook 2 minutes, until flour is toasted. Add wine and stir to release any browned bits. Return the legs, thighs and bouquet garni to the pot, add chicken stock and simmer until meat falls off the bone, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain legs, thighs and vegetables and strain the liquid through a fine sieve into a saucepan and set aside. Place the vegetables into a bowl. When the turkey is cool enough, remove the meat from the bones and shred into a bowl. Stir in 1/4 cup of the reserved liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Place a roasting pan over medium-high heat and add butter. Season the breasts on both sides with salt and pepper. When butter is sizzling, add the breasts, skin down. Sear about 5 minutes on each side, or until golden brown. Transfer the pan to the oven and roast breasts for 45 minutes, basting with the butter every 5 minutes. Remove and let rest for 15 minutes. Reduce oven temperature to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of salted water to a boil. Add cabbage leaves and cook until tender, about 5 to 7 minutes. Remove leaves and plunge them into ice water; drain. Trim the ends of the tough central rib from the leaves. Place a cabbage leaf on a cutting board (use two if they are small) and place 3 tablespoons of the leg meat and 1 tablespoon of the vegetables at one end. Season with salt and pepper. Fold in the sides and roll up like an envelope. Repeat. (You should have about 12 parcels.) Place in a buttered baking pan, seam side down. Cover with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, bring reserved liquid to a simmer and cook until the sauce lightly coats the back of a spoon. Heat cabbage parcels in a 350-degree oven for 20 minutes, or until hot. Slice the breast meat. Place one cabbage parcel on each plate and fan out 3 slices of breast on top. Spoon the sauce around and serve."}], "link": "https://cooking.nytimes.com/recipes/535-eric-riperts-turkey-two-ways"}