{"@context": "http://schema.org", "@type": "Recipe", "name": "Baby Stuffed Pumpkins", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread, italian sausage, pumpkin, fall, side dish", "aggregateRating": null, "recipeIngredient": ["8 small sweet pumpkins", "Fine sea salt and freshly ground white pepper to taste", "4 tablespoons unsalted butter", "2 tablespoons canola oil", "3 slices good quality white bread, crusts removed", "2/3 cup milk", "2 Italian sausage links, casings removed, finely chopped", "1 turkey liver, trimmed and finely chopped", "1 large egg, lightly beaten", "1/2 teaspoon minced garlic", "1 tablespoon minced shallot", "1 tablespoon chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Cut the top off each pumpkin in a zigzag pattern. Scrape out the seeds with a teaspoon. Season with salt and pepper. Place 1/2 tablespoon of butter in each pumpkin. Rub the outsides and lids with the oil and season with salt and pepper. Place the lid on each, but slightly ajar. Place in a baking pan and pour in 1/2 cup water. Roast 20 to 25 minutes, until the pumpkins are slightly softened. Set aside to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the bread into 1/2-inch cubes and place in a bowl. Add the milk and let stand until the bread absorbs most of it. Squeeze the bread lightly and pour off excess milk. (Bread should be moist.) Add remaining ingredients and stir well. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the stuffing evenly among the pumpkins. Replace the lids. Add additional water if pan is dry. Roast 40 to 50 minutes, or until the stuffing is cooked through and pumpkin is tender. Test by inserting a paring knife into the center of the stuffing for 5 seconds. (The knife will come out warm when the stuffing is cooked.) Let stand 5 minutes before serving."}]}