{"@context": "http://schema.org", "@type": "Recipe", "name": "Camaroes Recheados (Stuffed Prawns)", "description": "", "author": {"@type": "Person", "name": "Julie Sahni"}, "image": null, "totalTime": "PT45M", "recipeYield": "Six to eight servings as a first course; four as a main dish", "recipeCuisine": "portuguese", "recipeCategory": "dinner", "keywords": "appetizer, main course, jumbo shrimp, seafood", "aggregateRating": null, "recipeIngredient": ["2 pounds jumbo shrimp (8 to 10 per pound), shell on", "3 tablespoons red-wine vinegar", "1/2 cup olive oil", "1 1/2 teaspoons salt", "4 large cloves garlic", "12 hot green chilies, or 2 tablespoons shredded hot peppers", "1/2 cup fresh cilantro, lightly packed", "3 scallion stalks, trimmed", "Lemon slices for garni"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold each shrimp underside down. Using a sharp knife, slice through its shell down along its length, almost a half-inch deep. Devein and rinse in cold water. Dry the shrimp thoroughly on paper towels and put in a bowl. Add the vinegar, oil and a half teaspoon of salt, then toss and marinate for 15 minutes (or refrigerate for up to four hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mince the garlic together with the remaining salt and add to the container of a food processor, together with the chilies, cilantro and scallion. Process until finely minced."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal grill or preheat a broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the shrimp thoroughly, reserving the marinade. Stuff the back cavity of each with the minced herbs and arrange them on a rack. Charcoal grill or broil the shrimp until they are just cooked (six to seven minutes), turning once and brushing with the reserved marinade. Serve immediately with lemon slices."}], "link": "https://cooking.nytimes.com/recipes/5363-camaroes-recheados-stuffed-prawns"}