{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Roasted Cod With Stuffed Potatoes", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "cod, gold potatoes, main course", "aggregateRating": null, "recipeIngredient": ["18 small Yukon gold potatoes (evenly sized)", "Salt to taste", "1/2 cup milk", "4 ounces unsalted butter", "2 cups Italian parsley leaves", "1 cup extra-virgin oil plus four tablespoons", "1 ounce osetra caviar", "Juice of 1 lemon plus zest", "2 cups fish or chicken stock", "Freshly ground pepper to taste", "4 cod fillets (about 7 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the potatoes. Put 12 potatoes in sauce pan and cover with cold water. Add salt to taste and cook for three to five minutes, or until barely tender. Drain and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and dice remaining potatoes. Simmer until tender in cold water to cover with salt to taste. Remove, drain and pass through a food mill. Heat milk and an ounce of butter in a small pan. Stir into milled potatoes, season with salt and pepper to taste and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Cut a quarter of an inch off top and bottom of whole potatoes. With a melon baller scoop out the center of each potato. Fill hole with reserved potato puree. Put potatoes on oiled baking sheet and roast for 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make sauce. Blanche the parsley leaves in boiling water and refresh them in a bowl of cold water. Squeeze them dry and chop the leaves. Place oil in blender with parsley and puree. Set aside. Bring stock to boil in sauce pan with juice and zest of the lemon. Reduce by a third. Gradually whisk in butter, season with salt and pepper and three tablespoons parsley puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining oil in frying pan. Season cod fillets with salt and pepper and saute for two to three minutes on each side. To serve, divide the sauce among four plates. Put cod on top of sauce, three potatoes around the fish and top each with small spoon-full of sour cream and caviar. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/5375-pan-roasted-cod-with-stuffed-potatoes"}