{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Rice And Pecan Stuffed Onions With Cranberry-Orange Glaze", "description": "", "author": {"@type": "Person", "name": "Denise Landis"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, main course, pecans, sweet onions, wild rice, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 322, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "4 grams", "sodiumContent": "997 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup wild rice", "6 medium Vidalia, Maui or other sweet onions", "Olive oil", "2 tablespoons unsalted butter", "6 tablespoons finely chopped pecans", "2 teaspoons minced garlic", "Salt", "1 12-ounce can orange juice concentrate", "2 tablespoons balsamic vinegar", "1 tablespoon prepared mustard", "2 teaspoons light-color honey", "3/4 cup (packed) dried cranberries, more for garnish", "1 seedless orange, sliced, for garnish", "1 bunch chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine rice with 1 1/4 cups water. Bring to a boil, cover tightly, and reduce heat to low. Simmer until tender and water is absorbed, about 1 hour. Remove from heat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rice is simmering, heat oven to 450 degrees. Trim a small slice from root end of each onion so that it will stand upright. Remove skins. Use a small sharp paring knife to cut tops off onions, and with a series of small slits, hollow out a cylinder 1 inch wide and 2 inches deep. With a teaspoon, continue to hollow out onions to within about 1/2 inch of bottom. Leave enough thickness in the walls to retain their shape. Mince onion taken from cavities, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub onions with olive oil. Oil a baking dish large enough to hold them snugly in a single layer. Place in lower half of oven and roast until they are tender but still hold their shape, about 25 minutes. Remove pan from heat, and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a medium skillet over medium heat for 2 minutes. Melt butter, add minced onion and pecans, and saute about 8 minutes. Add garlic and stir 1 minute, then add rice and salt to taste. Reduce heat to medium-low, and saute 5 minutes more. Remove from heat, and allow to cool. (Onions and filling may be prepared 2 days ahead, and stored covered in refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow saucepan, whisk together the orange juice concentrate, vinegar, mustard and honey. Place over medium heat, and cook uncovered for 5 minutes. Add 3/4 cup cranberries and 1/4 teaspoon salt. Cook uncovered until thickened, 10 to 15 minutes. Remove from heat, and keep warm, or allow to cool, cover, and refrigerate until needed. (May be prepared 2 days before assembly.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For assembly:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Stuff filling into cavities of onions. Place onions in a baking pan, and top with any remaining filling. Cover tightly with foil, and bake just until thoroughly heated. While onions bake, reheat glaze. To serve, put a spoonful of hot glaze on each plate, and top with an onion. Drizzle sauce on top, and garnish plates with orange slices, cranberries and chives."}]}]}