{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach And Brussels Sprouts Pie With Hazelnut Pastry Crust", "description": "", "author": {"@type": "Person", "name": "Denise Landis"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "brussels sprouts, hazelnut, spinach, fall, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 644, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "9 grams", "proteinContent": "18 grams", "saturatedFatContent": "18 grams", "sodiumContent": "856 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup hazelnuts with skins", "2 1/2 cups unbleached white flour", "1/4 teaspoon salt", "3/4 cup chilled butter, cut into small pieces, more for pan", "2 tablespoons olive oil", "1/4 pound onions, peeled and diced small", "20 ounces spinach leaves, blanched, drained and chopped", "1 pound Yukon Gold potatoes, peeled, diced and boiled until tender", "2 large eggs, lightly beaten", "2 teaspoons minced fresh dill", "2 teaspoons tarragon", "2 teaspoons thyme", "1/2 teaspoon nutmeg", "Salt and freshly ground black pepper", "1/2 pound feta cheese, crumbled", "1 pound brussels sprouts, halved and steamed until tender", "3 roasted and peeled sweet red peppers or 3 canned pequillo peppers, in strips", "1 tablespoon butter, cut into bits"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Roast hazelnuts on a baking sheet until browned and fragrant, 25 to 30 minutes. Transfer, with skins on, to a food processor, and pulse to make a coarse meal. Transfer to a large bowl. Add flour and salt. Add 3/4 cup butter; use two knives or a pastry cutter to cut into mixture until it resembles coarse crumbs. Stir with a fork, and gradually add 1/2 cup cold water, or more as needed, until dough is cohesive. Shape into 2 balls. (May be covered with plastic wrap, and refrigerated for 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 9- or 10-inch pie pan. On a lightly floured counter, roll out each ball to rounds that are slightly larger than the pan. Place one crust in bottom of pan. Cover both crusts with plastic wrap. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small skillet over medium heat, and add olive oil. Add onions, and saute until translucent, 2 to 3 minutes. Transfer to a large mixing bowl. Add spinach, potatoes, eggs, dill, tarragon, thyme and nutmeg. Mix well, and season with salt and pepper to taste. Add feta, and toss gently to mix. (May be covered with plastic wrap, and refrigerated for 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place brussels sprouts cut side down on bottom and sides of pastry-lined pan. Cover sprouts with spinach mixture, mounding it high in center. Place red pepper strips evenly across top, and press gently to compact mixture. Top with remaining pastry crust, crimp edges together, and flute rim. Cut several slits in top of pie to vent it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Place pie on a baking sheet, and bake for 30 minutes. Remove pie from oven and dot crust with bits of butter. Return to oven until crust is lightly browned, about 30 more minutes. Allow to rest for 20 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/546-spinach-and-brussels-sprouts-pie-with-hazelnut-pastry-crust"}