{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Rack of Lamb With with Green Peppercorns", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "lamb, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1208, "unsaturatedFatContent": "51 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "110 grams", "fiberContent": "5 grams", "proteinContent": "43 grams", "saturatedFatContent": "51 grams", "sodiumContent": "1195 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["2 untrimmed seven-to-eight-rib racks of lamb, about 2 1/2 pounds each", "Salt to taste, if desired", "Freshly ground pepper to taste", "10 small sprigs fresh thyme, broken into small pieces, or 1 teaspoon dried thyme leaves", "10 whole, unpeeled cloves of garlic", "7 tablespoons butter", "2 cups water", "2 egg whites", "1/4 cup finely chopped parsley", "2 tablespoons drained green peppercorns", "2 tablespoons strong Dijon mustard", "2 tablespoons fine fresh bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 or 525 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have the meat cutter hack away the chine bone of each rack. Take care that all scraps of meat and bone are reserved. Cut the chine bones into two-inch pieces and set aside. There is a top coating of fat on top of each rack. At one side of each rack there is a small, cartilage like half-moon-shaped shoulder blade between the meat and the top coating of fat. Have this removed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, make deep diamond-shaped scorings down to the bottom of the top layer of fat. Neatly trim the bottom of each rib to make them French style, which is to say neatly trimmed of all meat and fat. They should be trimmed about one inch from the bottom. Sprinkle the racks with salt and pepper and cover the French-style ends of the chops with aluminum foil to prevent burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the scraps of meat and bones over the bottom of a shallow roasting pan large enough to hold the racks in one layer. Scatter the thyme and garlic cloves over the scraps. Arrange the racks, fat side up, in the baking dish. Put two tablespoons of the butter on top of each rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the lamb in the oven and bake 20 minutes. Turn the racks and continue roasting about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the racks to a warm platter. Put the roasting pan on top of the stove and heat the pan liquids. Add the water. Let simmer 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, remove the garlic cloves and remove the outer coatings. Chop the garlic to a fine puree and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the whites until stiff. Add the parsley, green peppercorns and mustard. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the foil from the lamb racks. Smear half the beaten white mixture on top of each rack. Sprinkle each rack with an equal amount of the bread crumbs. Pat the crumbs lightly to make them adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining three tablespoons of butter in a small saucepan. Dribble the butter on top of the racks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the lamb to the oven and bake about five minutes or less until the top of lamb coating starts to brown. Place the lamb briefly under the broiler to give a nice brown glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the pan juices from the roasting pan into a saucepan. Add the reserved chopped garlic. Stir and reheat briefly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the lamb, slicing between each two ribs, and serve with pan juices."}], "link": "https://cooking.nytimes.com/recipes/5465-roast-rack-of-lamb-with-with-green-peppercorns"}