{"@context": "http://schema.org", "@type": "Recipe", "name": "Roger Vergé’s Zucchini and Tomato Casserole (Tian de Courgettes Et Tomates)", "description": "Craig Claiborne brought this recipe to The Times in a 1981 article about the late Roger Vergé, a founding father of nouvelle cuisine. This is an adaptation of Mr. Vergé's dish. It requires a little time, but it's a perfect way to celebrate summer's bounty.", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, side dish, tomato, zucchini, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 257, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "936 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["3 medium-sized red peppers, about 1/2 pound, optional", "6 medium-sized zucchini, about 1 3/4 pounds", "4 large red, ripe tomatoes, about 2 1/2 pounds", "1 large onion, about 1/2 pound", "1/3 cup plus 1/4 cup olive oil", "1/2 cup water", "1 tablespoon finely minced garlic", "Salt to taste, if desired", "Freshly ground pepper to taste", "1 teaspoon dried thyme or 4 sprigs fresh thyme broken into small pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If the peppers are to be used, preheat the broiler. Place the peppers under the broiler and roast until they are burnt on one side. Turn and roast on the other side. Continue turning until roasted all over, top and bottom. Put in a plastic bag to cool. Peel. Discard the stems and seeds. Cut the peppers into thin strips. There should be about three-quarters of a cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the ends of the zucchini. Using a swivel-bladed vegetable cutter, trim off the sides of each zucchini, leaving intervals of green to make a pattern. Cut the zucchini on the bias into quarter-inch slices. There should be about seven cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cores from the tomatoes. Cut each tomato slice about one-third inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the onion and cut it in half crosswise. Cut each half into very thin slices. There should be about two cups. Put the onion in a heavy saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one-third cup of oil and the water to the onion. Bring to the boil and cook over relatively high heat about 10 or 12 minutes. When ready, the onion will be nicely glazed and lightly browned. Do not burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the onion over the bottom of an oval or rectangular baking dish (a dish that measures about 13 1/2 by 8 by 2 inches is ideal). Sprinkle the garlic and pepper strips over the onion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a layer of tomatoes, letting them lean at an angle against the sides of the baking dish. Arrange a layer of zucchini against the tomatoes. Continue making layers until all the tomatoes and zucchini are used. Sprinkle with salt and pepper to taste and the thyme. Dribble the remaining one-quarter cup of oil over all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 30 minutes. Increase the oven heat to 475 degrees and continue baking about 45 minutes. At this point the top of the vegetables will be quite dark. Press the vegetables down with a flat pancake turner. Return to the oven and continue baking 15 minutes. Serve hot or cold."}], "link": "https://cooking.nytimes.com/recipes/5466-roger-verges-zucchini-and-tomato-casserole-tian-de-courgettes-et-tomates"}