{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Squash With Cornbread, Sage and Chestnut Stuffing", "description": "", "author": {"@type": "Person", "name": "Denise Landis"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chestnut, cornbread, squash, fall, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["6 round medium-size squashes", "Salt and freshly ground black pepper", "5 cups vegetable stock", "4 tablespoons extra virgin olive oil", "1 cup diced yellow onion", "1/2 cup finely diced celery", "2 1/2 cups finely diced carrot", "6 cloves garlic, peeled and minced", "1/3 teaspoon celery seed", "1/2 teaspoon caraway seed", "1/3 teaspoon nutmeg", "2 tablespoons dry sherry", "4 cups toasted crumbled corn bread", "1 cup shelled roasted chestnuts, crumbled into large pieces", "2 tablespoons minced fresh sage", "2 leeks, white and light green parts only, in 1/2-inch-thick slices", "1 cup chopped portobello mushrooms", "1/2 pound smoked tempeh or tofu, in cubes", "1/2 teaspoon dried thyme", "1 teaspoon minced fresh rosemary", "1/4 teaspoon ground juniper berries", "2 bay leaves", "1 cup apple cider", "1 1/2 cups finely diced parsnips", "2 cups diced butternut squash", "2 tablespoons Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Slice 1 1/2 inches off tops of squashes, and set them aside. Scoop out, and discard seeds and pith. Sprinkle cavities with salt and pepper to taste. Place squashes cut sides down in a large baking dish. Pour in 2 cups stock and enough water for liquid to be 1/3 to 1/2 inch deep. Cover tightly with foil. On a baking sheet with rim, place squash tops cut side down, and add just enough water to cover bottom of pan. Bake until squashes are slightly soft when squeezed and flesh is fork-tender, 30 to 40 minutes. Tops can be baked as long or until very lightly browned. Remove from heat, and allow to cool. (May be covered, and refrigerated up to 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Reheat squashes and tops for 10 minutes. Place squashes on plate, fill with stuffing and top with ragout. Lean tops against squashes and serve."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For stuffing:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, heat 2 tablespoons oil. Add onion, celery, 1 1/2 cups carrots and 2 cloves garlic, and sauté until lightly browned. Add celery seed, caraway seed and nutmeg, and sauté for 1 minute. Add sherry and 1 cup stock, stirring and scraping pan. Simmer until reduced by one-third, then remove from heat. In a large bowl, combine corn bread, chestnuts and sage. Add carrot mixture, and mix well. Season with salt and pepper to taste. Set aside, and keep warm. (May be covered, and refrigerated up to 24 hours; gently reheat before using.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For ragout:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In deep skillet over medium heat, add remaining 2 tablespoons olive oil. Add leeks and remaining 4 cloves garlic, and sauté until softened. Add mushrooms and tempeh, and sauté until mushrooms are softened. Add thyme, rosemary, juniper and bay leaves, and sauté 1 minute. Stir in apple cider, scraping bottom of pan. Add parsnips, butternut squash, remaining 1 1/2 cups carrots and remaining 2 cups stock. Bring to a boil, then reduce heat to low. Cover, and simmer until vegetables are just fork-tender, about 30 minutes. Stir in mustard, and adjust salt and pepper to taste."}]}]}