{"@context": "http://schema.org", "@type": "Recipe", "name": "30-Vegetable Soup", "description": "", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "appetizer, main course, side dish, vegan, vegetarian, vegetables, white beans, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["1 pound small dried white beans (cannellini or Great Northern)", "8 cups water", "2 tablespoons fresh sage, or use 2 teaspoons each in dried form", "2 tablespoons fresh rosemary, or use 2 teaspoons in dried form", "2 tablespoons fresh thyme, or use 2 teaspoons in dried form", "2 tablespoons fresh basil, or use 2 teaspoons in dried form", "2 tablespoons fresh parsley, or use 2 teaspoons in dried form", "6 plum tomatoes, stems removed and cut in quarters", "2 tablespoons minced garlic", "1 small yellow onion, diced", "1 small white onion, diced", "1 small red onion, diced", "5 scallions, chopped", "1 large carrot, sliced", "2 ribs celery, sliced", "1 small celery root, diced", "1 bulb fennel, cored and sliced", "1 zucchini, sliced in half and cut across in half-moons", "1 yellow squash, cut in half lengthwise and then across in half-moons", "1 Yukon gold potato, peeled and diced", "1 Idaho potato, peeled and diced", "1 cup green beans, cut in small pieces", "1 cup green cabbage, cut in slivers", "1 cup Chinese cabbage, cut in slivers", "1 cup black cabbage (cavalo nero) cut in slivers (optional)", "1/2 butternut squash, peeled and diced", "1 bunch broccoli rabe, trimmed and cut in small pieces", "1 cup shelled or frozen peas", "1/2 bunch asparagus, trimmed and cut in 1-inch pieces", "1 large artichoke, choke and tough leaves discarded, heart and tender, leaves slivered", "1 bunch kale, cleaned, trimmed and chopped", "2 leeks, washed well and sliced", "1 turnip, peeled and diced", "1/2 head broccoli, cut in flowerettes", "2 cups washed spinach leaves, chopped", "2 cups washed swiss chard leaves, chopped", "1 cup washed red chard leaves, chopped", "Fine sea salt to taste", "Freshly ground black pepper to taste", "Red pepper flakes", "Extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the beans in a colander, and transfer to a large, nonreactive bowl. Cover with water by 2 inches, and let soak in a cool place overnight uncovered. Drain, and transfer to a 9- to-10-quart heavy pot. Add 8 cups of water and the fresh or dried herbs. Cook at a gentle boil for about 60 minutes, or until tender. Add the plum tomatoes, and continue cooking for 10 minutes. Remove from the heat, and cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the beans, tomatoes and all liquid in batches in a food processor. Return to the pot, and add all the vegetables except the spinach, Swiss chard and red chard. Season with salt and pepper, and bring to a simmer, stirring. Add small amounts of water just to cover the vegetables. Cook until all the vegetables are tender, about 20 minutes, adding more water if necessary. Add the spinach, Swiss chard and red chard. Cook for 1 to 2 more minutes, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt and pepper to taste, and red pepper to taste. Accompany with a cruet of olive oil for drizzling into the soup and, if desired, croutons."}], "link": "https://cooking.nytimes.com/recipes/5473-30-vegetable-soup"}