{"@context": "http://schema.org", "@type": "Recipe", "name": "Turducken", "description": "A well-prepared turducken is a marvelous treat, a free-form poultry terrine layered with flavorful stuffing and moistened with duck fat. When it's assembled, it looks like a turkey and it roasts like a turkey, but when you go to carve it, you can slice through it like a loaf of bread. In each slice you get a little bit of everything: white meat from the breast, dark meat from the legs, duck, carrots, bits of sausage, bread, herbs, juices and chicken, too.\n\nAlthough smoking turducken on my deck in Brooklyn was unlikely to happen, I would roast it in my oven. Turducken, it turns out, is not unlike preparing a turkey with stuffing, and not unlike cooking a rolled and tied butterflied leg of lamb. So that is just how I approached preparing it.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2016/11/18/dining/18COOKING-TURDUCKEN/18COOKING-TURDUCKEN-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "chicken, duck, turkey, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["1/2 pound pancetta, sliced 1/4-inch thick, then cut into 1/2-inch squares", "3/4 pound bulk sweet Italian sausage seasoned with fennel", "1 tablespoon olive oil", "1 cup chopped onions, plus 1 onion (halved) for pan", "1 cup chopped carrots, plus 2 carrots (halved crosswise) for pan", "1 1/2 cups chopped celery", "2 cloves garlic, smashed", "1 teaspoon fennel seed", "1 3- to 3 1/2-pound chicken, boned, giblets and wings reserved", "1 4- to 5-pound duck, boned, giblets and wings reserved", "Sea salt", "Freshly ground black pepper", "1/4 cup brandy", "3 tablespoons chopped fresh tarragon", "1 tablespoon chopped fresh thyme", "2 cups dry baguette in 1/2-inch cubes", "1 10- to 12-pound turkey, boned, wings and legs left intact"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before serving, cook pancetta in large sauté pan over low heat for 6 to 8 minutes, until fat is rendered and pancetta is browned. Drain on paper towels. Add sausage to pan in bite-size pieces, and cook sausage until no longer pink, breaking up into 1/2-inch pieces as you go. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off fat in pan. Add oil, along with chopped onion, carrot and celery, and garlic and fennel seed. Cook over medium heat for 2 minutes. Add all non-bony parts of chicken and duck giblets, and season with salt and pepper. Cook until giblets are almost cooked through, about 5 minutes, turning once partway through. Raise heat to high and pour in brandy. Reduce until almost gone, then shut off heat and stir in tarragon and thyme. Remove giblets from pan and chop into 1/2-inch pieces. In a large bowl, fold together pancetta, sausage, vegetables, giblets and bread cubes. Taste and adjust seasoning. Let cool and chill overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next morning, lay turkey out on counter, skin side down. Season with salt and pepper. Spread 1/3 of stuffing over its surface, mostly in empty center cavity between breast meat halves. Trim about 2/3 of fat from duck, leaving some fat over breast sections. Butterfly duck drumsticks. Lay duck pieces on top of turkey in their corresponding parts, fitting duck leg meat in cavity left by turkey thigh bones. Season with salt and pepper. Spread 1/3 of stuffing on duck. Lay chicken on top, again skin side down and corresponding in arrangement to turkey. Season with salt and pepper, and spread with remaining stuffing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Thread a carpet or upholstery needle with 2 feet of thin twine. Sew turkey legs back into original shape, if necessary, with duck and chicken meat and stuffing inside the thighs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rethread the needle with 3 feet of twine. Beginning at tail end, begin pulling sides of turkey together, reforming its body, stitching every inch or so. Have someone hold bird while you stitch. Do not sew turducken together too tightly or it will split open when cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn bird over; if necessary, sew together any parts of skin that may have ripped. With a 4-foot piece of twine, truss it as you would a chicken, wrapping the twine around tips of drumsticks (or loaf end), then crisscrossing it and going down around base of drumsticks. Crisscross twine under bird, then bring it up sides and crisscross it on top, wrapping it down and around wings, crisscrossing it on back side, and up again, tying it over breast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season roasting pan with salt and pepper. Place turducken in pan breast side up, and season it. Place chicken and duck wings, along with as many halved onions or carrots fit, in pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pan with aluminum foil and bake. After 2 hours, begin checking bird every 30 minutes or so, and basting when juices form. Turn pan every now and then so it cooks evenly. When a thermometer inserted in turducken reads 130 degrees (probably about 4 or 5 hours), remove aluminum foil and turn up heat to 375 degrees. Baste every 15 minutes or so, until turducken reaches 165 degrees at its thickest point. Remove from oven and let cool for 10 minutes or so. With sturdy spatulas, lift onto platter. Cover turducken with foil, and let sit another 15 to 20 minutes. Meanwhile, strain pan juices and spoon off fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a bread knife or carving knife, slice turducken like a loaf of bread. Serve, passing cooking juices."}], "link": "https://cooking.nytimes.com/recipes/548-turducken"}