{"@context": "http://schema.org", "@type": "Recipe", "name": "Stewed Lamb Shanks With White Beans And Rosemary", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "great northern beans, lamb shanks, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 997, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "6 grams", "proteinContent": "82 grams", "saturatedFatContent": "25 grams", "sodiumContent": "1818 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["8 meaty lamb shanks, about 1 pound each (your butcher should saw off most of the exposed bone)", "4 teaspoons kosher salt, plus more to taste", "Freshly ground pepper to taste", "2 teaspoons olive oil", "5 large cloves garlic, peeled and minced", "1 large onion, peeled and diced", "4 medium carrots, peeled and diced", "3 celery stalks, peeled and diced", "1 cup dry red wine", "1 28-ounce can whole plum tomatoes packed in tomato puree", "1 pound dried Great Northern beans, soaked in water overnight, drained", "8 cups chicken broth, homemade or low-sodium canned", "3 sprigs fresh rosemary", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the shanks with 1 teaspoon of the salt and freshly ground pepper. Heat the olive oil in a heavy, large skillet over medium-high heat. Add as many shanks as will fit without crowding. Brown the shanks well on all sides, about 10 minutes per batch. Set the browned shanks aside and repeat with the remaining shanks, pouring off the fat between batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic, onion, carrots and celery in the skillet and saute until softened, about 10 minutes. Pour in the wine and cook for about 2 minutes, scraping the bottom of the skillet with a wooden spoon to loosen any browned bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the vegetable and wine mixture to a large stockpot. Add the tomatoes and use the back of a spoon to break them into small chunks. Add the remaining ingredients, including the shanks. Bring to a boil. Reduce heat and simmer, skimming as necessary, until the lamb and beans are very tender, about 2 hours. If the lamb is done before the beans, take out the shanks and cover with foil to keep them warm until the beans are done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim off as much fat from the top of the liquid as possible. Use tongs to remove the shanks from the liquid, placing 1 shank on each of 8 plates. Season the bean mixture with additional salt if needed. Discard rosemary and bay leaves. Using a slotted spoon, arrange some of the beans and vegetables around each shank. Spoon some of the liquid over and around the shank and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/5487-stewed-lamb-shanks-with-white-beans-and-rosemary"}