{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Napoleons With Sugared Pecans And Caramel Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, pecan, phyllo, pumpkin purée", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 730, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "20 grams", "sodiumContent": "465 milligrams", "sugarContent": "56 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup sugar", "1/8 teaspoon kosher salt", "1 egg white", "1 tablespoon water", "Butter for greasing the baking sheet", "1 1/2 cups pecan halves", "1/2 cup pecans", "1/4 cup sugar", "6 sheets phyllo dough", "2 tablespoons unsalted butter, melted", "1 cup sugar", "6 tablespoons water", "1 cup heavy cream", "2 1/2 cups pumpkin puree", "2 tablespoons unsalted butter", "1/2 cup packed brown sugar", "1 teaspoon kosher salt", "1/2 teaspoon ground cinnamon", "2 teaspoons vanilla extract", "2 tablespoons heavy cream", "8 ounces mascarpone"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pecans, preheat the oven to 225 degrees. Mix the sugar and salt in a bowl. In another bowl, whisk the egg white and water together until frothy. Toss the pecans in the egg-white mixture to coat well. Drain, then toss in the sugar mixture. Grease a baking sheet and spread the pecans on it. Bake until dry, about 45 minutes, stirring every 15 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, preheat the oven to 325 degrees. Line 2 baking sheets with parchment paper and set aside. Pulse the pecans and sugar together in a food processor until ground. Lay 1 sheet of phyllo dough out on a work surface, keeping the rest covered with a damp cloth until ready to use. Brush with butter and sprinkle with about 3 tablespoons of the ground pecan mixture. Top with another sheet of phyllo, brush with butter and sprinkle with pecans. Top with a third sheet of phyllo and brush with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the phyllo layers to make a 16-by-12-inch rectangle. Cut into 16 4-by-3-inch rectangles. Divide between the baking sheets and bake until golden brown, about 5 minutes. Repeat with the remaining phyllo, butter and pecan mixture. Set the pastries aside; you'll have extra."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, place the sugar in a medium saucepan and stir in the water. Use a pastry brush dipped in water to wash down any sugar crystals on the side of the pan. Place over medium heat and cook without stirring until mixture turns a deep caramel color. Remove from heat and carefully add the cream. Return the pan to the heat and stir until all the caramel is dissolved. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, combine the pumpkin, butter, brown sugar, salt, cinnamon, vanilla extract and cream in a medium saucepan and place over medium heat. Cook, stirring occasionally, until smooth and hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The napoleons can be prepared ahead up to this point. Reheat the caramel sauce and the pumpkin filling. To assemble, spread the mascarpone over 8 of the pastries, using about 2 tablespoons for each. Top with another pastry and spread with about 1/4 cup of the pumpkin mixture. Top with another pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat 8 plates with caramel sauce. Top with the napoleons and scatter the sugared pecans around them. Serve immediately."}]}