{"@context": "http://schema.org", "@type": "Recipe", "name": "Sables", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT45M", "recipeYield": "32 cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, goat butter, lemon, vegetarian", "aggregateRating": null, "recipeIngredient": ["2 egg yolks", "3 ounces unsalted goat butter", "Finely grated rind of 1 large, cold, firm lemon", "1/4 cup granulated sugar", "1 cup plus 2 tablespoons sifted unbleached flour", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two flat or inverted baking sheets with parchment paper. Set aside. Place egg yolks in a small pan, and cover with water. Bring to a simmer, and let cook for 2 minutes; then, remove from heat and let stand for a minute. Remove yolks with a slotted spoon, and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, combine yolks and butter. Process for 10 seconds, scraping sides if necessary, until smooth. Add lemon rind, sugar, flour and salt, and process for 15 to 20 seconds, until ingredients hold together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a floured pastry cloth or lightly floured counter, and with floured hands, form into a firm square shape. Use a floured rolling pin to roll out to a 10-inch square (about 1/8 inch thick). To straighten sides, press a ruler or a long metal spatula against them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a long knife, cut square into four strips, then in the opposite direction into fourths, making 16 squares. Cut each square on an angle, making 32 triangles. Using a thin metal spatula, transfer triangles to baking sheets, spacing them apart. Dip a fork in flour, and with the underside of prongs, mark a ridged design on top of each cookie. Let stand for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven racks in upper-third and lower-third positions. Preheat oven to 350 degrees. Bake cookies, one sheet on each rack, for about 15 minutes, until only sandy colored. Change racks, and reverse sheets front to back once during baking to ensure even browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove sheets from oven. Slide parchment off sheets, and let cookies stand until almost cool. With a spatula, turn them over, and let stand until completely cool. Store in an airtight container."}], "link": "https://cooking.nytimes.com/recipes/5508-sables"}