{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Sundae With Peanut Sauce and Peanut Brittle", "description": "This unusual recipe came to The Times in 2000 from Zarela Martinez, the owner of Zarela, a landmark Mexican restaurant in New York that closed in 2011. The base here is a peanut ice milk, which is covered with torito, a rich, creamy peanut sauce made with cachaça, and individual sesame-peanut candies. The candies and ice milk can be made ahead of time. ", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/04/28/dining/peanutsundae-still/peanutsundae-still-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, side dish, peanut, peanut butter, summer", "aggregateRating": null, "recipeIngredient": ["1/3 cup sugar", "3 cups skim milk", "3/4 cup creamy peanut butter", "1 cup raw peanuts", "1 cup sesame seeds", "4 piloncillo cones (Mexican brown sugar), about 2 pounds total (see note)", "2 12-ounce cans evaporated milk", "1 14-ounce can condensed milk", "1 cup sugar-cane liquor (see note)", "1/2 cup creamy peanut butter", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make peanut ice, in a small saucepan over medium heat, combine sugar with 1/3 cup water and bring to a boil, stirring occasionally. Simmer until sugar dissolves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or food processor, combine syrup, skim milk and peanut butter, and process until smooth. Transfer mixture to an ice cream maker, and freeze according to manufacturer's instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make candies, in a heavy skillet over medium heat, toast peanuts, turning them so they do not burn, for about 5 minutes. Immediately transfer to food processor, or spread them out on a large baking sheet. If using a food processor, pulse gently until nuts are just broken up, about 1 minute. Otherwise, use a rolling pin to crush nuts on baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In same skillet over medium heat, toast sesame seeds, stirring, for about 3 minutes. Add to peanuts in food processor or baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy saucepan over medium heat, combine the piloncillo sugar with 1 quart water. Bring mixture to a boil, stirring frequently until the piloncillo melts. Continue to cook until syrup reaches hard crack stage (285 degrees on a candy thermometer), about 1 1/2 hours. Stir in peanuts and sesame seeds. Pour mixture onto a baking sheet lined with parchment or waxed paper. Cool. Place candy in a heavy duty plastic bag, and use a rolling pin to crush it into pea-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make peanut sauce, in a blender or food processor, combine all ingredients and process until smooth. Transfer to a tightly covered bottle, and store in refrigerator for up to one month."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble sundaes, pour a little bit of peanut sauce into a tall glass. Place two scoops of peanut ice on top. Sprinkle with a little crushed candy and serve."}], "link": "https://cooking.nytimes.com/recipes/5554-peanut-sundae-with-peanut-sauce-and-peanut-brittle"}