{"@context": "http://schema.org", "@type": "Recipe", "name": "Cherry Tart", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, almonds, cherries, dessert, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 514, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "11 grams", "sodiumContent": "102 milligrams", "sugarContent": "44 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup all-purpose flour", "1 tablespoon sugar", "1/4 teaspoon salt", "1/4 teaspoon grated lemon peel", "8 tablespoons (1 stick) unsalted butter", "1 tablespoon water", "1/2 teaspoon vanilla extract", "9 tablespoons sugar", "1 cup red Bordeaux wine", "2 tablespoons fresh lemon juice", "3 cups fresh Bing cherries, rinsed, stemmed, pitted", "1 large egg", "1 egg yolk", "3/4 cup sugar", "1/2 cup all-purpose flour", "1 cup whole milk", "3 tablespoons butter", "2 tablespoons Cognac or kirsch", "2 teaspoons vanilla extract", "1/4 teaspoon almond extract", "1/2 cup whole blanched almonds, finely ground in food processor or blender"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry shell. Mix the flour, sugar, salt and lemon peel in a bowl or food processor. Cut the butter into 1/2-inch slices and work them into the flour mixture with your fingers, or use the pulse motion of your processor, until the pastry is mostly cornmeal-size pieces and the mixture begins to hold together. Combine the water and vanilla and work them into the mixture just until the pastry is well blended and will hold together if you press it. Press the dough evenly over the bottom and up the sides of a 9-inch tart pan. Wrap in foil and freeze for 30 minutes or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Lightly press foil to line the bottom and sides of the pastry shell and fill with pie weights or dried beans. Bake for about 25 minutes, or until the pastry edges are golden brown. Carefully lift off the weights and foil. Bake the pastry 5 minutes longer. Cool the pan on a wire rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pastry bakes, make the cherry filling. Combine 6 tablespoons of the sugar, the wine and the lemon juice in a medium-size saucepan and stir until the sugar is dissolved. Heat to boiling. Drop in the cherries and simmer for 5 minutes, or until they are just tender. Cool in the syrup for 30 minutes. Then drain, saving the syrup for another use. (It can be kept covered in the refrigerator for up to 2 weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the almond custard. Whisk the egg and egg yolk in a mixing bowl until blended and gradually whisk in the sugar until the mixture is pale yellow. Whisk in the flour. Heat the milk to boiling in a small saucepan and whisk it into the egg mixture in a thin stream. Whisk until smooth. Pour into a medium-size saucepan and cook over medium heat, whisking slowly, until the mixture coagulates into lumps. Whisk vigorously until the custard is smooth. Lower the heat and beat with a wooden spoon 2 to 3 minutes longer to cook the flour thoroughly. Remove from the heat; beat in the butter, Cognac and extracts. Fold in the almonds and the drained cherries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Spread the cherry filling in the tart shell. Sprinkle the remaining 3 tablespoons of sugar over the tart and broil 2 to 3 minutes to caramelize the sugar lightly."}], "link": "https://cooking.nytimes.com/recipes/5562-cherry-tart"}