{"@context": "http://schema.org", "@type": "Recipe", "name": "Auberge de la Madone's Beef Stew With Wild Mushrooms and Orange", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef stew meat, wild mushrooms, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 640, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "58 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1362 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 1/2 pounds stewing beef, preferably a combination of beef round and beef chuck, cut into very large pieces, about 4 ounces each", "4 carrots, peeled and cut into rounds", "3 medium onions, peeled and coarsely chopped", "2 cloves garlic, peeled", "1 sprig fresh parsley", "1 rib celery, thickly sliced", "3 imported bay leaves", "1 tablespoon fresh thyme or 1 teaspoonteaspoon dried", "1/4 cup marc de Provence or Cognac", "5 1/2 cups sturdy red wine, like Cotes de Provence", "5 tablespoons extra-virgin olive oil", "1 teaspoon whole black peppercorns", "3 whole cloves", "1 tablespoon tomato paste", "2 tablespoons unsalted butter", "1 pound fresh wild cepe mushrooms or cultivated mushrooms, trimmed", "Kosher salt and freshly ground pepper to taste", "Grated zest and juice of 1 orange"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before serving the stew, combine the meat, carrots, onions, garlic, parsley, celery, bay leaves, thyme, marc, 3 1/2 cups of red wine and 1 tablespoon of olive oil in a large nonreactive bowl. Tie the peppercorns and cloves in a piece of cheesecloth, add to the bowl and toss the ingredients well. Cover and refrigerate for 24 hours, stirring once or twice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let meat and vegetables return to room temperature. With a slotted spoon, remove the meat from the marinade. Drain well and pat dry on paper towels. Set aside. Strain the liquid into a large nonreactive heatproof casserole and add the cheesecloth bag. Set the vegetables aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 cups of wine to the pot and bring the liquid to a boil. Boil for 5 minutes to reduce slightly. Remove from the heat, stir in the tomato paste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt 1 tablespoon of butter in 2 tablespoons of the olive oil over high heat. When hot, add the beef in batches, sauteing until browned all over, about 5 minutes per batch. Transfer when browned to the liquid in the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining butter and olive oil to the skillet. Add the reserved vegetables and saute until browned, about 7 minutes. Transfer the vegetables to the casserole. Add the mushrooms to the skillet and saute until lightly browned, about 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the liquid in the casserole to a simmer over medium-low heat. Reduce the heat to very low and simmer, skimming occasionally, until the meat is very tender, about 3 1/2 to 4 hours. Stir in salt and pepper to taste, the mushrooms and the orange zest and juice. Discard the cheesecloth bag with the peppercorns and cloves and the bay leaves. (The recipe can be prepared 2 to 3 days ahead and refrigerated. Reheat before serving.) Serve with potatoes, rice or pasta."}], "link": "https://cooking.nytimes.com/recipes/5571-auberge-de-la-madones-beef-stew-with-wild-mushrooms-and-orange"}