{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach-and-Green-Tomato Souffle With Ricotta Cheese and Smithfield Ham", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, green tomato, peach, smoked ham", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 235, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "8 grams", "sodiumContent": "456 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 ripe white-fleshed peaches, pitted", "2 large green tomatoes", "6 tablespoons unsalted butter", "6 tablespoons flour", "1/2 cup ricotta cheese", "6 large egg yolks", "1 1/4 teaspoons kosher salt", "1/4 teaspoon freshly ground white pepper", "8 large egg whites", "2 ounces thinly sliced Smithfield ham, cut into 1/2-inch strips", "1 ripe peach, peeled, pitted and finely diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the 3 peaches in a blender and pass the mixture through a mesh strainer, food mill or juice extractor; you should have 1 cup of juice. Repeat with the tomatoes to produce 1 cup of juice. Discard all the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a large saucepan set over medium-low heat and whisk in the flour. Cook, stirring, for 2 minutes. Slowly add the peach and tomato juices, stirring until smooth and thickened. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the ricotta and yolks until smooth. Stir 2 heaping tablespoons of the hot juice mixture into the yolks and ricotta, then slowly stir the entire yolk-ricotta mixture back into the pan. Place the pan over low heat and cook, stirring, 1 minute. Stir in 1 teaspoon of salt and 1/4 teaspoon of pepper, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees, and butter and flour an 8-cup souffle dish. Whip together the egg whites and remaining 1/4 teaspoon of salt until they form stiff but still moist peaks. With a wooden spoon, stir about 1/2cup of the whites into the sauce, then gently fold the sauce into the whites left in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 1/3 of the mixture into the souffle dish. Cover with a layer of the ham. Repeat with another 1/3 of the mixture and then another layer of the ham. Cover with the remaining mixture and bake, uncovered, until the souffle is puffy and well browned, from 35 to about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and serve immediately, spooned out onto individual plates and garnished with the diced peach."}]}