{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Onion and Lentil Pilaf", "description": "Back in 2003, Nigella Lawson brought to The Times a recipe for <a href=\"https://cooking.nytimes.com/recipes/5593-chicken-and-apricot-masala\">chicken and apricot masala,</a> and with it, she paired this dish, a caramelized onion and lentil pilaf. “The sweet smokiness of scorched onion and the depth of spicing you get from cumin, coriander and cloves more than balances out the rich texture of the rice studded with lentils and mustard seeds,” she wrote. “This dish is robust and earthy ballast. I might even have it by itself for supper, with no more than a salad of diced cucumber, dressed with yogurt and dried mint, on the side.” Perhaps you should do the same.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": null, "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "basmati rice, french green lentils, onion, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 300, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "214 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons ghee (clarified butter) or vegetable oil", "1 onion, peeled, halved and thinly sliced into half-moons", "1/2 teaspoon turmeric", "1 teaspoon ground cumin", "1 teaspoon ground coriander", "2 cloves", "1/2 teaspoon mustard seeds", "4 dried curry leaves (optional)", "2 teaspoons salt", "Black pepper", "1 cup French green lentils", "1 cup basmati rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy-based saucepan, heat ghee over medium heat. Add onion slices, and sauté until softened and deep golden brown. Remove half the onions and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium-low and add turmeric, cumin, coriander, cloves, mustard seeds and curry leaves. Add salt, and season with black pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine lentils and rice in a fine-meshed sieve, and rinse well with cold water. Drain, then add to pan. Add 4 cups water, raise heat, and bring to a boil. Cover, reduce heat to very low, and cook for 15 to 20 minutes. Water should be completely absorbed; if not, remove pan from heat, remove lid and cover pan with a kitchen towel, then replace lid and allow to stand for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, fluff pilaf with a fork, and transfer to a serving bowl. Garnish with reserved onions."}]}