{"@context": "http://schema.org", "@type": "Recipe", "name": "Fané", "description": "The fané (“faded” in French) is a truly lost dessert. The author Gail Monaghan had visited the Comtesse Cristina de Vogüé at her French chateau, where, on New Year’s Eve, a decadent confection of ice cream, whipped cream, white nougat, meringue and chocolate shavings was served. The countess described the recipe to Monaghan, who set about recreating it in New York. Two years later, she e-mailed her hostess to make sure she had the recipe right. The countess, however, had no recollection whatsoever of “this special cake.”", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Fane/Fane-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "Serves 10 to 12", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 721, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "29 grams", "sodiumContent": "153 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large egg whites, at room temperature", "Pinch of salt", "1/4 teaspoon cream of tartar", "3/4 cup plus 5 tablespoons superfine sugar", "Cooking-oil spray", "3 pints vanilla ice cream, softened", "5 cups heavy cream, chilled", "1 1/2 teaspoons vanilla", "12 ounces hard white nougat, crushed into small pieces", "3/4 cup (about 3 ounces) shaved bittersweet chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before, prepare the meringue: preheat oven to 200 degrees. Line a baking sheet with parchment paper. Using an electric mixer fitted with a whisk attachment, beat the egg whites, salt and cream of tartar on low speed. When soft peaks form, increase the speed and sprinkle in 3/4 cup of the sugar until the meringue holds stiff peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread meringue into a rough 1-inch layer on baking sheet. Bake until slightly sticky when pierced with a knife, about 2 hours. Turn off oven and leave meringue inside for a few hours to dry completely. Break into 1- to 2-inch chunks. Store in an airtight container for up to one week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Four hours before serving, assemble the fané: spray the inside of a 4-quart metal bowl with cooking spray and lay a large piece of plastic wrap against the inside of the bowl. Spread the ice cream evenly over the entire inside of bowl and plastic wrap. Cover and freeze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Two hours before serving, whip the cream. When it begins to thicken, add remaining sugar and the vanilla, then beat to soft peaks. Set aside 2 cups of the whipped cream and refrigerate. Fold nougat into remaining whipped cream, then add to the ice-cream-lined bowl. Cover and freeze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, rewhip the reserved whipped cream to firm peaks. Turn the bowl out onto a platter, separating the plastic wrap from the bowl. Remove the plastic wrap. Cover the ice cream with whipped cream, followed by chunks of meringue. Sprinkle with chocolate shavings. Let soften a bit at the table before cutting into wedges."}], "link": "https://cooking.nytimes.com/recipes/5699-fane"}