{"@context": "http://schema.org", "@type": "Recipe", "name": "Neapolitan Cake", "description": "Here is an excellent project recipe that Christine Muhlke, then an editor and columnist at The New York Times Magazine, brought to us in a 2007 profile of the cookbook writer Gail Monaghan, who adapted it from a cookbook written by the Vicomte de Mauduit in 1933. It is infinitely more chic and cosmopolitan than most Neapolitan cakes, with no cartoon hue or bulk.", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Neapolitan-Cake/Neapolitan-Cake-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "all-purpose flour, almonds, fruit jam, dessert, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 824, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "115 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "16 grams", "sodiumContent": "516 milligrams", "sugarContent": "63 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups sugar", "1 1/2 cups jam, raspberry, apricot, strawberry or peach", "Half of a vanilla bean, split lengthwise, seeds scraped", "Salt", "1/2 tablespoon lemon juice", "1 cup whole blanched almonds, toasted (see note)", "3 cups flour, sifted", "1 cup unsalted butter, at room temperature", "Finely grated zest of 1 lemon", "Finely grated zest of 1 orange", "4 large egg yolks, at room temperature", "1/2 teaspoon almond extract", "1 teaspoon orange-flower water", "1/4 cup sliced almonds, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1/4 cup of the sugar in a small saucepan. Cook over high heat, without stirring, until all the sugar turns caramel. Tilt pan to distribute caramel. Lower the heat and carefully whisk in the jam, the scraped vanilla bean and seeds, 1 tablespoon of water, a pinch of salt and the lemon juice. (The caramel will bubble violently.) Simmer, stirring, until the caramel dissolves into the jam. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulverize the whole almonds with 2 tablespoons of the flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, cream the butter, remaining sugar, 1/4 teaspoon salt and the zests until light and fluffy, about 5 minutes. Scrape down the bowl with a rubber spatula. Mix in the pulverized almonds until combined. Beat in the egg yolks, one at a time, and then add the almond extract and orange-flower water. Mix in the remaining flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into six equal balls. Place each ball between two sheets of plastic wrap and press into an 8-inch circle, using the inside of a pie pan as a guide. Chill the dough rounds in the refrigerator for 2 hours or freeze for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Remove plastic wrap, place a dough round on a parchment-lined baking sheet and bake until golden, about 15 minutes. Cool completely on a wire rack. Repeat with remaining rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a round in the center of a serving plate. Spread with 3 to 4 tablespoons of jam to just before the edge. Continue to layer the rounds, spreading jam between each. Spread a thin layer of jam over the top and cover with sliced almonds. The cake can be served immediately, but tastes even better, and is easier to cut, if tightly wrapped and served 1 or 2 days later."}], "link": "https://cooking.nytimes.com/recipes/5700-neapolitan-cake"}