{"@context": "http://schema.org", "@type": "Recipe", "name": "Prunes in a Pitcher", "description": "Gail Monaghan’s 2007 book “Lost Desserts” delved into the histories of some delectable dishes. This one goes back to the 1800s. Prunes in a pitcher, or pruneaux au pichet, were made by Fernand Point for the Aga Khan III and served to him in a rare Persian vase that Khan had given the legendary French chef. (However, the fact that the prunes are soaked for two days in port and Bordeaux doesn’t quite track with the Islamic part, Monaghan points out.)", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT20M", "recipeYield": "Serves 8 to 10", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, prune, wine", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 464, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "8 grams", "sodiumContent": "440 milligrams", "sugarContent": "61 grams", "transFatContent": null}, "recipeIngredient": ["40 large pitted prunes, preferably sulfured", "2 cups ruby port", "2 cups light red wine, such as Bordeaux", "2 cups sugar", "Half of a vanilla bean, split lengthwise, seeds scraped", "Salt", "1 1/2 cups cold heavy cream or vanilla ice cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 2 days before serving, place the prunes and port in a glass or ceramic container. Cover and let soak at room temperature for at least 24 hours or longer if possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the prunes and their soaking liquid in a non-reactive saucepan. Add red wine, sugar, vanilla bean and seeds and a pinch of salt. Bring to a boil over high heat, and then simmer until the prunes are soft and a few start to fall apart, about 15 minutes. Let cool. Refrigerate covered for at least 24 hours or up to 2 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a few prunes in individual cups and cover with a little heavy cream or vanilla ice cream. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/5701-prunes-in-a-pitcher"}