{"@context": "http://schema.org", "@type": "Recipe", "name": "Mozartbombe (Chocolate Cherry Bombe)", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "Four to six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, semisweet chocolate, sour cherry", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 651, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "26 grams", "sodiumContent": "124 milligrams", "sugarContent": "34 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons melted butter, plus additional for greasing dish", "1 tablespoon bread crumbs", "3 eggs", "1/4 cup sugar", "1 teaspoon vanilla extract", "1/8 teaspoon salt", "1 teaspoon grated lemon zest", "1/2 cup plus 1 tablespoon cake flour", "1 24-ounce jar sour cherries in light syrup, drained, syrup reserved", "1 teaspoon cornstarch", "2 tablespoons rum or Cognac", "1 1/2 cups heavy cream", "1/2 cup heavy cream", "5 ounces semisweet chocolate, chopped", "1/2 cup sliced almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake, preheat oven to 375 degrees. Butter a 6-cup bombe mold or metal bowl and coat it with the bread crumbs. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the eggs, sugar, vanilla, salt and lemon zest in a double boiler or in a metal bowl over hot water and whisk constantly until light and creamy. Remove from heat and continue whisking until cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in the flour and gently stir in the butter. Scrape the batter into the prepared mold and bake until a toothpick inserted in the center comes out clean, about 25 minutes. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, coarsely chop the cherries. In a small bowl, stir together the cornstarch and 2 tablespoons of the cherry syrup. Place the remaining syrup in a saucepan and bring to a boil. Reduce by half, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cornstarch mixture and boil 1 minute more. Stir in the rum and cherries. Let cool completely. Whip the cream to stiff peaks, setting aside 1/2 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, unmold the cake and use a serrated knife to cut it into 5 horizontal layers. Place the small cake layer with the rounded side back into the mold. Spoon some of the cherries and syrup over the cake and spread with some of the whipped cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue putting the cake back together, filling with the cherry mixture and whipped cream between each layer. Refrigerate for at least 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the glaze, bring the cream to a boil, remove from heat, add the chocolate and stir until melted. Cut out a round piece of heavy cardboard to fit the diameter of the cake. Dip the mold into hot water and invert the bombe onto the cardboard. Use the reserved whipped cream to spread a very thin layer over the outside of the bombe. Place in the freezer just until the cream is quite firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bombe on a rack and ladle the chocolate glaze over it so that it's well covered. Place the bombe, with the cardboard, on a serving plate and use the sliced almonds to make a 2-inch border along the bottom of the bombe, hiding the cardboard. Refrigerate until ready to serve."}]}