{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Striped Bass With Fennel And Tomatoes In a Roasting Bag", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fennel, striped bass, whole fish, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 583, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "83 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1598 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 4-pound striped bass (see note), gutted, scaled and gills and fins removed", "1 medium fennel bulb", "3/4 cup dry white wine", "2 teaspoons coriander seeds", "2 tablespoons extra-virgin olive oil", "Kosher salt and freshly ground pepper to taste", "4 tomatoes, peeled, seeded and cut into 1/2-inch chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Scrape off any scales adhering to the fish and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the feathery green fronds off the fennel and reserve. Cut off the stalks at the top of the bulb and discard. Use a vegetable peeler to remove any rough, stringy fiber from the outside of the bulb and then cut the fennel into 3 wedges. Place in a non-aluminum pan with the wine, coriander seeds, olive oil and salt and pepper. Simmer over low heat, covered, until the wedges soften but still retain some crunch, about 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, rinse and dry the fish, season it with salt and pepper and slide it into a roasting bag. (If the fish is too large you can cut off its head, but avoid this if possible as a headless fish makes a much less dramatic presentation.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the fennel, its cooking liquid and the reserved fennel fronds in the bag with the fish. Season the tomatoes with salt and pepper and add them to the bag. Push down on the bag to squeeze out excess air and seal with string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place the bag in an oval baking dish or shallow pan (it's easiest to bake the fish in something you can take straight to the table) and bake for about 15 minutes per inch of thickness (about 30 minutes for a 2-inch-thick fish)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut the bag open with a knife or scissors and serve pieces of fish surrounded by fennel, chopped tomatoes and a spoonful of the cooking juices."}], "link": "https://cooking.nytimes.com/recipes/5719-whole-striped-bass-with-fennel-and-tomatoes-in-a-roasting-bag"}