{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Blackfish Fillets With Warm Herb Vinaigrette", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT20M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "blackfish, fish, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 317, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "0 grams", "proteinContent": "37 grams", "saturatedFatContent": "3 grams", "sodiumContent": "533 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["4 6-to-8-ounce blackfish fillets, skin attached", "Kosher salt and freshly ground pepper to taste", "2 to 4 teaspoons olive oil", "3 tablespoons sherry vinegar, or more as needed", "3 tablespoons extra-virgin olive oil", "2 tablespoons mixed chopped fresh parsley, chives and chervil (or any 2 of them)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape off any remaining scales and season the fillets on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 to 4 tablespoons of olive oil in a large pan or skillet over medium heat, using the smaller amount of oil for a nonstick pan. Add the fillets and adjust the heat according to their thickness. (The thicker the fillet the lower the heat.) If your pan is not large enough to hold all the fillets without overcrowding, saute them in two batches, adding more oil if necessary for the second batch. Cook the fillets for about 4 minutes altogether for a 1/2-inch-thick fillet, turning them halfway through the cooking time (or covering them if fragile), and transfer them to hot plates or a hot platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the oil out of the pan with a paper towel and add the vinegar, extra-virgin olive oil and the herbs. Return the pan to the heat and bring the sauce to a rapid boil for half a minute. Remove from the heat. Season with salt and pepper to taste, spoon over the blackfish fillets and serve immediately."}]}