{"@context": "http://schema.org", "@type": "Recipe", "name": "Cary Neff's Fish Lasagna With Tea Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fish broth, fish fillets, lasagna, main course", "aggregateRating": null, "recipeIngredient": ["3/4 cup fresh squeezed orange juice", "1/2 cup lobster broth (clam juice can be substituted)", "4 jasmine tea bags", "1/4 teaspoon lemon zest", "1 teaspoon orange zest", "1 clove garlic, minced", "1 1-inch piece fresh ginger root, peeled and minced", "1 stalk lemongrass, smashed and coarsely chopped", "1/4 cup passion fruit juice", "1 tablespoon cornstarch", "Kosher salt and freshly ground black pepper to taste", "12 4-by-4-inch sheets of homemade pasta, or 8 dried lasagna noodles", "24 thin asparagus, steamed until tender and cooled", "16 baby carrots, steamed until tender and cooled", "1 cup fresh corn kernels, lightly toasted", "1 1/2 cups diced zucchini, steamed until nearly tender", "1 1/2 cups diced summer squash, steamed until nearly tender", "1 1/2 cups sliced shiitake mushrooms, steamed until tender", "1/2 cup fava beans or lima beans, steamed until tender", "Kosher salt and freshly ground black pepper to taste", "1 tablespoon chopped fresh basil", "1 tablespoon chopped fresh parsley", "12 ounces fresh goat cheese", "4 4-to 6-ounce grouper, catfish or halibut fillets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, warm cup orange juice with the lobster broth. Add the tea bags and steep. Meanwhile, place all the rest of the ingredients, except the remaining i cup orange juice, the cornstarch and the salt and pepper, in a pot and simmer for 5 minutes. Remove tea bags from tea mixture. Bring to a boil, reduce heat and simmer for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the cornstarch into the remaining orange juice to make a lumpless paste. Reduce the heat under the orange juice mixture to the lowest flame possible. Whisk in the cornstarch mixture and continue stirring until the sauce is clear and slightly thickened. Remove sauce from heat, taste and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the lasagna, preheat the oven to 400 degrees. Boil the lasagna noodles in salted water until tender, about 3 minutes for fresh sheets, 8 minutes for dried noodles. Combine all the cooked vegetables, season with salt and pepper, add the basil and parsley and set aside. Grill the fish over charcoal or broil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is cooking, cover the bottom of an 8-by-8-inch cake pan with a glaze of the tea sauce. Cover with noodles. Top with a layer of vegetables, using i of the mixture. Imagine cutting this, as you eventually will, into 4 portions. Put a heaping tablespoon of the cheese in the center of each imagined portion. Glaze lightly with more sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep adding layers of noodles. Spoon the sauce onto the lasagna and top with remaining cheese. Place the lasagna in the oven for 5 minutes, until the cheese is barely melted. Serve topped with the fish and drizzled with the sauce."}], "link": "https://cooking.nytimes.com/recipes/5725-cary-neffs-fish-lasagna-with-tea-sauce"}