{"@context": "http://schema.org", "@type": "Recipe", "name": "Jiggling Fruit Mold With Berry Compote", "description": "", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "berries, gelatin, dessert, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 434, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "13 grams", "proteinContent": "8 grams", "saturatedFatContent": "7 grams", "sodiumContent": "177 milligrams", "sugarContent": "63 grams", "transFatContent": null}, "recipeIngredient": ["4 cups (2 pints) raspberries or strawberries, hulled and sliced", "2 cups water", "1/2 cup granulated sugar", "Pinch of salt", "4 sheets of gelatin or 1 tablespoon powdered unflavored gelatin", "3 cups (1 1/2 pints) mixed berries like blueberries, blackberries, raspberries and strawberries", "1/2 cup sugar", "1/2 cup water", "1 tablespoon finely grated orange rind", "Pinch of salt", "1/2 cup unsweetened heavy cream, whipped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fruit jell, put the berries, water, sugar and salt in a saucepan. Bring to a boil, stirring, and boil gently for 3 or 4 minutes. Remove from the heat, and set aside for an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a fine-meshed sieve with a double layer of cheesecloth, and strain the cooked berries, pressing down gently so no pulp or seeds get into the liquid. Discard the pulp; there should be 2 cups of berry juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soften the gelatin sheets in enough cold water to cover for about 5 minutes. If using powdered gelatin, sprinkle it over 1/4 cup cold water, and allow to soften for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the reserved berry juice in a saucepan. Squeeze out excess water from the gelatin sheets, and add them to the juice, or add all the softened powdered gelatin. Warm over low heat, stirring, until the gelatin dissolves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spray four 1/2-cup molds with flavorless oil. (You can use metal molds, ramekins or coffee cups.) Fill with the berry juice. Refrigerate, covered, for 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the berry compote, put the 1 1/2 pints of mixed berries in a saucepan with the water, sugar, orange rind and salt. Bring to a low boil, and cook, stirring, for 3 to 4 minutes until the fruit has almost dissolved and is syrupy. Remove from the heat, transfer to a bowl, cool, and refrigerate, covered, for 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon berry compote onto four dessert plates. Dip the bottom of each mold into warm water, and unmold onto the compote. Put a dollop of whipped cream on the side of each, and serve."}]}