{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Hen Stuffed With Foie-Gras Butter And Black Truffles", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H20M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "black truffle, chicken, foie terrine, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1058, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "83 grams", "fiberContent": "0 grams", "proteinContent": "45 grams", "saturatedFatContent": "39 grams", "sodiumContent": "1164 milligrams", "sugarContent": "0 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 cup unsalted butter, softened", "2 ounces foie-gras terrine (see note)", "1 3-pound hen", "2 ounces black truffles Kosher salt and freshly ground pepper to taste", "1/2 pound fresh tagliatelle or fettucine", "1/2 cup duck-and-veal demi-glace (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 6 tablespoons of the butter and the foie-gras terrine in a food processor and process until smooth. Take out 1/2 cup of the butter and refrigerate the rest. Remove the hen's wishbone by lifting the skin around the neck, locating the bone and scraping away the meat with a small knife. Detach the bone from the wing joint and pull away. Using your fingers, separate the skin from the meat over the breast and legs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a tipless pastry bag with 1/2 cup of butter. Slip the bag under the skin and pipe in butter over the legs and breast. With your fingers on the skin, press the butter evenly over the meat. Freeze for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice 1 1/2 ounces of the truffles and chop the rest. Slip the sliced truffles under the chicken skin, covering the butter. Season the cavity with salt and pepper. Tie the legs together and refrigerate 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Place the hen in a roasting pan and season the skin with salt and pepper. Melt 1/2 cup of butter and brush generously over the skin. Roast 30 minutes, basting with the melted butter. Lower the temperature to 375 degrees and baste until the hen is cooked, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil a large pot of water and cook the pasta until al dente. Drain and toss with 2 tablespoons of butter, the chopped truffles and salt and pepper to taste. Remove the hen from the pan and let sit for 15 minutes. Meanwhile, degrease the pan juices. Place over medium heat, add the demi-glace and simmer 1 minute. Turn heat to low and whisk in the remaining foie-gras butter.Season with pepper and salt if needed. Carve the hen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the pasta among 4 plates. Surround with the sauce and top with slices of the hen. Serve."}]}