{"@context": "http://schema.org", "@type": "Recipe", "name": "Red-Chili-Braised Chicken With Potatoes And Mushrooms", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, dried chili peppers, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 679, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "8 grams", "proteinContent": "49 grams", "saturatedFatContent": "10 grams", "sodiumContent": "868 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 cloves garlic, unpeeled", "4 medium dried ancho chilies (about 2 ounces), stemmed and seeded", "8 medium dried guajillo chilies (about 2 ounces), stemmed and seeded", "1 1/2 teaspoons dried oregano, preferably Mexican", "1/8 teaspoon ground cumin, preferably ground fresh", "2 2/3 cups chicken broth, homemade or low-sodium canned, plus more if needed 1 1/2 tablespoons vegetable or olive oil", "1 2 1/2- to 3-pound chicken, quartered", "1 medium white onion, peeled and cut across into1/8-inch-thick slices", "1 pound red-skinned potatoes (about 8 small), quartered", "2 cups thinly sliced shiitake mushrooms", "1 teaspoon kosher salt, plus more to taste", "1 1/2 tablespoons vegetable or olive oi"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a griddle or heavy skillet over medium heat. Add the unpeeled garlic and roast until softened, shaking pan, about 15 minutes (garlic will blacken in spots). Cool and peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat another skillet. Open and flatten the chilies (they may break), and toast 2 at a time, pressing them against the hot surface until they crackle and emit wisps of smoke. Flip over and toast other sides. Place in a bowl of hot water. Weight with a plate to keep the chilies submerged, and soak for 30 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic, chilies, oregano, cumin and 2/3 cup of chicken broth in a food processor or blender and process until smooth, scraping and stirring. Add more broth, if needed, to puree the chilies. Press through a medium-mesh sieve and set aside. (The dish can be made ahead up to here.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, wide pot over medium-high heat. Pat the chicken dry and place in the pot in a single uncrowded layer, in batches if necessary. Cook until browned, about 4 minutes per side. Remove from the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all but 2 onion slices in the pot. Saute until browned, about 8 minutes. Add the chile puree and cook, stirring constantly, until thickened and much darker, about 5 minutes. Stir in the remaining 2 cups of broth. Simmer for 15 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the potatoes and mushrooms, cover and simmer over medium-low heat for 10 minutes. Push the chicken legs into the sauce, cover partly and cook 15 minutes. Push the remaining chicken into the sauce, cover partly and cook until done, about 30 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a warm, deep serving platter. Season the sauce and vegetables with salt. Spoon the sauce over the chicken and arrange the vegetables around it. Shape the reserved onion slices into rings and scatter over the vegetables. Serve."}], "link": "https://cooking.nytimes.com/recipes/5883-red-chili-braised-chicken-with-potatoes-and-mushrooms"}