{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Tart With Basil Crust", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H", "recipeYield": "Four to six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, basil, tomato, appetizer", "aggregateRating": null, "recipeIngredient": ["1 tablespoon tomato paste", "1 cup loosely packed basil leaves", "1/2 cup unsalted butter, cut into small pieces, at room temperature", "1 egg", "1 teaspoon sugar", "2 teaspoons baking powder", "1/2 teaspoon salt", "Several grinds of black pepper", "1 1/2 cups all-purpose flour", "3 packages (1 ounce each) instant cream of wheat cereal", "2 cups tomato juice", "2 tablespoons freshly grated Parmesan cheese", "3 tablespoons olive oil", "1 1/2 tablespoons red wine vinegar", "3 cloves garlic, peeled and minced", "1 stalk celery, trimmed and diced fine", "Salt and freshly ground pepper to taste", "4 large tomatoes, halved through the stem and cut into 1/4-inch-thick slices", "Salt and freshly ground pepper to taste", "2 teaspoons olive oil", "1/2 cup freshly grated Parmesan cheese", "1/4 cup chopped fresh basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, place the tomato paste, basil, butter, egg, sugar, baking powder, salt and pepper in a food processor. Pulse until smooth, stopping to scrape down the sides. Add 1/2 cup of flour and process just until incorporated. Add the remaining flour and pulse just until dough is crumbly. Press the dough together with your hands. Divide in half and shape each piece into a rectangle that is 3 or 4 inches wide. Wrap in plastic and refrigerate at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large baking sheet with parchment. On a lightly floured surface, roll out each piece of dough to a rectangle slightly larger than 12 by 5 inches. Trim to 12 by 5, preferably using a fluted pastry cutter. Place side by side on the baking sheet. Cover with plastic wrap and refrigerate at least 1 hour before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, place the cream of wheat in a bowl. Bring the tomato juice to a boil and whisk into the cereal. Stir in the Parmesan. Mix in the oil, vinegar, garlic and celery. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Uncover the baking sheet and bake the crusts until lightly browned, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, preheat the broiler. Spread half of the filling over each crust. Overlap the tomatoes in rows over the filling. Season with salt and pepper and drizzle 1 teaspoon of olive oil over each one. Sprinkle with Parmesan. Place 4 inches under the heat source and broil until the cheese is browned and the tarts are heated through, about 5 minutes, watching carefully. Slice into 4 or 6 servings, sprinkle with basil and serve immediately."}]}