{"@context": "http://schema.org", "@type": "Recipe", "name": "Blackberry-Fig Tart With Orange- Caramel Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT7H15M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, blackberries, figs, dessert, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1236, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "175 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "16 grams", "proteinContent": "16 grams", "saturatedFatContent": "31 grams", "sodiumContent": "34 milligrams", "sugarContent": "105 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 orange", "2 cups water", "1/2 cup sugar", "2 cups orange juice", "2 tablespoons fresh lemon juice", "1 tablespoon cornstarch", "2 tablespoons Grand Marnier or other orange liqueur or brandy", "2/3 cup sugar", "1/2 cup shelled pistachios", "2 teaspoons ground cinnamon", "2 cups all-purpose flour", "1 cup chilled, unsalted butter, cut into pieces", "1 chilled egg, beaten", "7 dried figs, stemmed", "About 3 tablespoons water", "1 1/2 pints blackberries (or raspberries)", "8 fresh figs, quartered", "Confectioners' sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, remove the orange zest with a vegetable peeler, avoiding the white pith. Place in a heavy medium saucepan with the water and bring to a boil. Simmer for 5 minutes. Transfer the peel and 1/4 cup of the liquid (discard the rest) to a blender and blend until minced. Return it to the saucepan and stir in the sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook over low heat until the sugar dissolves, swirling the pan occasionally. Increase heat and boil until the mixture turns a deep brown. Standing back to avoid splatter, pour in the orange and lemon juices. Bring to a simmer and stir until sugar crystals dissolve and the sauce is smooth. Mix the cornstarch with the liqueur, add to the sauce and cook for 1 minute. Cool. Strain through a fine sieve. Cover and refrigerate until well chilled, about 4 to 6 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cookies, pulse the sugar, pistachios, cinnamon and flour in a food processor until the nuts are finely ground. Add the butter and process until mixture resembles coarse meal. Add the egg and process just until crumbly and moistened. (If too dry, add water 1 tablespoon at a time.) Turn out onto a large sheet of plastic wrap, press the dough together and form into a rectangle. Wrap and refrigerate at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment paper. Roll the dough out between 2 sheets of plastic wrap into a 12-by-16-inch rectangle, about 1/4-inch thick. Cut out 6 5-inch circles using a floured cutter. Use a spatula to transfer the rounds to 1 of the baking sheets. Refrigerate at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Transfer half of the cookies to the second prepared baking sheet, spacing evenly. Bake until golden brown, switching positions of the baking sheets halfway through, about 15 to 20 minutes. Cool. Loosen with a spatula and transfer to racks in a single layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the topping, pulse the dried figs in a food processor until minced. With the machine running, add the water 1 tablespoon at a time, until the puree is a smooth, spreadable paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, carefully spread each cookie with fig puree and place 1 on each of 6 plates. Garnish with blackberries, figs and sifted sugar. Ladle sauce around the cookies and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/5888-blackberry-fig-tart-with-orange-caramel-sauce"}