{"@context": "http://schema.org", "@type": "Recipe", "name": "Swiss Chard Dolmas", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "18 dolmas", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, lamb-shoulder steaks, swiss chard", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 134, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "185 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["18 long-stemmed Swiss chard leaves, each leaf at least 5 by 8 inches (if chard is short stemmed, allow 4 or 5 extra leaves)", "1 pound lamb shoulder chops, on the bone", "2 tablespoons olive oil", "1 1/2 cups chopped onion, pieces about 1/3 inch size", "Fine shredded zest of 1 large lemon, about 1 tablespoon", "2 large cloves garlic, finely minced", "1/2 cup raw basmati rice, or other long-grain white rice", "2 tablespoons currants", "2 tablespoons pine nuts", "1/2 cup minced fresh parsley", "1/4 cup minced fresh dill, or 1 1/2 tablespoons dried", "1/2 teaspoon salt", "1/4 teaspoon allspice", "1 medium onion, thinly sliced", "2 egg yolks", "Juice of 1 lemon, about 1/4 cup", "1 lemon, cut in thin wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large kettle of water to the boil, add the chard and stir well. Drain at once, rinse with cold water, drain again and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bone the chops and reserve the bones. Cut off all fat and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the meat into little chunks a bit coarser than hamburger. There should be about one cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a wide skillet over medium heat, add the oil, then the chopped onion. Cook, stirring often, until the onion is just golden around the edges, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lemon zest and cook, stirring, for about two minutes, then add the garlic and meat. Continue cooking, stirring occasionally, until the meat is just starting to brown, about five minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the rice, turn the heat to medium-low and add a half-cup of water. Allow to simmer undisturbed until all the water is absorbed, then stir in the currants, pine nuts, herbs and seasonings and remove the pan from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold each chard leaf in half the long way, so the spine of the stem protrudes. Starting where the stem widens, slice out the lower portion of the stem. Reserve leaves and stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly film the bottom of a nonstick nine-inch diameter kettle with olive oil, then line it with onion slices, lamb bones and chard stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a trimmed leaf face up on the work surface. Put a generous portion of filling in a wide line right above where the cut has split the leaf. Fold up the two bottom flaps to cover the filling, fold in the leaf edges to enclose it further, then roll like a jellyroll to the tip, tucking as you go. Set the rolls seam side down in the kettle, placing the second layer of leaves perpendicular to the first."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in one and three-quarters cups of water; put a plate on top of the rolls to weight them down and cover the pan. Cook at a gentle simmer for an hour, or until the chard is tender and the rice fully cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, remove the rolls and set aside, covered to keep warm. Strain the kettle contents, pressing on the solids to get all juices; there should be about two-thirds of a cup of liquid. If necessary, boil to reduce, or add water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg yolks with the lemon juice in a small nonstick saucepan. Add the juices and cook, stirring constantly over very low heat, until the sauce thickens. Do not let it boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the dolmas hot or cold, with sauce on the side, garnished with lemon wedges."}]}