{"@context": "http://schema.org", "@type": "Recipe", "name": "James Budros's lobster and scallops with beurre blanc", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT50M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "bay scallops, endive, lobster, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "2 grams", "proteinContent": "20 grams", "saturatedFatContent": "21 grams", "sodiumContent": "660 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 live lobsters, each weighing about 1 1/4 pounds", "3 large endives, about 3/4 pound", "1 or 2 leeks, green part and all, about 3/4 pound", "13 tablespoons butter", "Salt to taste, if desired", "Freshly ground pepper to taste", "1 pound scallops, preferably bay scallops (if sea scallops are used, cut them into quarters)", "1/4 cup dry white wine", "2 tablespoons finely chopped shallots", "1/4 cup whitewine vinegar", "1/2 cup heavy cream", "6 teaspoons black caviar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the lobsters into boiling water, cover closely and cook about 10 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the tough ends of each endive and trim away any brown spots. Cut each endive crosswise in half. Cut each half lengthwise into thin slices. Cut the slices into very thin julienne strips. There should be about four cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the ends of the leek or leeks. Cut the leeks crosswise, green part and all, into two-inch lengths. Cut each length into very thin julienne strips. There should be about four and one-half cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat four tablespoons of the butter in a heavy skillet and add the leeks. Cook, stirring, about 10 minutes. Add the endive, stirring to blend. Add the salt and pepper. Cover closely and cook, stirring occasionally, about three minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the scallops in a small skillet and add the wine. Bring to the boil and cook, stirring occasionally, about one minute. Drain the scallops, reserving the cooking liquid. There should be about one-quarter cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of butter and add the shallots. Add the vinegar, and cook until almost reduced. Add the reserved scallop cooking liquid. Cook until liquid almost evaporates. Add the cream, salt and pepper, and bring to the boil. Cook down until reduced almost by half. Add the remaining eight tablespoons butter, a little at a time, to the sauce, stirring with a wire whisk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull apart and crack the lobsters, removing the meat from the tails and claws. Cut the meat into neat, bite-size cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, transfer the hot endive and leek mixture to a warm serving dish. Arrange the lobster pieces over the center of the vegetables. Arrange the scallops around the lobster meat. Spoon the sauce equally over the scallops and lobster meat. You may garnish the top of this with the tip of the lobster heads, arranging them beak to beak. Serve on six warm dinner plates. Top each serving with a teaspoon of caviar."}], "link": "https://cooking.nytimes.com/recipes/5908-james-budross-lobster-and-scallops-with-beurre-blanc"}