{"@context": "http://schema.org", "@type": "Recipe", "name": "Leslie Revsin's Braised Quail With Juniper, Bayberry And Pomegranates", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "juniper berries, pomegranate, quail, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1034, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "64 grams", "fiberContent": "4 grams", "proteinContent": "70 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1430 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 quail", "Coarse salt", "20 bayberry leaves or 6 bay leaves", "3 cloves garlic, cut in quarters", "1 tablespoon juniper berries, crushed", "1/4 teaspoon whole white peppercorns", "1 teaspoon whole coriander seeds", "1 tablespoon brandy", "1/2 cup diced carrot", "1/2 cup diced onion", "1/2 cup diced celery", "1/2 cup diced leek", "1 clove garlic, crushed with the flat side of a knife", "1 1/2 tablespoons rendered duck fat or a mixture of butter and olive oil", "1 1/2 cups dry red wine", "1 1/2 cups game stock or veal or chicken stock", "4 sprigs fresh thyme or 1/3 teaspoon dried thyme", "1 sprig fresh rosemary or 1/8 teaspoon dried", "1/2 cup white breadcrumbs, preferably homemade", "6 tablespoons unsalted butter", "2 pomegranates juniper branches, if available, and extra bay leaves to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the cavity of the quail put a little salt, a bayberry or quartered bay leaf (reserving the remaining leaves for later), and a quarter of a clove of garlic. Truss the quail."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl large enough to hold all 12 quail combine half a teaspoon salt, juniper berries and whole white peppercorns. Crush the whole coriander seeds with a mortar and pestle and add. Add the brandy. Toss the quail in this mixture, cover tightly and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. In a casserole large enough to hold the quail, brown the carrot, onion, celery and leek in threequarters of a tablespoon of duck fat or oil and butter mixture. Remove the vegetables and set aside. Add the remaining fat and carefully brown the quail a few at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the vegetables to the pan. Add the wine and stock. Bring to a boil and skim off any impurities that may rise to the surface. Add three bayberry or one bay leaf, thyme and rosemary and cover tightly. Cook for 45 minutes. The quail are done when they are very soft. Test with a fork or thin skewer. If they are not cooked long enough they will be stringy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, brown four tablespoons of butter without burning and brown the breadcrumbs in the butter. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the birds from pan. Strain the cooking juices into a saucepan and reduce to 1 1/2 cups. Season with freshly ground pepper and salt if needed. Stir in remaining two tablespoons of cold butter. Pour the sauce over the birds and sprinkle with breadcrumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish the plate with branches of juniper and peeled chokes of pomegranates, lacing them in and among the birds and sprinkle with extra bay leaves."}]}