{"@context": "http://schema.org", "@type": "Recipe", "name": "Cuttlefish With Shaved Fennel And Broken Vinaigrette", "description": "", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cuttlefish, extra virgin olive oil, fennel, gluten-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 597, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "5 grams", "proteinContent": "39 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1143 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 small heads fennel, trimmed", "6 tablespoons Dijon mustard", "1/2 cup fresh lemon juice", "2 large cloves garlic, peeled and lightly crushed", "Coarse salt", "3/4 cup extra virgin olive oil, more for oiling pan", "8 frozen whole cleaned cuttlefish, thawed and soaked in water for 1 hour and drained; or 16 cleaned calamari", "Coarsely ground black pepper", "handfuls haricots verts, trimmed", "4 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mandoline or a sharp knife, thinly shave the fennel crosswise, and set aside. In a small bowl, combine the mustard and the lemon juice. Add the garlic cloves and salt to taste. Stir the mixture while gradually adding 1/2 cup olive oil, until it is somewhat mixed but not fully incorporated; there should be large beads of oil flecking the liquid. Taste and adjust seasoning, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler, placing the rack 6 inches below the heat. Over high heat, bring a medium pot of lightly salted water to a boil. Lightly oil the broiling pan, and arrange the cuttlefish in a single layer. Sprinkle with remaining 1/4 cup olive oil, and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the haricots verts to boiling water, and blanch until tender, 3 to 4 minutes. Drain well, and cut into thirds. Place the cuttlefish under the broiler and cook, turning once, until puffed and opaque, about 2 minutes for each side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, make a pile of fennel on each of four plates. Sprinkle a handful of haricots verts over each. Spoon over with a tablespoon or two of the vinaigrette. Place the cuttlefish on top; pour some cooking juices over them. Add a touch more of the vinaigrette, and sprinkle with parsley. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/5946-cuttlefish-with-shaved-fennel-and-broken-vinaigrette"}