{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Chicken", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT1H50M", "recipeYield": "4 servings (with leftovers)", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "chicken, flour, rice flour, main course", "aggregateRating": null, "recipeIngredient": ["2 (3 1/2- to 4-pound) chickens for frying", "2 tablespoons Lawry's seasoned salt or 2 tablespoons of a mixture of equal parts sea salt, freshly ground pepper, garlic powder, paprika and cumin", "Vegetable oil for frying", "1 cup all-purpose flour", "1 cup rice flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse chickens inside and out under running cold water and pat dry with paper towels. Remove extra skin and excess fat. Cut off the first joint of wings and the backs and discard. Keeping skin on, cut legs into thighs and drumsticks. Remove the wings, split the breast and cut each half crosswise into two (or ask your butcher to do this). Place pieces in a single layer in a shallow baking dish; sprinkle with seasoned salt or seasoning mix and rub to coat on all sides. Cover and set aside to marinate 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 250 degrees. Heat 1 1/2 inches oil, enough to cover the chicken pieces 2/3 of the way but no more, in one or two wide, deep skillets or kettles to 325 to 350 degrees over medium-high heat. As the oil heats, mix the flours in a plastic food-storage bag. Add the thighs and drumsticks; shake to coat. Remove each piece with tongs, shake off excess flour and place skin side down in the hot oil without crowding. Fry until skin is browned and crisp, about 7 minutes; turn with tongs and fry until browned and crisp and cooked through, about 7 minutes longer, adjusting heat so chicken doesn't brown too quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain chicken on a wire rack set over a baking pan and keep chicken warm in the oven while coating and frying the remaining pieces: breast pieces next, about 5 minutes on each side, and wing parts last, about 4 minutes on each side. Serve while still warm. The meat will be less moist when served cold the next day, but still very tasty."}], "link": "https://cooking.nytimes.com/recipes/5974-fried-chicken"}