{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Breasts With Turnips And Eastern Spices", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT40M", "recipeYield": "2 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "chicken broth, duck breast, white turnip, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 443, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "24 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1462 milligrams", "sugarContent": "42 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium, round white turnips, about 1/3 pound each", "2 duck breasts, like magret, skin on, about 6 ounces each", "2 tablespoons coriander seeds", "2 whole cloves", "2 teaspoons cumin seeds", "Salt and freshly ground pepper to taste", "4 tablespoons natural honey", "3 tablespoons white vinegar", "1 cup hard cider, or 1/2 cup dry white wine", "1 cup fresh chicken broth or good canned version", "2 sprigs flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the ends of the turnips and peel them. Cut into 1/4-inch slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the duck breasts and the turnips in a large saucepan, and cover with boiling water. Cook, simmering, over low heat for one minute. Remove the duck breast, and cook the turnips two minutes longer. Remove the turnips, and place the duck breasts and the turnips into an ice-water bath to prevent them from cooking further. When cool, remove the duck and the turnips. Pat the duck dry with a paper towel. Using a sharp knife, remove the thick, excess fat, leaving a thin layer of fat underneath. Score the surface of the fat diagonally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the coriander, clove and cumin by placing them on a cutting board and crushing them with a heavy sauce pan. This can also be done in a spice mill, but be careful not to grind them too finely -- you want a crunchy texture to the spice crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, season the duck breast with salt and pepper. Place in a skillet over medium-high heat, skin side down, until lightly browned, about 2 minutes. Add the turnips, turning them from time to time, and continue cooking another 2 minutes. Remove the duck and turnips from the skillet, and pour off the fat. Pat the skin of the duck with paper towels to absorb any excess fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, combine the honey and white vinegar. Bring to a boil, stirring constantly, until the mixture begins to caramelize lightly and evenly. Add the ground spices while stirring. Be careful not to burn. Remove the skillet from the heat. Return duck breasts to the skillet, fatty side down. Move them around in the pan to coat them with the spice mixture. Remove the duck, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to medium-high heat, and add the cider. Cook, scraping the side and bottom of the pan, until all the brown particles are dissolved. Add the chicken broth, and bring to a simmer. Add the duck breasts, fatty side up, and place the turnips around them. Simmer for about 3 to 4 minutes. Remove the duck and keep warm. The meat should be pink in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the sauce and the turnips to a boil and cook until reduced by more than half, until the sauce has thickened to a syrupy consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the breasts on a bias into thin slices. Arrange the slices of the breasts in a fan shape in the center of a warm serving plate. Garnish with turnip slices, and spoon the sauce around. Garnish with parsley."}]}