{"@context": "http://schema.org", "@type": "Recipe", "name": "Shad Roe Poached In Butter", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT20M", "recipeYield": "3 main-course servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "butter, shad roe, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 404, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": null, "proteinContent": "59 grams", "saturatedFatContent": "6 grams", "sodiumContent": "241 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pairs of shad roe sacs (about 1 1/2 pounds total), or use one pair of pike roe sacs (1 3/4 pounds) or, for a snack, one pair of striped bass roe sacs (3 ounces)", "Melted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently pull the sacs away from each other, and the membrane attaching them will come apart. Snip any pieces of membrane that do not break easily with kitchen scissors. Take care not to tear the sacs. Run them under cool water, and pat them dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To know how much butter to poach the roe in, place the sacs in a straight-sided frying pan or saucepan just large enough to hold them in one layer. Add water to halfway up the sides of the sacs. Drain water off into a measuring cup. The level of water in the measuring cup is the level that the melted butter to cook the roe should reach. (In poaching pike or striped bass roe, the water should almost cover it. Both of those puff up in cooking, so they will need more butter.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the roe from the pan, and wipe the pan dry. Place the melted butter in the pan over medium heat. When the butter is bubbling, carefully slip the roe into the pan in one layer. Return to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook over medium heat for 1 minute to firm up the roe. Turn the heat to low (bubbles should be breaking the surface, but not vigorously). Cook for 2 minutes. Gently move each piece to assure that it does not stick. Continue to cook 4 minutes more (5 minutes more for the bass, 27 minutes more for the pike). Carefully flip each piece. Cook for 3 minutes, moving roe gently so that it does not stick. Continue to cook until the roe sacs have changed color and are opaque all the way through, 4 minutes for the shad, 5 minutes for the bass and 27 minutes for the pike. Move the pike occasionally to keep it from sticking."}]}