{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Alaska", "description": "Baked alaska was once a restaurant show stopper. A layering of spongecake, ice cream and meringue, it was presented on a tray and flambeed at the table to heat the covering of meringue so you had both warm and cold sensations as you ate it. But some restaurants serve it in individual portions, relying on a blowtorch back in the kitchen to caramelize the meringue. When Amanda Hesser brought this recipe to The Times in 1998, the pastry chef Stacie Pierce of the Union Square Cafe used espresso caramel ice cream instead of vanilla or chocolate and served a big ball of it on top of a tender chocolate souffle cake, rather than the traditional spongecake. The warm and cold effect is the same, and the flavors, sharper and distinct, come across as more mature.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "bittersweet chocolate, eggs, ice cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 639, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "96 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "10 grams", "sodiumContent": "593 milligrams", "sugarContent": "90 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces bittersweet chocolate", "16 large eggs", "1/2 cup granulated sugar", "2 teaspoons vanilla extract", "Salt", "1 quart caramel or coffee ice cream", "4 tablespoons sliced almonds, toasted", "2 tablespoons cream of tartar", "2 cups plus 4 tablespoons superfine sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees, and line a baking sheet with parchment paper. Melt chocolate in a double boiler, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate 4 eggs into two bowls. To the yolks add 1/4 cup granulated sugar and 1 teaspoon vanilla. Using an electric mixer, beat until the mixture is thick and pale yellow. Set aside. Using the mixer, whisk the egg whites and a pinch of salt until they hold soft peaks. Slowly add the remaining 1/4 cup granulated sugar until the whites are stiff and shiny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rubber spatula, fold the melted chocolate into the yolk mixture; then, fold the chocolate mixture into the meringue. Do not overmix. Spread the batter in an even layer, about 1/2 inch thick, on the baking sheet. Bake until the cake is spongy and moist, and slightly crisp on top, 10 to 15 minutes. Remove from oven and cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a 3-inch round cutter, press eight circles of cake. Position circles on a large baking sheet lined with parchment. Place a large scoop of ice cream on each circle. Sprinkle with toasted nuts. Put baking sheet in freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate the 12 remaining eggs, reserving yolks for another use and placing whites in a large bowl. Add a pinch of salt and cream of tartar. Using an electric mixer, whisk until frothy; then, increase speed to high and mix until soft peaks form. Slowly add superfine sugar, whisking until meringue is very stiff. Add remaining teaspoon of vanilla; whisk until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit a pastry bag with a large closed-star tip, and fill the bag with meringue. Remove baking sheet from the freezer. Starting at the base of each cake, pipe rosettes in a circular pattern until cake and ice cream are completely covered. Freeze at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, preheat the broiler. Place baked alaskas under the broiler for 10 to 15 seconds, until meringue is caramelized on the edges. (This may also be done with a kitchen blowtorch.) Transfer to plates, and serve immediately."}]}