{"@context": "http://schema.org", "@type": "Recipe", "name": "Lobster Avgolemono", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four to six servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, cherry tomatoes, chicken broth, lobster", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 666, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "5 grams", "proteinContent": "71 grams", "saturatedFatContent": "4 grams", "sodiumContent": "2297 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1 1/2 pound lobsters", "1/4 cup plus 1 tablespoon olive oil", "2 1/2 quarts chicken broth (homemade or low-sodium canned)", "15 cherry tomatoes, stemmed", "1 large onion, peeled, minced", "4 red Bliss potatoes, cut into 1/2 inch chunks, unpeeled", "3 egg yolks", "1/2 cup lemon juice", "Salt and fresh ground black pepper to taste", "1/4 cup minced, fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lobsters in a large pot of boiling water for 5 minutes. Remove them and place in a large bowl of ice water, to cool. Remove the claw and tail meat. Cut the tail meat into 1-inch pieces. Cut the claw in half lengthwise. Set both aside. Roughly chop the shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in a large pot over medium heat. Add chopped shells to cover the bottom of the pot in one layer. Cook in the oil until deep red, about 5 minutes. Add the remaining shells and cover with chicken broth. Add the tomatoes and simmer gently over medium heat until it reduces to 1 1/2 quarts, about 30 to 40 minutes. Strain, set the lobster broth aside and discard the shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a soup pot over medium heat, saute the onions in 1 tablespoon of olive oil until golden, about 5 minutes. Add the potatoes and cover with the lobster broth. Simmer gently until the potatoes are tender but firm, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the egg yolks in a glass or ceramic bowl, whisk in the lemon juice and set aside. Heat the remaining 2 tablespoons of olive oil in a saute pan over high heat until hot. Add the lobster meat, and quickly saute, about 3 minutes. Add the lobster meat to the soup, whisk 1 ladle of soup into the yolk-and-lemon mixture, and slowly add it back into the soup pot. Do not allow the soup to boil. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into 6 bowls and garnish with chives."}]}