{"@context": "http://schema.org", "@type": "Recipe", "name": "Le Cirque's Gingered-Chicken Fricassee", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "Two servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, ginger, raspberry vinegar, main course", "aggregateRating": null, "recipeIngredient": ["1 1/2-inch piece ginger, peeled and crushed", "1 clove garlic, smashed and peeled", "2 cups raspberry vinegar", "1/4 cup sugar", "4 small red onions, peeled and sliced 1/4-inch thick", "1 3-pound chicken", "1 teaspoon salt", "Freshly ground black pepper to taste", "4 tablespoons unsalted butter, at room temperature", "1 3-inch piece ginger", "4 cloves garlic", "3 cups water", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the onions, cook the ginger and garlic in a large skillet over medium heat for 3 minutes. Add the vinegar and sugar and simmer about 5 minutes. Pour over the onions. Keep onions warm until they've absorbed the flavor and start to soften, at least 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the chicken, preheat the oven to 400 degrees. Season the chicken with 3/4 teaspoon of the salt and fresh pepper to taste. Rub with 3 tablespoons of the butter. Stuff the ginger and garlic in the cavity and roast for 30 to 40 minutes, until the juices run clear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken is cool enough to handle, remove the meat from the bones. Reserve the bones as well as the ginger and garlic. Set the meat aside, covered, at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the fat from the roasting pan and place the pan on top of the stove over high heat. Add the chicken bones and allow to brown. Pour 1 cup of the water over the bones and simmer until it's almost gone, about 5 minutes. Transfer the bones and the liquid to a medium saucepan. Add the remaining 2 cups water and the ginger and garlic from the chicken. Boil for about 15 minutes, or until the sauce will coat the back of a spoon. Strain the sauce and season with 1/4 teaspoon salt and pepper to taste. Whisk in the remaining 1 tablespoon butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a medium skillet, add the chicken and saute to heat through. Divide the chicken between 2 plates and top with onions and sauce."}], "link": "https://cooking.nytimes.com/recipes/6046-le-cirques-gingered-chicken-fricassee"}