{"@context": "http://schema.org", "@type": "Recipe", "name": "Gilbert Le Coze's Bouillabaisse", "description": "“Bouillabaisse is a dish to make for four or six people at home,” said Gilbert Le Coze, the chef and co-owner of Le Bernardin. “To do a bouillabaisse properly you have to remove each kind of fish as it is cooked.”", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "soups and stews", "keywords": "appetizer, fish bones, red potato, seafood", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["5 pounds scraps and bones from white-fleshed fish, such as halibut, red snapper, cod, monkfish", "1 small conger eel, skinned and filleted, with bones reserved (see note)", "2 to 3 medium sea robins, skinned and filleted with bones reserved (see note)", "2 medium-to-large blue crabs, chopped", "1/2 cup extra-virgin olive oil", "1/2 cup thinly sliced fennel", "2 leeks, white part only, thinly sliced", "1 large onion, thinly sliced", "3 shallots, finely chopped", "1 whole head garlic, peeled and finely chopped", "1 cup dry white wine", "1 bouquet garni (bay leaf, parsley and thyme tied in cheesecloth)", "3 quarts water", "3 ripe tomatoes, chopped", "3 tablespoons tomato paste", "Pinch of cayenne pepper", "Kosher salt", "Large pinch of saffron", "7 cups fish soup", "4 medium-to-large new red potatoes (about 1 pound), peeled and sliced 1/4-inch thick", "12 small mussels, scrubbed and debearded", "12 Little Neck clams, scrubbed", "4 large sea scallops, cut in half horizontally", "1 10-to-12-ounce red snapper, filleted and cut into four pieces", "10 to 12 ounces monkfish, cut into medallions", "Rouille (<a href=\"http://cooking.nytimes.com/recipes/6050-florence-fabricants-rouille\">see recipe</a>)", "8 rounds of french bread, toasted and rubbed with garlic and olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fish soup, place all the fish bones and scraps, along with the crabs, in a large piece of cheesecloth and tie securely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a 10- to 12-quart pot. Add the fennel, leeks, onion, shallots and garlic along with the eel and sea robin fillets and cook slowly, until the vegetables are tender. Add the wine. Place the bag of fish bones and the bouquet garni in the pot and add the tomatoes, tomato paste and water to completely cover the fish bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season lightly with cayenne pepper and salt. Bring to a simmer and cook very slowly for two and a half hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bag of fish bones and the bouquet garni and drain well. Pass the soup mixture through a food mill, add the saffron, place in a large saucepan and simmer for 45 minutes to reduce it further. Adjust the seasonings. Strain through several thicknesses of cheesecloth. There should be between two and a half and three quarts. This soup can be prepared in advance and frozen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the stew, heat two cups of the fish soup in a saucepan and cook the potatoes in it until they are tender. Drain the potatoes and wrap in foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fish soup used for the potatoes to a three-quart saucepan and place the mussels and clams in it. Steam the mussels and clams, covered, until they just open. Remove from the heat and keep covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining fish soup in a saucepan just large enough to hold all the rest of the seafood. Heat to just barely simmering, add the remaining seafood and cook until just done, removing each type of seafood to a warm dish as it is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve the bouillabaisse, divide the potato rounds among four shallow, warmed soup plates. Arrange the cooked fish over the potatoes, then divide the mussels and clams, with the top shells removed, among the four plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir some of the soup used to poach the seafood into the rouille, then wisk the rouille back into the soup. Bring to barely simmering, then pour over the seafood in the plates and serve with croutons."}], "link": "https://cooking.nytimes.com/recipes/6049-gilbert-le-cozes-bouillabaisse"}