{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Oysters With Creamy Tartar Sauce", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT40M", "recipeYield": "Six servings as an appetizer; two as a main course", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "appetizer, main course, bread crumbs, cornichons, oyster", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 583, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "2 grams", "proteinContent": "19 grams", "saturatedFatContent": "9 grams", "sodiumContent": "404 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Peanut oil for deep frying", "1 leek, white portion only, carefully cleaned of sand", "12 large, fresh oysters", "1/2 cup flour", "2 whole eggs", "2 egg yolks", "1 cup freshly made bread crumbs", "2 tablespoons very finely chopped cornichons or dill pickle", "2 tablespoons capers, drained and very finely chopped", "1 teaspoon imported Dijon mustard", "1/2 teaspoon paprika", "1/2 cup very finely minced flat-leaf parsley", "1/2 cup creme fraiche or heavy cream, well chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil to 280 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the leek into very, very thin matchsticks about three inches long and as thin as possible. In several batches, drop the leek slices into the oil and fry until golden brown, about four to five minutes. The oil should not be too hot or the leeks will fry too quickly and burn. Drain on paper towels and set aside. This can be done up to two hours in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the oysters, reserve the oyster liquor and strain it to remove any portions of shell or sand. Place the liquor in a small saucepan and bring to a boil over high heat. Add the oysters, poach them for just 30 seconds and drain, again reserving the liquor. When the oysters and the liquor have cooled, combine them again, to keep the oysters moist and plump. This can be done up to two hours in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare three plates for coating the oysters: one with the flour, one with the eggs and egg yolks whisked together, and a third with the fresh bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the tartar sauce, combine the cornichons, capers, mustard, paprika and parsley. Whip the creme fraiche or heavy cream until stiff. Carefully fold the cornichon mixture into the cream. Adjust seasoning if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the oysters and dredge them, one at a time, in the flour. Dip them into the egg mixture, then dredge them in the bread crumbs. Fry the oysters, three or four at a time, until nicely browned, about one minute. Between batches, check that the oil temperature remains steady."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place the oysters on a platter, top with a nest of fried leeks and place a spoonful of tartar sauce alongside."}], "link": "https://cooking.nytimes.com/recipes/6058-fried-oysters-with-creamy-tartar-sauce"}