{"@context": "http://schema.org", "@type": "Recipe", "name": "Skate Wings With Cabbage And Spring Onions", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "main course, savoy cabbage, skate wing, thyme", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 720, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "4 grams", "proteinContent": "76 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1554 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 1-pound skate wings", "2 large yellow onions, peeled and halved", "1 large bunch fresh thyme, or 2 tablespoons dried thyme", "1 whole head garlic, crushed but not peeled", "Salt and freshly ground black pepper to taste", "1/2 small savoy cabbage, cut into 1/8's, lengthwise", "1/2 cup best quality sherry vinegar", "8 tablespoons (4 ounces) unsalted butter, chilled", "2 to 3 small white onions, cut into matchsticks, or 2 to 3 scallions, cut into thin rings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the fish and pat dry. Combine the onions, thyme, garlic, salt and pepper in a large, deep skillet. Add the skate wings and cover with cold water. Cover and bring to the boil over high heat. As soon as the water boils, remove the pan from the heat. Remove one cup of cooking liquid to a small saucepan. Cover the skillet again and let it sit off the heat until the fish is cooked through, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the same time, place the cabbage in a steamer and steam until cooked through, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the sauce, bring the reserved one cup of cooking liquid to a boil over high heat and reduce by more minute. Swirl in the butter and keep the sauce warm over very low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, drain the skate on a towel and remove the skin from both sides. Place two cabbage slices on each of four warmed dinner plates and place the skate on top of the cabbage. Spoon the sauce over the fish, sprinkle with the raw onions or scallions and serve immediately."}]}