{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled-Eggplant Salad With Fresh Mint", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "eggplant, tomato, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 144, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "10 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1024 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["3 eggplants (about 1 pound each)", "2 tablespoons extra-virgin olive oil, plus more for brushing eggplant slices", "Salt and freshly ground black pepper to taste", "3 medium white onions, peeled and chopped", "1 28-ounce can peeled tomatoes, drained and roughly chopped", "1 cup firmly packed, roughly chopped or torn fresh mint leaves", "2 tablespoons balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a very hot charcoal fire, or preheat the oven broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a pot of salted water to boiling. Meanwhile, cut the top off each eggplant and a thin slice off the bottom. Peel a wide strip of skin off 2 opposite sides of each eggplant. Holding the eggplant vertically, slice it lengthwise into 1/3-inch-thick slices, so that each has a thin border of peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Plunge the eggplant slices into the boiling water for 2 minutes. Remove, pat dry and brush lightly with olive oil. Place directly on the grill (or on an oiled cookie sheet beneath the broiler) in a single layer. Turn frequently, every 2 minutes or so, to make sure the slices don't burn. They are done when they are sizzled brown on the outside (they will be crusty in places, but that's what you want) and just tender within. Season both sides with salt and pepper and transfer to a cutting board. Cut into pieces about 1 inch square, place in a large bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a pan over moderately high heat. Add the onions and sauté for 3 minutes, then add the tomatoes. Cook for a few more minutes; season to taste. Stir into eggplant. Add the mint and balsamic vinegar. Mix well."}], "link": "https://cooking.nytimes.com/recipes/6074-grilled-eggplant-salad-with-fresh-mint"}