{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta, Green Beans and Potatoes With Pesto", "description": "The most elegant pasta dish that Italian cooks have ever invented is astonishingly simple to make. Here, the magical green sauce is tossed with trenette (or any long pasta you can twirl around a fork), tender slices of potato and barely blanched green beans.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": "https://static01.nyt.com/images/2018/04/21/dining/19COOKING-PESTO1/19COOKING-PESTO1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weeknight, pastas", "keywords": "basil, green beans, pasta, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 715}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 414, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "304 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 cups packed tender young basil leaves", "1/4 cup pine nuts", "1 teaspoon salt", "2 plump garlic cloves, peeled and crushed with flat blade of a knife", "1/2 cup extra-virgin olive oil, or more to taste", "1/2 cup freshly grated Parmigiano Reggiano cheese, or more to taste", "Salt to taste", "1/2 pound small potatoes, peeled and sliced about 1/4-inch thick", "1/4 pound tender young green beans, cut into 1-inch lengths", "1 pound trenette, or other long, thin pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make pesto: In the bowl of food processor, add basil, pine nuts, salt and garlic. Pulse until mixture is coarse and grainy. With the motor running, add oil in slow, steady stream. Add cheese; process just enough to mix well. If sauce is too dry, add a little more oil. Taste; add more cheese or salt, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 6 quarts water to rolling boil. Add at least 2 tablespoons salt and the potato slices. Cook for about 5 minutes, or until potatoes have started to soften but are not cooked through. Add green beans, and continue boiling another 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta, and stir. Start testing pasta at 5 minutes. When it is done, and when potatoes and beans are tender, drain and turn pasta and vegetables immediately into preheated bowl. Add pesto, and mix thoroughly. Serve immediately."}]}