{"@context": "http://schema.org", "@type": "Recipe", "name": "Corkscrew Pasta With Tomatoes And Basil", "description": "A simple tomato sauce, made from fresh or canned tomatoes, is the foundation for vast numbers of dishes, but it is also very good on its own. This recipe makes twice the amount of sauce needed for the dish. The rest can be refrigerated or frozen. Use fresh tomatoes, but only if they are very ripe, sweet and flavorful; about two pounds will do. Peel, seed and coarsely chop them before adding them to the saucepan. A pinch of sugar will help to accentuate the natural sweetness. Fresh tomatoes will need to cook about 10 minutes longer than canned.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, pastas", "keywords": "main course, pasta, tomato", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 392, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "563 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 yellow onion, coarsely chopped", "1 garlic clove, coarsely chopped", "1/4 cup flat-leaf parsley, coarsely chopped", "1/4 cup extra virgin olive oil", "1 28-ounce can whole tomatoes with juices", "Salt to taste", "1 pound fusilli", "1/4 to 1/2 cup slivered fresh basil leaves", "1/2 cup freshly grated Parmigiano Reggiano cheese (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In heavy saucepan over medium-low heat, gently saute onion, garlic and parsley in olive oil. When onion and garlic are softened, but not starting to brown, add tomatoes with liquid, breaking them up with wooden spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise heat to medium-high. Cook rapidly, stirring frequently, until tomato liquid has evaporated and sauce has thickened considerably, about 20 minutes. If desired, put sauce through food mill, or process in food processor or with immersion blender. This makes 3 cups of sauce, twice as much as necessary; set aside half in refrigerator or freezer. Return remaining sauce to low heat, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 5 to 6 quarts water to rapid boil. Add at least 2 tablespoons salt and then the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start testing pasta after 5 to 6 minutes. When pasta is done, drain it and turn it immediately into preheated bowl. Add slivered basil to hot tomato sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour about three-quarters of sauce over pasta. Toss to mix well, and then top with remaining sauce and grated cheese. (Or drain pasta when it is not quite done, finish cooking in tomato sauce, and then top with grated cheese). Serve immediately."}]}