{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Garlic, Oil and Hot Red Peppers", "description": "This is the kind of quick, simple dish Italians often throw together after an all-night party or when spirits are flagging and an infusion of food is called for. Other types of long, thin pasta, like vermicelli, linguine or taglierini, may be substituted. If anchovies are omitted, adjust the salt in the sauce.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, weekday, pastas", "keywords": "dried red chili, garlic, spaghetti, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 445, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "235 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["4 to 6 plump garlic cloves", "1/2 cup extra virgin olive oil", "Sea salt to taste", "1 pound spaghetti", "3 to 4 anchovy fillets, coarsely chopped (optional)", "1 small dried hot red chili pepper, crumbled, or 1/2 teaspoon hot red pepper flakes or more to taste", "1/2 cup minced flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 5 to 6 quarts water to rolling boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel garlic cloves, removing green sprout at center, if necessary, and chop coarsely. In pan large enough to hold all the drained pasta, cook garlic in oil very gently over medium-low heat. Cook just until garlic softens and starts to turn golden. Do not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add at least 2 tablespoons salt to vigorously boiling water. Add spaghetti, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using anchovies, add them to oil and garlic. Cook briefly, mashing anchovy pieces into oil with fork. Stir in chili pepper and half of the parsley, and carefully add a ladleful of the pasta cooking water. Let simmer, and reduce slightly while pasta finishes cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start testing pasta after it has cooked for 4 minutes. When it is still a little chewy in the center, drain and add it to pan with sauce. Turn heat up slightly, and cook, mixing pasta and sauce together well for 1 to 2 minutes, or until pasta is done to taste. Turn pasta into preheated serving bowl, sprinkle with remaining minced parsley, and serve immediately."}]}