{"@context": "http://schema.org", "@type": "Recipe", "name": "David Wallach's Wild-Mushroom Stew", "description": "", "author": {"@type": "Person", "name": "Andrew Arons"}, "image": null, "totalTime": "PT50M", "recipeYield": "One dinner serving", "recipeCuisine": "", "recipeCategory": "dinner, for one", "keywords": "artichoke hearts, dried porcini mushrooms, mushroom, main course, vegetarian", "aggregateRating": null, "recipeIngredient": ["1/8 cup dried morels", "1/8 cup dried porcini", "3 cups water", "3 tablespoons olive oil", "1/4 cup each of two other types of fresh mushrooms (such as shiitake, oyster, etc.), sliced", "1/2 medium leek, diced", "1 small new potato, peeled and diced", "1 small carrot, peeled and diced", "1/4 cup celery root, peeled and diced", "1 medium artichoke heart sliced in 1/4-inch pieces (use either fresh or a high quality canned artichoke bottom)", "1/2 bay leaf", "1/2 teaspoon fresh lemon thyme, chopped (or use fresh thyme)", "1/2 teaspoon Italian parsley, chopped", "Salt and freshly ground pepper to taste", "Juice of 1/2 lemon, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-sized saucepan, combine the dried morels and porcini with the water. Bring to a simmer, then remove from heat and let steep for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-sized saute pan, heat 2 tablespoons of the olive oil. When the oil is hot, add the fresh mushrooms and cook over high heat until the edges of the mushrooms are golden brown. Remove the mushrooms from the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the remaining tablespoon of olive oil in the saute pan and heat over a medium flame. Add the leek and saute until translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of lightly salted water to the boil. Add the new potato and cook until it is tender but firm, about 2 minutes. Remove the potato from the water with a slotted spoon and reserve. Then add the carrot to the boiling water and blanch for about 2 minutes, or until the carrot is cooked al dente. Remove the carrot with a slotted spoon, refresh in cold water and set aside. Then add the celery root to the boiling water and cook for about 2 minutes or until the celery root is al dente. Drain from the water, refresh in cold water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the mushroom broth through a fine mesh strainer and reserve the broth. Roughly chop the reconstituted mushrooms. Put the mushroom broth in a medium-sized saucepan and add the sauteed mushrooms, the reconstituted dried mushrooms, the cooked vegetables, the sliced artichoke, the bay leaf, chopped lemon thyme and parsley. Simmer gently for 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the stew with salt and pepper to taste. Add a splash of lemon juice to bring out the mushroom flavor. Serve with a hearty bread such as seven-grain or black bread."}]}