{"@context": "http://schema.org", "@type": "Recipe", "name": "Carolina Chicken Bog", "description": "Here is a rich and peppery stew that hails from the coastal plains of the Carolinas. The name derives from the way in which the pieces of chicken sit in the pot, like hummocks in a bog. It has since spread across both North and South Carolina, according to Kathleen Purvis, the food editor of The Charlotte Observer in North Carolina. “Bog is one of those classic Carolina meals,” she said. “It’s clumpy, it’s delicious and you see it everywhere — at football games and Nascar race weeks alike.” Recipes for bog are as varied as the 146 counties of North and South Carolina. For ours, we turned to Robert Stehling, who runs the Hominy Grill in Charleston, S.C. Mr. Stehling’s bog features just about every part of the bird you can name, save feet and cockscombs. (Which would be worthy additions.) As outlined in the recipe here, the dish serves about eight hungry people, but the proportions can be adapted by anyone who can do a little fourth-grade math.", "author": {"@type": "Person", "name": "Mark Bittman And Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/01/08/dining/ss-carolina-chicken-bog/ss-carolina-chicken-bog-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "At least 8 servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "chicken, sausage, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 696, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "6 grams", "proteinContent": "43 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1381 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons bacon fat, or neutral oil like corn or canola", "3/4 pound minced chicken gizzards and hearts", "Salt and pepper", "2 medium green bell peppers, diced", "2 medium red bell peppers, diced", "4 medium-to-large white onions, diced", "4 celery ribs, trimmed and diced", "2 tablespoons minced garlic", "1 cup dry red wine", "1 35-ounce can tomatoes, with liquid, chopped", "6 tablespoons butter", "4 tablespoons flour", "1 pound mixed sausages and cured meat, like kielbasa, Italian sausage, breakfast links, chorizo, diced ham or bacon", "2 cups chicken stock", "1 branch thyme", "1/4 teaspoon red pepper flakes, or to taste", "2 bay leaves", "1 pound chopped chicken meat, preferably from thigh", "8 chicken livers, trimmed and cut in half", "1 tablespoon apple cider vinegar", "1/2 cup Dijon mustard", "Cooked white rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put fat or oil in a deep skillet or large casserole over medium-high heat. A minute later, add gizzards and hearts and cook until quite brown and sticking to pan, at least 3 minutes. Stir once, sprinkle with salt and pepper, then brown other side. Add peppers, onions, celery and garlic and cook, stirring occasionally, until vegetables are soft, about 10 minutes. Add red wine and tomatoes, bring to a boil, and adjust heat so mixture simmers; cook for about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt 4 tablespoons butter in a small skillet or saucepan over medium heat. Add flour and stir until smooth. Cook, stirring occasionally, until mixture turns quite brown, about 10 minutes. Add this roux to simmering stew; cook 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add meats, stock, thyme, red pepper flakes and bay leaves; cook at a lively simmer, stirring occasionally, for about 40 minutes. Add chicken meat and cook another 15 minutes or more (this can sit on stove, simmering, for hours; add a little water or stock if it threatens to dry out)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining butter in an 8- or 10-inch nonstick skillet over medium-high heat. When butter foam subsides, add livers, 1 or 2 at a time, and cook until quite brown on one side; sprinkle with salt and pepper as they cook. Turn and brown on other side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir vinegar and mustard into stew. Add livers and stir. Serve over white rice."}]}