{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate terrine (Chocolate mousse in chocolate sponge cake)", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "", "keywords": "cocoa, eggs, semisweet chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 337, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "13 grams", "sodiumContent": "39 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces semisweet chocolate", "1/2 pound butter", "5 egg yolks", "2 tablespoons cognac", "5 egg whites", "1/2 cup sugar", "1 cup heavy cream", "1 cup unbleached white flour", "1 cup cocoa", "12 eggs", "1 1/2 cups sugar", "1 teaspoon vanilla", "1 pound semisweet chocolate", "1 cup cream, approximately", "1/2 pound semisweet chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter and flour two 10 inch-by-15-inch jelly-roll pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mousse, melt chocolate and butter over hot water, beat egg yolks into chocolate and butter, and add cognac."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg whites to soft peaks and add sugar slowly. Continue to beat till stiff but not dry. Add stiffly beaten whites to chocolate mixture and beat together with a whisk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip cream almost to stiff peaks and fold into chocolate mixture. Chill for at least one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sponge cake, sift flour and cocoa twice. Whisk together eggs and sugar over simmering water until sugar begins to dissolve and mixture is warm. Add vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip at high speed until thick and light, and mixture forms a ribbon when poured from a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift one-third of the dry ingredients over the eggs and sugar, and fold in with a rubber spatula until combined. Repeat with remaining flour and cocoa, one third at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter equally between the two pans and bake until cake tester is clean in the center, or about 20 minutes. Remove from oven and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cake has cooled, cut the sponge cake to line completely a pate mold or a straight-sided bread pan, about three inches by four inches by 10 inches. Cut each piece slightly larger than the pan. Simply press the fresh cake against the bottom and sides of the pan, making sure the corners and seams are sealed with cake. Chill until ready for filling. Save the scraps for later use; you should have two pieces large enough to use as layers inside the terrine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ganache, chop chocolate into coinsize pieces. Bring one cup of the cream to a boil and pour over chocolate. Stir until chocolate is completely dissolved and ganache is smooth and shiny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, fill chocolate terrine with alternating layers of chocolate mousse, ganache and a sheet of chocolate sponge cake, ending with chocolate sponge cake to form a cover and seal the terrine, reserving enough chocolate ganache to cover the outside. This will come later. Rap the pan sharply several times while assembling and again afterwards. Allow the terrine to chill overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make chocolate curls, melt the semisweet chocolate slowly over hot water, making sure the bottom of the bowl does not touch the water. When completely melted, spread the chocolate about one-eighthinch thick on a baking sheet with a metal spatula. Chill completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When chilled, remove from refrigerator and let chocolate begin to warm. Holding the metal spatula at a 45-degree angle to the baking sheet, begin to move the spatula across the sheet, loosening the chocolate. If the chocolate has reached the proper temperature, it will slide up the spatula as you move along the sheet, curling as you go. If it cracks, it is too cold. Let it warm up and try again. If it sticks to the spatula, it is too warm. Regrigerate for a moment or two. Refrigerate the curls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the terrine has chilled thoroughly, turn it out by placing an appropriate-size platter (a rectangular bread board will do) upside down on top of the terrine. Then turn it over. The terrine should drop right out. If it does not, let it sit on the platter, and tap the top and sides with the heel of your hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remelt the remaining ganache over hot water, stirring occasionally until smooth and shiny again. If it seems too thick to pour, add several tablespoons of cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting at one end and moving toward the other, pour the ganache over the terrine, letting it run down the sides. Smooth the sides and top with a narrow frosting spatula and let the terrine set in the refrigerator for several minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish the entire terrine with curls in any way you like. The curls will stick to the ganache. Refrigerate until one-half hour to one hour before serving."}], "link": "https://cooking.nytimes.com/recipes/6135-chocolate-terrine-chocolate-mousse-in-chocolate-sponge-cake"}