{"@context": "http://schema.org", "@type": "Recipe", "name": "Shell-shaped Dacquoise", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT4H", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, egg whites, nuts, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 317, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "12 grams", "sodiumContent": "39 milligrams", "sugarContent": "24 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 egg whites", "1/3 teaspoon cream of tartar", "1 teaspoon almond extract", "Pinch of salt", "1 1/2 cup sugar", "2/3 cup cornstarch", "1/2 cup finely ground roasted hazelnuts or almonds", "5 eggs", "3/4 cup sugar", "1 pound sweet butter, softened but still cool, cut into tablespoon-size pieces", "1 tablespoon instant espresso coffee, or leftover fresh", "2 tablespoons cognac", "1/2 pound semisweet chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the Dacquoise, first line two cookie sheets with baking parchment paper. Using a pencil, draw a scallop shell on the parchment paper about seven inches in diameter. Cut it out and trace it three times, once on one cookie sheet and twice on the other, leaving space in between."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat whites with cream of tartar, almond extract and salt until frothy, and soft peaks form. Continue to whip at high speed. Add one cup of sugar by tablespoons. Whip until dry and very stiff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix remaining sugar, cornstarch and ground nuts together, and fold gently into the meringue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the top of the shell Dacquiose, use a plain round tip (No. 7 or one-half-inch in diameter) and pipe long fingers of meringue (just less than one-half-inch thick) from the scalloped edge of the pattern to the bottom edge of the shell. Fill in where necessary. Pipe another layer of meringue directly on top of the first, but starting one-half-inch in toward the center of the shell. Again, fill in where necessary. Repeat the process a third time to complete the top layer of the shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using either a spatula or the pastry bag, fill in the remaining two shell-shaped layers, each slightly less than one-half-inch thick. Pipe any extra meringue in strands on the cookie sheets to use for decoration later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake at 300 degrees until stiff and dry - at least three hours. Turn off oven and leave meringues overnight or until completely cool. Remove from paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the butter cream filling, heat egg and sugar over water until warm and sugar begins to dissolve. Beat at high speed until completely cooled. Lower speed and beat in butter, piece by piece, until buttercream is light and fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the espresso in the cognac and add to egg mixture. Beat until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the semisweet chocolate in a metal bowl over hot water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the Dacquoise by spreading the two flat layers of meringue with a thin coat of chocolate, then a generous layer of buttercream. Place one on top of the other, placing the top of the shell on last."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the sides with buttercream and use the extra meringue strands (crushed with your hands or a rolling pin) as decoration over the buttercream. Cover the top with powdered sugar by sifting it through a strainer."}], "link": "https://cooking.nytimes.com/recipes/6137-shell-shaped-dacquoise"}