{"@context": "http://schema.org", "@type": "Recipe", "name": "Fruit cornucopia", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "TK", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, fruit, heavy cream, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 290, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "13 grams", "sodiumContent": "54 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["3 cups flour", "1/2 tablespoon sugar", "1/4 teaspoon salt", "1 1/2 cups of cold butter, cut into tablespoon-size pieces", "3 tablespoons cold water", "2 eggs", "2 tablespoons heavy cream", "Mixture of fresh fruit, such as red or yellow raspberries, strawberries or blueberries, for filling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix flour, sugar and salt together. Using an electric mixer and paddle, add all the butter and mix on lowest speed until mixture resembles cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add water in a continuous stream and blend only until the mixture forms a mass. Divide dough into two portions, and wrap and chill for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is chilled, roll each portion into a 12-inch by 14-inch rectangle, about one-quarter-inch thick. Place on a cookie sheet covered with plastic wrap, separating each layer with a sheet of plastic wrap or waxed paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form a cornucopia shape using aluminum foil: Start with a piece 12 inches by 22 inches and make a cone shape 12 inches long and six inches wide at the open end. Then cut four or five pieces of 24-inch by 12-inch foil. Stuff each piece into the cone-shaped mold until it is solidly filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one layer of the pastry on a floured board and cut into 24 to 28 three-eighth-to one-half-inch strips, 14 inches long. Place 22 of the strips on a piece of wax paper on a cookie sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the remaining strips, begin to weave each strip into the strips on the table, creating a tight lattice and leaving no space between the strips. (Eighteen strips by 22 strips makes a 12-inch-by-14-inch woven square.) Chill the woven square until firm, about 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the remaining layer of pastry into 24 to 28 strips, three eighths-inch wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare an egg wash with the eggs and heavy cream, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place aluminum-foil cornucopia diagonally across the woven square, with the open end pointing toward the bottom left hand corner of the woven pastry square and the tip of the cone pointing toward the upper right corner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the top left corner of the woven pastry square over the aluminum cone and toward the bottom right corner.Continue to roll toward the bottom right corner, tucking in the ends of the pastry as you go."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the covered foil cone rest on the edge of the pastry sealing it, it should be completely covered.Tuck any loose ends at the tip end of the cornucopia underneath it. Moisten fingers with water to help seal the ends into the woven body.To finish the open end, fold the loose ends back on top of the cornucopia and crimp the edge. Chill until firm, one-half hour or more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a narrow brush to paint the egg and cream glaze on the cornucopia. Bake till golden brown, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cornucopia stand until completely cool. Pull out each piece of aluminum foil from inside the foil mold. When the mold is empty, pull the foil mold away from the pastry and gently collapse the mold inside the cornucopia. Slowly work it out of the pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, fill with summer fruit - red raspberries, yellow raspberries, strawberries, blueberries."}], "link": "https://cooking.nytimes.com/recipes/6143-fruit-cornucopia"}