{"@context": "http://schema.org", "@type": "Recipe", "name": "Pears in Red Wine", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 pear halves", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, dry red wine, pear", "aggregateRating": null, "recipeIngredient": ["3 pears, about 1/2 pound each", "2 cups dry red wine", "4 whole cloves", "Peel of one lemon, yellow part only", "1/2 cup brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the pears and cut each crosswise in half. Cut or scoop out the center core."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pears, one at a time, cut side down on a flat surface. Using a small paring knife, cut each half into a fan shape, slicing down, left to right, at quarter-inch intervals, almost but not quite up to the stem end. Leave the stem end intact."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the pear halves cut side down on a baking dish in which they will fit in one layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the wine, cloves, lemon rind and brown sugar in a saucepan, and bring to a boil. Let simmer 5 minutes. Pour this over the pears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Baste the pears and cover closely with aluminum foil. Punch a few holes in the foil to allow steam to escape. Place in the oven and bake 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the pears to a dish, taking care not to break the slices. Pour the liquid into a saucepan, and bring to a boil. Reduce over moderately high heat to about 3/4 cup. Pour this over the pears. When ready to serve, flatten the pears slightly and gently to make a fan pattern."}]}