{"@context": "http://schema.org", "@type": "Recipe", "name": "A Cheat's Bordelaise Sauce", "description": "Classic bordelaise sauce, which can transform shoe leather into strip steak, is made with veal stock, demi-glace and time -- a lot of time. Here, though, you’ll use pan drippings from pork chops, simmering them with a red wine reduction until the two combine into an unctuous, rich sauce that flanks the old methods. Strain the whole thing, stir in a little butter and seasonings, and drizzle it over the pork chops. This takes most of a bottle of pinot noir, so choose the one you won’t mind finishing off in the kitchen yourself, alone with your heat and creativity.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT20M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "condiments", "keywords": "demi-glace, red wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 shallot, chopped", "1 clove garlic, chopped", "2 stems fresh thyme", "1 bay leaf", "3 cups pinot noir or other red wine", "Pan drippings from pork chops or 2 tablespoons demi-glace, preferably homemade", "3 tablespoons unsalted butter", "Kosher salt and freshly ground black pepper to tast"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the olive oil into a large saucepan, place over medium-high heat and add the shallot and garlic and then the thyme and bay leaf. Cook until the shallots are light brown, then add the wine, lower the heat and simmer until reduced to about 1/2 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pan drippings from the chops or the demi-glace if you have it. Simmer for an additional 5 to 10 minutes and then strain into a clean saucepan. Return to medium heat until warm and whisk in the butter and season with salt and pepper to taste. Serve immediately drizzled over the pork chops."}], "link": "https://cooking.nytimes.com/recipes/6178-a-cheats-bordelaise-sauce"}