{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Grain Crostini With Beans And Greens", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/crostini/crostini-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "appetizer, side dish, baby spinach, bread, white beans, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 14}, "recipeIngredient": ["4 tablespoons extra virgin olive oil", "8 1/2-inch thick slices good whole-grain bread, preferably cut from a crusty loaf", "2 garlic cloves, minced", "1 onion, diced", "2 cups cooked or canned white beans, liquid drained and reserved", "1 pound spinach, washed, trimmed and roughly chopped", "10 leaves fresh sage or about 1 teaspoon dried sage, crumbled", "Salt and pepper to taste", "Grated Parmesan cheese to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a grill or heat an oven to 400 degrees. Use about half the oil to lightly brush each slice of bread. Grill until grill marks appear or bake until golden and slightly crisp, about 10 minutes. (Turning is unnecessary but doesn't hurt.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put remaining oil in a skillet over medium heat. Add garlic and onion, and cook, stirring occasionally, until fragrant and softened, about 5 minutes. Add beans and spinach, and stir. Cook, stirring occasionally, until spinach wilts, about 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sage and, if necessary, enough reserved bean liquid to keep mixture moist. Cover and cook for another 5 minutes. (You can prepare and refrigerate all of this before assembling crostini; warm gently before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and season to taste with salt and pepper. Spoon on top of crostini, sprinkle with Parmesan cheese and serve immediately"}], "link": "https://cooking.nytimes.com/recipes/6185-whole-grain-crostini-with-beans-and-greens"}