{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Grilled In Fennel", "description": "", "author": {"@type": "Person", "name": "Mark Militello"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fennel, snapper, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1125, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "12 grams", "proteinContent": "111 grams", "saturatedFatContent": "20 grams", "sodiumContent": "2283 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 head garlic, cloves peeled", "2 shallots", "1 tablespoon fresh thyme leaves", "1/2 cup extra virgin olive oil", "3 lemons", "2 whole yellowtail snappers, red snappers or black sea bass, each about 2 1/4 pounds, cleaned", "Salt and freshly ground black pepper to taste", "4 to 6 heads fennel, branches and fronds untrimmed (fronds will be quite long)", "1 tablespoon unsalted butter", "1/2 cup heavy cream", "1 cup Parmigiano-Reggiano shavings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place garlic cloves in small saucepan, cover with water, and simmer 15 minutes, until they are tender. Drain. Mash by hand or pur&#233;e in small food processor. Mince 1 shallot, mix with the garlic, add half the thyme and, by hand or machine, beat in 3 tablespoons olive oil and the juice of 1/2 lemon to make a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 4 deep slashes in both sides of each fish. Rub the fish inside and out with some oil and juice of 1/2 lemon. Season with salt and pepper to taste. Fill slashes with garlic paste, and spread any remaining inside fish. Slice remaining shallot, and put slices in cavities. Slice one lemon, and put slices in cavities."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off fennel bulbs, and remove a few frond sprigs for garnish. For each fish, place about three fennel branches, fronds attached, side by side lengthwise on work surface. Place one fish on bed of fennel, and top with about three more branches with fronds. With butcher's cord, tie fennel around fish in 3 places. Drizzle with remaining olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill, preferably charcoal. Heat oven to 425 degrees. Butter a shallow 4-cup baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice off bottom half inch of fennel bulbs. Slice each bulb vertically, in 1/2-inch-thick slices. Place in saucepan, cover with water and bring to a boil. Cook 3 minutes, drain and place in bowl of ice water. Drain and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange fennel slices, partly overlapping, in baking dish. Scatter with remaining thyme. Drizzle with cream, and strew with cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill fish 10 to 15 minutes on each side, until tip of knife inserted in thickest part slips out easily and feels very warm when touched to your chin. While fish grills, place dish with fennel in oven, and bake about 15 minutes, until browned on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, snip off the strings around the fish, and remove the fennel. Remove the lemon and shallot slices from inside fish. Fillet fish, and arrange on platter; garnish with remaining lemon, cut in wedges, and reserved fennel sprigs. Serve baked fennel alongside."}], "link": "https://cooking.nytimes.com/recipes/6191-fish-grilled-in-fennel"}