{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Braised Apricots With Yogurt, Honey And Pistachios", "description": "", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "apricot, greek style yogurt, honey, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 418, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "98 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "67 milligrams", "sugarContent": "94 grams", "transFatContent": null}, "recipeIngredient": ["2 lemons", "2 cups sugar", "1 1/2 pounds apricots (about 7 medium)", "7 ounces whole milk yogurt, preferably Total yogurt brand from Greece", "2 tablespoons confectioners' sugar", "Pinch salt", "1/4 cup wildflower honey", "2 tablespoons shelled unsalted pistachios, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Peel lemons, avoiding white pith, and toss strips into a large saucepan. Squeeze juice through a strainer into saucepan; add sugar and 2 cups water. Cover and bring to a boil, stirring once. Remove lid and simmer until mixture reduces slightly, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve and pit apricots and place them cut-side down in a single layer in a small roasting pan. Apricots should be snug. Strain reduced hot syrup over them. Cover fruit flush with foil and braise in oven for 5 minutes. Turn apricots over carefully, replace foil, and braise 5 minutes more. Remove apricots from oven, turn again and cool. Transfer apricots, covered by their liquid, to a shallow container with cover, and refrigerate 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove apricot halves from their liquid and drain on paper towels. Pour syrup in a saucepan and reduce over high heat until slightly thickened, about 10 minutes. In a small bowl, stir yogurt, confectioners' sugar and salt together until smooth. Spoon warm sauce on each plate, topped by 2 or 3 apricot halves. Spoon yogurt into their centers. Drizzle with honey and sprinkle with nuts."}], "link": "https://cooking.nytimes.com/recipes/6196-chilled-braised-apricots-with-yogurt-honey-and-pistachios"}