{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Veal Shanks With Fava Bean Puree", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H50M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken broth, fava beans, veal shank, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 632, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "13 grams", "proteinContent": "62 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1494 milligrams", "sugarContent": "21 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon olive oil", "4 veal shanks, about 12 ounces each", "6 large cloves garlic, peeled and thinly sliced", "4 shallots, peeled and thinly sliced", "1 cup white wine", "3 cups chicken broth, homemade or low-sodium canned", "5 medium-size carrots, peeled and cut across into 1/4-inch-thick slices", "1/4 cup chopped Italian parsley", "1 teaspoon kosher salt, plus more to taste", "Freshly ground pepper to taste", "3 cups shelled fava beans", "2 tablespoons heavy cream", "1 teaspoon olive oil", "1 teaspoon kosher salt, plus more to taste", "Freshly ground pepper to taste", "4 teaspoons chopped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the veal, heat the olive oil in a large, deep, heavy-bottom skillet. Add the veal shanks and cook until brown on all sides, about 10 minutes. Remove the shanks from the skillet and set aside. Add the garlic and shallots and cook, stirring constantly, until browned, about 1 minute. Add the wine and simmer until reduced by half, about 5 minutes, scraping up any browned bits stuck to the bottom of the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the shanks to the pan and pour in the broth. Bring to a boil. Reduce heat and simmer slowly for 1 hour. Add the carrots. Continue cooking until the meat is very tender, about 1 hour more. Remove the shanks from the skillet. Increase the heat and simmer for 15 minutes. Stir in the parsley, salt and pepper and return the shanks to the skillet. Taste and adjust seasoning, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the puree, place the fava beans in a medium-size saucepan and cover with cold water. Bring to a boil over medium-high heat. Reduce heat and simmer until soft, about 15 to 20 minutes. Drain, reserving the liquid. Place the beans in a food processor. Add 1/2 cup of the cooking liquid, the cream and the olive oil. Process until smooth, stopping to scrape the sides of the bowl. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1 shank on each of 4 plates and spoon the sauce over. Divide the puree among the plates and sprinkle with chives. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/6204-braised-veal-shanks-with-fava-bean-puree"}