{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Extremes (Double Chocolate Cookies)", "description": "These provocatively named cookies came to The Times in a 1999 Sunday Magazine article about Mrs. London's Bake Shop, a husband and wife owned bakery in Saratoga Springs, N.Y., known for their sweets. While the name suggests these cookies might veer into the too sweet and too rich category, they do not. Shiny and crackly on top while tender and deeply chocolaty in the center, they're like an ideal brownie in cookie form. They're kind of perfect.\n\n(One note: The recipe calls for bittersweet chocolate, but feel free to use semisweet or a combination of the two. Also, a sprinkle of flaky sea salt before baking would not be a bad idea.)", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2018/02/06/dining/06COOKING-CHOCOLATEEXTREMES4/06COOKING-CHOCOLATEEXTREMES4-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 18 large cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "Cookies, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 530}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "30 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 ounces bittersweet chocolate, preferably Valrhona, finely chopped, plus 6 ounces cut into 1/4 to 1/2-inch chunks", "6 tablespoons unsalted butter", "1 tablespoon brewed espresso", "2 large eggs, at room temperature", "7 tablespoons sugar", "1 1/2 teaspoons vanilla extract", "7 tablespoons sifted cake flour", "1 teaspoon baking powder", "2 cups coarsely chopped pecans"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. In the top of a double boiler set over simmering water, combine the finely chopped bittersweet chocolate, butter and espresso. Stir occasionally until smooth. Set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in the bowl of an electric mixer, combine eggs and sugar and whip until the mixture is light in color and increases substantially in volume, about 10 minutes. Beat in the vanilla extract. Stir in the melted chocolate. In a separate bowl, whisk together the flour and baking powder and fold them into the chocolate mixture until just combined. Fold in the pecans and chocolate chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two cookie sheets with parchment paper. Drop the batter by heaping tablespoons onto the paper, leaving about 2 inches between each. Bake until the cookies are slightly puffed and cracked on the outside but gooey inside, about 10 to 14 minutes. Cool on the cookie sheets."}]}