{"@context": "http://schema.org", "@type": "Recipe", "name": "Linzer Hearts", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2019/01/11/dining/mo-linzer-hearts/merlin_148333515_721eb5e5-d590-4cd7-a055-0cbcce80afd3-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "About 18 large cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "almonds, pastry flour, raspberry preserves, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 314, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "100 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons dry, plain cookie or cake crumbs", "1 cup finely ground toasted almonds", "3/4 cup plus 2 tablespoons sugar", "2 1/4 cups pastry flour", "Scant teaspoon baking powder", "1 teaspoon cinnamon, preferably Vietnamese", "1/2 teaspoon finely ground sea salt", "1 cup (2 sticks) chilled unsalted butter", "2 large eggs", "1 teaspoon vanilla extract", "1 to 1 1/2 cups raspberry preserves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, combine the cookie crumbs, almonds and 2 tablespoons of sugar; pulse until the mixture resembles coarse sand. Transfer to a large bowl. In a separate bowl, sift together the flour, baking powder, cinnamon and salt and stir it into the almond mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer, cream the butter. Beat in the remaining sugar. Beat in one egg and the vanilla extract until creamy. Stir the dry ingredients into the butter mixture until just combined. Halve the dough, form into 2 disks, wrap in plastic and chill until very firm, at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll out half the dough to a 16-inch thickness. Use a pastry brush to brush off excess flour on the top of the dough, and use a large (about 3 1/2 inches at its widest point) heart-shaped cutter to stamp out as many hearts as possible. Use a wide spatula to transfer them to parchment-lined cookie sheets and chill. Gather the scraps, form into a disk and refrigerate. Repeat with the remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slightly smaller (about 2 inch wide) heart-shaped cutter, cut out the centers of half the chilled hearts. Leave the exterior rings on cookie sheets, and add the cut-out centers to the scraps. Roll out the chilled scraps and cut out an equal number of large hearts and rings. Chill them for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. In a cup, lightly whisk the remaining egg. Remove the chilled large hearts from the refrigerator and, using a small pastry brush, brush a coating of egg around the edges of each. Use a spatula to carefully lift the rings from the cookie sheets and place each over a heart. Press gently with your fingers to make them adhere. Brush the rings with more egg. Bake the cookies until the hearts are lightly colored, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and drop about a tablespoon of the preserves into the centers, spreading to fill. Return the cookies to oven and bake until the jam is set but not bubbling, about 3 minutes. Remove from the oven and cool the cookies on the sheets."}], "link": "https://cooking.nytimes.com/recipes/6213-linzer-hearts"}