{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Rhubarb Pie", "description": "This rave-worthy pie showcases perfectly the classic combination of sweet strawberries with tart rhubarb.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/04/18/dining/18COOKING-STRAWRHUBARBPIE2/18COOKING-STRBRYYRHUBARBPIE2-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, pastry dough, rhubarb, strawberry, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 362}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 508, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "17 grams", "sodiumContent": "153 milligrams", "sugarContent": "29 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups rhubarb in one-inch pieces, about one pound", "3 cups strawberry halves", "1 cup sugar", "3 tablespoons ''minute'' tapioca", "3 tablespoons unsalted butter", "2 ½ cups all-purpose flour, plus more for dusting", "½ teaspoon salt", "¾ teaspoon sugar, plus extra for sprinkling", "15 tablespoons unsalted butter (almost 2 sticks), very cold and cut into 1/4-inch cubes", "½ cup ice-cold water", "1 tablespoons milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry: combine the flour, salt and sugar in a large mixing bowl. Using a fork or pastry cutter, work half of the butter into the flour until it resembles coarse meal. Quickly work the remaining butter into the dough until the biggest pieces are the size of lima beans. Drizzle in the water in several additions, tossing and mixing between each. (It should look rather ropy and rough.) Stop adding water when a few bits of dry flour remain in the bottom of the bowl; do not overwork the dough or it will become tough. Gather two-thirds of the dough and wrap tightly with plastic wrap. Do the same with the remaining third. Flatten into disks. Refrigerate for at least 30 minutes. When the dough is chilled, roll out the larger piece and line a nine-inch pie pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If rhubarb is thick, peel it. Combine rhubarb and strawberries in a bowl. Mix sugar and tapioca together and fold gently into the strawberries and rhubarb. Allow to macerate for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon fruit into pastry shell and dot with butter. Roll out remaining pastry, cut into strips three-quarters of an inch wide and weave a lattice to cover the pie. You can simply lay the strips on top in criss-cross fashion if weaving is not one of your skills. Seal, trim and crimp the edges. Brush the lattice with milk and sprinkle with a bit of sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake in preheated oven for 15 minutes. Lower heat to 350 degrees and bake 40 minutes longer, until pastry has browned and filling begins to bubble. Let pie cool completely before serving, at least 3 hours and up to overnight to set the filling."}], "link": "https://cooking.nytimes.com/recipes/6216-strawberry-rhubarb-pie"}