{"@context": "http://schema.org", "@type": "Recipe", "name": "Charlotte Nesselrode", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT35M", "recipeYield": "12 or more servings", "recipeCuisine": "french, russian", "recipeCategory": "sauces and gravies, times classics", "keywords": "candied fruit, eggs, gelatin, ladyfingers, milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 10}, "recipeIngredient": ["2 cups milk", "2 tablespoons unflavored gelatin", "1/4 cup Cognac, kirsch or rum", "8 egg yolks", "1 cup sugar", "2 cups <a href=\"http://cooking.nytimes.com/recipes/6221-nesselrode-mix\">Nesselrode mix</a>", "1 cup heavy cream", "1 teaspoon butter at room temperature", "16 to 18 ''double'' store-bought ladyfingers or 32 to 36 <a href=\"http://cooking.nytimes.com/recipes/6220-ladyfingers\">homemade ladyfingers</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the milk in a heavy saucepan and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the gelatin and Cognac, kirsch or rum. Stir until softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the egg yolks and sugar in a heavy saucepan and beat until light and lemon-colored. Gradually add the hot milk, stirring vigorously with a wire whisk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the mixture to a bare simmer, stirring constantly with a wooden spoon. Do not let the sauce boil or it will curdle. Cook until the mixture has a custardlike consistency and coats the sides of the spoon. Add the gelatin mixture and stir until dissolved. Put the sauce through a fine sieve, pressing to extract all the liquid from any solid. Add the Nesselrode mix and let stand until thoroughly cooled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the cream until stiff and fold it into the custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the bottom and sides of a 12-cup mold with a very thin coating of butter. Line the bottom and sides with the ladyfingers. To do this, separate the ''double'' ladyfingers. Arrange enough of them in a petal-like, symmetrical arrangement over the bottom, cutting them to fit. Remember to place them smooth surface down so that when the charlotte is unmolded, this surface will appear on top. Line the sides of the mold with ladyfingers, smooth surface against the side of the mold. Arrange the ladyfingers close together and trim each ladyfinger as necessary so that it fits neatly, top and bottom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the custard mixture and place in the refrigerator. Chill several hours or overnight, until the custard is set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, dip the mold in hot water and remove immediately. A damp, hot cloth should also be used on the mold to help loosen it. Unmold and serve."}], "link": "https://cooking.nytimes.com/recipes/6219-charlotte-nesselrode"}