{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Niçoise", "description": "", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "lunch, quick, pastas", "keywords": "garlic, pasta, rigatoni, tuna fillet, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 787, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "98 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "7 grams", "proteinContent": "50 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1035 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 head garlic, cloves separated but not peeled", "3 tablespoons olive oil", "Salt and freshly ground black pepper", "1 pound rigatoni", "1 pound tuna steak, 1 inch thick and cut in 1-inch cubes", "1 1/2 cup haricots verts or other thin green beans, trimmed", "2 tablespoons extra virgin olive oil", "Juice of half a lemon, or more if desired", "Grated rind of half a lemon, optional", "1 pound (about 6 medium) tomatoes, blanched, peeled and coarsely chopped", "16 marinated anchovies (available in specialty food stores)", "1/2 cup chopped parsley", "1 cup loosely packed fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large pot of water for pasta over high heat. Place a small saucepan of water over high heat. When small pan comes to a boil, add garlic and boil for 5 minutes. Cool, then peel. Place a large skillet over medium heat, warm the 3 tablespoons olive oil, and saut&#233; garlic until golden and caramelized. Drain on paper towels, reserving oil in skillet; set skillet aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When large pot of water comes to a boil, lightly salt it and add rigatoni; cook to taste, 12 to 15 minutes. While pasta cooks, place the skillet over medium-high heat, and add tuna. When tuna is seared but still pink inside, transfer to a plate. Add the beans to the skillet. When beans are cooked, drain off the olive oil (leave beans in pan) and add the extra virgin olive oil, the juice of half a lemon and the lemon rind. Stir, and add tomatoes, garlic, tuna, anchovies, parsley and half the basil leaves. Season with salt and pepper and more lemon juice to taste, if desired. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain pasta well, and transfer to a large warm bowl. Add tuna mixture, and toss gently to mix. Garnish with remaining basil leaves, and serve."}], "link": "https://cooking.nytimes.com/recipes/6224-pasta-nicoise"}