{"@context": "http://schema.org", "@type": "Recipe", "name": "Griot (Spicy Pork Shoulder)", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "caribbean", "recipeCategory": "dinner, project", "keywords": "boneless pork shoulder, lemon juice, lime juice, pork, white vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1237, "unsaturatedFatContent": "51 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "92 grams", "fiberContent": "2 grams", "proteinContent": "89 grams", "saturatedFatContent": "32 grams", "sodiumContent": "1427 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["4 1/2 pounds pork shoulder, cut into 2-inch stew pieces by your butcher", "7 tablespoons distilled white vinegar", "4 tablespoons lemon juice, the squeezed halves of 1 lemon reserved", "4 tablespoons lime juice, the squeezed halves of 1 lime reserved", "3 tablespoons hot sauce", "2 sprigs parsley", "1 scallion", "1/2 small green bell pepper, thinly sliced", "2 tablespoons tomato paste", "Kosher salt and freshly ground black pepper", "1/4 Spanish onion, peeled and thinly sliced", "1/2 small carrot, peeled and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil, then lower the heat to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the pork, 2 tablespoons of the vinegar, the lemon juice and 3 tablespoons of the lime juice and toss until well mixed. Rub the pork all over with the insides of the lemon and lime halves, then put the halves and 4 tablespoons of the vinegar into a pot of simmering water. Place the pork in a colander, rinse well under hot water, then add it to the pot and simmer, uncovered, for 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the colander in the sink, drain the pork and rinse well with hot water. Clean and dry the pot, return the pork to it and stir in the remaining 1 tablespoon vinegar, remaining 1 tablespoon lime juice, the hot sauce, parsley, scallion, half of the bell pepper, the tomato paste and 2 cups water and season with salt and pepper to taste. Place over medium heat and cook, covered, for 20 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Using a slotted spoon, transfer the pork to a roasting pan and bake until well browned and tender, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the cooking liquid from the pot into a small saucepan and remove the parsley and scallion. Add the remaining bell pepper, the onion, carrot and 1 cup water. Bring to a boil, lower the heat and simmer until vegetables are very tender, about 10 minutes. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pork from the oven, transfer to a serving platter and pour the cooking liquid over the pork. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/6260-griot-spicy-pork-shoulder"}