{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Broccoli Rabe and Acorn Squash", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "acorn squash, arborio rice, broccoli rabe, chicken stock, dry white wine, parmesan, fall, high fiber, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 632, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "88 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "8 grams", "proteinContent": "22 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1547 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 medium acorn squash, peeled, seeded and cut into 1/4-inch cubes (about 3 cups)", "Kosher salt and freshly ground black pepper to taste", "4 1/2 cups homemade chicken stock", "1 tablespoon butter", "1/2 onion, chopped", "1 bunch (1 pound) broccoli rabe, well rinsed and tough stems removed", "1 1/2 cups Arborio rice", "1 cup white wine", "1 1/2 teaspoons lemon zest", "1/2 cup freshly grated Parmesan, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saute pan, heat 1 tablespoon of the olive oil over medium heat and add the squash. Cook, shaking the pan frequently, until the squash is softened but not mushy, about 5 minutes. Season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the stock in a saucepan on the back of the stove and adjust the heat so that it is just below a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large, heavy-bottomed pot, heat the remaining tablespoon of olive oil and 1 tablespoon of butter over medium-high heat and add the onion. Cook, stirring, until the onion becomes translucent, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rabe and continue to cook for another few minutes until it is somewhat reduced in volume. Add the rice and toss until well coated. Add the wine and cook, stirring, until it is almost completely evaporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One cup at a time, add 3 cups of the stock, letting the liquid all but evaporate between each addition and stirring constantly. (Lower the heat if necessary to keep the rice from sticking.) Add a fourth cup of stock along with the squash and continue to cook, stirring, until the mixture is almost completely dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat and stir in the lemon zest, Parmesan and final 1/2 cup of stock. Season to taste with salt and pepper and cook, stirring, for a minute or two more until the mixture becomes creamy. Remove from the heat and serve immediately with Parmesan on the side."}], "link": "https://cooking.nytimes.com/recipes/6301-risotto-with-broccoli-rabe-and-acorn-squash"}