{"@context": "http://schema.org", "@type": "Recipe", "name": "Periyali's Greek Rice Pudding", "description": "This dish is called rizogalo, or Greek rice pudding. Though it is a simple dessert that is usually served cold, rizogalo is actually cooked the same way as risotto: the rice is simmered slowly and must be stirred constantly to massage the starch out of the grains and to attain a creamy, toothsome consistency.\n\nAnd though New Yorkers don't carry on about it, it has been with them for many years, all over the city. It is a mainstay on sophisticated menus at Molyvos in midtown and Periyali in the Flatiron district, where it is mounded in a bowl and splashed with cinnamon.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "greek", "recipeCategory": "", "keywords": "cinnamon, heavy cream, milk, rice, dessert, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 167, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "5 grams", "sodiumContent": "58 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["4 cups whole milk", "1 2-inch piece lemon peel", "1/3 cup Carolina long-grain rice", "1 egg yolk", "1/4 cup sugar", "1/3 cup heavy cream", "1/2 teaspoon vanilla extract", "Ground cinnamon, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy 4-quart saucepan, combine the milk, lemon peel and rice. Bring to a boil; reduce heat and simmer, stirring frequently, until the rice is soft to the bite but still retains its shape, about 45 minutes. Remove rice from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the egg yolk and sugar. Rapidly stir a spoonful of the rice mixture into the yolk mixture. Stir the yolk mixture into the pan of rice, mixing steadily to prevent the yolk from curdling. Reduce the heat to low, and cook, stirring constantly, 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cream, and cook, stirring, until the mixture is steaming. Remove from heat, and discard lemon peel. Stir in vanilla. Continue to stir until the mixture has cooled slightly; then press a piece of plastic wrap directly onto the surface of the rice to prevent a skin from forming. Serve warm or at room temperature, spooned into bowls and sprinkled with cinnamon."}], "link": "https://cooking.nytimes.com/recipes/6313-periyalis-greek-rice-pudding"}