{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Sausage Gumbo", "description": "This recipe came to The Times in 1983 from Paul Prudhomme, the New Orleans chef who put Louisiana on the American culinary map. It is a hearty, rich Creole stew generously seasoned with black and white pepper, cayenne, paprika and filé powder, a spice made from the leaves of the sassafras tree. Filé powder is readily available in most grocery stores and online, and while it's not 100 percent necessary, it lends a distinctive, earthy quality to the dish. Mr. Prudhomme intended this to be made with chicken, but we've had excellent results using leftover turkey from Thanksgiving, too.", "author": {"@type": "Person", "name": "Paul Prudhomme"}, "image": "https://static01.nyt.com/images/2017/01/30/dining/30COOKING-CHICSAGE-GUMBO1/30COOKING-CHICSAGE-GUMBO1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 or more servings", "recipeCuisine": "cajun, creole, southern", "recipeCategory": "dinner, project, sauces and gravies", "keywords": "celery, chicken, chicken broth, file powder, flour, green pepper, poultry, rice, smoked sausage, spices, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 672}, "recipeIngredient": ["1 chicken, 3 to 4 pounds, cut into serving pieces", "Salt to taste if desired", "1 teaspoon finely ground black pepper", "1 1/4 teaspoons finely ground white pepper", "1 teaspoon powdered mustard", "1 1/2 teaspoons cayenne pepper", "1 1/2 teaspoons paprika", "1 teaspoon granulated garlic", "1 teaspoon file powder, optional", "1 1/2 cups flour", "2 1/2 cups corn, peanut or vegetable oil", "3/4 cup finely chopped onion", "3/4 cup finely chopped celery", "3/4 cup finely chopped green pepper", "9 cups chicken broth", "1 3/4 cups chopped or thinly sliced smoked sausage such as andouille or kielbasa", "1 bay leaf", "1 teaspoon finely minced fresh garlic", "2 cups cooked rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken pieces in a bowl. Blend salt, peppers, mustard, cayenne pepper, paprika, granulated garlic and file powder. Rub four teaspoons of the mixture over the chicken. Set rest of spice mixture aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour in a bowl and add two teaspoons of the reserved spice mixture. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 10-inch skillet and add the oil. Dredge the chicken pieces in the flour mixture to coat well, shaking off excess. Reserve the leftover flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil is hot and almost smoking, add the chicken pieces skin side down. Cook about two minutes on one side until golden brown. Turn and cook about three minutes on the second side until nicely browned. Do this in batches so as to not crowd the pan. Drain thoroughly on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but one cup of fat from the skillet. Heat this oil over high heat until it is almost smoking and add the reserved seasoned flour. Stir rapidly and constantly with a wire whisk until the mixture is golden brown. Do not burn. This is a roux."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chopped onion, celery and green pepper to the roux and stir to blend well. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring the broth to a boil in a large saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add about half a cup of the roux mixture to the broth, stirring rapidly with the whisk. Continue adding the roux mixture, half a cup at a time, always stirring rapidly and constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the smoked sausage and stir. Cook over high heat, stirring often from the bottom, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken pieces, bay leaf and finely minced fresh garlic. Cook about 40 minutes, on medium-low, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken pieces. Cut the meat from the bones and discard the bones. Cut the chicken into cubes or shred it and add it back to the pot. Serve with white rice or potato salad (or both) spooned into the gumbo."}], "link": "https://cooking.nytimes.com/recipes/6341-chicken-and-sausage-gumbo"}