{"@context": "http://schema.org", "@type": "Recipe", "name": "Maida Heatter's Chocolate Cheesecake Brownies", "description": "The year: 1983. The place: Williamsburg, Va., where representatives from across the globe — and “some of the biggest and brightest names on the American culinary scene” — gathered. The Times’s own Craig Claiborne planned the menus; Paul Prudhomme, Wolfgang Puck and Zarela Martinez cooked; and Maida Heatter provided dessert. Among her offerings were these, chocolate cheesecake brownies, “a formidable new creation” for the time. Here, a layer of pecan-studded brownie meets a sheet of chocolate cheesecake. Make them for a group — or for yourself to eat over time. They freeze well, and can just as well be served frozen.", "author": {"@type": "Person", "name": "Maida Heatter"}, "image": "https://static01.nyt.com/images/2015/12/21/dining/21COOKING_CHOCCHEESECAKE/21COOKING_CHOCCHEESECAKE-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "16 square brownies or 32 bars or triangles", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "almond extract, butter, cocoa powder, coconut flakes, cream cheese, egg, flour, pecans, sugar, unsweetened chocolate, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 265}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "91 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces (1 stick) unsalted butter, plus butter for greasing the pan", "2 ounces unsweetened chocolate", "Pinch of salt, if desired", "1 cup sugar", "1/2 teaspoon pure vanilla extract", "2 large eggs", "1/3 cup unsifted all-purpose flour (bleached or unbleached)", "1 cup toasted pecan halves (see note)", "1/2 cup packed shredded coconut", "8 ounces cream cheese, at room temperature", "1/2 cup sugar", "2 tablespoons unsweetened cocoa powder", "1/2 teaspoon pure vanilla extract", "A few drops almond extract, optional", "2 large eggs", "1 tablespoon flour", "Cocoa powder, either sweetened or unsweetened, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust a rack one-third up from the bottom of the oven and preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a 9-by-9-by-1 3/4-inch pan as follows: Turn the pan upside down. Center a 12-inch square of aluminum foil over the pan and fold down the sides and corners to shape the foil. Then turn the pan right side up. Place the foil in the pan and gently press it into place. Place a piece of butter in the pan, heat it in the oven to melt and then brush it all over with a pastry brush or spread it with crumbled wax paper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the brownie layer, place the chocolate and butter in a 2- to 3-quart heavy saucepan over low heat and stir occasionally until melted. Stir in the salt, sugar and vanilla. Remove from heat and stir in the eggs one at a time. Add the flour and stir well to mix, then stir in the pecans and coconut. Turn the batter into the prepared pan and smooth the top. Let stand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the cheesecake layer, beat the cheese in the small bowl of an electric mixer until it is soft. Add the sugar, two tablespoons cocoa powder, vanilla and almond extracts, eggs and flour, one at a time, beating until incorporated after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the cheesecake mixture in a ribbon over the top of the brownie layer. Smooth the top. Then marbleize the two mixtures slightly as follows: Insert the handle end of a teaspoon almost but not completely to the bottom in one corner of the pan and, with the flat side of the handle, cut through the batter in a wide zigzag pattern. Smooth the top again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for about 40 minutes until a toothpick gently inserted in the middle comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool to room temperature. Then place in the freezer for about one hour until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with a piece of wax paper and, on top of that, a cookie sheet. Turn the pan and cookie sheet upside down, remove the pan and peel off the foil. Cover with a cutting board or another cookie sheet and then turn upside down again, leaving the cake right side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut into 16 large squares or 32 bars or triangles, wiping the blade with a damp cloth between cuttings. These may be wrapped individually in clear plastic wrap. But if they are not going to kept cold, using a sieve, sprinkle cocoa over the tops before wrapping to prevent sticking. Store these in the refrigerator or the freezer. They may be served frozen."}]}