{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai-Inspired Beef Salad With Mint", "description": "This salad, with Southeast Asian flair, takes mere minutes to make, even with cooking the beef. Its base is mesclun and a handful of flavorful, mild herbs, like parsley or mint. Because steak doesn't need any seasoning, cooking it takes only 10 minutes. You could substitute chicken, pork or shrimp. The vinaigrette that accompanies this salad is light but assertive, based not on olive oil but on a neutral-flavored oil like canola. I use relatively little oil, as its job is only to help the remaining dressing ingredients coat the greens. To this I add rice vinegar or lime juice, both of which are high in flavor but low in acidity. The vinaigrette is rounded off with mustard, shallots, and nam pla (Thai fish sauce) or soy sauce.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/12/dining/Minty-Thai-Beef-Salad/Minty-Thai-Beef-Salad-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick, weekday, times classics", "keywords": "beef, canola oil, mesclun, mint leaves, mustard, nam pla, rice vinegar, shallot, sirloin steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 206}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 461, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "31 grams", "saturatedFatContent": "9 grams", "sodiumContent": "538 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 to 1 1/2 pounds thick sirloin, rib-eye or other boneless steak", "6 to 8 cups mesclun greens", "1 cup mint leaves", "1/4 cup neutral oil, like canola", "1/4 cup rice vinegar or lime juice", "1 teaspoon mustard, optional", "1 chopped shallot, about 1 tablespoon", "2 tablespoons nam pla, or 1 tablespoon soy sauce mixed with 1 tablespoon water", "1/4 teaspoon or more freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you're grilling, start a charcoal fire or preheat a gas grill. Grill steak about 4 minutes a side for medium rare. (If you're cooking inside, preheat oven to its maximum, 450 to 500 degrees. Heat ovenproof skillet on stove over high heat until it smokes. Place steak in skillet, and transfer to oven. Roast about 4 minutes a side for medium rare.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, wash greens and toss with mint. Whisk or blend remaining ingredients together, taste, and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let steak rest for a minute before slicing, and then place it atop greens, with its juices. Dress with vinaigrette, and serve."}]}