{"@context": "http://schema.org", "@type": "Recipe", "name": "Fricassee of Squid and Potatoes", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner, one pot", "keywords": "cherry tomatoes, dry white wine, herbes de provence, new potatoes, oil-cured black olives, onion, parsley, squid, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 465, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "5 grams", "proteinContent": "27 grams", "saturatedFatContent": "5 grams", "sodiumContent": "476 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds squid, or a firm-fleshed fish like salmon or catfish", "4 tablespoons olive oil", "2 onions (about 8 ounces), peeled and sliced thin", "1 1/2 pounds tiny potatoes (the size of large cherry tomatoes), peeled", "4 large cloves garlic, peeled and chopped (1 tablespoon)", "1 teaspoons herbes de Provence or Italian seasoning", "1 pound cherry tomatoes, cleaned", "1/2 cup oil-cured black olive pieces (about 3 ounces)", "1/2 cup dry white wine", "3/4 teaspoon salt", "2 tablespoons coarsely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Be sure that the plastic-like pen, and all bones and cartilage, have been removed from the body of the squid and that the beak has been removed from the tentacles. If the black surface skin has not already been removed, pull it off and discard. Rinse the squid body and tentacles well under cool water and cut them into 1 1/2-inch pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a saucepan until hot but not smoking. Add the onion and saute it about 2 minutes. Add the potatoes, cover, and reduce the heat to low. Cook about 15 minutes, until the potatoes are tender. The recipe can be prepared to this point a few hours before serving and set aside in the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 10 to 15 minutes before serving, reheat the potatoes and add the squid, garlic, herbes de Provence, tomatoes, olives, wine and salt. Cover, bring to a boil, and cook for 3 to 4 minutes, removing the lid long enough to stir the mixture occasionally, just until the squid are tender when pierced with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the contents of the saucepan to a serving dish, sprinkle with the parsley and serve."}], "link": "https://cooking.nytimes.com/recipes/6387-fricassee-of-squid-and-potatoes"}