{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Chicken Curry", "description": "Weeknight cooking doesn't get any easier than this endlessly adaptable five-ingredient, 30-minute curry from Mark Bittman. Sauté a pile of chopped onions in a little oil, then stir in curry powder (or red curry paste for Thai flavors). Pour in a can of coconut milk and swirl to combine. Add chicken, simmer until it's cooked through and finish with some chopped tomatoes. And dinner is served! This recipe lends itself to experimentation, so change it up. Be generous with spices. Toss in chopped bell pepper or carrots with the onions. Add a can of drained chickpeas or a generous handful of fresh spinach with the tomatoes. Instead of chicken, try shrimp, duck, turkey, firm fish, tofu, lump crab meat or beef. Just watch the cooking time: Fish, shrimp and crab cook faster than other meats. Also, don't forget to season as you go with salt and pepper.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2018/03/01/dining/01COOKING-CHICKEN-CURRY1/01COOKING-CHICKEN-CURRY1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, easy, quick, weekday, one pot", "keywords": "basil, canola oil, curry powder, shrimp, tomato, unsweetened coconut milk, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2077}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 423, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "27 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1048 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons canola, corn or other neutral oil", "2 large onions, peeled and sliced", "Salt and freshly ground black pepper to taste", "2 teaspoons curry powder", "1 can unsweetened coconut milk (1 1/2 to 2 cups)", "1 1/2 pounds peeled shrimp or boneless chicken, cut into 3/4- to 1-inch chunks", "1 cup peeled, seeded and diced tomato (canned is fine; cut up and drain before using)", "Chopped basil or mint for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oil in a large skillet; turn heat to medium-high. A minute later, add onions, along with a generous pinch of salt and some pepper. Cook, stirring occasionally, until onions are very soft and almost falling apart, 15 minutes or more. Stir in curry powder, and cook, stirring, for another minute or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add coconut milk, and cook until it thickens, about 2 minutes, stirring occasionally. Add chicken, and stir, then cook until done, 3 to 6 minutes. (If you use shrimp, keep in mind that it cooks a little faster than chicken; if you are in doubt about whether chicken is done, cut into a piece.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomato, and cook another minute; adjust seasonings as necessary. Serve over rice, garnished with basil or mint, if desired."}], "link": "https://cooking.nytimes.com/recipes/6393-easy-chicken-curry"}