{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Coconut Noodles", "description": "Coconut milk brings distinctive flavor and creamy heft to these rice noodles, which are stir-fried with pork or chicken, bell pepper and eggplant. Be generous when you're seasoning the dish with nam pla (fish sauce), which adds umami and some welcome funk. No nam pla? Use soy sauce instead.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/04/11/dining/11COOKING-COCONUT-NOODLES/11COOKING-COCONUT-NOODLES-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy", "keywords": "canola oil, cilantro leaves, eggplant, garlic, ground pork, nam pla, red bell pepper, rice noodles, unsweetened coconut milk, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 178}, "recipeIngredient": ["3/4 pound linguine-style rice noodles", "3 tablespoons canola, corn or other neutral oil", "1 pound minced or ground boneless pork or chicken", "1 yellow or red bell pepper, seeded and minced", "1 eggplant, about 1/2 pound, cut into 1/2-inch cubes", "1 tablespoon minced garlic", "1 can unsweetened coconut milk (1 1/2 to 2 cups)", "Nam pla (fish sauce), soy sauce or salt, to taste", "Freshly ground black pepper, to taste", "Minced cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using rice noodles, soak them in very hot water to cover until ready to add to stir-fry in Step 4. If using linguine, bring a large pot of water to a boil, salt it, and cook pasta until it is nearly but not quite done. Drain, and rinse in cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place 1 tablespoon of the oil in a large skillet or wok; turn heat to high. A minute later, add meat, and cook, stirring occasionally, until browned, about 5 minutes. Remove with slotted spoon; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon of the oil to skillet, followed by bell pepper and eggplant. Cook over medium-high heat, stirring occasionally, until both are browned and tender, about 10 minutes. Remove with slotted spoon; combine with meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining tablespoon of oil, followed immediately by the garlic and about 30 seconds later, the coconut milk. Cook over medium-high heat, stirring and scraping with a wooden spoon, for about a minute. Add drained noodles along with meat and vegetables, and cook until noodles absorb most of the coconut milk, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with nam pla to taste, then add plenty of black pepper. Garnish with cilantro, and serve."}]}