{"@context": "http://schema.org", "@type": "Recipe", "name": "Gin and Tonic", "description": "This refreshing summer cocktail for a crowd came to The Times by way of Toby Cecchini, a bartender and the inventor of the once ubiquitous cosmopolitan cocktail. This recipe originated with his father, Andrea Cecchini, a research chemist who “brought his scrutiny to bear on cocktails.” A few things the senior Mr. Cecchini would insist upon here: Use a pitcher because proportion is crucial, and you need plenty of room for the ice, tonic and limes. The limes should be room temperature. The tonic chilled, and the ice cracked, preferably by hand. Of course, do what you can, and if you want to make a single cocktail, simply divide the amounts by four (use the juice of one lime per cocktail and have another on hand for garnish). Toby likes to use Tanqueray for “its punchy botanicals and authority; it is 94 proof to the more common 80, making it cantankerous in a martini, but perfect for a G and T.”", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": "https://static01.nyt.com/images/2019/05/26/dining/14COOKING_GINANDTONIC/14COOKING_GINANDTONIC-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "gin, lime, tonic water", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "recipeIngredient": ["5 limes, room temperature", "16 ounces of gin", "Cracked ice", "1 liter tonic water, chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead 4 of the limes on a cutting board, then juice. Slice used rinds into thin strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large pitcher, combine gin and rinds, and muddle for two minutes. Add lime juice, and let stand for five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill pitcher halfway with ice. Slowly add tonic. Mix carefully, and pour into tall, chilled highball glasses. Garnish with lime rounds cut from the remaining lime."}], "link": "https://cooking.nytimes.com/recipes/6420-gin-and-tonic"}