{"@context": "http://schema.org", "@type": "Recipe", "name": "Terrine of Rabbit in Aspic", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project", "keywords": "appetizer, main course, carrot, chicken stock, cognac, dry white wine, garlic, gelatin, herb sprigs, onion, pearl onions, rabbit, shallot, tarragon vinegar", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 380, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "37 grams", "saturatedFatContent": "3 grams", "sodiumContent": "828 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 rabbit, about 3 pounds, cut up", "2 cups dry white wine", "1 sprig fresh thyme", "1 sprig fresh rosemary", "2 cloves garlic, peeled and chopped", "2 shallots, diced", "Salt and freshly ground black pepper to taste", "2 tablespoons extra virgin olive oil", "5 medium-size carrots, trimmed and scraped", "1 medium-size onion, sliced", "5 tablespoons Cognac", "2 tablespoons tarragon vinegar", "Leaves from 4 sprigs fresh tarragon", "1 cup tiny pearl onions, peeled", "1 1/3 cups greaseless chicken stock", "1 envelope plain gelatin", "2 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rabbit in a bowl. Combine one cup of the wine with the thyme, rosemary, one clove garlic, shallots, salt and pepper, pour over the rabbit and allow to marinate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Heat the olive oil in a heavy casserole. Cut one of the carrots into thick slices and stir in with the sliced onion. When the vegetables begin to color, stir in the remaining garlic. Drain the rabbit pieces and reserve the marinade. Pat the rabbit pieces dry on paper towels and add them to the casserole. Stir them around for a few minutes, then strain the marinade into the casserole. Add three tablespoons of the Cognac."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a simmer, cover and place in the oven to braise for 1 hour 15 minutes, until the rabbit is tender. Allow to cool to room temperature in the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat from the bones, keeping it in chunks. Season with salt and pepper to taste, sprinkle with vinegar and toss with the tarragon leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the remaining four carrots into quarters lengthwise, and then into 1-inch pieces. Place the carrots and pearl onions in a saucepan with the chicken stock and simmer about eight minutes, until just tender. Remove vegetables from the pan with a slotted spoon and mix gently with the rabbit. Reserve the stock, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soften the gelatin in water, then dissolve in the hot reserved stock. Stir in the remaining white wine and Cognac. Taste for seasoning and add salt if necessary. Pour the sauce over the rabbit and vegetables, mix gently and then transfer to a 5- to 6-cup terrine or glass bowl. Refrigerate until set. Serve as a first course or luncheon dish with a small salad such as mache in vinaigrette dressing."}], "link": "https://cooking.nytimes.com/recipes/6429-terrine-of-rabbit-in-aspic"}