{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Mushroom Lasagna", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H50M", "recipeYield": "Six servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles, pastas", "keywords": "cepes, dried cepes, garlic, lasagna noodles, mushroom, parmesan, part-skim ricotta, pasta, sage, thyme, main course, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 407, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "7 grams", "proteinContent": "22 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1133 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["3 ounces dried cepes", "2 quarts water", "1 1/2 teaspoons olive oil", "2 onions, peeled and minced", "2 cloves garlic, peeled and minced", "1 pound fresh cepes or shiitake mushrooms, stemmed and coarsely chopped", "1 pound fresh domestic mushrooms, stemmed and coarsely chopped", "2 tablespoons minced fresh thyme leaves", "2 1/2 teaspoons salt, plus more to taste", "1 teaspoon freshly ground pepper, plus more to taste", "2 cups part-skim-milk ricotta", "1 tablespoon minced fresh sage leaves", "12 lasagna noodles, parboiled", "2 tablespoons grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine dried cepes and water in a saucepan. Simmer gently over medium heat until reduced to 4 cups, about 1 hour. Drain cepes, reserving liquid. Set aside 1 3/4 cups of the cepes broth. Place remaining broth in saucepan over medium-high heat and reduce to 1 cup. Coarsely chop drained cepes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 teaspoon olive oil in a large, nonstick skillet. Add the onions and garlic and cook over medium-low heat until soft, about 7 minutes. Place half of the onions in a medium bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons of the unreduced cepes broth and half of the fresh mushrooms to the skillet. Increase heat to medium-high and saute until mushrooms release their liquid, about 6 minutes. Transfer mushroom mixture to a bowl. Repeat with 2 tablespoons broth and remaining mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all mushrooms, including cepes, to the skillet. Stir in remaining unreduced cepes broth. Simmer 15 minutes. Stir in thyme, 1 1/2 teaspoons salt and 1 teaspoon pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Stir ricotta, sage and remaining salt into reserved onions. Brush the inside of a 12-by-7 1/2 baking dish with the remaining oil. Cover the bottom with a layer of lasagna noodles, trimming to fit as necessary. Spread half the ricotta mixture over the noodles. Sprinkle with 1 tablespoon Parmesan. Cover with half of the mushroom mixture. Repeat the layers. Sprinkle the top with remaining Parmesan. Pour the reduced cepes broth over all. Cover with foil. Bake until tender, about 1 hour."}], "link": "https://cooking.nytimes.com/recipes/6438-wild-mushroom-lasagna"}