{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Cod Broiled With Miso", "description": "Black cod with miso was not invented by Nobu Matsuhisa, the chef at Nobu in TriBeCa, but he certainly popularized it. His time-consuming recipe, which calls for soaking the fish in a sweet miso marinade for a couple of days, is a variation on a traditional Japanese process that uses sake lees, the sweet solids that remain after making sake, to marinate fish. If you broil black cod with nothing but salt, you already have a winning dish. If you broil it with miso – the intensely salty paste made from fermented soybeans – along with some mirin and quite a bit of sugar, you create something stunningly delicious. And no long marination is necessary.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/04/25/dining/25COOKING-FISHWITHSAUCE2/25COOKING-FISHWITHSAUCE2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "black cod fillets, fish, mirin, miso, low-fat, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 710}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 419, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "43 grams", "saturatedFatContent": "1 gram", "sodiumContent": "2672 milligrams", "sugarContent": "29 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup sugar", "1 cup miso, preferably dark", "1/2 cup mirin, sake or white wine", "1 1/2 to 2 pounds black cod fillets (skin may be on or off)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler; set rack 3 to 4 inches from heat source. Combine first three ingredients in a small saucepan and, over low heat, bring almost to a boil, stirring occasionally just until blended; mixture will be fairly thin. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put fillets in an ovenproof baking dish or skillet, preferably nonstick, and spoon half the sauce on top. Broil until sauce bubbles and begins to brown, then spoon remaining amount over fish. Continue to broil, adjusting heat or rack position if sauce or fish is browning too quickly, until fish is just cooked through. Serve immediately."}]}