{"@context": "http://schema.org", "@type": "Recipe", "name": "Frisee Aux Lardons", "description": "", "author": {"@type": "Person", "name": "Rick Marin"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "brunch, salads and dressings", "keywords": "appetizer, bacon, cantal cheese, dijon mustard, eggs, french baguette, frisée, lemon juice, white vinegar", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1039, "unsaturatedFatContent": "70 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "94 grams", "fiberContent": "3 grams", "proteinContent": "22 grams", "saturatedFatContent": "21 grams", "sodiumContent": "898 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cloves garlic, peeled and chopped", "2 1/4 cups extra virgin olive oil", "Salt and freshly ground black pepper", "1 baguette or crusty Italian loaf", "16 slices bacon", "1/4 cup Dijon mustard", "1/2 cup fresh lemon juice", "1 tablespoon sugar", "1/2 teaspoon ground white pepper", "1/2 cup white vinegar", "6 to 8 large eggs (1 egg per serving)", "6 to 8 small bunches (1 bunch per serving) Italian frisee, washed and dried", "1/4 pound Cantal or Gruyere cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. In a small mixing bowl, combine garlic, 1/4 cup of the olive oil, and salt and black pepper to taste. Slice the bread thinly on the diagonal, to make ovals 3 inches long; 3 per serving will be needed. Brush both sides of the bread with the oil mixture, and place on a baking sheet. Bake until golden brown, about 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of water to a boil, add bacon, blanch 30 seconds, then remove and drain well. Dice bacon into 1-inch pieces. Place a medium saute pan over medium heat, add bacon and saute until browned. Then, remove the pan from heat. Discard the fat, then set aside the bacon in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium mixing bowl, combine mustard, lemon juice, sugar and white pepper. Mix well. Slowly whisk in the remaining 2 cups olive oil until well blended. Season with salt to taste. Add half the mixture to the pan with the bacon, and stir. Reserve the remaining vinaigrette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium nonreactive saucepan, combine 4 cups water with vinegar and 1 1/2 teaspoons salt. Bring to a boil, then reduce heat to low. One at a time, gently break each egg into the water. Simmer just until whites are firm, about 3 minutes. Remove with a slotted spoon, and drain well in a colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine frisee with bacon mixture. To serve, place an equal amount of frisee in a mound in the center of each plate. Slant three croutons on top so that they touch at the center of the plate over the frisee."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a cheese or vegetable peeler, cut slices of the cheese, placing one over each crouton. Place a poached egg on top of each salad, right where the croutons come together. Drizzle some of the reserved vinaigrette around the edge of each plate. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/6478-frisee-aux-lardons"}