{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Guinea Hen", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "Enough for 2 for dinner and lunch the next day", "recipeCuisine": "", "recipeCategory": "dinner, weekday, sauces and gravies", "keywords": "garlic, guinea hen, olive oil, poultry, thyme, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "recipeIngredient": ["1 guinea hen, about 4 pounds, rinsed and patted dry (if you have the time, place on a baking rack, uncovered, in the refrigerator for 24 hours)", "4 teaspoons olive oil", "3/4 teaspoon coarse sea salt", "1/2 teaspoon coarsely ground black pepper", "2 tablespoons fresh thyme leaves", "3 cloves garlic, skin left on and lightly crushed", "1 cup chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Place the guinea hen in an iron skillet large enough for it to fit or in a heavy roasting dish. (Enameled cast iron is best.) Using your hands, rub 2 teaspoons of the olive oil all over the bird, inside and out. Season again all over with salt and pepper. Sprinkle with thyme leaves. Scatter the garlic cloves around the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and roast 15 minutes. Drizzle with the remaining olive oil and roast, basting every 10 minutes with pan drippings, until a thermometer inserted in the thickest part of the thigh reads 160 degrees; this should take 40 to 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the hen from the oven and transfer to a cutting board. Drain excess fat (leaving some!) from the pan and place over medium-high heat. Pour in the chicken broth. Using a wooden spoon, scrape up the pan drippings and bring to a boil. Reduce until the sauce is syrupy. Add salt and pepper to taste. Cut the hen into 6 pieces and pour the juices from the cutting board back into the sauce. Serve on a platter and pass the sauce with a big spoon."}], "link": "https://cooking.nytimes.com/recipes/6483-roasted-guinea-hen"}