{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Stew Marengo", "description": "", "author": {"@type": "Person", "name": "Mimi Sheraton"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "dry white wine, mushroom, olive oil, shallot, tomatoes, veal, veal shoulder, veal stock, white onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 671, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "6 grams", "proteinContent": "43 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1358 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds well trimmed veal shoulder, cut in 2-inch pieces", "Salt and black pepper", "1/2 cup olive oil, or as needed", "1/2 pound mushrooms, coarsely chopped", "12 to 15 small white onions", "4 tablespoons unsalted butter", "1 1/2 tablespoons flour", "2 cloves garlic, minced", "3 shallots, minced", "1 cup dry white wine", "1 cup hot veal stock or hot water", "3 sprigs parsley", "1 bay leaf", "Pinch of leaf thyme", "2 large tomatoes, peeled, seeded and diced, or 2 canned tomatoes, well drained and diced", "1 or 2 teaspoons tomato puree (not paste), if needed", "About 12 slices toasted round of French bread rubbed with garlic", "Minced parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry veal pieces with paper towel, then sprinkle lightly on all sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in heavy Dutch oven or casserole. When it begins to smoke add layer of veal. Pieces should not touch each other. Brown over moderate heat, turning pieces so they brown evenly. When first batch is brown, remove and reserve. Add second batch and continue until brown. Add more oil if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add mushrooms to pan and brown quickly. When juice subsides, remove mushrooms. Add onions to pan and stir in hot fat until golden brown on all sides. Remove from pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil from pot leaving about 2 tablespoons. Return veal to pan and add butter. Stir over low heat until butter melts. Sprinkle veal with flour. Saute over moderate heat and stir with wooden spoon until flour is absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, shallots, wine, stock or water, parsley, bay leaf, thyme and tomatoes. Bring to boil. Cover pan, reduce heat and simmer gently but steadily for about 45 minutes or until meat is almost entirely tender. Add more wine and stock if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return mushrooms and onions to pan and cook for 30 minutes or until meat and onion are tender. Adjust seasonings, remove bay leaf and parsley, and skim fat from surface of sauce. If sauce seems thin, or if color needs brightening, stir in tomato puree and simmer for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn into serving dish and top with minced parsley and toasted French bread. Boiled potatoes, green noodles or rice are optional garnishes."}]}