{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Braised In Milk And Cream", "description": "", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "boneless pork loin, fatback, garlic, half and half, heavy cream, lemon, milk, pork, sage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1263, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "104 grams", "fiberContent": "5 grams", "proteinContent": "57 grams", "saturatedFatContent": "55 grams", "sodiumContent": "1564 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds pork loin, seasoned to taste, larded with fatback and tied", "1 tablespoon chopped fresh sage", "1 tablespoon chopped garlic", "Kosher salt and freshly ground black pepper", "1 tablespoon olive oil", "2 cups milk", "2 cups half-and-half", "2 cups heavy cream", "3 lemons", "3 tablespoons butter", "20 cloves garlic (from about 2 heads), peeled and lightly crushed", "20 sage leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pork in a container, and rub all over with chopped sage and chopped garlic. Cover, and refrigerate overnight. The next morning, bring to room temperature. Scrape off and discard sage and garlic; season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep, heavy casserole or Dutch oven fitted with a lid, heat olive oil over medium-high heat. Add pork loin, and brown very well on all sides, about 20 minutes. Meanwhile, in a saucepan, combine milk, half-and-half and cream. Bring to a boil, then shut off heat. Using a vegetable peeler, remove peel from lemons in long strips. Set peel aside, and reserve fruit for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pork is browned, transfer it to a plate and discard fat that's in casserole. Reduce heat to medium, and add butter to pan. When it is foamy, add garlic cloves. Stir until lightly browned on edges. Add sage leaves, and stir to coat. Put pork back in casserole, and pour in enough of the warm milk mixture to come 1/2 to 2/3 up the sides of pork. Bring to a simmer, add lemon zest and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partly cover, and simmer until an instant-read thermometer registers 140 degrees (about 15 to 30 minutes; cooking time will vary according to shape of roast and degree of browning). Liquid will form a skin and custard around pork. Shut off heat, and allow to cool. Cover, and refrigerate until shortly before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove pork from milk mixture and carve into 1/8-inch slices. Meanwhile, place casserole over medium heat and reduce liquid to a soupy custard. While the liquid is still a little loose, return sliced pork to casserole and spoon sauce on top. Allow pork to heat through. Serve, spooning some custard, lemon zest and sage on top and sprinkling with coarse salt."}], "link": "https://cooking.nytimes.com/recipes/6509-pork-braised-in-milk-and-cream"}