{"@context": "http://schema.org", "@type": "Recipe", "name": "Stewed Spicy Chicken With Lemongrass And Lime", "description": "This wildly flavorful chicken dish is inspired by the bright flavors found in Thai cooking – garlic, galangal (or ginger), chiles, turmeric, cilantro and lemongrass. While its flavor profile is complex, it is blessedly easy to make. Just sauté the savories, herbs and spices and add the chicken to the pan. Allow it to cook, covered, for about 20 to 30 minutes. Remove the lid, let the chicken brown a bit, and that's it. Serve over rice so you don't miss out on a single drop of the exquisite sauce.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/12/dining/12COOKING-SPICYCHICKEN1/12COOKING-SPICYCHICKEN1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday", "keywords": "chicken, chili, cilantro, dried cilantro, galangal, garlic, lemongrass, lime leaves, nam pla, poultry, sugar, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "1 gram", "proteinContent": "45 grams", "saturatedFatContent": "10 grams", "sodiumContent": "920 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons peanut or vegetable oil", "1/2 cup minced shallot", "1 tablespoon minced garlic", "1 tablespoon minced galangal or ginger", "1 teaspoon minced hot chili, or crushed red pepper flakes, or to taste", "1 teaspoon turmeric", "1 teaspoon ground dried cilantro", "1 teaspoon sugar", "2 stalks lemongrass", "1 3-pound chicken, cut into serving pieces", "Salt and freshly ground black pepper", "1 tablespoon minced lime leaves or zest", "2 tablespoons nam pla", "1/4 cup minced cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the oil in a large, deep skillet and turn the heat to medium. Add the shallot, garlic, ginger and chilies and cook, stirring frequently, until the vegetables are tender and the mixture pasty. Add the turmeric, cilantro and sugar and cook, stirring, for another minute. Trim the lemongrass stalks of their toughest outer layers, then bruise them with the back of a knife; cut them into sections and add them to the mixture along with 1 cup water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken and turn it once or twice in the sauce, then nestle it in the sauce; season with a little salt and pepper. Turn the heat to low and cover the skillet. Cook, turning once or twice, until the chicken is cooked through, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the skillet and raise the heat to medium-high; turn the chicken skin-side down. Let most (but not all) of the liquid evaporate and brown the chicken just a little on the bottom. Stir in the lime leaves and nam pla; taste and adjust seasoning as necessary, then garnish and serve with white rice."}]}