{"@context": "http://schema.org", "@type": "Recipe", "name": "Philippe Bertineau's Chilled Heirloom Tomato Soup", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "project, soups and stews", "keywords": "aniseed, beefsteak tomatoes, bouquet garni, coriander seeds, dry fennel sticks, fennel, fennel seeds, guacamole, leek, red bell pepper, appetizer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 209, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "7 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1034 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 large leek, white part only, split, rinsed well, coarsely chopped", "1 stalk celery, coarsely chopped", "1 small bulb fennel, coarsely chopped", "1 medium red bell pepper, stemmed, ribs removed, seeded and coarsely chopped", "1/2 medium Spanish onion, coarsely chopped", "1/2 bulb garlic, unpeeled, cut crosswise in half and crushed gently", "1 sprig thyme, 1 sprig rosemary, 1/4 bunch parsley, 3 sprigs basil, 3/4-inch-diameter bundle of dry fennel sticks, all tied together with kitchen string", "3/4-inch-diameter of dry fennel sticks, all tied together with kitchen string", "1 tablespoon anise seeds, 1 tablespoon fennel seeds, 1 teaspoon coriander seeds, all placed on a thick square of cheesecloth, gathered into a bundle and tied with kitchen string", "15 large, ripe Carmello or beefsteak tomatoes, each cut into 8 pieces", "Salt and freshly ground white pepper to taste", "Tabasco sauce to taste", "Celery salt to taste", "6 ounces guacamole"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large saucepan over medium heat, add the vegetables (but not the tomatoes). Cover and sweat for 10 minutes, until soft but not brown. Add the bouquets garnis and tomatoes to 3 cups water. Bring to a boil and cook for 15 minutes, until the tomatoes are softened but not overcooked, then season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a large heatproof bowl and cool in a container of ice and water. (This will allow the tomatoes to retain their color.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bouquets garnis and, in batches, puree the mixture in a blender. Pass through a food mill into a large bowl and season to taste with salt, white pepper, Tabasco and celery salt. Refrigerate until cold (but not freezing) to taste the full flavor of the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the cold tomato soup into soup bowls and place a spoonful of the guacamole in the center and then garnish with a basil flower."}]}