{"@context": "http://schema.org", "@type": "Recipe", "name": "Glazed Orange Rind", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT38M", "recipeYield": "3 cups glazed rind", "recipeCuisine": "", "recipeCategory": "project", "keywords": "blood orange, sugar, dessert, winter", "aggregateRating": null, "recipeIngredient": ["Peel from 4 blood oranges, in quarters, with strings removed and cut lengthwise into 1/4-inch-wide strips", "4 1/2 cups cold water", "4 ounces granulated sugar", "1/2 cup raw (turbinado) sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place orange rind and 1 1/2 cups of the water in a 2 1/2-quart souffle dish. Cover tightly with microwave plastic wrap and cook at 100 percent power in a 650- to 700-watt oven for 5 minutes. Prick plastic to release steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and uncover. Strain orange peel, discard liquid and return peel to souffle dish with 1 cup cold water. Cover tightly with microwave plastic wrap and cook at 100 percent power for 5 minutes. Repeat this process twice, using half the remaining cold water each time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return drained orange peel to souffle dish and stir in granulated sugar. Cover tightly with microwave plastic wrap and cook at 100 percent power for 8 minutes, stirring once. Prick plastic to release steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and uncover. Place a wire rack over a piece of parchment or wax paper. Put orange slices on the rack so that they do not touch one another. Allow to stand for about 1 hour to dry out slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss orange peel in the raw sugar in a shallow bowl to coat evenly. Return peel to the wire rack to dry out completely, for about 2 hours. Store in an airtight box."}], "link": "https://cooking.nytimes.com/recipes/6535-glazed-orange-rind"}