{"@context": "http://schema.org", "@type": "Recipe", "name": "Preserved Duck", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT5H20M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, bay leaves, duck, kosher salt, saltpeter, thyme", "aggregateRating": null, "recipeIngredient": ["4 or more domestic ducks, jointed (see below)", "3 tablespoons kosher salt", "1/8 teaspoon saltpeter", "1/2 teaspoon thyme", "1/2 bay leaf", "1/4 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut up ducks: remove legs and separate into thigh and leg pieces; remove entire breast and cut in two lengthwise (only these pieces are preserved)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix salt with remaining ingredients, rub pieces thoroughly with it, pack into bowl and let stand for 24 hours in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put remaining parts of the ducks, including all fat, in pot and cover with water. Chop carrot, onion, rib celery and sprig parsley and add to pot along with bay leaf and a little thyme, salt and pepper. Simmer, covered, for 3 hours. Strain and refrigerate stock overnight. Remove cake of fat and reserve. Freeze stock for other uses."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe salted duck pieces to remove excess salt and put into deep pot. Melt all duck fat you have on hand and, when hot, pour over duck pieces in pot, adding as much hot melted lard as needed to cover pieces. Simmer pieces very gently for 1 1/4 to 2 hours, or until no liquid comes out when they are pierced with knitting needle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When duck is cool, remove skin and bones if desired, pack pieces into wide-mouthed jars (fill the jars only 3/4 full) and pour on melted fat to cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate until set and then top jars up with more melted fat to insure a good seal. Duck preserved in this way will keep up to 6 months in refrigerator. To use, simply warm the jar in a very low oven till fat melts, fork out pieces needed and refrigerate again (making sure of good depth of fat for seal)."}]}