{"@context": "http://schema.org", "@type": "Recipe", "name": "Zebra Tomato And Polenta Lasagna", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, casseroles", "keywords": "feta, green zebra tomatoes, oregano, polenta, ricotta, main course, summer, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 579, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "12 grams", "proteinContent": "27 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1503 milligrams", "sugarContent": "35 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 teaspoons kosher salt, plus more for seasoning", "1 cup dry uncooked polenta", "25 green zebra tomatoes", "1 clove garlic", "1 teaspoon white pepper", "1 teaspoon olive oil", "1 bunch fresh oregano", "6 ounces feta cheese", "8 ounces fresh ricotta cheese", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Put 4 3/4 cups water in large pot, add salt and bring to a boil. Slowly sprinkle polenta into water in a thin stream, whisking constantly until it is absorbed. Reduce heat to simmer, and cook, covered, for 35 minutes. Every 10 minutes, give the pot 1 minute of vigorous stirring; after final stir, allow polenta to cook for 5 more minutes. Turn out into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut 5 tomatoes into quarters, and place them with garlic in blender. Blend tomatoes until very smooth. Taste puree mixture, season lightly with salt and white pepper, and set aside. Slice remaining tomatoes into disks, each 1/4 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease 8-by-8-inch baking dish with olive oil. Spoon half of polenta into dish, and press it out to sides in even layer. Arrange 1 layer of tomatoes on top of polenta, season lightly with salt and white pepper, and place 1 oregano leaf on each tomato slice. Drizzle about 3 tablespoons of puree mixture over tomatoes. Sprinkle a third of crumbled feta over puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat ricotta cheese and egg together, and season lightly with salt and white pepper to taste. Build second layer of tomatoes, salt, white pepper and oregano. Spread half of ricotta mixture over this layer. Make another layer from the rest of the polenta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place layer of tomatoes, salt, white pepper and oregano over polenta. Add remaining ricotta and then remaining sliced tomatoes, and season again as above. Spread remaining puree over all, and then sprinkle remaining crumbled feta over top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 35 to 45 minutes, until tomatoes are bubbling and cheese is golden."}], "link": "https://cooking.nytimes.com/recipes/6584-zebra-tomato-and-polenta-lasagna"}