{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt Cod Fritters", "description": "Salt cod, often called by the fish's Spanish name, bacalao, or some variation, is still popular, but not because salting is the most efficient way of preserving fish; about a hundred years ago, freezing claimed that honor. Salting completely transforms cod's flavor and texture, allowing all sorts of dishes that are not possible with fresh cod or, for that matter, with anything else. At least not with such character.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, main course, eggs, fish, flour, parsley, salted cod", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "recipeIngredient": ["1 pound boneless salt cod, soaked overnight, drained and poached 15 minutes", "1 onion, minced", "2 garlic cloves, minced", "1/2 teaspoon black pepper or more, or cayenne to taste", "1 cup flour", "2 eggs", "1/2 cup fresh chopped parsley or cilantro", "Corn, grape seed, canola or other neutral oil for deep-frying", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop salt cod with a knife, and then shred it with your fingers. Combine it with the onion, garlic and pepper in a bowl, and mix well with a wooden spoon. Add flour, and stir a few times; then beat in eggs one at a time. Add about 1/2 cup water, and stir; continue to add water (about 1/4 cup more), until a batter forms -- it should be a bit thicker than pancake batter -- and then stir in the herb."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Letting mixture rest, put about 3 inches of oil in a deep saucepan, and turn heat to medium-high; bring to 350 degrees. (A drop of batter will sizzle energetically when oil reaches that temperature.) Gently drop tablespoonfuls of cod mixture into oil, and fry, turning once, until golden brown, about 5 minutes. Work in batches, taking care not to crowd fritters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain on paper towels, and serve with lime wedges, or keep in a warm oven until ready to serve."}], "link": "https://cooking.nytimes.com/recipes/6597-salt-cod-fritters"}