{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Pizza", "description": "Lemon pizza not only sounds good; it also looks and tastes as sunny as summer. You may, of course, knead your own dough, but if you don't have the hours for it to rise, why not try the frozen variety? Roll it out to the thickness you like -- thin or Sicilian -- blanket it with lemon slices and bake for a few minutes. The lemon will crisp and intensify slightly in flavor. (They must be cut very thin.) When it comes out of the oven, just spread some crème fraîche on it and cover it with way too much salmon caviar or perhaps a little less Sevruga. Even if it seems a little prematurely retro -- say, from the 80's, which any day now will be the new 50's -- the salmon roe makes a more colorful and lighter presentation.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2014/05/23/dining/Lemon-Pizza/Lemon-Pizza-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 appetizer servings", "recipeCuisine": "mediterranean", "recipeCategory": "pizza and calzones", "keywords": "appetizer, crème fraîche, extra virgin olive oil, lemon, pizza dough, salmon caviar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 217, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "587 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["12 ounces prepared pizza dough", "3 lemons, ends trimmed and discarded, sliced paper thin, seeds removed", "Freshly ground black pepper", "Extra-virgin olive oil", "1/2 cup crème fraîche", "6 ounces good-quality salmon caviar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees and roll dough out to roughly 12 inches in diameter and very thin -- about 1/6-inch thick. Place on a greased sheet pan, or heat a pizza stone in the oven. Cover surface of dough with lemon slices, overlapping them very slightly. Sprinkle with pepper and olive oil. Transfer pizza to hot pizza stone or place the sheet pan in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until dough is brown and crisp, 15 to 20 minutes. (If the lemons brown too quickly, cover the surface of the dough with foil until dough is cooked through.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pizza from the oven and let cool. Spread crème fraîche over the surface and dot with caviar. Cut into wedges and serve."}], "link": "https://cooking.nytimes.com/recipes/6634-lemon-pizza"}