{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Moroccan-Style Lamb With Dried Prunes, Almonds and Apricots", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, weekday, one pot", "keywords": "blanched almonds, boneless lamb shoulder, cumin, dried apricots, dry red wine, fresh herbs, lamb, prune, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 284, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "277 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 boned and trimmed lamb shoulder, about 2 pounds", "2 teaspoons ground cumin", "1 1/2 teaspoons freshly ground black pepper, plus more to taste", "1/2 teaspoon chopped fresh thyme", "1 teaspoon kosher salt, plus more to taste", "3 tablespoons olive oil", "1 large onion, peeled and coarsely chopped", "1 large carrot, peeled and coarsely chopped", "1 rib celery, coarsely chopped", "2 cloves garlic, peeled and thinly sliced", "1 teaspoon chopped fresh rosemary", "1 cup dry red wine", "2 cups lamb or low-sodium chicken broth, plus up to 1/2 cup, if needed", "1 medium tomato, trimmed and coarsely chopped", "1 cup blanched whole almonds, lightly toasted", "1/2 cup pitted prunes", "1/2 cup dried apricots"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Lay the lamb out, skin side down, and sprinkle with 1 teaspoon of the cumin, 1/2 teaspoon of the pepper and the thyme. Roll and tie well with butcher's string. Sprinkle the outside with 1/2 teaspoon of the pepper and 1/2 teaspoon of the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in a large oven-proof casserole. Add the lamb and brown on all sides. Remove lamb from pot. Add remaining tablespoon oil. Stir in onion, carrot, celery and garlic. Cook over medium-high heat until vegetables soften, about 5 minutes. Stir in the remaining teaspoon cumin, the rosemary and the red wine. Bring to a boil and cook about 3 minutes, stirring with a wooden spoon and scraping browned bits off the bottom of the pot. Stir in the stock, tomatoes, 1/2 teaspoon salt and 1/2 teaspoon pepper. Return the lamb to the pot, cover, place in the oven and bake until meat is almost tender, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the casserole from the oven and take out the meat. Remove the vegetables from the pot with a slotted spoon and place them in a blender. Blend until smooth. Scrape the mixture back into the pot and stir well. Place over medium heat and cook about 5 minutes to thicken slightly. Return the meat to the sauce and surround with the almonds, prunes and apricots. Cover and bake until meat is very tender and fruit is soft, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lamb from the pot, cut and remove string and cut lamb into thin slices. If sauce is too thick, thin with a little additional broth. Divide the lamb among 8 plates and spoon some sauce over the top. Serve immediately, passing any remaining sauce separately."}], "link": "https://cooking.nytimes.com/recipes/6675-braised-moroccan-style-lamb-with-dried-prunes-almonds-and-apricots"}