{"@context": "http://schema.org", "@type": "Recipe", "name": "Sauteed Foie Gras With Apple-Wine Sauce And Potato-Onion Latke", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, main course, apple, baking potatoes, balsamic vinegar, cinnamon stick, foie gras, ginger, kosher red wine, veal broth", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 699, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "4 grams", "proteinContent": "14 grams", "saturatedFatContent": "13 grams", "sodiumContent": "970 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["2 cups kosher red wine (the same as served with dinner)", "4 tablespoons balsamic vinegar", "1 tablespoon honey", "1/2 tablespoon chopped fresh ginger", "1 small cinnamon stick", "1/2 apple, peeled, cored and chopped", "1/2 cup veal, duck or chicken broth", "Salt and freshly ground black pepper to taste", "1 medium onion, peeled and thinly sliced", "2 1/2 tablespoons olive oil", "3 large baking potatoes, peeled", "1 1/2 teaspoons salt", "1 teaspoon freshly ground black pepper", "1 fresh foie gras (about 1 pound)", "Salt and freshly ground black pepper", "2 tablespoons peanut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, combine all ingredients except salt and pepper in a small saucepan and cook over low heat until reduced to 1 cup, about 30 minutes. Remove cinnamon stick, pour sauce into blender and puree. Place in a small saucepan, season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Heat 1 tablespoon of the olive oil in a medium skillet. Add the onions and cook until golden brown. Cut the potatoes across into 1/8-inch thick slices, place in a bowl and toss with the remaining olive oil. Lightly grease a 10-inch nonstick or cast-iron baking pan or ovenproof skillet. Arrange half of the potatoes in the pan in a single layer and season with salt and pepper. Cover with the onions, top with the remaining potatoes and season with salt and pepper. Bake until potatoes are golden brown and crisp, about 30 minutes. If the underside of the potatoes are not browned when the potatoes are tender, finish over high heat on top of the stove. Loosen from the pan with a spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the foie gras into 1/2-inch-thick slices and season with salt and pepper. Heat the oil in a large saute pan over medium-high heat. When oil begins to smoke, add the foie gras and cook until seared on the outside and slightly pink in the center, about 1 minute a side. Remove from pan and pat dry with a towel. Meanwhile, warm the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut the latke into 6 equal slices and place on each of 6 plates. Place foie gras over the latke and glaze each serving with a tablespoon of sauce. Serve immediatley, passing remaining sauce on the side."}]}