{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Pizza", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/27/dining/friedpizza-still/friedpizza-still-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "At least 4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pizza and calzones", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 171}, "recipeIngredient": ["2 cups all-purpose or bread flour, more as needed  ", "3/4 teaspoon instant yeast", "1 teaspoon coarse salt", "3 tablespoons extra virgin olive oil, more for cooking", "About 2 cups any light, fresh tomato sauce, warmed", "Sliced mozzarella to taste", "Salt and black pepper", "Prosciutto slices and basil leaves for topping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour, yeast and salt in a food processor. Turn machine on and add 1/2 cup water and 2 tablespoons oil through feed tube. Process for about 30 seconds, adding more water, a tablespoon or so at a time, until mixture forms a ball and is slightly sticky to the touch. (If mixture becomes too sticky, add flour a tablespoon at a time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put one tablespoon olive oil in a bowl and turn dough ball in it. Cover bowl with plastic wrap and let rise until dough doubles in size, 1 to 2 hours. When dough is ready, re-form into a ball and divide it into 4 pieces; roll each piece into a ball. Place each piece on a lightly floured surface, sprinkle with a little flour, and cover with plastic wrap or a towel. Let rest until each puffs slightly, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, press one ball into about a 10-inch round. Use a little flour, if needed, to prevent sticking and a rolling pin, if desired. Film a 10-inch skillet with olive oil and turn heat to medium. When oil shimmers, put dough in pan and adjust heat so it browns evenly without burning. (If dough puffs up unevenly in spots, push bubbles down.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough, then top browned side with tomato sauce, cheese, a bit of salt and pepper, and, if you like, prosciutto and/or basil leaves. If top is now heavily laden, cover pan and continue cooking, or run it under broiler, just until toppings become hot. With only a couple of toppings, just cook until bottom browns. Repeat with remaining dough; serve hot, warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/6703-pan-fried-pizza"}