{"@context": "http://schema.org", "@type": "Recipe", "name": "Eddie’s Remarkable Ribs", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "four to six servings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner", "keywords": "black chinkiang vinegar, butter, chili powder, cider vinegar, dijon mustard, garlic, ginger, ketchup, lemon, st. louis pork ribs, sugar, tabasco sauce, vegetable oil, worcestershire sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["3 racks St. Louis-cut pork ribs weighing about 2 1/4 pounds each", "1 1/2 tablespoons coarse sea salt", "coarsely ground black pepper to taste", "2 large cloves garlic, smashed, peeled and minced", "3 medium cloves garlic, smashed, peeled and minced", "1 1/2-inch piece ginger, peeled and minced", "1 cup ketchup", "1/3 cup cider vinegar", "1/3 cup worcestershire sauce", "1/2 cup black ''Chinkiang'' vinegar (available in Asian groceries)", "1/3 cup vegetable oil", "2 tablespoons melted butter", "1 tablespoon Tabasco sauce", "1/4 cup Dijon-style mustard", "1/2 cup sugar", "2 tablespoons chili powder", "1 teaspoon salt", "freshly ground black pepper to taste", "1 lemon, cut across into 1/4-inch-thick slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "About 2 hours before serving, rub the pork on each side with the salt, pepper and garlic and allow it to marinate for 1 hour at room temperature. Meanwhile, build a fire in a kettle-style grill using about 50 briquettes. When the coals are ready, divide evenly on each side of the grill, leaving a space in the center. Place about 7 fresh briquettes on top of the already burning ones. Lay a medium-size disposable pan in the open space to catch the grease. Place the seasoned ribs on a roasting rack, high above the coals, in the center of the kettle. Cover and roast for 30 minutes. Turn and roast 35 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, mix together all of the ingredients except the lemon and stir to combine completely. squeeze the juice from the lemon into the mixture and then drop the lemon slices in as well and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the ribs have been roasted, remove the grill rack from the kettle. Remove the grease pan and rake the coals out evenly. Replace the grill rack. Use a brush to baste the ribs generously with sauce, turning the ribs as soon as the side facing the heat begins to sizzle and caramelize around the edges. Baste and glaze the ribs at least 5 times on each side. They're done when they just begin to blacken in some spots. Use a sharp knife to separate the ribs, and serve."}], "link": "https://cooking.nytimes.com/recipes/6705-eddies-remarkable-ribs"}