{"@context": "http://schema.org", "@type": "Recipe", "name": "Fluffy Orange Shortcake", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "Serves 10", "recipeCuisine": "", "recipeCategory": "", "keywords": "candied orange peel, eau de vie, eggs, flour, heavy cream, marmalade, dessert, nut-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 482, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "17 grams", "sodiumContent": "235 milligrams", "sugarContent": "35 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/2 teaspoon salt", "1 1/2 cups sugar", "6 eggs, separated", "2 teaspoons lemon juice", "1 teaspoon vanilla", "1/2 teaspoon grated lemon zest", "2/3 cup orange or other marmalade", "3 tablespoons eau de vie", "3 cups heavy cream", "2 tablespoons confectioners' sugar", "1/4 cup candied orange, grapefruit or lemon peel, cut into slivers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Have ready an ungreased 10-inch tube pan. Preheat the oven to 325 degrees. Sift flour, measure, resift 3 times with baking powder, salt and 3/4 cup sugar. Put the egg yolks into a mixer fitted with a whisk, add 1/4 cup cold water and the lemon juice, then beat on medium speed until thick and spongy, 4 to 5 minutes. Without stopping the beaters, gradually add 1/2 cup sugar and the vanilla and beat until mixture is again thick and spongy. Now turn the mixer to the lowest speed and add flour in 4 portions, scraping the sides and bottom of the bowl constantly with a spatula. Beat until batter is smooth. Fold in the lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and clean the whisk. In another mixer bowl (or in a bowl with a hand whisk), quickly beat the egg whites until stiff enough to form peaks, then beat in the remaining 1/4 cup sugar until the whites form shiny pointed peaks that curve at the tips. Fold the yolk mixture into the whites, lightly but thoroughly. Flow batter into the tube pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 50 to 60 minutes or until the cake springs back when lightly touched. Remove from the oven and invert over a large funnel or bottle. When just cooled, remove the cake from the pan using a thin-bladed knife. Slice the cake into 4 layers. Wrap and freeze 2 layers for up to 2 months. Ice the other two and eat now."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one layer on a cake plate. In a small pan, warm the marmalade and eau de vie until loose, then brush this on the bottom layer. Whip the cream with the confectioners' sugar until it holds soft peaks; sweeten with more sugar if you like. Spread about 1 cup of the cream over the marmalade (now cooled). Place the second layer of cake on top, then ice the cake with the remaining whipped cream and decorate the top with slivers of candied peel. Chill and serve within 2 hours."}], "link": "https://cooking.nytimes.com/recipes/6727-fluffy-orange-shortcake"}