{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea And Mountain (Mar Y Montana)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "almonds, chicken, chicken broth, dry white wine, garlic, hazelnuts, lobster, olive oil, onion, parsley, pine nuts, saffron, tomato, unsweetened chocolate, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 596, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "2 grams", "proteinContent": "38 grams", "saturatedFatContent": "9 grams", "sodiumContent": "939 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large tomatoes, about one and one-half pounds total weight, baked (see recipe for baking tomatoes and garlic)", "1 two-and-three-quarter-pound chicken, cut into serving pieces (backbone discarded)", "Salt to taste, if desired", "Freshly ground pepper to taste", "2 one-and-one-half-pound live lobsters", "1/2 cup olive oil", "1 cup finely chopped onion", "1 1/2 tablespoon finely minced garlic", "2 tablespoons finely chopped parsley", "1 cup dry white wine", "2/3 cup picada (<a href=\"http://cooking.nytimes.com/recipes/6729-picada-a-nut-and-chocolate-condiment\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the tomatoes according to instructions. Or you may use one and three-quarter cups of drained, chopped canned tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, sprinkle the chicken pieces with salt and pepper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Split each lobster in half crosswise at the point where the tail and body meet. Cut the tail piece crosswise into three or four pieces. Crack the claws. Cut the body pieces in half lengthwise. Arrange the tail pieces, cracked claws and the body halves in a dish. Sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large heavy casserole and add the lobster pieces. Cook, stirring, over high heat about two or three minutes. Using a slotted spoon, transfer the lobster pieces to a dish. Let the oil remain in the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the oil in the casserole add the chicken pieces skin side down. Cook until golden brown on one side, about five minutes. Turn and cook on the second side about five minutes. Remove the pieces and add them to the lobster, leaving the oil in the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the finely chopped onion and minced garlic to the oil and cook, stirring often, until the onion is golden brown, about 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the parsley. Peel the baked tomatoes and chop them. There should be about one and three-quarter cups. Add this to the onion mixture. Cook, stirring occasionally, about five minutes. Add the wine and cook about five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the lobster and chicken to the casserole. Cook five minutes and add the picada. Cover and cook five minutes longer. If desired, remove the claws and break them open. Remove the meat and return it to the casserole. Discard the claw shells."}], "link": "https://cooking.nytimes.com/recipes/6728-sea-and-mountain-mar-y-montana"}