{"@context": "http://schema.org", "@type": "Recipe", "name": "Gateau Reine de Saba", "description": "Julia Child wrote that the Gateau Reine de Saba was the first French cake she ever ate. My version is a bit simpler to make than hers. I melt the chocolate with liquid, and I use all ground almonds rather than the traditional mixture of flour and almonds. I like my Reine de Saba to be slightly more like pudding and voluptuously melting. As \"Reine de Saba\" is French for Queen of Sheba, this seems entirely fitting. It also makes this cake eminently suitable for those who are gluten-intolerant. A little of this cake goes very far. You can easily get 12 slices out of this cake, so each person isn't consuming a huge amount of sugar. But to be defensive is to end on the wrong footing. A cake this good does you good, both body and soul.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/06/02/dining/Gateau-Reine/Gateau-Reine-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "One 9-inch cake (10 to 12 servings)", "recipeCuisine": "french", "recipeCategory": "", "keywords": "almond extract, bittersweet chocolate, butter, cake, egg, ground almonds, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 218}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 406, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "13 grams", "sodiumContent": "54 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 tablespoons (1 1/2 sticks) butter, more for pan", "6 ounces bittersweet chocolate, chopped into small pieces", "A few drops almond extract", "2 tablespoons strong coffee", "4 large eggs, separated", "Pinch of salt", "1 cup sugar", "1 3/4 cups finely ground almonds", "2 tablespoons sugar", "1 tablespoon corn syrup", "4 ounces bittersweet chocolate, chopped into small pieces", "1 tablespoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare cake:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Butter a 9-inch springform pan, and line the side wall with parchment paper. In a heavy-bottomed pan, combine 12 tablespoons butter, 6 ounces chopped chocolate, almond extract and coffee. Melt over low heat, then transfer to a bowl and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With an electric mixer, whisk egg whites and salt until soft peaks form. Slowly add 1/2 cup sugar until thick and glossy. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together egg yolks with remaining 1/2 cup sugar until thick. Fold in the melted chocolate mixture. Add ground almonds and mix well. Whisk in a dollop of egg whites to lighten mixture. Using a rubber spatula, gently fold in the rest of egg whites, keeping batter airy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape batter into pan and bake until cake is dry on top and a bit gooey in center, 30 to 40 minutes. (After 30 minutes of baking, check center of cake with a tester or toothpick. If center seems very wet, continue baking.) Cool cake on a rack for 20 minutes, then remove side of pan. Allow to continue cooling. Top of cake may crack as it cools, but glaze will cover most cracking."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare glaze:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine 2 tablespoons sugar, the corn syrup and 1/4 cup water. Bring to a boil, then remove from heat. Add 4 ounces chopped chocolate, swirl pan to mix, and allow to stand until melted, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk 1 tablespoon butter into icing, then pour evenly over cake. Use a spatula to ease icing out to edges of cake. Allow icing to cool, and set before slicing."}]}], "link": "https://cooking.nytimes.com/recipes/6793-gateau-reine-de-saba"}