{"@context": "http://schema.org", "@type": "Recipe", "name": "Montreal Bagels", "description": "As with most ethnic foods, bagels are prepared differently from city to city, community to community. But the special appeal of Montreal bagels draws even those accustomed to the New York variety. \n\nMontreal bagels are a different breed, chewy and tinged with a tantalizing sweetness. The real thing is still baked in wood ovens, which give the bagels an irregularly charred outer surface. These bagels shine, too, with a gloss that only a short swim in a bath of honey- or malt-sweetened water can impart. With no chemical additives or dough conditioners, these bagels stand out in taste and looks.", "author": {"@type": "Person", "name": "Marcy Goldman-Posluns"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/montrealbagels-still/montrealbagels-still-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "18 bagels", "recipeCuisine": "jewish", "recipeCategory": "project", "keywords": "bread flour, egg yolks, honey, quick-rising yeast, sesame seeds, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 263}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 221, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "0 grams", "sodiumContent": "339 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups water, room temperature", "2 packages dry quick-rising yeast (or 1 1/2 ounces fresh yeast)", "1 teaspoon sugar", "2 1/2 teaspoons salt", "1 whole egg", "1 egg yolk", "1/4 cup oil", "1/2 cup honey", "5 cups or more flour (preferably bread flour)", "3 quarts water for boiling", "1/3 cup honey or malt syrup", "Sesame or poppy seeds for sprinkling on top"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl or in the bowl of an electric mixer that has a dough hook, blend together the water, yeast, sugar and salt. Stir in the whole egg, the yolk, oil and 1/2 cup honey, and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the 5 cups flour, and mix until the dough is too stiff to mix by hand. Transfer to a lightly floured work surface (if using electric mixer, attach dough hook), and knead to form a soft, supple dough. Add a bit more flour as needed to prevent dough from getting too sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is smooth and elastic, place it in a lightly oiled bowl, and cover with a sheet of plastic wrap or with a plastic bag. (See note.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the dough rest about 20 minutes. Punch it down, and divide into 18 equal portions. Pour the water into a Dutch oven, along with the remaining 1/3 cup honey or malt syrup, and heat to boiling. Cover, reduce the heat, and allow to simmer while preparing the bagels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the dough portions into bagels or doughnutlike rings by elongating each portion into an 8- to 10-inch coil that is 3/4 inch thick. Fold the ends over each other, pressing with the palm of one hand and rolling back and forth gently to seal. This locks the ends together and must be done properly or the bagels will open while being boiled. Let the bagels rest 15 minutes on a towel-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Bring the water back to a boil and remove the lid. Have bowls of poppy seeds and sesame seeds nearby."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water is boiling, use a slotted spoon, and add three bagels to the water. As they rise to the surface, turn them over, and let them boil an additional minute before removing them and quickly dipping them in either bowl of the seeds. Continue boiling the bagels in batches of three until all have been boiled and seeded."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the boiled bagels on a baking sheet, and bake on the lowest rack of oven until they are medium brown, approximately 25 minutes. Remove from the oven. Once cooled, the bagels can be placed in a plastic bag, sealed and frozen."}], "link": "https://cooking.nytimes.com/recipes/6795-montreal-bagels"}