{"@context": "http://schema.org", "@type": "Recipe", "name": "Three Little Asparagus Soups For Spring", "description": "The most daunting aspect of serving three asparagus soups is finding 18 little bowls. But unless you're having Nathan Lane to dinner, who cares if they match? Coffee cups, old-fashioned glasses, mugs, pairs of cupped hands -- all are fine.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "project, soups and stews", "keywords": "appetizer, arborio rice, asparagus, chicken broth, half and half, salmon fillet, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 739, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "5 grams", "proteinContent": "20 grams", "saturatedFatContent": "21 grams", "sodiumContent": "388 milligrams", "sugarContent": "14 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 pounds asparagus, ends trimmed", "6 tablespoons butter", "4 cups chicken broth", "2 pints half-and-half", "2 tablespoons olive oil", "1 medium onion, chopped", "1 cup Arborio rice", "2 cups water", "1/4 cup all-purpose flour", "1 egg, beaten", "1/2 cup bread crumbs", "Vegetable oil for deep frying", "3 ounces raw salmon fillet, skinned, cut into 1/4-inch dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel 4 asparagus stalks and slice the remainder crosswise into 1-inch pieces. In a large saucepan, melt the butter over medium heat and add the sliced asparagus and 2 of the peeled stalks. Saute 5 minutes or until soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken broth, bring to a boil and add half-and-half. Simmer for 10 minutes. Remove the 2 stalks. Continue to simmer for 10 minutes more, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the soup through a coarse sieve set over a large bowl, pressing the asparagus through with the back of a large spoon. Scrape the pulp into the soup, whisk and refrigerate 1/3 of it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the 2 cooked asparagus stalks into 1/4-inch dice. Set aside. Slice the 2 raw asparagus stalks into 1 1/2- by- 1/8-inch julienne. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For a risotto quenelle garnish, heat the olive oil in a large skillet over medium heat and saute the onion until soft, about 10 minutes. Add the rice and saute until translucent, about 5 minutes. Stir in the water, 1/3 cup at a time, adding more as water is absorbed, cooking risotto about 10 minutes in all. Add the diced asparagus and cook for 3 minutes, stirring constantly, until rice is al dente. Spread risotto on a plate to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the flour, egg and bread crumbs in separate shallow bowls. Shape the rice into quenelles (small footballs) with 2 teaspoons, lightly roll in the flour, then the egg, then the bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 inches of vegetable oil in a small pot to 375 degrees and fry the risotto quenelles until brown and crisp. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove the cold soup from the refrigerator and remove any solidified butter to larger portion of soup. Heat the unrefrigerated soup till hot and pour into 12 small bowls, adding the reserved asparagus strands to 6 and the quenelles to 6. Pour the cold soup into 6 small bowls, adding the chopped raw salmon to each. Serve each diner with 3 different soups."}]}