{"@context": "http://schema.org", "@type": "Recipe", "name": "Monkey Bread", "description": "Back in 1982, a <a href=\"http://www.nytimes.com/1982/02/10/garden/q-a-243129.html\">reader wrote in</a> about a friend who had “once seen ‘monkey bread’ on a dinner menu,” asking Craig Claiborne if he'd ever heard of it. Mr. Claiborne, it turns out, hadn’t.\n“My dictionary informs me that monkey bread is the gourdlike fruit of the baobab tree,” <a href=\"http://www.nytimes.com/1982/02/24/garden/q-a-252366.html\">he wrote</a>.\nA couple of weeks (and “numerous” letters and phone calls) later, he corrected himself, running this recipe from James Beard’s 1973 book “Beard on Bread.” We've retested the recipe, and made a couple of updates. It’s still a little different from many of the pull-apart breads you may find online, and a showstopper. Its crispy, buttery edges are almost like sweeter dinner rolls, giving way to caramelized, gooey bits at the bottom. It makes a ton, so save it for guests — or freeze the leftovers for <a href=\"https://cooking.nytimes.com/recipes/1018482-baked-french-toast-with-oat-crumble-topping\">your next French toast casserole</a>.", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT2H", "recipeYield": "12 to 14 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch", "keywords": "brown sugar, butter, currants, egg, flour, milk, yeast, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 397, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "9 grams", "sodiumContent": "121 milligrams", "sugarContent": "27 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 1/2 teaspoons/14 grams/2 envelopes active dry yeast", "1 cup/200 grams granulated sugar", "16 tablespoons (2 sticks)/226 grams unsalted butter, at room temperature, plus more to grease bowl", "1/2 teaspoon kosher salt", "1 cup/240 milliliters warm milk", "3 eggs, at room temperature", "2 egg yolks, at room temperature", "6 to 7 cups/720 to 840 grams flour", "1/2 cup currants soaked in warm water (optional)", "1/2 cup/100 grams light brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together yeast, sugar and 1/2 cup/120 milliliters warm water (110 degrees) in large mixing bowl or in bowl of a stand mixer. Let sit while you complete next step. (It may look like the yeast isn’t working, but don’t worry as long as it’s fresh.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine half of butter, cut into 8 pieces, salt and warm milk (110 degrees) in a medium bowl. Lightly whisk to break up butter, which does not need to be totally melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter mixture to yeast blend, and stir in whole eggs and yolks. Whisk to blend thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start adding flour, one cup at a time, stirring well after each addition. If using a stand mixer with a paddle attachment, mix on low speed. After five cups are added, dough will become quite sticky and, if making by hand, is ready to be kneaded. If using a mixer, continue adding until about 6 1/2 cups of flour have been added. Switch to a dough hook attachment when dough becomes too hard to manage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto lightly floured surface and work with hands. Lift dough and fold over. Continue lifting and folding, while adding remaining flour, until dough is elastic and pliable, kneading for about 10 minutes (about 3 to 5 minutes, if finishing from the mixer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape dough into ball and put it in buttered bowl, turning dough to coat it with butter. Cover with plastic wrap and set in warm, draft-free place to rise until doubled in bulk, about 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down dough and let it rest, uncovered, for five minutes. Turn it out onto the lightly floured work surface and shape once more into ball. Let stand, lightly covered with plastic wrap, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 10-inch tube bread pan. If using a two-piece angel food cake pan, line the space between the two pieces with a circle of parchment paper that extends up the interior sides of the pan by 1/2-inch to contain any leaks, then butter the pan and small edge of visible paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small sauce pan, melt remaining butter, and add brown sugar and drained currants, if using. Pinch off enough dough to make about 60 golf-ball-size balls. Pour mixture into large bowl, and roll balls of dough in it, working about 10 at a time. Line bottom of pan with balls, and continue arranging in loose layers. Reheat butter mixture slightly if it becomes to stiff. Scrape remaining butter and brown sugar mixture, if any remains, on top. Cover with plastic wrap and let rise until doubled in bulk, about 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 350 degrees. Place tube pan on a baking sheet, put in oven on low shelf, and bake about 45 to 50 minutes, tenting with foil after about 15 minutes. Remove or replace foil at any time to avoid overbrowning or inhibiting the rise of the dough. Tap top; it will sound hollow when the bread is done, or check with an instant-read thermometer for an internal temperature of 200 degrees. Unmold upright, and let cool before slicing or serve it warm and pull it apart."}], "link": "https://cooking.nytimes.com/recipes/6832-monkey-bread"}