{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Duck With Orange-Glazed Turnips", "description": "", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "butter, duck, orange, poultry, turnip, main course", "aggregateRating": null, "recipeIngredient": ["1 4 to 4 1/2 pound duck", "1 orange", "1/2 teaspoon rosemary", "Coarse salt and freshly ground black pepper to taste", "1 large turnip, cut into walnut-sized pieces", "2 teaspoons sugar", "1/2 stick butter", "1 tablespoon fresh chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the duck in half lengthwise with poultry shears, working up from the tail and down the center (or have it cut in half by the butcher). Remove as much fat as possible from the carcass. Prick the skin lightly all over with a fork so the fat will pour off as the duck cooks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pare the orange thinly and set the peel aside. Squeeze the juice from the orange and pour it over the duck on the bone side. Sprinkle that side with rosemary, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler to medium-hot. Place the duck halves on a broiler rack, bone side up, and broil four inches from the heat for 15 minutes. Drain off the fat and turn the duck pieces so the skin side is up. Season with salt and pepper. Broil for 20 minutes or until the skin is browned and crisp. Be careful not to burn the skin. If it cooks too fast, move the broiling rack to a lower rung. The duck is done when the juices are pink."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the duck is cooking, bring the turnip pieces to a boil in enough water to cover. After five minutes add the orange peel. When the turnips are almost tender - after about 10 minutes - drain off all but half a cup of water. Add the sugar and butter and cook until glazed, turning occasionally with a wooden spoon. Meanwhile, cut the orange peel into julienne strips and add to the turnips. Correct seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the turnips in a heated dish and the duck halves on heated individual plates. Garnish with parsley and serve."}]}