{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Salmon Fillets With Roasted Fennel And Balsamic Lentils", "description": "", "author": {"@type": "Person", "name": "Donna St. George"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fennel, fish, french green lentils, red bell pepper, salmon, yellow bell pepper, high fiber, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 722, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "8 grams", "proteinContent": "49 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1008 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 red bell peppers", "2 yellow bell peppers", "1 cup French lentils or brown lentils, rinsed", "2 large fennel bulbs, very thinly sliced, fronds reserved for garnish", "4 cloves garlic, very thinly sliced", "4 tablespoons extra-virgin olive oil", "Salt and pepper to taste", "Juice of 1 lemon", "1 shallot, minced", "4 tablespoons balsamic vinegar", "4 6-ounce salmon fillets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler with rack placed 6 inches under the heat source. Place the bell peppers on a pan in the broiler. Cook, turning occasionally, until the skin is blackened on all sides. Remove from heat, and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower oven heat to 425 degrees. In a medium saucepan, combine the lentils and 6 cups water. Bring to a boil, lower heat to a simmer and cook until tender, about 40 minutes. Drain the cooked lentils, rinse with cool water and reserve. While lentils are cooking, prepare the fennel salad: in a medium mixing bowl, combine the fennel, garlic, 2 tablespoons of olive oil and salt and pepper. Place the mixture in a shallow oven-proof dish, and roast until the fennel is lightly browned, about 40 minutes. Remove fennel from oven, add lemon juice and reserve until serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin and seed the cooled bell peppers and cut into small dice. In a medium saute pan over medium heat, combine 1 tablespoon olive oil and shallots. Saute until shallots begin to soften, about 1 minute. Add lentils and diced peppers. Saute another minute, and remove from heat. In a small saucepan over low heat, simmer the balsamic vinegar until reduced by a third, about 2 minutes. Cool, add to the lentil mixture and toss gently. Set aside until serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Season salmon fillets with salt and pepper to taste. In a well-seasoned or nonstick skillet over high heat, place 1 tablespoon olive oil. Quickly sear the fillets so they are well browned on the surface, and remove from heat. Transfer to an oiled baking dish, and bake about 5 minutes or to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spread half of each plate with balsamic lentils, and half with roasted fennel salad. Top with a salmon fillet, and garnish with a sprig of fennel frond. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/6845-seared-salmon-fillets-with-roasted-fennel-and-balsamic-lentils"}