{"@context": "http://schema.org", "@type": "Recipe", "name": "Cucumber Terrine", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "appetizer, baby shrimp, chives, cucumber, gelatin, kirby cucumber, lime juice, pink peppercorns, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 61, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "0 grams", "sodiumContent": "493 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 baby shrimp", "1 tablespoon kosher salt", "2 teaspoons celery seed", "10 pink peppercorns", "6 1/2 tablespoons fresh lime juice", "2 pounds Kirby cucumbers, peeled, seeded and sliced lengthwise in paper-thin strips", "2 large cucumbers", "3 tablespoons chives, sliced thin", "2 packets plus 1 teaspoon plain gelatin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the shrimp for 5 minutes, drain and immerse in cold water. Remove their shells, devein and slice them in half lengthwise. Put the salt, celery seed, pink peppercorns and 4 tablespoons of the lime juice in a bowl and add the Kirby cucumbers. Mix well and allow them to macerate for 2 hours. Strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Juice the large cucumbers in a juice extractor, and scald 1/2 cup of the juice over high heat. Meanwhile, add the remaining 2 1/2 tablespoons lime juice and the chives to the cucumber juice that wasn't heated. Stir. Sprinkle the gelatin on top and allow to moisten. Add the heated juice and stir until dissolved, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spray the bottom and sides of a 9-by-3-by-3-inch terrine with nonstick vegetable coating. Make a line down the center of the terrine with the shrimp. Spread about a fifth of the sliced Kirbys on top of the shrimp. Cover this layer with some of the gelatin. Refrigerate until set, about 30 minutes. Spread another fifth of the cucumbers on top, cover with some more gelatin and refrigerate until set. Repeat with the remaining 3 layers. When set, unmold onto a serving plate and slice."}]}