{"@context": "http://schema.org", "@type": "Recipe", "name": "Petit Beurre Cookies", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "10 to 12 fragile cookies", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "all-purpose flour, almond flour, butter, confectioners' sugar, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "12 grams", "sodiumContent": "3 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 ounces all-purpose flour (see note)", "3 ounces almond flour (see note) from 3 ounces packaged slivered almonds", "2 3/4 ounces confectioners' sugar", "10 ounces softened unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. In a mixer fitted with a paddle, combine the two flours, confectioners' sugar and 6 1/2 ounces butter. Mix on medium-low until a dough forms. Transfer to a baking sheet and roll out 1/8-inch thick. Shape of dough does not matter; smooth edges for even browning. Bake until barely golden brown at edges, 25 to 35 minutes; be careful not to overbake. Remove from oven and cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fingers, crumble dough into fine crumbs and place in bowl of mixer fitted with a paddle. Add remaining 3 1/2 ounces butter and mix at medium speed. Mixture will gather into small pieces, and after a few minutes will change to a dough, pulling away from sides of bowl. Continue to mix until mixture becomes fluffy and creamy like whipped butter; this may take an additional 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with plastic wrap. Using a rubber spatula, transfer dough to sheet and spread in a thick oval. Cover with plastic wrap, and use a rolling pin to roll mixture to about 1/3-inch thick. Chill until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Line a baking sheet with parchment paper. Using a 3-inch cookie cutter, cut circles from chilled dough. Transfer to baking sheet, spacing cookies at least 2 inches apart. (Scraps of dough may be re-rolled and chilled for additional cookies.) Bake until edges are golden brown, 7 to 10 minutes. Remove from oven and cool on baking sheet. Transfer baking sheet to refrigerator; allow cookies to become well chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fifteen minutes before serving, use a thin, flexible spatula to remove cookies from sheet. Chilled cookies may be placed atop a circle of raspberries or other berries. If desired, garnish plate with a scoop of ice cream."}], "link": "https://cooking.nytimes.com/recipes/6895-petit-beurre-cookies"}