{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Pot Pie", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "Eight servings", "recipeCuisine": "american", "recipeCategory": "dinner, weekday, sauces and gravies", "keywords": "chicken legs, flour, lard, leek, peas, thyme, wild mushrooms, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 632, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "2 grams", "proteinContent": "28 grams", "saturatedFatContent": "15 grams", "sodiumContent": "643 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups flour", "1/4 teaspoon salt", "5 ounces lard", "1/2 cup ice water", "3 chicken legs (1 pound, 6 ounces)", "Salt and freshly ground pepper to taste", "2 tablespoons unsalted butter", "1/2 cup diced carrots", "1 packed cup diced leeks, white part only", "1 1/2 cups diced wild or cultivated mushrooms", "1 heaping teaspoon chopped fresh thyme", "2 tablespoons flour", "3/4 cup plus 2 tablespoons milk", "3/4 cup shelled fresh peas", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry: Combine the flour, salt and lard in a mixing bowl. Using two knives or a pastry blender, cut the flour and lard together, reducing the lard to pieces about the size of large peas. Add the ice water, mix together and gather the mass into a ball. The mixture should be quite moist and pliable, but not sticky. If sticky, knead in a little more flour. Cover the pastry in plastic wrap and refrigerate for at least an hour, or until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the pastry in half and roll each piece out on a floured board to about 1/8-inch thickness and about 12 inches in diameter. Fit one into a 9-inch shallow Pyrex pie dish, trimming the excess. Reserve the other pastry circle for the top. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken legs with salt and pepper and place them, skin side up, in a small roasting pan. Bake for 35 minutes on the top rack of the oven. Remove from the oven and cool. Remove any fat from the pan and de glaze the cooking juices with 1/4 cup of water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove all the meat from the legs and discard the skin and bones. Dice the meat and set aside (you should have about 2 heaping cups). Melt the butter in a skillet. Add the carrots, leeks, mushrooms, 1/2 cup water, thyme and a pinch of salt. Bring to a boil, reduce to a simmer, cover and let the vegetables sweat for 5 minutes. Stir in the flour and cook for 3 minutes. Then stir in 3/4 cup of milk and the deglazed cooking juices. Raise the heat and allow the mixture to thicken, stirring constantly. Reduce the heat and simmer another 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat and stir in the chicken and the peas, adjusting the seasonings. Pour the mixture into the pastry shell. Cover with the remaining circle of dough, trim off the excess and press the edges gently with the tines of a fork to seal. Combine the egg with the remaining milk and brush over the entire surface of the pie. Cut a small hole in the center of the dough and bake for 50 minutes or until brown on top. Remove from the oven and cool for 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/6901-chicken-pot-pie"}