{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Borscht", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "eastern european, jewish", "recipeCategory": "dinner, soups and stews", "keywords": "appetizer, main course, baking potatoes, beets, cabbage, carrot, celery root, cider vinegar, dill, dried porcini mushrooms, parsnip, white mushrooms, high fiber, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["1 ounce dried porcini mushrooms", "2 tablespoons vegetable oil", "1/2 pound white mushrooms, wiped clean and sliced 1/4-inch thick", "1 large onion, cut into 1/4-inch dice", "10 small or 7 to 8 medium beets, peeled, quartered and cut across into 1/4-inch slices; if the beet greens look nice, use half, and cut across in narrow strips", "2 medium carrots, peeled and cut across into 1/4-inch rounds", "1 medium parsnip, peeled and cut across into 1/4-inch rounds", "1 very small or 1/2 medium celery root, peeled and cut into 1/2-inch cubes", "3 medium baking potatoes, peeled and cut into 1/2-inch cubes", "1/2 small white cabbage, shredded", "3 large cloves garlic, smashed, peeled and very finely chopped", "3 tablespoons tomato paste", "1 medium bunch dill, coarsely chopped", "4 tablespoons sugar", "1/2 cup cider vinegar", "2 tablespoons kosher salt", "Freshly ground black pepper to taste", "Coarsely chopped dill", "Sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the dried mushrooms in 1 cup warm water for 15 minutes. Drain and squeeze out the excess liquid. Strain all the soaking liquid through a coffee filter or cloth. Reserve the liquid (there should be 1 cup) and the mushrooms separately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a tall, narrow stockpot, warm the oil over medium heat. Stir in the fresh mushrooms, and cook, stirring occasionally, for 4 minutes. Stir in the onions, and cook, stirring occasionally, for 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beets, carrots, parsnips, celery root, 8 cups water and the mushroom soaking liquid. Bring to a boil. Lower the heat, and simmer for 5 minutes. Stir in the potatoes, cabbage, garlic, and if using, the beet greens. Dissolve the tomato paste in 1/2 cup of the liquid, and stir back into the soup. Return to a boil. Lower the heat, and simmer for 5 minutes. Stir in the soaked dried mushrooms, and simmer for 5 minutes or until all the vegetables are tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat. Stir in the dill, sugar, vinegar, salt and pepper. Pass around bowls of the chopped dill and sour cream for garnish"}], "link": "https://cooking.nytimes.com/recipes/6909-vegetarian-borscht"}