{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Rice Crepe Napoleons With Raspberry Red-Chili-Pepper Sorbet", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets, project", "keywords": "butter, chilies, coconut, dark rum, egg whites, heavy cream, raspberries, rice flour, dessert, gluten-free, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 705, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "85 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "17 grams", "proteinContent": "7 grams", "saturatedFatContent": "25 grams", "sodiumContent": "764 milligrams", "sugarContent": "57 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 fresh red hot chili peppers, stems removed", "7 tablespoons granulated sugar", "3 tablespoons water", "6 half pints (about 42 ounces) raspberries", "3/4 cup powdered sugar", "6 tablespoons rice flour", "3 tablespoons powdered sugar", "2 large egg whites", "2 tablespoons melted unsalted butter", "1/2 cup hot water", "3 tablespoons clarified unsalted butter", "Granulated sugar for sprinkling", "1 1/2 cups heavy cream", "2 tablespoons dark rum", "1 cup finely grated desiccated coconut", "1/4 cup powdered sugar", "1/2 pint raspberries", "2 tablespoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sorbet, place the peppers, granulated sugar and water in a blender and process until smooth. Strain through a fine-mesh sieve, discard the solids and set the liquid aside. Place the raspberries in a food processor and process until pureed. Strain the puree through a fine-mesh sieve, pressing on the solids to extract as much puree as possible. Discard the solids. Place the puree in a bowl and whisk in the powdered sugar. Measure out and stir in 1 to 2 tablespoons of the chili-and-sugar syrup, to taste. Refrigerate until chilled, and freeze according to the instructions for your ice-cream maker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crepes, preheat the oven to 275 degrees. In a bowl, combine the rice flour and sugar. In another bowl, whisk together the egg whites, melted butter and hot water, and stir it into the flour and sugar. Keep stirring until the mixture is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place an 8-inch nonstick skillet over medium heat. Brush it with clarified butter and pour in 2 tablespoons of the batter, swirling the pan to coat it evenly. Cook until the crepe is set but not brown, about 1 minute. Turn and cook the other side. Transfer to a plate and allow to cool slightly. Cut crepe into 4 wedges, and transfer to a sheet pan lined with parchment paper. Repeat until you have made 6 crepes. Brush them with clarified butter, sprinkle with granulated sugar and bake until crisp, about 20 minutes. Remove from oven and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, combine the cream and rum, and whip until soft peaks form. Combine the coconut and sugar, and fold into the cream. Place the raspberries and granulated sugar in a bowl and mash with a fork until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, place a wedge of crepe on a dessert plate and spread with a layer of coconut mixture, then with raspberry puree. Stack a second wedge on top, and add the coconut and raspberry layers. Repeat again, and top with the fourth wedge of crepe. Place a scoop of sorbet on the side."}], "link": "https://cooking.nytimes.com/recipes/6911-crispy-rice-crepe-napoleons-with-raspberry-red-chili-pepper-sorbet"}