{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Gnocchi With Butter", "description": "This recipe is from Laura Sbrana, the mother of the chef Marco Canora, and there are a number of tricks here. You start with baking potatoes and get rid of as much moisture as you can. You use less flour than you would expect. And you work the dough as little as possible so that it doesn't become glutinous.", "author": {"@type": "Person", "name": "Tom Colicchio"}, "image": null, "totalTime": "PT3H", "recipeYield": "8 main-dish or 16 side-dish servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "appetizer, baking potatoes, butter, egg yolks, flour, parmesan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["5 pounds Idaho baking potatoes, 10 to 12, uniform size, scrubbed", "Kosher salt", "3 egg yolks, lightly beaten", "Freshly ground white pepper", "1 1/4 cups flour, approximately", "8 cups ice cubes", "1/2 pound unsalted butter", "1/4 pound Parmigiano-Reggiano, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Cover a jellyroll pan with a 1-inch layer of kosher salt. Place potatoes on salt, and bake 1 1/2 hours. Remove potatoes, and cut in half horizontally. Deeply score flesh in crisscross pattern. Place halves on racks; set aside until room temperature, at least 30 minutes. Scoop out flesh into a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Force potato flesh through a fine ricer or sieve. Weigh it. You need 2 1/4 pounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread riced potatoes on work surface, and shape loosely into a flat mound. Drizzle with egg yolks. Sprinkle with pepper. Cut into potato mound at 1-inch intervals with a pastry scraper, spatula or cleaver, to incorporate egg yolks. Sprinkle with flour as you go. Work mound by cutting and folding, but not kneading. Sprinkle on flour in handfuls until potato mixture feels fairly dry and is no longer sticky, and a small piece can be rolled easily into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two jellyroll pans with parchment. Lightly dust with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean work surface with a scraper, and lightly dust with flour. Shape potato mixture into a loaf about 1 1/2 inches high, 4 inches wide and 12 inches long. Cut 1 1/2-inch slice from the loaf with a scraper or knife. Roll into a rope about 1/2 inch thick and 30 inches long. Cut at 1-inch intervals. Smooth ends of each piece lightly with fingertips. Place finished gnocchi on a paper-lined pan. Repeat with remaining mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water, with 1 heaping tablespoon salt for each quart, to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place ice cubes in a large bowl, add 4 quarts cold water, and place a large colander in the bowl so that it fills with ice water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide gnocchi from one baking sheet into boiling water. After about 90 seconds, gnocchi will begin floating to the surface. Remove to colander with a slotted spoon or skimmer. Repeat with second batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reline baking sheets with clean parchment. With a skimmer, transfer cold gnocchi to baking sheets. Cooked gnocchi can be served at once, set aside for several hours or frozen for future use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, melt butter in a small saucepan. Whisk in 1 cup water until emulsified. (If not using entire batch of gnocchi, use proportionately less butter sauce.) Transfer sauce to 1 or 2 skillets large enough to hold gnocchi in a single layer. Add gnocchi, and cook over medium heat until butter starts to bubble and gnocchi are warmed through. Dust with cheese, and serve. Frozen gnocchi can be heated in butter without thawing."}], "link": "https://cooking.nytimes.com/recipes/6932-potato-gnocchi-with-butter"}