{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheese Pudding Soufflés", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "project, sauces and gravies", "keywords": "appetizer, egg, gruyère, heavy cream, milk, scallion, spring, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 273, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "12 grams", "sodiumContent": "378 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter", "1/4 cup all-purpose flour", "1 1/2 cups milk, slightly warmed", "1 teaspoon salt or to taste", "2 sprigs fresh thyme", "1 medium onion, diced", "1/2 cup scallions, including a bit of the green part, thinly sliced", "1/2 cup garlic cloves, peeled and thinly sliced", "Pinch of cayenne", "1/2 cup grated Gruyère cheese (2 ounces)", "1/2 teaspoon freshly ground black pepper or to taste", "3 large eggs, separated", "1/3 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 3 tablespoons of the butter over medium-low heat. Add the flour and cook for a few minutes, stirring constantly. Pour in the milk a little at a time, whisking after each addition until smooth. Add 1/2 teaspoon salt and the thyme sprigs. Reduce heat to very low and cook, stirring frequently, until the sauce is medium-thick, about 20 minutes. Let cool to room temperature and remove the thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining tablespoon butter in a skillet over medium heat and cook the onion until translucent, about 5 minutes. Add scallions, garlic, 1/2 teaspoon salt and 1/4 cup water. Reduce heat and cook until the garlic is soft and the water is nearly evaporated, about 10 minutes, adding more water if necessary to keep the vegetables from browning. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée the mixture in a food processor, add the sauce, cayenne, Gruyère and 1/2 teaspoon pepper and process until blended. Taste and adjust seasoning -- it should be fairly highly seasoned. Add the egg yolks and process until blended. Transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Generously butter six 6-ounce ramekins or custard cups. Beat the egg whites in a medium bowl until they form soft peaks and gently fold them into the cheese mixture. (Do not overfold.) Spoon into the ramekins and place in a baking pan. Add enough boiling water to come halfway up the sides. Bake until the soufflés are puffed and light golden brown, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the ramekins. When the soufflés have cooled a bit, unmold them by running a paring knife around the edges, inverting each soufflé into the palm of your hand and placing it in a shallow baking dish, top side up. They can now be held at room temperature for a few hours. They can also be held in the refrigerator, covered in plastic wrap, overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, preheat oven to 425 degrees. If refrigerated, bring soufflés to room temperature. Pour the cream over and around soufflés. Bake until the cream is hot and bubbling and the soufflés are puffed up again, about 6 to 8 minutes. Serve with the hot cream."}]}