{"@context": "http://schema.org", "@type": "Recipe", "name": "Crown Roast of Lamb", "description": "The crown rib roast is one of the most festive and serviceable cuts of meat, beautifully proportioned and wieldy, with luscious, lean red meat at the chop end tapering off into rustic, fatty and crispy rib bits at the bone end, with a built-in handle to facilitate gnawing.\n\nDomestic lamb is more than suitable for crown roast and with its slightly firmer texture seems to stand up better on the plate than the incredibly supple lamb from Australia and New Zealand. The local lamb is also a good deal.", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": "https://static01.nyt.com/images/2014/04/15/dining/crownroast-still/crownroast-still-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project", "keywords": "garlic, lamb, lamb rack, rosemary, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["2 4-pound racks of lamb, trimmed and Frenched", "2 tablespoons olive oil", "1 1/2 teaspoons salt", "1 1/2 teaspoons ground black pepper", "2 tablespoons chopped garlic", "2 tablespoons chopped rosemary"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 9-by-13-inch roasting pan in oven, and heat oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay racks side by side on a cutting board so concave rib side faces up, with rib tips pointing up as well. With a sharp knife, make a short, shallow incision (not more than 1/8-inch deep) in the flesh between each rib bone. With butcher's needle and twine, stitch the racks together where they meet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift racks by rib tips to stand upright, and shape them by hand so that the ends come together to form a crown. With the needle and twine, stitch the racks together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle olive oil over the inside and the outside of the crown roast, and massage it onto lamb. Shower crown roast with salt and pepper. Mix garlic and rosemary and press it thoroughly onto inside and outside of crown. Wrap each exposed rib tip with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place crown meat-side down on a flat rack in roasting pan, and roast 35 to 40 minutes for rare; let rest uncovered 10 minutes. Remove foil and place paper frills on rib tips."}], "link": "https://cooking.nytimes.com/recipes/6963-crown-roast-of-lamb"}