{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Duck With Peppered Pineapple Chutney", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT9H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "roasts", "keywords": "brown sugar, duck, lemon, peppercorns, pineapple, poultry, star anise, main course", "aggregateRating": null, "recipeIngredient": ["1 duckling, about 5 pounds", "3 lemons", "5 star anise", "6 cloves garlic, peeled and crushed", "Salt and freshly ground black pepper", "1/2 fresh pineapple, peeled, cored and diced", "1/2 cup finely chopped onion", "3 tablespoons cider vinegar", "6 tablespoons light brown sugar, or to taste", "1/2 teaspoon whole black peppercorns, crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 200 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse duck, pat it dry and pull any excess fat away from cavity. Using a skewer or sharp fork, prick skin all over, piercing it horizontally to penetrate into the layer of fat, not the flesh. Halve two lemons, and place them in cavity along with anise, garlic and salt and pepper to taste. Put duck on a V-shaped roasting rack placed in a roasting pan. Place it in oven, and pour about an inch of water in pan. Roast for 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the oven temperature to 425 degrees, and roast about 20 minutes longer, just until the skin is crisp and brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While duck is roasting, place pineapple in a heavy saucepan. Add the juice and grated rind of the remaining lemon, along with the onion, vinegar, sugar and crushed peppercorns. Bring to a boil, and cook over medium-high heat for 20 to 25 minutes, until most of the liquid has evaporated and the mixture is thick. Adjust the amount of sugar to taste. The chutney should be somewhat tart. It can be made either shortly before the duck has finished roasting or earlier in the day and refrigerated, then rewarmed for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chutney from heat, and transfer to a serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck from oven. Cut it in sections, and arrange on a platter. Serve with warm chutney."}]}