{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Sturgeon With Spring Vegetables", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT35M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "asparagus, brandy, butter, carrot, dry white wine, fish, green leaf lettuce, green peas, leek, scallion, shrimp shells, sturgeon, tomato, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 449, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "8 grams", "proteinContent": "47 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1076 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 7-ounce pieces fresh sturgeon", "Kosher salt and freshly ground black pepper to taste", "5 tablespoons unsalted butter", "1/2 cup homemade or low-sodium chicken stock", "3 carrots, peeled and cut diagonally in two-inch pieces, blanched in salted water until almost tender", "9 large scallions, white part only, blanched in salted water until almost tender", "3 cups fresh shelled peas, blanched in salted water until almost tender", "8 stalks asparagus, bottoms trimmed, blanched in salted water until almost tender", "1 leaf green lettuce, sliced into very thin strips", "1/2 teaspoon chopped tarragon", "1 1/2 cups green-pea sauce (<a href=\"https://cooking.nytimes.com/recipes/7016-green-pea-sauce\">see recipe</a>)", "1 1/2 cups shrimp sauce (<a href=\"https://cooking.nytimes.com/recipes/7017-shrimp-sauce\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Lightly season the sturgeon with salt and pepper on both sides. In each of 2 large ovenproof skillets set over medium-high heat, melt 2 tablespoons of the butter. When the butter stops foaming, place the fish in the pans, leaving at least an inch of space around each piece. Cook until the bottoms turn golden, 4 to 5 minutes. Turn and cook for another 3 minutes. Place the pans in the middle shelf of the oven to finish cooking, for about 8 minutes, while preparing the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining tablespoon of butter in a large saucepan. Add the chicken stock, carrots and scallions and simmer for 4 minutes. Add the peas and asparagus, and continue to cook until all of the vegetables are tender, another 3 minutes. Remove from the heat and add the lettuce and tarragon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, gently warm the pea sauce and the shrimp sauce in separate pots over low heat, without letting them reach a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle a few tablespoons of pea sauce onto the centers of 6 plates. Divide the vegetable mixture evenly among the plates. Top the vegetables with 1 piece of sturgeon. Ladle more pea sauce around the vegetables, and then drizzle the shrimp sauce over the fish and around the edge of the plate. Serve immediately."}]}