{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry Mousse", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H40M", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, egg whites, gelatin, heavy cream, raspberries, raspberry vodka, sugar, gluten-free, nut-free, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 172, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "5 grams", "sodiumContent": "25 milligrams", "sugarContent": "22 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup sugar", "1 1/3 cup fresh raspberries", "2 tablespoons raspberry-flavored vodka, or kirsch", "2 cups fresh raspberries", "1 envelope (2 1/4 teaspoons) unflavored gelatin", "1/2 cup sugar", "2 tablespoons light corn syrup", "3 large egg whites", "1 cup heavy cream", "Prepared raspberry syrup, for serving", "Mascarpone cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, combine sugar and 1/2 cup water in a small nonreactive, heavy saucepan, and bring to a boil over medium heat. Add 1 1/3 cups of the raspberries and return to a boil without stirring. Transfer to a small bowl and allow to cool completely. Add the vodka. Cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mousse, puree the 2 cups of raspberries in a blender and set aside. Sprinkle the gelatin into 1/4 cup of cool water and set aside for 3 minutes. Pour 1/4 cup water, 1/2 cup sugar and the corn syrup into a small, heavy saucepan and place over medium-high heat. Insert a candy thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the egg whites into the bowl of a mixer and whip until they form soft peaks. When the sugar water has reached 250 degrees, pour it down the sides of the bowl (not directly onto the beaters) into the egg whites while continuing to whip. Add the gelatin mixture and continue to whip until the outside of the bowl is warm, but not hot, about 5 minutes, and the meringue is stiff and glossy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the heavy cream into a large mixing bowl and whisk until it forms soft peaks. Fold half of the raspberry puree into the whipped cream and the other half into the meringue, being careful not to deflate either mixture. Fold the meringue and whipped cream together until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mousse in a pastry bag with a large opening, and pipe the mousse into twelve nonreactive cup molds, filling them halfway. Spread the mousse up the sides of the mold. Place a spoonful of the filling into the center of each mold and top with more mousse. Place the molds in the refrigerator to set for at least 3 hours. To serve, drizzle each plate with raspberry syrup, and unmold the mousses in the center of each plate and serve with a dollop of mascarpone on the side."}], "link": "https://cooking.nytimes.com/recipes/7018-raspberry-mousse"}