{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Cumin, Honey and Orange", "description": "An easy way to give roast chicken some character is to baste it with flavorful liquid. Contrary to conventional wisdom, this does nothing to keep the bird moist. Even a very lean bird remains moist as long as it isn't overcooked. But the liquid adds flavor to the skin and creates a ready-made sauce that can be spooned over the chicken as you serve it.  If you add some sugar or other sweetener to the basting liquid, the bird gains a mahogany color that you have to see to believe. As it heats, the sugar caramelizes, becoming thicker and stickier and turning the chicken's skin crisp and gorgeous. The result is not overly sweet, because caramelized sugars have a bitter, complex component. I prefer honey to sugar and like to combine it — as I do here — with orange juice and ground cumin, which together add acidity and even more complexity. This aromatic mix creates pan juices that can be spooned over rice or sopped up with bread. ", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/12/dining/Roast-Chicken-With-Cumin-Honey-And-Orange/Roast-Chicken-With-Cumin-Honey-And-Orange-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, roasts, times classics", "keywords": "chicken, cumin, honey, orange juice, poultry, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1143}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 649, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "1 gram", "proteinContent": "44 grams", "saturatedFatContent": "10 grams", "sodiumContent": "968 milligrams", "sugarContent": "37 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup freshly squeezed orange juice", "1/2 cup honey", "1 tablespoon ground cumin", "Salt and freshly ground black pepper", "1 3-pound chicken, giblets and excess fat removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Use a nonstick roasting pan, or line a roasting pan with a double layer of aluminum foil. Combine orange juice, honey, cumin, salt and pepper in bowl, and whisk until smooth. Place chicken in pan, and spoon all but 1/4 cup of liquid over all of it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken in oven, legs first, and roast for 10 minutes. Spoon accumulated juices back over chicken, reverse pan back to front, and return to oven. Repeat four times, basting every 10 minutes and switching pan position each time. If chicken browns too quickly, lower heat a bit. If juices dry up, use reserved liquid and 1 or 2 tablespoons of water or orange juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 50 minutes of roasting, insert an instant-read thermometer into a thigh; when it reads 155 to 165 degrees, remove chicken from oven, and baste one final time. Let rest 5 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/7029-roast-chicken-with-cumin-honey-and-orange"}