{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-Baked Snapper with Ice Wine Nage", "description": "", "author": {"@type": "Person", "name": "Dana Bowen"}, "image": "https://static01.nyt.com/images/2014/06/02/dining/Salt-Baked-Snapper/Salt-Baked-Snapper-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project, sauces and gravies", "keywords": "belgian endive, cipollini onions, coarse salt, fish, ice wine, juniper berries, red snapper, saffron, star anise, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 842, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "10 grams", "proteinContent": "32 grams", "saturatedFatContent": "25 grams", "sodiumContent": "1635 milligrams", "sugarContent": "22 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 lemon", "1 orange", "10 cups coarse sea salt or kosher salt", "1/4 cup juniper berries, crushed", "1 tablespoon fennel seeds", "1 star anise pod, cracked", "3/4 cup egg whites (from 6 large eggs)", "1 4- to 4 1/2- pound whole red snapper, pink snapper or black sea bass, gutted and scaled", "Olive oil, as needed", "12 tablespoons (1 1/2 sticks) unsalted butter", "7 to 10 cippoline onions, sliced, or 1 large Spanish onion, sliced", "2 heads Belgian endive, julienned", "2 carrots, peeled and sliced into thin rounds", "1 1/2 cups ice wine or other sweet white dessert wine", "1/4 teaspoon saffron threads", "Salt and freshly ground black pepper", "2 tablespoons chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare snapper: Heat oven to 400 degrees. Finely grate zest of lemon and orange into a large bowl. Squeeze juices from lemon and orange into a separate bowl, and reserve for preparing nage. To bowl of zests, add the salt, juniper berries, fennel seed, star anise and egg whites. Mix well. Spread half the mixture flat on a baking tray. Rub snapper all over with olive oil, and place on top of salt mixture. Spread with remaining salt mixture, patting it down and leaving mixture thinner at edges than on top. (This is where crust will be cracked after baking.) Bake 30-35 minutes for medium-rare fish, 40 to 45 minutes for medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While fish bakes, prepare nage and vegetables: Melt 2 tablespoons butter in a sauté pan over medium heat. Add onions, and sauté until translucent, about 4 minutes. Add endive and carrots, and sauté for 2 minutes. Add wine, reserved lemon and orange juice and saffron. Raise heat to medium-high and boil until nage is reduced by about a third, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove nage from heat. Using a slotted spoon, transfer vegetables to a bowl, and set them aside. Return pan to low heat, and whisk in remaining 10 tablespoons butter, a tablespoon or two at a time. Season with salt and pepper to taste. Return vegetables to pan, and reheat just until warmed. Add parsley, remove from heat, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use a kitchen mallet to crack salt crust lightly around edges of fish. Remove salt crust with a knife, and transfer portions of fish fillet to each of four plates. Top with nage and vegetables, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7038-salt-baked-snapper-with-ice-wine-nage"}