{"@context": "http://schema.org", "@type": "Recipe", "name": "Twice-Cooked Lamb", "description": "These lamb ribs are a specialty of Kashmir called tabak maaz. The ribs undergo a curious braise-then-brown process which, though uncommon, makes perfect sense. The meat is made tender by braising, then browned with fresh spices and oil (or, in this case, butter). The result is the flavor of braising with the crispness of sautéing, an unbeatable combination.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 main course or 8 appetizer servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner", "keywords": "appetizer, main course, cinnamon stick, ginger, lamb, lamb ribs, lamb shoulder chops, milk, spices", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "recipeIngredient": ["4 pounds lamb ribs from the breast or 2 to 3 pounds shoulder lamb chops", "Salt", "1/4 teaspoon cayenne pepper", "1 tablespoon ground fennel seeds", "1 tablespoon chopped fresh ginger", "1 teaspoon ground turmeric", "2 bay leaves", "4 cloves", "4 cardamom pods", "1 cinnamon stick", "1/2 cup milk", "2 tablespoons butter or neutral oil like corn or grapeseed", "1 tablespoon minced garlic", "Chopped cilantro leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place ribs in a large skillet with a pinch of salt and the cayenne, fennel, ginger, turmeric, bay leaves, cloves, cardamom, cinnamon, milk and about 1/2 cup water. Bring to a boil, then adjust heat so mixture simmers. Cook, turning or stirring meat occasionally until just about tender, adding more water if mixture dries out, about 30 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat is tender, remove it. If any liquid remains in pan, cook over medium-high heat, stirring with a wooden spoon to loosen any bits stuck to bottom, until mixture is just about dry. Remove cardamom pods, cloves, cinnamon stick and bay leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter or oil and the garlic to pan over medium heat and when it's hot, brown meat in it. Remove meat to a warm platter. Add about 1/2 cup water to pan. Once again cook liquid over medium-high heat, stirring with a wooden spoon to loosen any bits that have stuck to bottom, until liquid is reduced by about half. Pour over meat, garnish with cilantro and serve."}], "link": "https://cooking.nytimes.com/recipes/7039-twice-cooked-lamb"}