{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear-Almond-Honey Tart", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "almond, honey, pear, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 19}, "recipeIngredient": ["Pastry for a single-crust 8-inch tart", "3/4 cup sliced almonds", "5 ripe pears", "1 lemon", "3 tablespoons honey", "1 teaspoon butter", "2/3 cup plain nonfat yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line an eight-inch tart pan with the pastry. Prick the pastry, cover it with foil and weight it down with beans or pastry weights. Bake until it takes on a parchment look, about eight minutes. Remove the foil and weights and bake until it is lightly browned, about 15 minutes. Remove from the oven. Reduce heat to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pastry is baking, grind half a cup of the almonds in a food processor. Remove them and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, core and quarter the pears. Puree two of them in a food processor (it is not necessary to clean the food processor from the almonds) with one tablespoon lemon juice and one tablespoon of the honey. Mix with the ground almonds and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the rest of the pears in eighths and toss with remaining lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pastry has baked sufficiently, spread the pear puree in the bottom of it. Arrange the pear eighths in a pattern on the pear puree and scatter the remaining sliced almonds over the top. Drizzle with a tablespoon of the honey and dot with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake about 35 minutes, until the almonds and pears begin to look toasty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the yogurt with the remaining honey. Serve the tart while it is still warm with honeyed-yogurt on the side."}]}