{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Tamales With Mole Sauce", "description": "Florence Fabricant brought this recipe to The Times in 1988, part of a piece looking at the Coyote Cafe in Santa Fe, N.M, where  the owner Mark Miller drew from a diverse selection of ingredients. Here, duck serves as the filling in tamales smothered in mole sauce. It’s a rich, satisfying dish for a weekend project.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican, south american, southwestern", "recipeCategory": "dinner, project", "keywords": "chili powder, corn husks, dried ancho chile, duck fat, duck leg, duck thigh, garlic, masa, poultry, spices, tomatillo, unsweetened chocolate, main course, winter", "aggregateRating": null, "recipeIngredient": ["3 dried ancho chilies", "2 plum tomatoes", "2 fresh tomatilloes, husked", "2 cloves garlic, peeled", "2 cups duck or veal stock", "1 teaspoon dried oregano", "2 teaspoons canela or cinnamon", "Pinch of ground cloves", "1 teaspoon ground black pepper", "1/4 teaspoon ground allspice", "2 ounces unsweetened chocolate, cut into small pieces", "Pinch of sugar", "2/3 cup duck confit fat, chilled (see recipe)", "Duck confit (<a href=\"http://cooking.nytimes.com/recipes/7041-duck-confit\">see recipe</a>)", "2 cups masa harina (an instant cornmeal preparation available in specialty food stores)", "1 1/3 cups warm water", "Salt to taste", "16 cornhusks, soaked in warm water, or cooking parchment"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mole sauce, cover the ancho chilies with boiling water, and allow to soak until soft. Remove the seeds, and chop the chilies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spear the tomatoes and tomatilloes with a fork and roast over an open flame until the skins begin to blacken. Chop and place in a food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the garlic by holding it on a fork over the flame until lightly browned. Add to the food processor, along with the duck or veal stock, chilies, oregano, canela or cinnamon, cloves, pepper and allspice. Puree this mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a saucepan, and simmer 15 to 20 minutes. Add the chocolate and sugar, and stir just until melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the tamales, remove 3 tablespoons of fat from the duck confit, and heat the fat in a skillet. Add the mole sauce to the fat, and cook 5 minutes, stirring constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the confit. Remove duck legs, skin them, and cut the meat off the bones, dicing it into 1/2-inch cubes. Mix with 1/4 cup of mole sauce and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir warm water into the masa harina. The texture should be malleable, like a very soft dough. In a bowl whip the remaining chilled confit fat with a fork, and beat in the masa harina. Season to taste with a little salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dry the cornhusks. Flatten them, and spread about 1 1/2 tablespoons of the masa harina-fat mixture on the smooth inner side of each husk. Distribute the diced confit mixture in a line down the center of each husk. Roll each husk loosely, allowing room for expansion, and fold down the top to make a package. Tie with a strip of cornhusk. If cornhusks are not available, use pieces of cooking parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the tamales for 30 minutes. Meanwhile, reheat the remaining mole sauce. Allow the tamales to cool slightly, then serve with the mole sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/7040-duck-tamales-with-mole-sauce"}