{"@context": "http://schema.org", "@type": "Recipe", "name": "Ravioli With Spinach", "description": "My aunt would save leftover meat in the freezer until she had enough to make the filling. The dough should be made a day in advance, and the filling and the sauce can be made then. Allow about 2 hours to assemble and plan on putting them together several hours before cooking so they have time to dry.", "author": {"@type": "Person", "name": "Marialisa Calta"}, "image": null, "totalTime": "PT1H", "recipeYield": "Six to eight servings as antipasto, about 100 ravioli", "recipeCuisine": "italian", "recipeCategory": "pastas, project", "keywords": "appetizer, main course, side dish, chopped cooked beef, chopped cooked pork chop, chopped cooked turkey, egg, flour, frozen spinach, pasta", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["3 to 3 1/2 cups sifted flour", "2 large eggs mixed with 1/2 cup water", "2 1/2 cups of cooked, finely chopped meat, such as turkey, chicken, veal and beef, including at least one pork chop", "1 egg, lightly beaten", "Salt and freshly ground pepper to taste", "2 teaspoons olive oil", "1 clove garlic, finely chopped", "1 package (10 ounces) frozen spinach, cooked, well-drained and chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir 3 or 4 tablespoons of flour into the egg-and-water mixture. Place the 3 cups of flour on a working surface and make a well in the center. Slowly pour the egg mixture into the well, working the liquid into the flour as you go. Knead for at least 15 minutes. The dough should be so stiff that when you poke it with your finger it doesn't bounce back immediately. If the dough is still sticky, add some of the remaining flour as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough into two pieces, wrap in plastic wrap and chill overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix the meats with the egg. Add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saute pan, heat the 2 teaspoons of olive oil over medium-low heat. Add the garlic and saute until soft. Add the well-drained, well-chopped cooked spinach and cook for a few minutes. Add the spinach mixture to the meat mixture and combine well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the ravioli, using a rolling pin or pasta machine, roll out one of the halves of dough as thin as possible on a well-floured board. (Refrigerate the remaining dough until ready to use.) This should be almost paper thin; the thinner the ravioli, the better. Leaving a 2-inch strip of dough at the top, place a rounded half-teaspoon of filling at 1-inch intervals across the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the strip over; on the unfolded sides, cut around each mound of filling with a small, serrated pastry wheel. If the ravioli do not stay closed, moisten your finger with milk and press the edges together. Place on a clean, lightly floured dish towel while you make the rest of the ravioli."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue in the same manner until the dough is used up. The ravioli should rest uncovered at room temperature for several hours before cooking. Turn them once during this time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill two large pots with about 5 quarts of salted water each. Bring to the boil. Place the ravioli gently in the pots and cook at a full boil for 10 to 15 minutes. When done, skim them from the pot with a slotted spoon and drain in a colander. Slide them onto a platter and serve with tomato sauce and grated Parmesan cheese."}]}