{"@context": "http://schema.org", "@type": "Recipe", "name": "Quail With Toast and Liver", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "belgian endive, chicken liver, chicken stock, garlic, herbs, peasant bread, poultry, quail, shallot, fall, winter, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 777, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "4 grams", "proteinContent": "62 grams", "saturatedFatContent": "11 grams", "sodiumContent": "837 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 quails", "8 large cloves garlic, peeled and minced", "2 teaspoons dried thyme", "2 teaspoons dried savory", "2 teaspoons dried oregano", "Salt and freshly ground black pepper to taste", "3 tablespoons olive oil", "1/2 pound chicken livers, or a mix of chicken and quail livers", "1 tablespoon heavy cream", "A few gratings whole nutmeg", "8 slices peasant loaf, about 4 inches in diameter, lightly toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If necessary, remove the feet and neck from the quails. Use your fingers or the tip of a small knife to remove the wishbone from each quail. Combine the garlic, thyme, savory and oregano. Rub the quails with the herb mixture, inside and out, and use your fingers to push some of it under the skin that covers the breast meat. Salt and pepper the birds generously inside and out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 10-inch skillets over medium-high heat and add 1 tablespoon of the olive oil to each. Saute the quails, turning occasionally, until they are browned on all sides, about 10 minutes. Reduce the heat to low and cover the skillets. Cook until the meat where the leg meets the body is just very lightly pink (it should not be bloody), about 10 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the quails to a warm platter and cover with foil. Wipe 1 of the skillets with paper towels and add the remaining tablespoon of olive oil. Over medium-high heat, saute the livers until they are browned on the outside and just slightly pink inside, 5 to 10 minutes. Transfer the livers to a food processor, add the cream and nutmeg and process until smooth. Season with saltand pepper and transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread each slice of toast with liver and place a quail on top. Serve with braised Belgian endive (see recipe) on the side."}]}