{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Duck With Olives", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "duck, fresh herbs, picoline olives, pinot noir, poultry, main course", "aggregateRating": null, "recipeIngredient": ["1 Pekin duck, about 3 1/2 pounds", "Salt and pepper", "5 branches fresh thyme", "5 stalks fresh rosemary", "2 cups chicken stock", "2 cups pinot noir or similar red wine or port", "2 medium carrots, scraped and sliced", "1 stalk celery, chopped", "1 small onion, quartered", "2 bay leaves", "Thinly peeled rind of 1 lemon", "8 ounces picholine or similar green olives, pitted", "1 teaspoon flour (optional)", "1 teaspoon butter, melted (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Remove the duck's wings, giblets and neck; rinse inside and out and dry. Prick the skin of the breast and thighs with a fork. Lightly season the inside with salt and pepper; stuff with thyme and rosemary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place duck, breast side down, in a large Dutch oven (preferably enamel-lined) over medium heat and brown on all sides, spooning off the fat as it renders."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring stock and wine to a boil in a small pan; pour over the duck. Add the vegetables, bay leaves, lemon rind and several grindings of pepper. Cover; braise in oven until the leg meat is firm and the breast brown throughout, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck and cover loosely. Strain the stock, discard the vegetables and spoon off the fat. Boil stock until reduced to about 1 cup, about 10 minutes. Add the olives for the final 3 to 4 minutes. (You may thicken stock slightly with a roux of flour and butter.) Adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, thinly slice the breast lengthwise. Separate legs from thighs. Pour on sauce."}]}