{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon-Topped Meatloaf Burgers", "description": "Instead of turning a meatloaf into a red-centered burger-loaf, why not turn a burger into a tender, juicy meatloaf patty? You get the inimitable meatloaf flavors of beef laced with ketchup and onion but in a far more delectable form. Simply broil the burgers until they are just past purple on the inside, and seared mahogany brown on the outside. This takes about five minutes — 55 minutes less than a traditional meatloaf. Put the patties on a potato bun and bite in. The meat is juicy enough to soak the roll, and is flavored in that meatloaf manner — brawny yet barely sweet, porky from the bacon, aromatic with herbs, onion and garlic, all commingled with a deep, beefy flavor. Excellent!", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT20M", "recipeYield": "6 burgers", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, quick, weekday, burgers", "keywords": "bacon, beef, buns, dijon mustard, ground beef, ketchup, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 429, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "24 grams", "saturatedFatContent": "12 grams", "sodiumContent": "409 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 tablespoons ketchup", "2 tablespoons Dijon mustard", "1 teaspoon Worcestershire sauce", "1 1/2 pounds ground beef, or a combination of beef, pork and veal", "1/2 cup finely chopped onion", "1 tablespoon chopped fresh thyme leaves or 1 teaspoon dried thyme", "1 garlic clove, minced", "1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "6 slices bacon, cut into thirds crosswise", "Burger buns and trimmings like pickles, tomato, lettuce and mayonnaise, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler. Position oven rack 4 inches from heat. In a small bowl, mix together ketchup, mustard and Worcestershire sauce. In a separate medium bowl, mix together the meat, onion, thyme, garlic, salt and pepper. Mix in half the ketchup mixture, reserving other half as a glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form meat mixture into six equal patties, about 1 1/4 inches thick. Transfer patties to a baking sheet. Brush each patty with glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For rare burgers, broil for 1 minute, then add bacon slices to tops of patties and continue broiling until bacon is browned and meat is cooked as desired, about 4 minutes longer. For medium, add bacon after 2 minutes of broiling, and for well-done, after 3 minutes. Serve with buns and trimmings if desired."}], "link": "https://cooking.nytimes.com/recipes/7123-bacon-topped-meatloaf-burgers"}