{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttery Berry Pie", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "blackberries, blueberries, butter, flour, instant tapioca, raspberries, sour cream, strawberries, dessert, summer", "aggregateRating": null, "recipeIngredient": ["2 cups, plus 2 tablespoons, flour", "14 tablespoons unsalted butter, cut into 1-inch cubes", "8 ounces sour cream", "1/2 teaspoon salt", "2 whole graham crackers, smashed to make fine crumbs", "1 egg, lightly beaten", "2 tablespoons heavy cream", "1 tablespoon sugar, for sprinkling", "2/3 cup sugar", "4 tablespoons instant tapioca", "1 pint blueberries", "1 pint raspberries", "1 pint strawberries", "1 pint blackberries", "2 tablespoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pie dough, put 2 cups of the flour in the freezer for 15 minutes. Add the butter, toss well and put back in the freezer for another 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump the flour and butter mixture onto a work surface and, using a rolling pin, mush them together quickly. Sweep in the stray piles of flour and bits of butter and continue rolling. This is a messy procedure as the mixture sticks to everything. Use your hands to remove pieces stuck to the work surface and gently roll them back into the flour and butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sour cream and the salt in a large bowl. Add the dough and, using a rubber spatula, mix to combine as well as possible. Use your hands to bring it together to form 2 rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the work surface with the remaining flour and roll out 1 piece of dough. Fold it onto itself and roll again. Do this 3 times to each piece of dough, then pat each into a flat round and refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, preheat the oven to 425 degrees. Combine the sugar and tapioca and toss them with the berries, lemon juice and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust the work surface with the graham-cracker crumbs and roll out 1 round of dough on top of the crumbs, turning once to dust each side. Line a 9-inch pan with the dough. Pour in the berries. Roll out the other round on the remaining crumbs, cut decorative steam vents near the center and lay it loosely over the mounded fruit. Crimp the edges together firmly and flute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the egg and cream. Brush the crust with the mixture, sprinkle with sugar and bake for 20 minutes. Lower the temperature to 350 degrees and bake for 30 to 40 more minutes, or until the fruit is bubbling."}], "link": "https://cooking.nytimes.com/recipes/7127-buttery-berry-pie"}