{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Burgers", "description": "For this recipe, you’ll want to grind part of the salmon in a food processor: It’ll bind the rest, which can be coarsely chopped to retain moisture during cooking. Some bread crumbs keep the burger from becoming as densely packed as (bad) meatloaf. This approach, along with a few simple seasonings, produces delicious burgers in not much more time than it takes to make one from ground chuck. The only real trick is to avoid overcooking. Whether you sauté, broil or grill this burger, it's best when the center remains the color of … salmon. Two or three minutes a side usually does the trick.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/18/dining/salmonburger2/salmonburger-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, burgers", "keywords": "bread crumbs, capers, dijon mustard, fish, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1540}, "recipeIngredient": ["1 1/2 pounds skinless, boneless salmon", "2 teaspoons Dijon mustard", "2 shallots, peeled and cut into chunks", "1/2 cup coarse bread crumbs", "1 tablespoon capers, drained", "Salt and black pepper", "2 tablespoons butter or olive oil", "Lemon wedges", "Tabasco sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the salmon into large chunks, and put about a quarter of it into the container of a food processor, along with the mustard. Turn the machine on, and let it run — stopping to scrape down the sides if necessary — until the mixture becomes pasty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shallots and the remaining salmon, and pulse the machine on and off until the fish is chopped and well combined with the puree. No piece should be larger than a 1/4 inch or so; be careful not make the mixture too fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture into a bowl, and by hand, stir in the bread crumbs, capers and some salt and pepper. Shape into four burgers. (You can cover and refrigerate the burgers for a few hours at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the butter or oil in a 12-inch nonstick skillet, and turn the heat to medium-high. When the butter foam subsides or the oil is hot, cook the burgers for 2 to 3 minutes a side, turning once. Alternatively, you can grill them: Let them firm up on the first side, grilling about 4 minutes, before turning over and finishing for just another minute or two. To check for doneness, make a small cut and peek inside. Be careful not to overcook. Serve on a bed of greens or on buns or by themselves, with lemon wedges and Tabasco or any dressing you like."}], "link": "https://cooking.nytimes.com/recipes/7131-salmon-burgers"}