{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Chicken With Ginger and Chestnuts", "description": "Gish Jen, the author of “Mona in the Promised Land,” shared this recipe with The Times in the late 1990s. Growing up in Scarsdale, N.Y., she was “suspicious” of her mother’s cooking. “I mean, I never ate the kind of Chinese food they serve in restaurants.” But she came to love her mother’s family-style Shanghai cooking. This dish, Peace and Safety In All Seasons, is part of her family's traditional Chinese New Year feast along with Step-by-Step Higher (rice and cabbage), Yearly Surplus (fried sea bass) and High Achievement (pork and hard-boiled eggs). To derive the maximum benefit from the feast, the author said, you have to eat absolutely everything — the sweet and the sour.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner", "keywords": "chestnut, chicken, ginger, poultry, sherry, star anise, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 542, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "38 grams", "saturatedFatContent": "9 grams", "sodiumContent": "919 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup whole chestnuts, either dried or blanched and frozen", "2 tablespoons vegetable oil", "1 1-inch piece of fresh ginger, peeled and cut into thin discs", "2 scallions, each cut into 4 pieces", "1 3 1/2- to 4-pound chicken, cut into 10 pieces", "5 tablespoons dark soy sauce", "1/2 cup dry sherry", "2 tablespoons brown sugar", "1/4 teaspoon salt, plus additional to taste", "1 1/4 cups water", "1 whole star anise", "Freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using dried chestnuts, soften for 4 hours in warm water and then simmer until tender, about 10 minutes. Drain, cool and set aside. If using frozen, blanch for 3 minutes, drain, cool and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok or heavy-bottomed casserole, warm the oil over high heat. When sizzling, add the ginger and scallions and cook for 2 minutes. Add the chicken and stir to make sure that each piece is cooked until consistently golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the soy sauce, the sherry, the sugar, and the salt and toss chicken pieces to coat evenly, for 2 minutes. Add the water, the star anise and the softened chestnuts. Reduce the heat to low and simmer for 40 minutes, stirring occasionally. Taste, adjust seasoning with salt and black pepper and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7155-braised-chicken-with-ginger-and-chestnuts"}