{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Roasted Duck (Anatra All'arancia)", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": null, "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, roasts", "keywords": "duck, gran marnier, italian bread, italian sausage, orange, pancetta, poultry, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["1 6-pound duck", "2 teaspoons finely chopped rosemary", "1 tablespoon plus 1 teaspoon finely chopped sage", "2 cloves garlic, chopped", "1 1/4 teaspoons salt", "1 1/4 teaspoons pepper", "1/4 pound spicy Italian sausage, cut from casing", "1/4 pound sweet Italian sausage, cut from casing", "1/4 cup (1 ounce) pancetta, cut into small dice", "1 cup diced day-old Italian bread, crust removed", "2 1/2 cups diced celery ( 1/2 cup small dice, 2 cups large dice)", "2 1/2 cups diced carrots ( 1/2 cup small dice, 2 cups large dice)", "2 1/2 cups chopped red onion", "6 oranges (1 peeled, seeded and diced, 3 juiced, 2 sliced 1/4 inch thick)", "2 teaspoons spezie forti (Tuscan spice) or garam masala", "3 tablespoons extra virgin olive oil", "1/4 cup Grand Marnier"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375. With paring knife, make four incisions in skin of duck: one between leg and breast on each side of duck, and one between wing and back on each side. Make a spice mixture with 1 teaspoon rosemary, 2 teaspoons sage, 1 chopped garlic clove, 1/4 teaspoon salt and 1/4 teaspoon pepper. Stuff incisions with pinches of mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size bowl, combine sausages, pancetta, bread, celery in small dice, carrots in small dice, 1/2 cup chopped onion, diced orange, remaining chopped garlic, remaining rosemary and sage, 1 1/2 teaspoons Tuscan spice, a half-teaspoon salt and a half-teaspoon pepper. Drizzle juice of one orange over ingredients, and mix well. Season cavity of duck with 1/4 teaspoon salt and 1/4 teaspoon pepper, stuff with mixture, and truss with a toothpick, a skewer or butcher's thread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour olive oil into a 9-by-13-inch roasting pan. Place duck in pan, breast side up. Rub surface of duck with oil from pan, and roast 40 minutes. Remove pan from oven, transfer duck to a cutting board, and pour off all but 1 tablespoon fat. Add remaining celery, carrots and onion to pan in an even layer, and place duck on vegetables, breast side up. Drizzle juice of one orange and Grand Marnier over duck, season duck with remaining Tuscan spice, 1/4 teaspoon salt and 1/4 teaspoon pepper, and layer slices of one orange over breast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return to oven, and roast 2 hours, basting with pan juices every 20 minutes. Once orange slices on breast have browned, add them to pan, pour juice of remaining orange over duck, and layer slices of second orange over breast. Raise oven to 400 degrees for final 20 minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck from oven, and transfer to a cutting board. Remove all but 4 orange slices from pan, and discard. Spoon off any excess fat, and discard. Pur&#233;e contents of pan in a food processor, and heat in a small saucepan over medium-high heat to reduce while you carve duck. Adjust seasonings, and pour sauce over carved duck. Serve."}], "link": "https://cooking.nytimes.com/recipes/7160-orange-roasted-duck-anatra-allarancia"}