{"@context": "http://schema.org", "@type": "Recipe", "name": "Fruit Tarts", "description": "", "author": {"@type": "Person", "name": "Christopher Idone"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six tarts", "recipeCuisine": "french", "recipeCategory": "sauces and gravies", "keywords": "berries, butter, egg yolks, flour, dessert, nut-free, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 386, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "12 grams", "sodiumContent": "60 milligrams", "sugarContent": "17 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups flour, sifted", "1/8 teaspoon salt", "1/2 teaspoon sugar", "1 1/2 sticks unsalted butter, chilled and cut into bits", "2 to 3 tablespoons ice water", "3 egg yolks", "1/4 cup sugar", "1 tablespoon arrowroot", "1 cup cold milk", "1 tablespoon eau de vie. such as framboise, poire or kirsch", "1/4 teaspoon vanilla", "1 sprig fresh mint", "3 cups, about 1 1/2 pints, fresh berries, such as strawberries, raspberries, blackberries or blueberries (see note)", "1/3 cup currant jelly"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, place the flour, salt, sugar and butter in the bowl of an electric mixer. Use a dough hook at low speed and mix until it is the consistency of cornmeal, about eight minutes. Add the ice water a tablespoon at a time. When the pastry becomes elastic and pulls away from the sides of the bowl, it is blended. Remove the pastry to a lightly floured surface and shape into a ball. Cover with waxed paper and refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the pastry dough on a lightly floured surface to a thickness of a quarter inch. Set six five-inch fluted, loose-bottomed tart pans together to form a rectangle. Lift the dough and place it loosely over the tart pans. Gently press the dough into the pans and roll firmly over the pans with a rolling pin. Remove the excess dough and line the bottom and corners with the dough. Prick the dough surface with a fork. Line the pastry with foil and weigh down with aluminum baking weights or dry beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tart shells on a baking sheet and bake for eight to 10 minutes or until the dough begins to release from the sides of the pans. Remove the weights and foil and bake for another eight minutes or until the pastry is lightly browned. Remove and cool on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the cream, bring the water to a simmer in the lower part of a double boiler. In the upper part of the boiler, whisk the egg yolks and sugar off the heat until the mixture becomes thick and lemon colored."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the arrowroot with the milk and add it to the egg mixture. Set the mixture over the bottom pan and whisk in the liqueur and vanilla. Continue whisking until the mixture becomes thick, about 10 minutes. Remove from the heat, bruise the mint and add to the cream mixture. Cool over a bowl of ice, whisking constantly. Cover and refrigerate until ready to assemble the tarts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the shells have cooled, remove the tart pan collars and bottoms. Stir the pastry cream and divide among the pastry shells. Tightly fill each pastry shell with one layer of berries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt the currant jelly with one tablespoon of water over medium-low heat. Brush the melted jelly over the berries. Set aside until ready to serve. Do not refrigerate."}], "link": "https://cooking.nytimes.com/recipes/7167-fruit-tarts"}