{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Baked Squid", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT6H30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "appetizer, beets, bread crumbs, brown sugar, cider vinegar, fennel seeds, lemon juice, mustard seed, onion, red onion, seafood, squid", "aggregateRating": null, "recipeIngredient": ["1 cup fresh lemon juice", "1/4 cup plus 1 tablespoon olive oil", "1/2 cup minced scallions", "8 cloves garlic, peeled and minced", "12 small whole squid, cleaned, tentacles finely chopped", "3/4 pound cleaned squid, sacs cut into 1/4-inch-thick rounds", "12 medium beets", "2 tablespoons balsamic vinegar", "Salt and pepper to taste", "1 head garlic", "1 medium onion, peeled and thinly sliced", "1 small red onion, peeled and thinly sliced", "2 shallots, peeled and halved", "1 teaspoon fennel seeds", "1/2 teaspoon yellow mustard seeds", "1/2 teaspoon celery seeds", "1/2 cup cider vinegar", "1/4 cup brown sugar", "1/2 teaspoon kosher salt", "1 teaspoon fresh ground pepper", "1 cup freshly made dry bread crumbs", "1 tablespoon minced basil leaves", "1 tablespoon minced parsley leaves", "1 tablespoon minced fennel leaves", "1 tablespoon minced chervil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the lemon juice, 1 tablespoon of the olive oil, scallions and garlic in a large glass or ceramic bowl. Add the squid. Cover and refrigerate for 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Combine 8 of the beets with 1 tablespoon olive oil in a baking dish. Roast the beets in the oven until tender, about 35 to 40 minutes. Set aside to cool. Peel. Cut into 1/3-inch cubes. Set aside. Dice the remaining 4 beets. Combine the diced beets and balsamic vinegar in a blender or food processor, and puree until smooth. Strain into a glass or ceramic bowl. Whisk in the remaining olive oil. Season to taste with salt and pepper. Add the roasted beets and toss. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all of the ingredients for the onion confit in a large saucepan. Simmer over medium heat for 1 hour. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the oven temperature to 475 degrees. Combine the bread crumb ingredients in a large bowl. Place the whole sacs together in a large baking dish. Place the sliced squid and tentacles next to them. Pour the marinade over all the squid. Top with the bread crumb mixture. Bake until tender, about 10-12 minutes. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon equal amounts of sliced squid and tentacles in the center of four plates. Strain the beets, reserve the vinaigrette. Ring the squid with a circle of minced beets. Wreathe the beets with a circle of onion confit. Arrange 3 whole sacs around the center like the spokes of a wheel. Drizzle with the beet vinaigrette. Garnish with chervil. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7182-lemon-baked-squid"}