{"@context": "http://schema.org", "@type": "Recipe", "name": "Cupid's Coupe", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT20M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "dessert, heavy cream, lime, phyllo dough, strawberry, sugar, nut-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 363, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "16 grams", "sodiumContent": "48 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 sheet phyllo dough", "1 tablespoon melted butter", "1 tablespoon confectioners' sugar", "2 pints fresh strawberries, hulled", "1 cup heavy cream", "1/4 cup granulated sugar", "Grated zest of 1 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Brush the phyllo sheet with butter and sprinkle with confectioners' sugar. Cut the sheet in half crosswise and then lengthwise to make 4 rectangles. Make a fan by taking the short side of 1 of the rectangles and gathering it together like pleats on a skirt, pinching the pleats together to make them stick. Place on a parchment-lined baking sheet. Repeat with remaining rectangles. Bake until light brown, about 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a scant pint of the strawberries in a blender and puree, stopping as necessary to scrape sides of jar. Pass the puree through a fine sieve so you are left with only a thick liquid. Set aside. Whip cream to soft peaks. Add the sugar and the lime zest. Whip to stiff peaks. Coarsely chop enough of the remaining strawberries to make 1/2 cup. Stir them into the cream mixture. Stir in the strawberry puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the remaining strawberries. Either use a small heart-shaped cutter to cut hearts out of the strawberry slices or trim them into heart shapes with a small knife. Press several of the strawberry hearts in a decorative, asymmetrical pattern against the inside of each of 4 wineglasses. Spoon in the mousse. Top with a layer of strawberry hearts. Place the narrow end of each fan into the mousse. Serve immediately."}]}