{"@context": "http://schema.org", "@type": "Recipe", "name": "Angel's Delight", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT30M", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "bittersweet chocolate, cocoa, corn syrup, egg whites, strawberry, sugar, dessert, gluten-free, nut-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 675, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "108 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "18 grams", "sodiumContent": "139 milligrams", "sugarContent": "102 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup granulated sugar", "1/4 cup light corn syrup", "1/4 cup water", "8 small fresh strawberries, hulled", "Butter and granulated sugar for molds", "6 ounces bittersweet chocolate, preferably Valrhona, coarsely chopped (see note above)", "5 tablespoons unsalted butter", "Pinch salt", "2 tablespoons cocoa", "4 egg whites", "3 tablespoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the angel hair, combine sugar, corn syrup and water in a medium saucepan. Place over high heat and cook, swirling pan occasionally, until the mixture reaches 305 degrees on a candy thermometer. Immediately remove from heat and plunge the bottom of the pan into cold water. Let stand until mixture thickens, about 5 minutes. Place a large sheet of parchment paper on a work surface. Hold 2 forks in 1 hand and dip the tines into the syrup. Rapidly wave the forks back and forth over the parchment paper, letting the thin, fine strands fall on the paper. Repeat with remaining syrup. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the strawberries. Either use a small heart-shaped cutter to cut hearts out of strawberry slices or trim them into heart shapes with a small knife. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake, preheat oven to 375 degrees. Butter 4 1-cup ramekins and coat with sugar. Set aside. Place chocolate, butter and salt in a double boiler. Heat over medium heat, stirring occasionally until melted. Remove from heat, add cocoa and whisk until smooth. In separate bowl, whip egg whites on medium speed until foamy. Add sugar, turn speed to high and whip to stiff peaks. Very gently fold chocolate into egg whites. Spoon the mixture into the molds until they are 3/4 full (this may not take all of the batter). Bake until puffed and browned but still liquid in the center, about 5 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a small knife inside the rim of the molds to loosen. Invert the cakes onto the center of each of 4 plates. Wrap some of the angel hair around each of the cakes. Scatter a few of the strawberry hearts over the angel hair. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7187-angels-delight"}