{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Chocolate Pudding Enchiladas With Strawberry Almond Salsa", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "amaretto, butter, cocoa, kaluah, milk, mint leaves, semisweet chocolate, serrano pepper, sliced almonds, strawberry, dessert, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 576, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "5 grams", "proteinContent": "15 grams", "saturatedFatContent": "14 grams", "sodiumContent": "134 milligrams", "sugarContent": "54 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 pound semi-sweet chocolate", "1 ounce (1/4 stick) unsalted butter, soft", "3 1/2 cups milk", "2 tablespoons cornstarch", "1/4 cup cocoa", "3/4 cup sugar", "2 eggs", "3 egg yolks", "1/4 cup Kahlua", "3/4 cup all-purpose flour", "1/4 cup plus 2 tablespoons unsweetened cocoa", "2 tablespoons sugar", "1 1/4 cups milk", "2 eggs", "Butter for cookie sheet", "Strawberry almond salsa (<a href=\"http://cooking.nytimes.com/recipes/7202-strawberry-almond-salsa\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt chocolate and butter over simmering water in top of a double boiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 1/2 cup of the milk into a medium-size bowl. Whisk in the cornstarch, cocoa and 1/4 cup of the sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size saucepan over medium heat, scald remaining 3 cups of milk and 1/2 cup of sugar by heating to just under a boil, when it begins to foam. Remove from heat, and whisk hot liquid into the cornstarch mixture. Return to heat and, while constantly scraping bottom of pan with a whisk, cook until tiny bubbles boil up for 10 seconds, no more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put eggs and egg yolks in a bowl. Whisking vigorously, slowly drizzle in one cup of hot liquid. Pour everything back into saucepan. Simmer until tiny bubbles boil up again, constantly scraping bottom of pan with a whisk. Stir in Kahlua. Strain pudding, and fold in the melted chocolate and butter. Cover with wax paper to prevent a skin from forming. Set aside for one hour. Refrigerate until chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make enchiladas, first make the crepes. Put flour, cocoa, sugar, milk and eggs in the bowl of a food processor, or blender and run at high speed for one minute. Scrape down the sides, and run for another 10 seconds. Let batter rest in refrigerator for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a nonstick saute pan or crepe pan over medium-high heat for one minute. Remove it from heat and, holding it with one hand, pour 1/4 cup of the batter into it. Quickly tilt it so a thin film of batter coats pan's bottom. Return pan to heat, and cook for 1 to 2 minutes, or until the top looks set but not dry and you can lift crepe with a rubber spatula and then your fingers. (Cover your free hand with a paper towel to catch finished crepe.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place crepes cooked-side-up on a sheet of waxed paper, and repeat with rest of batter. You should have 8 to 10."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Lightly butter a cookie sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a crepe, cooked side up, on a dry work surface. Drop about 1/4 cup of pudding in the center. Spread it from side to side, leaving one-inch borders. Fold bottom edge over the center of the pudding. Next, fold the right side of the crepe back to the middle; repeat with the left side. Fold the last section toward the middle to make the enchilada. Repeat with remaining crepes. These may be prepared up to a day in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each enchilada, seam side down, on buttered pan. Bake for 5 to 7 minutes to warm them. Serve with strawberry almond salsa."}], "link": "https://cooking.nytimes.com/recipes/7201-warm-chocolate-pudding-enchiladas-with-strawberry-almond-salsa"}