{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Vanilla Cakes", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "12 cakes", "recipeCuisine": "", "recipeCategory": "project", "keywords": "bread flour, butter, vanilla bean, vanilla ice cream, white chocolate, dessert, nut-free", "aggregateRating": null, "recipeIngredient": ["7 tablespoons butter; more for molds", "10 ounces top-quality white chocolate", "5 eggs at room temperature, separated", "3 vanilla beans, split in half lengthwise and seeds scraped", "1/4 cup plus 2 tablespoons bread flour, sifted", "Pinch cream of tartar", "1/4 cup plus 2 tablespoons sugar", "Vanilla ice cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter and 7 ounces white chocolate in a double boiler over water that is hot but not boiling. When mixture is melted, remove from heat and stir until smooth. Whisk in egg yolks and half the vanilla-bean seeds. Sift flour over mixture. Whisk until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an electric mixer fitted with a whisk, combine egg whites and cream of tartar. Whisk until fluffy. Slowly add sugar a little at a time, until meringue is shiny and tight. Fold a little of the chocolate mixture into meringue; then fold meringue into remaining chocolate mixture, until mixture is smooth. Cover with plastic wrap, and refrigerate about 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Line a baking sheet with parchment paper. Butter 12 metal rings 2 1/2 inches in diameter and 1 1/4 inches high. Place them on parchment paper. Using a spatula, spoon cool batter into a pastry bag with a tip opening of about 1/2 inch. Fill molds 1/3 full. Break remaining chocolate into pieces about 1 inch square and 1/8 inch thick. Drop a piece in each mold. Sprinkle a little cluster of vanilla seeds from remaining beans. Cover chocolate with more batter so molds are barely 2/3 full."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 12 to 14 minutes, until risen and still a bit jiggly in center. Remove from oven. Have 12 plates ready. Slip tip of a knife under cake, and lift it a little; then slide a spatula underneath, and transfer to a serving plate. Holding mold in place with tongs, run a sharp knife around top edge of mold; then lift mold off cake with tongs. Repeat with other cakes. Serve immediately with ice cream."}], "link": "https://cooking.nytimes.com/recipes/7209-warm-vanilla-cakes"}