{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Tomato and Eggplant Casserole", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "eggplant, onion, tomato, main course, side dish", "aggregateRating": null, "recipeIngredient": ["3 pounds plum tomatoes (about 12 to 14), halved", "Salt for seasoning, plus 1 teaspoon", "Freshly ground black pepper for seasoning, plus 1/4 teaspoon", "3 medium eggplants (about 3 pounds), cut into 1/2-inch slices", "3 tablespoons olive oil", "3 large red onions (about 3 pounds), halved and sliced", "3 large yellow onions (about 3 pounds), halved and sliced", "6 cloves garlic, chopped", "1/2 cup white wine", "2 cups homemade or low-sodium chicken stock", "1 1/4 teaspoons chopped fresh rosemary", "1 1/4 teaspoons chopped fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Season the cut sides of the tomatoes lightly with salt and pepper and place cut sides down on a lightly oiled baking sheet. Bake until the tomatoes are very lightly browned and collapsed, about 3 hours. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the oven temperature to 450 degrees. Sprinkle the eggplant slices lightly with salt and transfer them to a large colander to drain for 30 minutes. Wipe the slices dry with paper towels and place them in a single layer on one or more lightly oiled baking sheets. Roast the eggplant slices, turning once, until they are soft and lightly browned, about 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large, heavy-bottomed kettle, heat the 3 tablespoons of olive oil over medium heat and add the red and yellow onions and garlic. Cook, stirring frequently, until the onions are very soft and lightly caramelized, about 25 minutes. (Lower the heat if the bottom of the pan begins to scorch.) Add the wine, stock, herbs and 1 teaspoon salt and 1/4 teaspoon pepper. Raise the heat to high and continue to cook until the mixture thickens slightly, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the oven to 400 degrees. Spread a thin layer of the onion mixture in the bottom of a 13-by-9-inch baking pan. Top with half the eggplant slices, half the tomatoes and half of the remaining onions. Top with the remaining eggplant slices, tomatoes and onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until bubbly and lightly browned, about 35 to 40 minutes. Let stand for 10 minutes before serving."}]}