{"@context": "http://schema.org", "@type": "Recipe", "name": "Deviled Chicken Thighs", "description": "In cooking, the term ''deviled'' has several meanings, but it most often implies a preparation with a sharp flavor, most often derived from mustard, vinegar, cayenne or other chiles. In this dish, you don't need vinegar, because there is plenty of acidity in Dijon mustard. Nor, strictly speaking, do you need cayenne (and I omit it when cooking for children); the taste is strong without it. \n\nYou can make this dish with chicken breasts if you prefer; I recommend bone-in breasts, which follow the same procedure. For boneless, skinless breasts -- forget crispness, of course -- smear the meat all over with the mustard mixture, then broil it for just about six minutes, turning two or three times to prevent burning.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/02/09/dining/09COOKING_BAKEDCHICKEN2/09COOKING_BAKEDCHICKEN2-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weeknight", "keywords": "chicken thigh, dijon mustard, shallot, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1842}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 683, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "2 grams", "proteinContent": "50 grams", "saturatedFatContent": "14 grams", "sodiumContent": "775 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["8 chicken thighs, or a mixture of thighs and drumsticks", "Salt and freshly ground black pepper", "1/3 cup Dijon mustard", "1/3 cup minced shallots, onion or scallion", "1/4 teaspoon ground cayenne pepper or Tabasco sauce, or to taste", "Minced parsley for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to its maximum, and set the rack about 4 inches from the heat. Season the chicken with salt and pepper on both sides, and place it in a pan, skin side up. Broil, watching carefully, until the skin is golden brown, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the mustard, shallots and cayenne. (If you have a small food processor, you can chop the shallots by throwing them in with the mustard and pulsing the machine on and off a few times.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken has browned, remove it from oven, and turn it. Spread just a teaspoon or so of the mustard mixture on the underside of the chicken, and broil about 5 minutes. Turn the chicken, and spread the remaining mixture on the upper, or skin side. Broil until mustard begins to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, the chicken may be done. (There will be only the barest trace of pink near the bone; an instant-read thermometer inserted into the meat will read 160 degrees.) If it is not done, turn off the broiler and leave the chicken in the oven 5 more minutes or so. Garnish and serve."}]}