{"@context": "http://schema.org", "@type": "Recipe", "name": "Sage Chicken In A Fried Potato Crust", "description": "I have thought a lot about fried chicken because Americans love it. The idea for a potato crust on it came to me from frozen Tater Tots. I loved their crunch and thought if I coated the chicken with potatoes instead of bread crumbs the crunch would be better. It's more work, but it's more than worth it. Wrapping the chicken in plastic film helps the coating adhere, but you need to put the wrapped pieces in the freezer for an hour to get the plastic off without removing the potato coating.", "author": {"@type": "Person", "name": "Michel Richard"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, potato, sage, main course", "aggregateRating": null, "recipeIngredient": ["3 skinless, boneless chicken breast halves", "3 skinless, boneless chicken thighs", "1/2 cup loosely packed chopped sage", "1 teaspoon minced garlic", "1 teaspoon ground cumin", "2 pounds (2 to 3 large) baking potatoes", "7 tablespoons all-purpose flour", "2 tablespoons lightly beaten large egg white", "Freshly ground black pepper", "2 large eggs, lightly beaten", "Grapeseed oil for deep frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each chicken breast half into three pieces, and each thigh into two pieces. In a bowl, combine chicken, sage, garlic and cumin. Cover and refrigerate for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mandoline or sharp knife, slice potatoes into 1/8-inch-thick julienne, then crosswise into 1/8-inch dice. Rinse, then pat dry between cloth towels. Roll in towels to squeeze out moisture. In a medium bowl, combine potatoes with 4 tablespoons flour and beaten egg white. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape garlic and sage from chicken pieces, and pat dry with paper towels. Season with pepper to taste and dust with remaining flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 10-inch square of plastic wrap on a work surface. Evenly spread about 2 tablespoons of potato in center of plastic. Dip a piece of chicken in beaten egg, and place in center of potato. Top with about 1 tablespoon potato, and wrap plastic securely so that potato covers chicken completely. Repeat with remaining chicken, egg and potatoes, to make a total of 15 packets. Place in freezer for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 200 degrees. Preheat at least 4 inches oil in a deep fryer to 325 degrees. Unwrap three chicken packets, and deep fry until potatoes are crisp and golden brown, 5 to 8 minutes. Transfer to baking sheet lined with paper towels, and keep warm in oven. Repeat with remaining packets. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/7240-sage-chicken-in-a-fried-potato-crust"}