{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza Dough", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "1 large pizza", "recipeCuisine": "italian", "recipeCategory": "dinner, pizza and calzones", "keywords": "active dry yeast, all-purpose flour, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "recipeIngredient": ["3 cups all-purpose or bread flour, plus more as needed", "2 teaspoons instant yeast, such as SAF-Instant Yeast", "2 teaspoons coarse sea or kosher salt, plus extra for sprinkling", "1 to 1 1/4 cups water", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a food processor, combine flour, yeast and salt in work bowl. Turn machine on and add 1 cup water and the oil through the feed tube. Process 30 seconds, adding up to 1/4 cup more water, a little at a time, until mixture forms a ball and is slightly sticky to the touch. (In unlikely event mixture is too sticky, add flour, a tablespoon at a time.) To make dough by hand, combine half the flour with the yeast and salt in a bowl and stir to blend. Add 1 cup water and the olive oil; stir with a wooden spoon until smooth. Add remaining flour bit at a time; when mixture becomes too stiff to stir with a spoon, begin kneading, adding as little remaining flour as possible, just enough to keep dough from being sticky mess. Knead 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough onto a floured work surface and knead by hand a few seconds to form a smooth, round ball. Transfer to a bowl and cover with plastic wrap; let rise until doubled in size, 1 to 2 hours. (You can cut rising time if you are in a hurry, or you can let dough rise more slowly in refrigerator for 6 to 8 hours.) Dough can then be used immediately or wrapped tightly in plastic wrap and frozen for a month. Defrost in covered bowl in refrigerator or at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form risen dough into a ball and divide into two or more pieces; roll each into a ball. Place each on a lightly floured surface, sprinkle with a little flour, and cover with plastic wrap or a towel. Let rest until slightly puffed, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil one or more baking sheets, then press each dough ball into a flat round directly on sheet. Pat out dough as thin as you like, using oiled hands if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Proceed with any recipe."}]}