{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Snapper With Tomatoes, Potatoes, Mussels and Clams", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "dinner, one pot", "keywords": "clams, mussels, red snapper fillets, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 539, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "6 grams", "proteinContent": "49 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1643 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium white onions, peeled, quartered and cut into 1/8-inch-thick slices", "2 baking potatoes, peeled, quartered and cut into 1/8-inch-thick slices", "Salt and freshly ground pepper to taste", "2 ripe tomatoes, quartered and cut into 1/8-inch-thick slices", "2 branches fresh thyme", "2 cups white wine", "2 1/2 teaspoons olive oil", "1/2 cup chopped shallots", "24 littleneck clams, scrubbed", "24 small mussels, scrubbed, beards removed", "12 cloves roasted garlic, peeled", "4 4-ounce red snapper fillets", "4 lemon slices", "2 teaspoons chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of water to a boil. Add onions and blanch until tender, about 3 minutes. Remove with a slotted spoon. Add potatoes and blanch until tender, about 7 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange onions in the bottom of a 14-inch ovenproof skillet (or divide between 2 smaller skillets). Layer the potatoes over onions and season with salt and pepper. Layer tomatoes over potatoes and place thyme on top. Pour in 1 cup of wine, place over medium-high heat and bring to a simmer. Reduce heat and simmer for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 350 degrees. Heat 1/2 teaspoon of olive oil in a large, wide pot over low heat. Add the shallots and saute for 5 minutes. Add the remaining wine and bring to a boil. Add clams and mussels, cover and cook until shells are opened, about 8 minutes. Strain; reserve the broth. Keep the clams and mussels warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter roasted garlic over tomatoes. Season snapper with salt and pepper and lay the fillets over the vegetables. Drizzle with the remaining olive oil. Pour 1 cup of reserved broth around the fish. Bake until cooked through, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use a spatula to get underneath the fish and vegetables so that you can transfer each serving to a soup plate, without disturbing the layers. Garnish with the clams and mussels. Top with a lemon slice and the chopped parsley and serve immediately."}]}