{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Tuna Salad With Fennel", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "fennel, mixed salad, tuna, low cholesterol, main course", "aggregateRating": null, "recipeIngredient": ["1 1/2 pounds tuna, in one chunk", "2 heads fennel, sliced into 1/2-inch- thick rings, leafy green fronds reserved", "Kosher salt and freshly ground black pepper to taste", "4 cloves garlic, peeled", "2 to 3 cups olive oil", "3 tablespoons freshly squeezed lemon juice", "6 cups salad greens", "1/2 small red onion, thinly sliced", "1 red tomato, sliced into thin wedges", "1 yellow tomato, sliced into thin wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Season the tuna and fennel generously with salt and pepper and place in a deep, 8-by-8-inch baking dish. Place the garlic in the pan and pour in just enough olive oil to cover the tuna. Bake for 15 minutes, until the fennel softens and the tuna is just pink at the center. Remove from the oven and cool in the oil for 5 minutes. Using a slotted spoon, remove the tuna, fennel and garlic from the oil and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic, 6 tablespoons of the oil in which the fish cooked and the lemon juice in the container of a blender and blend until smooth. (Discard the remaining oil or save it for another use.) Season the dressing to taste with salt and pepper. Toss the greens and onion with 3 tablespoons of the dressing and place them on a platter. Slice the tuna thinly and lay it over the greens along with the fennel. Toss the tomatoes with 2 tablespoons of the dressing and surround the tuna with them. Pour the remaining dressing over the tuna, chop a few of the fennel fronds and sprinkle them over the tuna. Serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/7284-baked-tuna-salad-with-fennel"}