{"@context": "http://schema.org", "@type": "Recipe", "name": "Big Apple Pie", "description": "", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, pie pastry, dessert", "aggregateRating": null, "recipeIngredient": ["3 pounds apples, 2 or 3 different kinds, like Golden Delicious, Macoun or Cortland, but not Granny Smith or greenings", "1/2 cup granulated sugar", "1/2 cup apple cider or apple cider vinegar", "1 1/2 teaspoons cinnamon", "1/8 teaspoon salt", "Several grindings black pepper", "2 tablespoons flour", "Cold pastry for a 9- to 10-inch double-crust pie", "2 tablespoons unsalted butter", "1 egg beaten with 1 tablespoon of water", ""], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Peel and core the apples, and cut them into slices. Place in a large bowl. Add sugar, apple cider or vinegar, cinnamon, salt, pepper and flour. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a deep-dish 9- or 10-inch metal pie pan with half the pastry, leaving a generous top edge. Prick the bottom of the pastry all over with the tines of a fork. Transfer apples to pie tin, mounding slightly in center. Cut butter into bits, and distribute over apples."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover apples with the other half of the pastry. Trim around edges, and pinch the top and bottom pastry together. Using a pastry brush, paint the top of the pastry with the egg wash. With a sharp knife make a small hole in the center of the pastry. Make five cuts, each about three-inches long, radiating from the center hole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pie pan on a baking sheet, and bake on the lower level of the oven for 10 minutes. Reduce the heat to 325, and bake for about 50 minutes longer, until the crust is deep golden brown. Remove to a rack, and cool. Serve warm or at room temperature with whipped cream, creme fraiche or ice cream."}], "link": "https://cooking.nytimes.com/recipes/729-big-apple-pie"}