{"@context": "http://schema.org", "@type": "Recipe", "name": "Bittersweet Chocolate Semifreddo", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "16 servings", "recipeCuisine": "", "recipeCategory": "dinner, ice creams and sorbets", "keywords": "bittersweet chocolate, egg whites, hazelnut, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "9 grams", "sodiumContent": "48 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces bittersweet chocolate, chopped, plus 2 ounces shavings for garnish", "6 tablespoons unsalted butter", "1 3/4 cups heavy cream", "3 tablespoons dark rum", "3/4 cup egg whites (from about 5 large eggs)", "1 1/2 cups sugar", "Pinch of salt", "1 cup whole hazelnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the top of a double boiler set over barely simmering water, combine the chocolate and 4 tablespoons of the butter. Cook, stirring occasionally, until the chocolate melts and the mixture is smooth. Remove from the heat and set aside. Whip the cream with the rum until soft peaks form. Cover and refrigerate. In the top of a double boiler, combine the egg whites, sugar and salt. Cook, whisking continually, until the mixture registers 140 degrees on a candy thermometer and remove from heat. Transfer the mixture to a bowl of an electric mixer and whip on a high speed until the meringue is completely cooled, about 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 400 degrees. Place the hazelnuts in a heavy baking pan and roast until the skins crack and the nuts are lightly browned, about 10 minutes. Rub the nuts in a towel to remove the skins. Transfer the nuts to a food processor, add the remaining butter and process until a smooth paste is formed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 2-quart loaf pan with plastic wrap. In a large bowl, combine the melted chocolate and the hazelnut paste. Fold in the whipped cream. Fold in 1/4 of the meringue, then the remainder. Scrape the mixture into the prepared pan, cover with a plastic wrap and freeze overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove the top layer of plastic wrap, invert the loaf pan onto a platter and peel away the remaining plastic wrap. Slice into 1/2-inch slices and garnish with chocolate shavings."}], "link": "https://cooking.nytimes.com/recipes/7298-bittersweet-chocolate-semifreddo"}