{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Lamb Shanks With Apricot Curry Sauce", "description": "", "author": {"@type": "Person", "name": "Charlie Trotter"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "dried apricots, lamb shanks, onion, main course, winter", "aggregateRating": null, "recipeIngredient": ["3/4 cup dried apricots, diced", "1 1/2 teaspoons hot curry powder", "1/2 cup rice wine vinegar", "1 tablespoon Dijon mustard", "4 lamb shanks, 12 to 16 ounces each, bones cracked", "3 1/2 tablespoons grapeseed or canola oil", "2 carrots, peeled, in 1 1/2-inch chunks", "2 stalks celery, in 1 1/2-inch chunks", "1 Spanish onion, peeled, in 1 1/2-inch chunks", "1 red, green or yellow pepper, cored, seeded and diced", "8 large cloves garlic, peeled", "1 sprig fresh thyme, more for garnish", "2 bay leaves", "1/2 teaspoon black peppercorns", "4 servings creamy, garlicky grits"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, combine apricots, curry powder, vinegar, mustard and 1 cup water. Puree until smooth, about 3 minutes. Place lamb shanks in a glass or other nonreactive dish, and add apricot sauce. Turn to coat lamb well. Cover and refrigerate 1 to 2 days, turning meat occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 275 degrees. Place a large, deep, heavy saute pan over medium-high heat, and add 2 tablespoons oil. Remove lamb from marinade, reserving liquid. Brown lamb, turning often to prevent burning. Transfer to a platter. Add remaining 1 1/2 tablespoons oil to pan. Add carrots, celery, onion, bell pepper and garlic. Saute over medium heat until softened but not browned, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lamb shanks on vegetables, and add thyme sprig, bay leaves, peppercorns and all but 1/2 cup marinade. Add water to come up almost to top of pan. Lay a sheet of parchment paper over pan, and carefully transfer to oven. Braise until meat is so tender it almost falls off bone, 5 to 6 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from oven. Using a slotted spoon, transfer lamb to a baking sheet. Brush with remaining marinade. Raise oven temperature to 300 degrees, and return lamb to oven to crisp. Strain cooking liquid into saute pan, discarding vegetables. Cook over high heat, reducing it by four-fifths."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon grits onto each of four serving plates. Lay lamb on top, and spoon some cooking liquid around and over. Garnish each plate with a sprig of thyme."}], "link": "https://cooking.nytimes.com/recipes/7305-braised-lamb-shanks-with-apricot-curry-sauce"}