{"@context": "http://schema.org", "@type": "Recipe", "name": "Crepes Belle-Hélène", "description": "", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, quick", "keywords": "bartlett pear, bittersweet chocolate, vanilla ice cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 893, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "137 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "7 grams", "proteinContent": "11 grams", "saturatedFatContent": "22 grams", "sodiumContent": "131 milligrams", "sugarContent": "106 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup sugar", "1 vanilla bean, split lengthwise", "2 strips lemon zest, each about 2 1/2 inches by 1/2 inch", "3 large Bartlett pears or other pears suitable for poaching, peeled, cut in two lengthwise and cored", "1 cup flour", "1 1/3 cups milk", "1 large egg", "2 tablespoons butter, melted and slightly cooled", "8 ounces bittersweet or semisweet chocolate, chopped", "1/2 cup strong black coffee or 1 teaspoon instant coffee dissolved in 1/2 cup water", "1/2 cup sugar", "1/2 cup heavy cream", "1 tablespoon Poire William liqueur, optional", "6 scoops high-quality vanilla ice cream", "Crystallized violets, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pears: In a wide saucepan, mix together 1 cup sugar, vanilla bean, lemon zest and 3 cups water. Place over low heat and stir until sugar dissolves. Increase heat to medium and simmer for 5 minutes. Add pear halves and simmer until pears are tender but still keep their shape, about 30 minutes. Transfer pears to a bowl, and set aside. (Vanilla bean may be rinsed, dried and placed in a jar of sugar to make vanilla-scented sugar.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pears poach, prepare crepes: heat oven to 200 degrees. Mix together the flour, milk and egg until smooth. Transfer to a bowl, and stir in melted butter. Place a nonstick or well-seasoned crepe pan or 8-inch skillet over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour a scant 1/4 cup batter into center of pan; lift pan and swirl it so batter covers bottom thinly and evenly. Return pan to heat, and allow it to sit until bottom of crepe is lightly browned, about 1 minute. Flip crepe, and cook other side for 30 to 60 seconds. Transfer to a parchment-paper lined baking sheet, and place in oven to keep warm. (Alternatively, crepes may be allowed to cool for reheating later.) Continue with remaining batter, to make a total of at least 6 crepes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chocolate sauce: In a small saucepan, combine chocolate, coffee and 1/2 cup sugar. Place over low heat, stirring occasionally, until chocolate melts. Add cream, return to a bare simmer, and stir until smooth. Stir in liqueur, if using. Pour into a pitcher, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Cut pear halves into thin slices. Arrange crepes on a clean work surface, and cover half of each crepe with pear slices. Fold crepes over to make six semicircles. Use a spatula to transfer crepes to individual serving plates or one large platter. At one side of each semicircle place a scoop of ice cream. Fold other side over to make a fat quarter. Top each quarter with hot chocolate sauce, and garnish with crystallized violets."}]}