{"@context": "http://schema.org", "@type": "Recipe", "name": "New England Clam Chowder", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "new england", "recipeCategory": "dinner, project, soups and stews", "keywords": "appetizer, bacon, cherrystone clams, russet potatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 480, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "15 grams", "sodiumContent": "482 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons kosher salt", "12 cherrystone clams, rinsed clean", "12 to 16 ice cubes", "1 packet ( 1/4 ounce) unflavored gelatin powder", "1/2 cup extra virgin olive oil", "1/2 cup minced chives (about 1 ounce)", "1/2 pound russet potatoes (about 1 medium potato), peeled, cut into 8 pieces", "1 cup plus 2 tablespoons heavy cream", "Crushed black pepper to taste", "2 cups chopped white or yellow onion (about 1 large)", "1/4 pound thick-cut bacon, about 4 slices", "6 potato chips, finely crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For clams and clam-broth jelly, fill a 6-quart pot halfway with water, add 1 tablespoon salt, and boil over high heat. Immerse 4 clams for 15 to 20 seconds, and remove. Working over a small bowl, shuck the 4 clams with a short sharp paring knife, reserving liquid they release. Reserve shelled clams in another small bowl. Return any stubborn clams to boiling water for a few seconds. Repeat, cooking 4 clams at a time, using all 12. Drain any accumulated clam juice into clam juice bowl, cover clams with plastic wrap, and chill in refrigerator for about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour 1 1/2 quarts cold water into a large bowl and add ice cubes. Strain clam juice into another small bowl. (You should have about 1 cup; add water if necessary.) Pour 3/4 cup clam juice into small saucepan, and heat over medium-low heat until it simmers. Soften unflavored gelatin in remaining clam juice. Pour hot clam juice over gelatin, and whisk until it dissolves. Set bowl of clam juice and gelatin halfway into ice-water bath, whisking often, for about 5 minutes, as the gel begins to set. Remove bowl when juice is barely set, but not firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For chive oil, heat 1/4 cup olive oil in a small saucepan until just smoking; remove from heat. Add minced chives and 1/4 teaspoon salt, stirring to dissolve. Let cool for 10 minutes, pur&#233;e in a blender, strain through a fine mesh strainer or coffee filter, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For potato pur&#233;e, boil 4 cups water in a small saucepan. Add 1 teaspoon salt and potatoes, and cook until fork-tender, about 15 minutes. Drain, reserving boiling water, and mash potatoes in medium bowl. Add 1 teaspoon olive oil, 1/2 teaspoon of salt and 6 tablespoons potato water, blending with an immersion blender or food processor until potatoes are a thick paste. Add 2 tablespoons cream, stirring, until potato is consistency of thickened cream. Thin further, if necessary, with potato water. Season to taste with salt and pepper. Keep warm, or warm before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For onion jam, heat 2 tablespoons olive oil, 1/2 teaspoon salt and chopped onion in a medium skillet over medium-low heat and saut&#233;, stirring frequently, until onion is very soft, but not caramelized, about 15 minutes. Pur&#233;e in a food processor with 1 tablespoon olive oil until smooth; season with salt to taste and reserve. Keep warm or warm before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For bacon cream, lay bacon in a cold, medium skillet, and fry over medium-high heat, flipping several times, until crisp, about 5 minutes. Add 1 cup cream to pan with bacon still in it and turn off heat under pan. Allow to rest 5 minutes; remove and reserve bacon strips from pan. Chop bacon finely, for use as a garnish. Keep cream warm but not hot, whipping to a froth in a bowl just before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble servings in 6 small shallow bowls. Spoon 2 tablespoons warm potato pur&#233;e into each bowl. Add 1 tablespoon of warm onion jam, slightly off-center. Spoon 1 tablespoon bacon cream around edge of pur&#233;es. Place a room-temperature clam in center of bowl. If clam broth jelly has solidified, pulse it with an immersion blender or whisk it until it is a loose gel, and spoon 1 teaspoon directly over clam in each bowl. Drizzle chive oil over dish. Garnish with reserved diced bacon and with pinches of crushed potato chips."}], "link": "https://cooking.nytimes.com/recipes/7318-new-england-clam-chowder"}