{"@context": "http://schema.org", "@type": "Recipe", "name": "Spoonbread With Cheese and Scallions", "description": "Spoonbread, a sort of cornmeal soufflé, is far more popular in places like Virginia and the Carolinas than in Tennessee and Mississippi, where I did my formative eating. I love it, but I never understood why nobody ever made it with cheese (cheese grits being one of the world's great creations), so I did. Purists will likely curse me, but I have to say that cheese spoonbread is possibly the most inspired idea I've ever had. It's great with sausage, but it would also pair well with country ham or any kind of stew or daube.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": "https://static01.nyt.com/images/2016/11/16/dining/16COOKING-SPOON-BREAD1/16COOKING-SPOON-BREAD1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, casseroles", "keywords": "cornmeal, scallion, sharp cheddar cheese, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 283, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "1 gram", "proteinContent": "12 grams", "saturatedFatContent": "9 grams", "sodiumContent": "364 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons butter, plus enough to grease the baking dish", "1/2 cup firmly packed, grated Parmesan cheese", "2 bunches scallions, white and light-green parts, thinly sliced", "2 cups whole milk", "1 cup half-and-half", "1/2 teaspoon salt", "1 cup white cornmeal", "1/2 cup firmly packed, grated sharp Cheddar cheese, preferably white", "4 eggs, separated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Butter a 2-quart soufflé dish or casserole and sprinkle with enough Parmesan (about 1 tablespoon) to lightly coat the dish. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon butter in a skillet, add the scallions and cook until just wilted. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy saucepan over medium heat, heat the milk, half-and-half and salt until bubbles form around the edges. Slowly sprinkle in the cornmeal, stirring constantly. Continue to stir and cook over low heat until the mixture is smooth and creamy. Remove pot from the heat and add the remaining butter and Parmesan, the scallions and the Cheddar cheese. Stir vigorously until well incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly beat the egg yolks and add them, stirring vigorously. Beat egg whites until they form stiff peaks. Beat a large spoonful of whites into the cornmeal mixture; then gently fold in the rest of the whites. Pour into the prepared dish and smooth the top. Bake 30 to 40 minutes, or until puffy and golden brown on top. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7328-spoonbread-with-cheese-and-scallions"}