{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Marsala and Mushrooms", "description": "Served over a tangle of linguine or with side of roast potatoes, this classic Italian-American dish made with chicken breasts, mushrooms and Marsala wine is comfort home cooking at its absolute best. Good news: It's also weeknight easy. First, pound boneless chicken breasts (you can use boneless thighs, too, but they might need a little more cooking time) with a mallet or a rolling pin until they're about 1/4-inch thick. Season them generously with salt and pepper, dredge in flour and fry in a little olive oil until they're golden brown. Make a quick sauce of mushrooms, shallots and Marsala and pour it over the chicken. Garnish with a little chopped parsley or chervil for color. That's good eating.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2018/03/27/dining/27COOKING-CHICKENMARSALA2/27COOKING-CHICKENMARSALA2-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken breast, marsala, mushroom, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1064}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 443, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "42 grams", "saturatedFatContent": "4 grams", "sodiumContent": "705 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons olive oil", "4 boneless, skinless chicken breast halves (about 1 1/2 pounds), pounded to 1/4-inch thickness", "Kosher salt and freshly ground pepper to taste", "2/3 cup flour", "1/2 pound cleaned and thinly sliced button, crimini or shiitake mushrooms (or a combination)", "1 shallot, minced", "4 tablespoons Marsala wine, more as needed", "3 tablespoons veal glaze (<a href=\"http://cooking.nytimes.com/recipes/7340-veal-stock\">see recipe</a>) or chicken stock, more as needed", "1 tablespoon butter", "1 tablespoon chopped chervil or parsley (optional, for garnish)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a medium-size skillet set over high heat. Sprinkle the chicken pieces with salt and pepper to taste and dredge in flour. Place 2 of the chicken pieces in the pan and cook until nicely browned, about 2 minutes per side. Add another tablespoon of oil and the remaining chicken pieces. As chicken is cooked, set aside on a plate and loosely tent with foil to keep it warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining tablespoon of oil in the skillet, add the mushrooms and shallot and cook until the mushrooms are tender and beginning to brown. Add the Marsala wine and cook until reduced by half. Stir in the veal glaze or stock and heat for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and swirl in the butter until melted. Transfer the chicken to a serving platter and pour the sauce from the skillet over the chicken. Garnish with chervil or parsley and serve."}]}