{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken-Tarragon Pot Pie", "description": "This recipe, which is adapted from “Julia and Jacques at Home” by Julia Child and Jacques Pépin and was featured in a New York Times article about roast chicken, makes delicious use of leftovers (it would be excellent with the Thanksgiving turkey remainders as well). It is rich, but packed with vegetables. You can substitute dried tarragon for fresh, but use less than a tablespoon, and season to taste.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/01/16/dining/16COOKING_CHICKENTARRPOTPIE/16COOKING_CHICKENTARRPOTPIE-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, one pot", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 656, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "2 grams", "proteinContent": "18 grams", "saturatedFatContent": "27 grams", "sodiumContent": "409 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups all-purpose flour", "14 tablespoons (1 3/4 sticks) cold unsalted butter, cut into pieces", "1 tablespoon cold vegetable shortening", "Scant 1/2 teaspoon salt", "Scant 1/2 teaspoon sugar", "1 egg", "5 tablespoons unsalted butter", "1 cup chopped carrot", "1 cup chopped celery", "1 cup thinly sliced leeks", "1 tablespoon chopped fresh tarragon", "1 cup frozen baby green peas", "4 tablespoons all-purpose flour", "2 1/2 cups chicken broth", "1 cup heavy cream", "1/4 teaspoon salt", "1/4 teaspoon freshly ground pepper", "3 cups leftover roast chicken, cut into 1/2-inch chunks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, combine flour, butter, shortening, salt and sugar in a food processor. Pulse together just until the mixture is crumbly and butter is broken into small pieces. Pour 1/3 cup ice water into the machine, and pulse 3 or 4 times. Squeeze a little dough in your hand to see whether it clumps together and is evenly moist. If not, add another tablespoon of water, and pulse 1 or 2 times more. Don't overmix so that the dough forms a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out dough on a large sheet of plastic wrap. Lift ends of plastic to gather dough together inside. Press into a large disk, and wrap tightly in plastic wrap. Refrigerate until ready to use, up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, melt 2 tablespoons butter in a large skillet over medium-high heat. Add carrot, celery, leeks and tarragon, and cook, stirring, just until slightly softened but not browned (reduce the heat if necessary to prevent browning), about 3 minutes. Transfer cooked vegetables to a bowl, wipe out the skillet, and place it back on the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 3 tablespoons butter, and melt over medium heat. Whisk in flour, and cook, whisking, until the mixture bubbles and smells cooked. Do not let it brown. Whisk in 2 cups broth, and cook, whisking, 1 minute. Whisk in cream, and cook 2 or 3 minutes, just until thickened. Add salt and pepper. If the sauce is too thick, whisk in remaining broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Add cooked vegetables and peas, chicken and sauce to 8-inch deep pie dish or other baking dish, mix gently, and taste for seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flour a work surface. Remove dough from refrigerator. Roll out the dough, turning and flouring often, and cut a shape approximately the size of your baking dish plus 1 1/2 inches overlap all around."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll dough up onto the rolling pin, and unroll over dish, so it rests evenly on top of filling. Fold the edges under and crimp. Poke tip of knife through crust to create 3 vent holes near the center. Whisk the egg with a teaspoon of cold water. Use a pastry brush to lightly coat the entire crust with egg wash. Place on cookie sheet, and place in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 20 minutes, then reduce temperature to 375 degrees. Bake 25 to 30 minutes more, until crust is golden and filling is bubbling through vents. Let rest 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/7378-chicken-tarragon-pot-pie"}