{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Omelets", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT15M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "eggs, scallion, tomato, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "13 grams", "saturatedFatContent": "5 grams", "sodiumContent": "345 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "2 scallions, minced (about 3 tablespoons)", "1 large tomato (8 ounces), peeled, seeded and coarsely chopped (about 1 cup)", "1/2 teaspoon salt", "6 large eggs", "1/4 teaspoon freshly ground black pepper", "1 teaspoon unsalted butter", "1 tablespoon olive oil", "6 large eggs", "1/4 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1/4 cup chopped herbs (a mixture of parsley, chervil, tarragon and chives)", "1 teaspoon unsalted butter", "Vinegar, oil and herbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tomato omelet: In a large saucepan, preferably nonstick, heat one tablespoon of the olive oil. When hot, add the minced scallions and saute for about 30 to 45 seconds. Add the chopped tomatoes and a quarter teaspoon of the salt. Saute the tomatoes for about 45 to 60 seconds, until they are warm and starting to render their juice but are still firm. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining tablespoon of oil in a clean saucepan. Meanwhile, beat the eggs with the remaining quarter teaspoon of salt and the pepper in a bowl. When the oil is hot, add the egg mixture and, when the curds form in the bottom of the pan, stir until the whole mixture is set but a little wet inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fork, bring the near lip over toward the center of the omelet and arrange the tomato mixture down the center of the omelet. (If the tomato mixture is too wet, use a slotted spoon to remove the solids for use on the omelet.) Fold both lips of the omelet back over the tomatoes to enclose them as best you can. Heat the one teaspoon of butter in the exposed end of the skillet and cook the omelet for about 45 to 60 seconds to brown it nicely underneath. Invert onto a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When lukewarm, slide the omelet onto a piece of plastic wrap and roll it into a tube, tightening it as you roll to give it a nice cylindrical shape and twisting the wrap at both ends. Refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At serving time, cut the omelet into one-and-one-half-inch slices and place the slices cut-side-down in a small gratin dish. Sprinkle with a few drops of vinegar, about one tablespoon of oil and extra herbs, if desired. Serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the herb omelet: Beat the eggs with the salt, pepper and chopped herbs and proceed with the directions above (ignoring references to the tomato mixture) to make and finish the omelet."}], "link": "https://cooking.nytimes.com/recipes/7381-cold-omelets"}