{"@context": "http://schema.org", "@type": "Recipe", "name": "Mussels With Saffron And Sherry", "description": "", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": null, "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "french", "recipeCategory": "dinner, quick", "keywords": "appetizer, main course, mussels, saffron, sherry", "aggregateRating": null, "recipeIngredient": ["4 pounds mussels, scrubbed, beards and barnacles removed", "1/4 teaspoon saffron threads", "2 tablespoons olive oil (not extra virgin)", "1/2 cup finely chopped onion", "3 to 4 tablespoons finely chopped parsley", "2 garlic cloves", "1 cup amontillado sherry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a sink with cold water and put the mussels in to soak. Put saffron into a 1/4-cup measuring cup, and fill with steaming-hot water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place largest pan available (6 quarts or larger) over medium heat, and add oil, onion and 1 tablespoon of parsley. Saute gently until onion is softened but not browned, about 5 minutes. Remove pan from heat, and use a fine Microplane grater to grate garlic into pan. (If a Microplane grater is not available, a garlic press may be used, but the mixture should be sauteed for 1 more minute.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mussels to a large colander, sorting through them and discarding any that are damaged or open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to medium heat, and when the onion mixture begins to sizzle, add the saffron in its water, the sherry and 1 cup hot water. Add the mussels, cover, and raise heat to high. Bring to a boil and steam until the mussels have opened, 3 to 5 minutes. Discard any mussels that do not open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mussels and pan liquid to one large bowl or two smaller bowls. Sprinkle with remaining parsley. If desired, serve with crusty bread."}], "link": "https://cooking.nytimes.com/recipes/7385-mussels-with-saffron-and-sherry"}