{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Steaks With Prosciutto and Mushrooms", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, mushroom, prosciutto, turkey breast", "aggregateRating": null, "recipeIngredient": ["4 turkey breast steaks, total weight about 1 1/2 pounds", "Salt and freshly ground pepper to taste", "1/4 cup flour, for dredging", "2 tablespoons olive oil", "1/4 pound small button mushrooms, washed and drained", "4 large, thin slices of prosciutto, about 2 ounces total", "2 tablespoons butter", "1 clove garlic, peeled", "1 tablespoon chopped fresh sage or 2 teaspoons dried", "1/4 cup Marsala wine", "4 servings broccoli rabe with tomatoes (<a href=\"http://cooking.nytimes.com/recipes/75-broccoli-rabe-with-tomatoes\" target=\"_blank\">see recipe</a>)", "2 tablespoons chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the turkey steaks between sheets of plastic wrap and pound them evenly, with a meat pounder or flat mallet without breaking the flesh, until the fillets are about 1/4-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with salt and pepper. Dredge lightly in the flour and shake off the excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a nonstick skillet large enough to cook the turkey pieces in one layer. Scatter the mushrooms around the turkey and cook over high heat about 2 minutes or until golden brown on one side. Turn the turkey and cook about one minute more on the other side. Remove the turkey and the mushrooms and place on a warm platter. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, without removing the oil, saute the prosciutto briefly, about 15 seconds. Add the butter and garlic clove to the pan. Return the turkey and the mushrooms to the pan along with any juices that have accumulated around the turkey. Place a slice of prosciutto over each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the sage over the prosciutto and pour the Marsala into the pan. Cover and cook for about one minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and serve immediately. Spoon equal portions of the broccoli rabe dish onto four warm serving plates. Top each serving with the turkey and mushrooms. Pour the sauce over and sprinkle with parsley."}]}