{"@context": "http://schema.org", "@type": "Recipe", "name": "Curried Carrot And Red Snapper Chowder", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project, soups and stews", "keywords": "boiling potatoes, celery root, red snapper fillets, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["2 large onions, quartered", "4 large carrots, peeled and coarsely chopped", "8 stalks celery, rinsed and cut into large pieces", "2 tomatoes, halved", "8 mushrooms, halved", "2 whole heads garlic, cloves separated, skin intact", "1 4-inch piece ginger, coarsely chopped", "1 bunch flat-leaf parsley", "6 sprigs fresh thyme or 1 tablespoon dried", "1 tablespoon whole black peppercorns", "2 bay leaves", "1/2 teaspoon salt", "1 1/2 cup fresh carrot juice or 6 large carrots, grated", "1 tablespoon olive oil", "1 small white onion, peeled and minced", "1 clove garlic, peeled and minced", "2 teaspoons curry powder", "4 large celery root, peeled and cut into 1/4-inch cubes", "3 large boiling potatoes, peeled and cut into 1/4 inch cubes", "1 cup celery leaves", "2 carrots, peeled", "1 pound red snapper fillet, skin on, cut into 1/2-inch chunks", "1/2 teaspoon salt, plus more to taste", "1 teaspoon freshly ground pepper, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the broth ingredients, except carrot juice, in a large pot. Add 6 quarts of cold water and bring to a boil over high heat. Lower the heat and simmer, until reduced to 2 1/2 quarts, about 2 to 3 hours. Strain through a sieve lined with cheesecloth. Combine the carrot juice or grated carrots and 1 1/2 quarts of broth in a blender. Purée until liquefied. Strain. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 teaspoon of the olive oil in a saucepan. Add the onion and garlic. Cook until soft, about 5 minutes. Add the curry powder and continue cooking for 3 minutes, stirring often. Add the carrot broth, 3 cups of celery root and 2 cups of the potatoes. Simmer for 15 minutes. Purée in a blender or food processor until smooth. Strain into a clean saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil in a skillet. Fry the celery leaves until crisp. Drain on paper towels. Score the carrots lengthwise with a channel knife. Cut into very thin slices crosswise. Set aside in a bowl of ice water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the soup over medium-low heat, but do not allow it to boil. Add the remaining celery root and potatoes. Simmer until tender, about 3 to 5 minutes. Add the fish and scored carrots. Season to taste with salt and pepper and simmer gently until the fish is cooked through, about 3 minutes. Ladle into 4 warmed soup bowls. Garnish with fried celery and serve."}], "link": "https://cooking.nytimes.com/recipes/7401-curried-carrot-and-red-snapper-chowder"}