{"@context": "http://schema.org", "@type": "Recipe", "name": "Saffroned Mussel And Lobster Chowder", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "new england", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, fall, summer, gluten-free, nut-free, lobster, mussels, saffron", "aggregateRating": null, "recipeIngredient": ["1 small onion, peeled and coarsely chopped", "1 clove garlic, peeled", "3 cups dry white wine", "2 cups clam broth", "1 2-pound lobster", "3 cups water", "3 pounds mussels, well scrubbed", "2 teaspoons butter", "2 leeks, white part only, sliced thinly and rinsed well", "1/4 teaspoon salt, plus more to taste", "1 teaspoon freshly ground pepper, plus more to taste", "4 plum tomatoes, peeled, cored and cut into small dice", "1 teaspoon saffron threads", "1 teaspoon grated lemon rind", "6 red bliss potatoes, scrubbed and quartered", "3/4 cup minced fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the onion, garlic and white wine in a large pot. Bring to a boil. Add the lobster. Cover, reduce heat slightly and steam the lobster for 12 minutes. Remove the lobster. Set aside to cool. Add the water, clam broth and mussels, cover the pot and continue cooking until the mussels begin to open, about 4 minutes. Strain, reserve the broth and set the mussels aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a large saucepan over low heat. Add the leeks. Season with salt and pepper. Cook until soft, about 6 minutes. Add the tomatoes, saffron, grated lemon rind and broth. Add the potatoes. Simmer about 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lobster meat from its shell. Cut the tail meat into small chunks. Carefully slice the claw meat in half lengthwise. Set aside. Take the mussels out of their shells. Add the lobster-tail meat and mussels to the broth. Simmer gently until the shellfish is warmed through, about 1 to 2 minutes. Ladle the chowder into 4 warm bowls. Garnish each with half a lobster claw and basil."}]}