{"@context": "http://schema.org", "@type": "Recipe", "name": "Escarole Salad With Turkey Crackling", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "escarole, turkey skin, fall", "aggregateRating": null, "recipeIngredient": ["Skin from 1 14-to-15 pound turkey (about 1 pound)", "Salt", "1 large or 2 smaller heads escarole (Choose escarole heads with the whitest possible insides. Green leaves tend to be tough and bitter.)", "2 teaspoons Dijon-style mustard", "1 to 2 cloves garlic, peeled, crushed and finely chopped (1 teaspoon)", "1 tablespoon red-wine vinegar", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon salt", "1/3 cup oil (half olive and half rape-seed oil or a mixture of olive, rapeseed and safflower oils - or 1/4 cup of the above oil and 2 tablespoons of the fat rendered by cooking the turkey skin)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To remove the skin from the turkey, cut along the backbone of the turkey with a sharp knife. Begin pulling and cutting on each side of the bone to help separate the skin from the carcass. Keep pulling and cutting the skin to separate it completely from the bird. Do not worry if you make holes in the skin or if it is cut into smaller pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the crackling, spread the turkey skin, stretching it thinly in one piece or several pieces on a large cookie sheet in one layer. Sprinkle with salt and place in a preheated 350-to-400-degree oven. Bake for about 30 minutes, until crisp and brown all over. The skin will have shrunk considerably. If the skin is very thick, bake longer, until very crisp. Cool slightly and lift from the surrounding fat. Break into half-inch pieces and set aside. The skin from one turkey should yield one to one-and-a-half cups of crackling. Reserve the fat in the pan for sauteeing vegetables or for adding to the vinaigrette above."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the salad, trim off the outside escarole leaves that are very green or damaged and cut the remaining leaves into two-inch pieces. Wash thoroughly, lifting the leaves up out of the water. Dry well in a salad spinner. You should have approximately 9 to 10 cups of washed escarole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dressing, combine the mustard, garlic, vinegar, pepper and salt together with a spoon. Add the oil and turkey fat slowly and mix well. (The dressing should be slightly separated, not homogenized, so the salad is shiny when tossed with the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At serving time, add the dressing to the greens and toss well. Sprinkle with the crackling and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/741-escarole-salad-with-turkey-crackling"}