{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Roast Chicken", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "chicken, main course", "aggregateRating": null, "recipeIngredient": ["A 4- to 5-pound chicken", "1 lemon", "1 tablespoon olive oil, vegetable oil or soft butter", "Salt and freshly ground black pepper", "3 to 4 sprigs parsley", "2 medium onions", "Water", "1/2 cup dry white wine or chicken stock (optional)", "1 teaspoon cornstarch (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the package of gizzards, heart, liver and neck from the cavity of the chicken. Except for the liver, these parts can be used to make stock. You may wish to freeze them until you have the innards of several chickens. Saute the liver and spread on toast or freeze it separately, adding to your supply of frozen livers as you buy whole chickens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the chicken with cold water and pat it dry on a paper towel. Pull off any excess fat from the back of the cavity near the tail. This fat can be sauteed slowly in a small skillet to use for frying or it can be frozen for future use. Pull out with tweezers or singe over an open flame any large pinfeathers on the wings. Sqeeze the juice of half the lemon into the cavity and rub it in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the outside of the chicken with the oil or butter. Season the chicken inside and out with salt and pepper. Tuck the lemon halves and the parsley into the cavity. Quarter one of the onions and tuck the quarters into the cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The chicken will hold its shape better if is trussed. At the very least, tuck the wing tips behind the chicken and, using butcher's cord, tie the legs together. To truss the chicken completely, first loop cord around the tail and crisscross it around the legs, pulling the legs together tightly. Then run the length of cord along the sides of the chicken, just under the drumstick and through the wing joints, pulling the ends together across the back near the neck, securing the extra flap of neck skin under the cord. Tie the cord securely, making for a tight, plump-looking bird."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the remaining onion and scatter it in the roasting pan. Position the chicken on a rack and place in the oven. Roast for 13 to 15 minutes a pound, until the juices run clear when the meaty flesh of the upper thigh is pricked with a sharp fork. If the onions in the pan appear to be browning too rapidly while the chicken is roasting, add a little water to the pan. The onions should become dark brown but should not be allowed to blacken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken to a platter or cutting surface and allow it to rest 10 to 15 minutes before carving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim any excess fat from the roasting pan. Add several tablespoons of water to the roasting pan, place it on top of the stove over medium heat and stir, scraping up any browned bits clinging to the pan. Strain the pan juices into a small saucepan. These juices can be seasoned with salt and pepper and used to moisten the portions of chicken or can be used to make a gravy. Add the wine or stock to the juices and bring to a simmer. Dissolve the cornstarch in one tablespoon cold water and stir into the gravy mixture. Simmer until thickened, then season."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the chicken by cutting through the joints to remove the drumsticks and wings, then slicing the breast meat and thigh meat. Arrange the meat on a platter and serve either moistened with pan juices or with the gravy on the side."}], "link": "https://cooking.nytimes.com/recipes/7421-basic-roast-chicken"}