{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Poached Chicken", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 7}, "recipeIngredient": ["A 4-pound chicken, left whole or split", "Juice of 1/2 lemon", "Water", "2 medium onions", "2 leeks, well rinsed", "2 carrots, peeled", "2 stalks celery", "2 cloves garlic, peeled", "2 sprigs parsley", "2 sprigs fresh dill", "10 whole black peppercorns", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the gizzards, heart, neck and liver from the chicken. Pull off any excess fat from the edges of cavity. Rinse the chicken in cold water, pat dry on paper towels and rub with the lemon juice. Place in a large, deep pot and cover with cold water to a depth of two inches. If necessary to fit the chicken comfortably in the pot, it can be split in half. Rinse the gizzards, heart and neck and add them as well. Reserve the liver for another use. It should not be added to poached chicken, because it will make the stock bitter. It can be frozen. The excess fat can be sauteed slowly in a small skillet to use for frying or it can also be frozen for future use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water with the chicken to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the water is coming to a boil, cut the root and top ends off the onions but do not peel them. The skin will enhance the color of the soup. Trim the roots and most of the green off the leeks and trim the root ends off the carrots. Cut or break the celery if necessary to fit it into the pot. Add the garlic. Tie the parsley and dill together in a piece of cheesecloth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken has come to a boil, reduce the heat to a steady simmer and skim the surface of the water, removing the scum as it accumulates. Do this for at least five minutes, until relatively little scum reappears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vegetables, herbs and peppercorns. Continue simmering the chicken and vegetables slowly, skimming the surface from time to time, for one hour, until the juices of the chicken run clear when the thigh is pricked with a sharp fork. If necessary, additional water can be added to the pot during the cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the pot, allowing it to drain well. Set it aside, covered, in a shallow bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the contents of the pot through a colander set into another large pot or a deep bowl that holds at least six quarts. Clean the original cooking pot. Pour the soup through a large, very fine strainer into the cooking pot. If you do not have a large very fine strainer, use a large strainer with a coarser mesh and line it with a clean linen napkin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the soup to a gentle simmer and allow it to cook for 20 to 30 minutes, until it has reduced and concentrated somewhat. Do not allow it to come to a boil or it will turn cloudy. When the soup tastes rich enough, season it with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup is simmering, retrieve vegetables you wish to serve with it and cut them into one-inch pieces. Remove the skin from the chicken and cut it into serving pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the chicken and vegetables in bowls, with the hot soup spooned over them. If desired, noodles or rice can be cooked separately and added to the soup as well."}], "link": "https://cooking.nytimes.com/recipes/7422-basic-poached-chicken"}