{"@context": "http://schema.org", "@type": "Recipe", "name": "Union Square Cafe's Tuna Club Sandwich", "description": "This update on a workaday sandwich takes time and work, it’s true. But the result, Julia Reed says, is the best old-fashioned tuna salad sandwich you’ve ever had in your life. You’ll need one pound of yellowfin tuna, which you’ll poach with aromatics, cool and then mix with a few chopped peppers, fennel seed, onion and herbs. If you plan ahead, you can make the tuna salad without the herbs, refrigerate it overnight, and add them in before assembling your sandwiches. Layer it on toasted bread with a lemon-pepper aioli, slab bacon and arugula. This is picnic food for the gods.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-TUNACLUB/19COOKING-TUNACLUB-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fish, tuna, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "recipeIngredient": ["2 egg yolks", "1 1/2 tablespoons lemon juice", "2 teaspoons red wine vinegar", "1 tablespoon Dijon mustard", "2 teaspoons finely minced garlic", "1/2 teaspoon kosher salt", "1 1/2 cups olive oil", "3/4 teaspoon coarsely ground pepper", "1/2 cup coarsely chopped onion", "1/3 cup coarsely chopped carrot", "1/3 cup sliced celery", "1 bay leaf", "3 whole black peppercorns", "1 pound yellowfin tuna, skinless, cut into 2-inch pieces", "1 teaspoon fennel seeds", "2 tablespoons diced red bell pepper", "2 tablespoons diced yellow bell pepper", "1/4 cup minced red onion", "1 tablespoon julienned fresh basil leaves", "1 teaspoon finely chopped mint", "3/4 teaspoon kosher salt", "Freshly ground black pepper to taste", "Fresh lemon juice to taste", "12 slices sourdough, white or whole wheat bread, lightly toasted", "2 1/2 cups arugula, trimmed, washed and dried", "8 ( 1/4-inch-thick) slices slab bacon, cooked until crisp"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make aioli: Combine egg yolks, lemon juice, vinegar, mustard, garlic and salt in a food processor. With the machine running, slowly add the olive oil in a constant stream through the feed tube until all the oil is absorbed and the mixture has the consistency of mayonnaise. Add pepper and mix 10 seconds. Transfer to a bowl, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 4 cups water, onion, carrot, celery, bay leaf and peppercorns in a 2-quart saucepan and bring to a boil over high heat. Lower to simmer, cover and cook for 15 minutes. Add the tuna pieces and simmer until they are barely cooked through, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cooked tuna from the cooking liquid to a bowl using a slotted spoon. While the fish is still warm, flake it into small pieces with a fork or your fingers. (The fish firms up as it cools and will not flake as nicely.) Cover loosely and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crush the fennel seeds between two sheets of waxed paper; dry fry in a small skillet until fragrant. Place in large bowl; add 1/2 cup aioli, the red and yellow peppers, onion, herbs and salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the flaked tuna into the fennel mixture. Combine well and taste for seasonings, adding salt, pepper and lemon juice as needed. (The tuna salad can be made ahead to this point without the herbs and refrigerated until the next day; stir in the herbs just before using.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a slice of sourdough bread with the aioli, then with a spoonful of the tuna salad. Top with a few leaves of the arugula and one slice of bacon. Repeat with a second slice of sourdough. Stack one layer on top of another and finish by topping with a third slice of sourdough. Repeat to make three more club sandwiches. Slice each sandwich into halves or thirds and secure each piece with a toothpick."}]}