{"@context": "http://schema.org", "@type": "Recipe", "name": "Nancy Reagan's Monkey Bread", "description": "", "author": {"@type": "Person", "name": "Michael Boodro"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "1 loaf", "recipeCuisine": "", "recipeCategory": "", "keywords": "flour, yeast, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 294, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "10 grams", "sodiumContent": "169 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 ounces butter, softened, plus extra for greasing pan", "4 to 5 cups all-purpose flour, plus extra for flouring pan and work area", "1 package active dry yeast", "1 cup lukewarm milk (110 to 115 degrees)", "3 large eggs", "3 tablespoons sugar", "1 teaspoon salt", "4 ounces melted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter and flour a 1-quart or larger ring mold or tube pan and set aside. Whisk the yeast with the milk in a large bowl. Whisk in 2 of the eggs and then the sugar, salt and 4 cups of the flour, switching to a spoon when the dough gets stiff. Stir in the softened butter and knead the dough in the bowl until it comes together in a ball. Turn out onto the work area and knead until it forms an elastic ball, sprinkling with and working in up to 1 cup more flour to keep dough from getting sticky. Place dough in a clean bowl and cover with plastic wrap. Let rise in a warm place until doubled in size, 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down dough and turn out onto a lightly floured work area. Roll dough into a log and cut into 28 equal-size pieces. Shape each piece into a ball, dip in melted butter and place in the prepared pan, staggering pieces in 2 layers. Cover loosely with plastic wrap and let rise in a warm place until doubled in bulk, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Beat the remaining egg and lightly brush over the top of the bread. Bake until top is nicely browned and dough is cooked through, 25 to 30 minutes. (Test by turning out the loaf onto a rack; the bottom and sides should be nicely browned.) Turn upright on another rack to cool slightly before serving."}], "link": "https://cooking.nytimes.com/recipes/7444-nancy-reagans-monkey-bread"}