{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Squab With Green Lentils", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H45M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "lentils, squab, main course", "aggregateRating": null, "recipeIngredient": ["4 squabs, each weighing about 1 pound, butterflied with all bones and innards reserved", "Kosher salt and freshly ground black pepper to taste", "1/4 cup olive oil", "2 cloves garlic, peeled and coarsely chopped", "3 large shallots, peeled and thinly sliced", "3 sprigs flat-leaf parsley", "3 sprigs fresh thyme, with additional for garnish", "1 bay leaf", "7 cups homemade or low-sodium chicken broth", "1/2 pound lentils, preferably the small, green French variety", "1 medium onion, peeled and cut in half, each half stuck with a clove", "2 carrots, peeled and cut in half", "3 slices bacon", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the squabs under cold water, pat dry and flatten on a baking sheet. Season each side lightly with salt and pepper and place in the refrigerator. Using a sharp heavy knife or a cleaver, hack the reserved squab bones, neck, liver, gizzard and heart into 1/2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heavy-bottom pot over medium-high heat. Warm 2 tablespoons of the oil; when it is sizzling, add the bones and innards, stirring to brown darkly, about 10 minutes. Carefully pour off the oil and discard. Return the pot to high heat and use a wooden spoon to dislodge the bits of browned skin before adding the garlic, shallots, parsley, thyme, bay leaf and 4 cups of chicken stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the broth to come to a boil, reduce the heat and simmer for 4 hours, skimming frequently. Strain through a fine-mesh strainer, discarding the bones and aromatics. Place the broth in a saucepan over medium heat and simmer until the liquid has reduced to equal 1 cup. Season this with salt and pepper to taste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the squabs from the refrigerator and bring to room temperature. Rinse the lentils under cold water and discard any stones. Place lentils in a heavy-bottom casserole along with the clove-studded onion halves, carrots and bacon. Add the remaining chicken broth, place over high heat and bring to a boil. Reduce the heat to low, partly cover the pot and simmer for 45 minutes to 1 hour, stirring frequently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the lentils are soft and all the cooking liquid has been absorbed, remove the onion, bacon and carrots. Add the butter and 1/2 cup of the squab broth, season with salt and pepper, cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees. Place the squabs in a heavy-bottom, ovenproof skillet or baking pan, or 2 if necessary, large enough to accommodate the squabs. Place the pan over high heat on the stove. Add the remaining olive oil and when the oil is hot, place the squabs skin side down in the skillet. Press them down with a spatula to flatten them. Brown for 1 minute. Transfer the pan to the oven and continue cooking, skin side down, for 10 minutes for rare, and several minutes longer for medium to well done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the squab broth and divide the lentils among 4 plates, creating a circle of lentils in the center of each. Place the squab on the lentils, drizzle each with the hot broth, garnish each with a sprig of thyme and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7447-roast-squab-with-green-lentils"}