{"@context": "http://schema.org", "@type": "Recipe", "name": "Pot Roast With Cranberries", "description": "There's more to the cranberry than sauce, you know, and this simple roast is happy, yet unexpected, proof. Its preparation is as simple as can be: generously dust the meat with sugar then sear in a skillet. Once browned, toss in a bag of cranberries, orange peel, orange juice, a good half cup of sherry vinegar and a pinch of cayenne. Cover and simmer until tender. It's a lively, perfectly-balanced, cold-weather meal. It also makes a mercifully easy Christmas main.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/19/dining/19POTROAST/19POTROAST-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": " 4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "beef, tenderloin, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 145}, "recipeIngredient": ["1 tablespoon butter or extra-virgin olive oil ", "1/2 cup sugar ", "1 2-pound piece beef tenderloin, or 3-pound piece chuck or brisket ", "Salt and freshly ground black pepper ", "1/2 cup sherry vinegar or good wine vinegar ", "1 12-ounce bag cranberries ", "1 orange ", "Cayenne, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put butter or oil in a casserole or skillet with a lid, and turn heat to medium-high. Put sugar on a plate, and dredge meat in it on all sides; reserve remaining sugar. When butter foam subsides or oil is hot, brown meat on all sides, seasoning it with salt and pepper as it browns. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat is nicely browned, add vinegar, and cook a minute, stirring, then add cranberries and remaining sugar, and stir. Strip zest from orange (you can do it in broad strips, with a small knife or vegetable peeler), and add it to pot; juice orange, and add juice also, along with a pinch of cayenne. Turn heat to low, and cover pan; mixture should bubble but not furiously. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, turning meat and stirring about every 30 minutes. Tenderloin will be medium-rare in about 1 hour, or when its internal temperature is 125 to 130 degrees; cook it longer if you want it more done. Chuck or brisket will take 2 hours or longer; it is done when tender. Taste, and adjust seasoning if necessary. Turn off heat, and let roast rest for a few minutes, then carve and serve, with sauce. "}], "link": "https://cooking.nytimes.com/recipes/7449-pot-roast-with-cranberries"}