{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna Al Tarocco", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "fish, tuna, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 644, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "5 grams", "proteinContent": "51 grams", "saturatedFatContent": "6 grams", "sodiumContent": "966 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup blood-orange juice", "1/2 teaspoon Dijon mustard", "1 tablespoon red wine vinegar", "Kosher salt", "1/2 cup plus 3 tablespoons extra virgin olive oil", "1 orange", "2 scallions, thinly sliced", "1/2 pound wild mushrooms (or a mixture of flavorful cultivated mushrooms), cut into 1/4-inch slices", "Pepper to taste", "1 medium head radicchio, cut into 2-inch chunks and the leaves separated", "2 tablespoons toasted pine nuts", "1/2 cup chopped fennel fronds, or a mixture of parsley and mint leaves", "4 6-to-8-ounce tuna steaks", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "First make the vinaigrette. In a small pan over high heat, bring the blood-orange juice to a boil, and reduce by half. Remove from the heat, and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small mixing bowl, combine the reduced orange juice, mustard, vinegar and salt to taste. Whisk to blend, and slowly whisk in 1/2 cup of the olive oil until emulsified. Set aside. Grate and reserve the zest from the orange. Cut any remaining peel and pith from the orange. Over a bowl, cut the orange into segments, reserving the segments and juices released into the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-to-12-inch saute pan over high heat, heat 1 tablespoon olive oil, and add the scallions. Saute until the scallions are softened, 30 to 45 seconds. Add the mushrooms, and season with salt and pepper to taste. Saute until the mushrooms are softened, 2 to 3 minutes. Add the radicchio, orange segments and any juice. Toss to wilt, 30 to 45 seconds. Transfer to a platter, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the orange zest, pine nuts, and fennel fronds; set aside. In a 12-inch saute pan over high heat, heat the remaining 2 tablespoons olive oil until smoking. Season the tuna steaks with salt and pepper to taste, and add to the pan. Saute for 4 to 5 minutes, then turn the steaks and saute for another 2 to 3 minutes, for medium rare. Transfer to the serving platter, laying the steaks on top of the radicchio mixture. Sprinkle the blood orange vinaigrette over the steaks, and top with the orange zest mixture. Serve immediately."}]}