{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Young Turkey With Giblet Gravy", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne With Pierre Franey"}, "image": null, "totalTime": "PT4H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "fall, main course, turkey, turkey broth", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 888, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "2 grams", "proteinContent": "100 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1568 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 11- to 12-pound turkey", "1 large lemon", "1 small apple, about 3 ounces, cored and stem removed", "1 cup parsley, coarsely chopped and loosely packed", "1 cup coarsely chopped onion", "4 bay leaves, broken into quarters", "10 sprigs fresh thyme or 1 teaspoon dried, finely chopped", "1/4 cup corn, peanut or vegetable oil", "Salt to taste, if desired", "Freshly ground pepper to taste", "12 tablespoons unsalted butter at room temperature", "10 tablespoons flour", "2 teaspoons water", "3 cups turkey broth made with turkey neck and wing tips, or use an equal amount of fresh or canned chicken broth", "1 turkey heart", "1 turkey gizzard", "1 finely chopped hard-cooked egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off the wing tips of the turkey. Set aside for broth or soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the lemon lengthwise in half and cut each half crosswise into quarter-inch-thick slices. Cut the apple lengthwise in half. Cut each half crosswise into quarter-inch-thick slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl combine the lemon, apple, parsley, onion, bay leaves, thyme and oil and blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the turkey inside and out with salt and a generous grinding of pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the cavity of the turkey with the lemon and apple mixture. Flex the thighs and wing joints of the turkey. Truss or tie the turkey with string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend four tablespoons of the butter and four tablespoons of the flour with the fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the turkey all over with the butter-flour mixture, massaging it thoroughly for several minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the bottom of a shallow roasting pan with the remaining six tablespoons of flour. Place a rack inside the pan and arrange the turkey breast-side up on the rack. Let the turkey sit outside the oven for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the turkey in the oven and roast 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the remaining eight tablespoons of butter in a small saucepan and stir in the water. Baste the turkey with the melted butter mixture. Reduce the oven heat to 350 degrees and continue roasting the turkey, basting often with the butter mixture, for about one hour and 40 minutes. Remove the turkey and let rest for 20 minutes before carving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the turkey or chicken broth to the boil and add the turkey heart and gizzard. Let simmer 10 minutes. Strain, reserving both the broth and giblets. Finely chop the giblets and set aside. Set the strained broth aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the turkey rests, skim off the semi-clear liquid from the drippings in the pan, leaving the browned flour and the particles that cling to the bottom and sides of the pan intact. Place the pan on top of the stove and add the reserved turkey or chicken broth. Scrape all around to dissolve the browned particles that cling to the bottom and sides of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth into a saucepan and bring to the boil. Let simmer, skimming the surface as necessary, about 10 minutes. Add the chopped giblets and the chopped egg. Slice the turkey and serve with the gravy on the side."}]}