{"@context": "http://schema.org", "@type": "Recipe", "name": "Tourta Kritiki (Cretan Easter Lamb Pie)", "description": "", "author": {"@type": "Person", "name": "Diane Kochilas"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "8 servings", "recipeCuisine": "greek", "recipeCategory": "", "keywords": "lamb, pie dough, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1180, "unsaturatedFatContent": "51 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "116 grams", "fiberContent": "1 gram", "proteinContent": "31 grams", "saturatedFatContent": "58 grams", "sodiumContent": "636 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups warm water", "1 envelope active dry yeast", "4 cups all-purpose flour, plus additional flour for dusting", "1 teaspoon salt", "1/4 cup olive oil, plus 2 tablespoons and additional oil for greasing", "4 eggs", "4 scallions, both green and white parts, finely chopped", "2 pounds lean boneless lamb, shredded or diced", "2 teaspoons ground cinnamon", "Salt and freshly ground black pepper to taste", "1 pound Greek anthotyro cheese or fresh ricotta", "1/2 pound Cretan gravieri cheese, shredded (see note)", "Sesame seeds to sprinkle on top of pie"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the yeast in the warm water. In a medium bowl, combine 4 cups of the flour and 1 teaspoon salt. Make a well in the center. Add the yeast mixture, the 1/4 cup olive oil and 2 eggs, very well beaten. Stir with a fork from the center outward until a dough begins to form. Lightly dust a work surface with flour. Knead the dough until silky to the touch, 10 to 12 minutes, adding more flour if necessary. Grease a bowl with olive oil. Place the dough in the bowl, cover, and allow to rise until doubled in bulk, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy skillet, heat the 2 tablespoons olive oil. Add the scallions, and saute over medium heat until wilted. Add the lamb. Season with cinnamon, salt and pepper. Brown, stirring frequently, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the anthotyro or ricotta with the shredded gravieri cheese. Stir in 1 egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a 9-inch springform pan. Divide the dough in half. On a lightly floured surface, roll out the first half to a circle about 13 inches in diameter. Place on the bottom of the pan, and lightly press around the sides. There should be at least an inch of dough hanging over the pan's top rim. Spread half the lamb on the bottom of the pan. Spread half the cheese mixture evenly over it. Repeat with the remaining lamb and cheese. Roll out the second half of the dough, and place over the filling. Trim the edges, leaving 1 to 1 1/2 inches of dough hanging over the outer sides of the pan. Roll up the dough to form a rim of crust around the top of the pan. Cover, and set aside for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Beat the remaining egg. With a sharp knife make four slits in the surface of the dough. Brush the dough with the beaten egg, and sprinkle with sesame seeds. Bake for about 50 minutes, until the pastry is golden and begins to separate from the sides of the pan. Cool slightly on a rack. Remove the sides of the pan just before serving."}]}