{"@context": "http://schema.org", "@type": "Recipe", "name": "Masoor Dal (Spiced Red Lentils)", "description": "What I have come to understand is that how food looks as you prepare it can make as much difference to the cook as it does, on the plate, to the person who gets to eat it. When the skies are drab and life feels a little gray, I am absurdly cheered by the fresh brightness of a vibrantly orange dal, a red lentil stew spiced with turmeric, chili and ginger, and colored with sweet potatoes and tomatoes. Just seeing that mixture in the pan lifts my spirits. It helps that a dal is simple to make: a bit of chopping and the stew all but cooks itself. And it can be made in advance and then reheated, always a bonus. This dal makes a wonderful, exuberant partner to broiled salmon, but I love it without meat, too, when I partner it with my “<a href=\"https://cooking.nytimes.com/recipes/7518-bright-rice\">bright rice</a>.”", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2018/01/16/dining/16COOKING-MASOORDAL/16COOKING-MASOORDAL-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "indian", "recipeCategory": "easy", "keywords": "fall, onion, red lentils, sweet potato, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2332}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 195, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "0 grams", "sodiumContent": "299 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons vegetable oil", "1 cup finely chopped onion", "2 1/2 cups (10 ounces, about 1 medium) finely diced sweet potato", "1 tablespoon minced ginger", "2 garlic cloves, minced", "1 Thai or bird's-eye red chili", "1 cup red lentils", "2 teaspoons ground coriander", "2 teaspoons ground cumin", "2 teaspoons turmeric", "1 teaspoon ground ginger", "1 cup canned chopped tomatoes", "Salt", "3 tablespoons chopped cilantro", "Pieces of coconut flesh from a fresh coconut (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan over medium-low heat, heat oil, and sauté onion until softened. Add sweet potato, and sauté for about 5 minutes. Add minced ginger and garlic; stir, and reduce heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely dice chili, keeping seeds if you wish to add more heat. Add chili, lentils, coriander, cumin, turmeric and ground ginger to pan. Stir until lentils are well coated with oil. Add tomatoes and 4 cups water. Raise heat to bring to a boil, then reduce heat until mixture is at a fast simmer. Cook uncovered until lentils and potatoes are soft, stirring occasionally, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste with salt, and continue to simmer until mixture has thickened, about 10 minutes. Whisk dal to amalgamate lentils and sweet potatoes. If dal is too soupy, increase heat and cook for a little longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place dal in a serving bowl and sprinkle with chopped cilantro. If desired, shave thin strips of fresh coconut on top. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/7517-masoor-dal-spiced-red-lentils"}