{"@context": "http://schema.org", "@type": "Recipe", "name": "Chunky Lobster Stew With Tomalley Croutons", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne With Pierre Franey"}, "image": null, "totalTime": "PT2H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "fall, french bread, lobster, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 584, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "43 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1176 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["5 1-pound live lobsters", "Salt to taste, if desired", "2 cups coarsely chopped onion", "4 bay leaves", "1 large tomato, about 1 pound, peeled", "20 sprigs fresh chervil, optional", "2 cups heavy cream", "12 tablespoons unsalted butter", "1 teaspoon finely minced garlic", "2 tablespoons finely chopped onion", "2 cups coarsely chopped white part of leeks", "1 cup carrot rounds, sliced as thinly as possible", "Freshly ground black pepper to taste", "1 loaf French bread, cut into 1/4-inch slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring enough water to the boil to cover the lobsters when they are added. Add salt and the lobsters and cook exactly four minutes after the water has returned to boiling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the lobsters immediately. Make a small half-inch crack in the solid shell that covers the head of each lobster. Make the crack slightly below the eyes of each lobster. Place the lobsters tail-side up, heads down, so that the liquid drains from the heads."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the lobsters are cool enough to handle, tear off the tails and claws of each. Let the tomalley -the inner soft portion of the bodies-empty into a mixing bowl. Put the shells in a kettle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lobster tails on a flat surface and cut lengthwise with a sharp knife or cleaver. Pull away and discard the intestinal tract of each tail. Remove the tail meat and put the shells into the kettle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack the claws and remove the meat. Put the claw shells into the kettle. Cut the claws and tail meat into bite-size pieces. There should be about three cups. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the lobster shells in the kettle add 10 cups of water, the two cups of coarsely chopped onion and the bay leaves. Bring to the boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut away and reserve the firm outer flesh of the peeled tomato. Set aside. Chop the inner portion of the tomato and add it to the kettle. Cut the reserved portion of the tomato into half-inch cubes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull away the leaves of the chervil. Set the leaves aside. Toss the remaining sprigs into the kettle. Cook the lobster broth about one hour, then add the heavy cream. Let simmer briefly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the garnish for the stew, put four tablespoons of the butter into a saucepan. Add the garlic and finely chopped onion to the butter and cook about three minutes, stirring. Add this to the reserved tomalley and beat thoroughly to blend. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the remaining eight tablespoons of butter in a heavy saucepan and add the leeks and carrots. Cook about five minutes, stirring occasionally without browning. Add the cubed lobster meat, the tomato cubes and cook, stirring briefly, until heated through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the liquid from the kettle, discarding the solids. There should be about six cups. Pour this into the saucepan containing the lobster meat. Bring to the simmer and add salt and a generous grind of black pepper. Finely chop the chervil leaves and add them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the broiler and toast the French bread slices on both sides. Spread one side of each with a thin layer of the tomalley mixture. Run briefly under the broiler until the tomalley mixture starts to bubble. Serve the hot soup with the pieces of tomalley toast on the side."}], "link": "https://cooking.nytimes.com/recipes/753-chunky-lobster-stew-with-tomalley-croutons"}