{"@context": "http://schema.org", "@type": "Recipe", "name": "Maury Rubin's Passion Push-Up", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, side dish, egg yolks, heavy cream, passion fruit, summer", "aggregateRating": null, "recipeIngredient": ["1 1/3 cups passion-fruit purée", "3 egg yolks", "1/4 cup granulated sugar", "1/2 cup heavy cream", "Generous amount assorted edible flowers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large saucepan with 3 inches of water and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the passion-fruit purée into a medium saucepan and cook on low for 2 minutes, or until hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the egg yolks and sugar in a medium metal bowl. Set the bowl over the saucepan of boiling water, making sure the bottom of the bowl does not touch the water. Whisk the yolks and sugar vigorously until thick and pale, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the hot passion-fruit juice slowly into the yolk mixture, whisking constantly. With a wooden spoon, stir the mixture until it is thick and coats the back of the spoon, about 1 minute. Strain through a fine sieve into a large bowl. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the heavy cream into a bowl and with a whisk or hand-held mixer, beat until stiff peaks form. Fold cream into cooled passion-fruit mixture. With a spoon, fill each of 4 1/2-cup push-up molds to the top and place in the freezer for 1 hour. Remove and push the frozen filling up through its holder and quickly roll in a plate of edible flowers until covered and serve."}], "link": "https://cooking.nytimes.com/recipes/7550-maury-rubins-passion-push-up"}