{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna With Black-Eyed Pea and Artichoke Salad", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H10M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "project, salads and dressings", "keywords": "artichoke, black-eyed peas, tuna, spring", "aggregateRating": null, "recipeIngredient": ["5 ripe tomatoes, cored and cut into large chunks", "1/2 cup extra-virgin olive oil", "Kosher salt and freshly ground pepper to taste", "1 cup dried black-eyed peas", "1/2 small onion, peeled", "1 small carrot, peeled and cut into large chunks", "4 sprigs fresh thyme", "1 bay leaf", "8 cloves garlic, peeled", "3 1/2 cups water", "2 teaspoons balsamic vinegar", "2 teaspoons red-wine vinegar", "2 tablespoons extra-virgin olive oil", "16 fresh baby artichokes, trimmed, tough outer leaves discarded", "1/2 teaspoon kosher salt, plus more to taste", "1/4 teaspoon freshly ground pepper", "2 tablespoons finely chopped scallions", "1 teaspoon olive oil", "1 8-ounce fresh tuna steak.", "Kosher salt and freshly ground pepper to taste", "2 tablespoons chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the oil, puree the tomatoes in a food processor. Strain through a fine-mesh sieve. Place in a medium-size saucepan and simmer over low heat until reduced to 1/2 cup, about 1 hour. Strain again and let cool. Gradually whisk in the olive oil. Season with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the black-eyed peas, onion, carrot, thyme, bay leaf, garlic and water in a medium-size saucepan and bring to a boil. Reduce the heat and simmer until the peas are tender, about 40 minutes. Drain and remove all but the peas. Place in a large bowl and toss in the vinegars and 1 tablespoon of oil. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Thinly slice the artichokes, place in a roasting pan and toss with 1 tablespoon of oil. Roast until tender, about 15 minutes. When cool, toss with the peas, along with the salt, pepper and scallions. Set aside at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the tuna, heat the oil in a medium-size nonstick skillet over medium-high heat. Add the tuna and saute until seared on both sides but still pink in the center, about 10 minutes. Let stand for 10 minutes. Slice thinly across the grain. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shake or stir the tomato oil and drizzle it around the edge of 4 plates. Mound the salad in the center of the plates and lay the tuna over the top. Garnish with parsley and serve."}], "link": "https://cooking.nytimes.com/recipes/7569-tuna-with-black-eyed-pea-and-artichoke-salad"}