{"@context": "http://schema.org", "@type": "Recipe", "name": "Free-Form Apple Or Pear Tart", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/09/24/dining/24TART/24TART-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "apple, butter, flour, dessert, side dish, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 253}, "recipeIngredient": ["1 1/4 cups all-purpose flour", "Pinch salt", "3 tablespoons sugar", "9 tablespoons cold butter", "1 egg yolk", "3 or 4 medium apples, preferably Golden Delicious, or pears, peeled, cored and very thinly sliced", "2 tablespoons brown sugar", "Crème fraîche, sweetened", "Whipped cream or vanilla ice cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour, salt and sugar in a food processor; pulse once or twice. Cut 8 tablespoons butter into chunks, and add it and egg yolk to flour mixture. Process until butter and flour are blended, about 10 seconds. Turn mixture into a bowl, and add cold water, a tablespoon at a time, stirring after each addition. After adding 3 or 4 tablespoons you should be able to gather mixture into a ball; wrap ball in plastic, and refrigerate for at least 1 hour (or freeze for about 15 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Roll or pat dough into a 10-inch circle; it can be quite crude in shape. Place it on a cookie or pizza sheet, preferably nonstick. Arrange fruit slices on top, right out to edges; make the pattern attractive, if you like. Sprinkle with brown sugar. Cut remaining butter into bits, and top fruit with it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until crust is nicely browned and fruit is tender, 20 to 30 minutes. Remove, and serve warm or at room temperature, with crème fraîche, whipped cream or ice cream."}], "link": "https://cooking.nytimes.com/recipes/7573-free-form-apple-or-pear-tart"}