{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower With Anchovy Mayonnaise", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday", "keywords": "anchovy, cauliflower, mayonnaise, side dish, summer, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 565, "unsaturatedFatContent": "45 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "10 grams", "sodiumContent": "603 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["Coarse sea salt", "1 egg yolk", "1 tablespoon lemon juice, from Meyer lemons, if possible", "4 large anchovy fillets packed in olive oil, drained and pounded to paste with a mortar and pestle", "Freshly ground pepper (black, red, green, grains of paradise, whatever you like)", "3/4 cup peanut oil", "1/4 cup extra virgin olive oil", "1 1/2 pounds cauliflower, trimmed into walnut-size florets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with water. Season with coarse sea salt, and bring to a boil. Meanwhile, in a small bowl, combine egg yolk, lemon juice, half the anchovy paste, a large pinch of salt and several turns of the pepper mill. Whisk together vigorously."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually add peanut oil, whisking in a few drops at a time. Once mixture begins to emulsify, oil may be added faster, in a thin stream. After peanut oil is added, begin whisking in olive oil. Whisk in remaining anchovy paste. Mixture should be highly seasoned, and anchovy should be pungent but not unpleasantly so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water comes to a boil, add cauliflower, and cook until tender but still slightly crisp, about 3 to 4 minutes (may also be steamed). Drain, and run under cold water. Lay out on a dish towel to dry, then transfer to a serving bowl. Pour 1/2 cup mayonnaise on top, and toss to coat. Taste and adjust seasoning. Serve, with remaining mayonnaise on the side, or save it for sandwiches."}]}