{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cauliflower", "description": "Cauliflower is an excellent blank canvas. You can steam or blanch it to keep its essential flavors intact, but by roasting or sautéing it, you can bring out its sweetness. Cauliflower will absorb the oil and seasoning, soaking up flavors much the way eggplant does. But it remains firmer.\n\nRoasted cauliflower can be served warm or at room temperature. It can be part of an antipasto of roasted vegetables. Or an accompaniment to a roast chicken or lamb. And though they aren't obvious choices, scallops and lobster, both naturally sweet themselves, are delicious with roasted cauliflower.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2015/10/15/dining/15COOKING-CAULIFLOWER1/15COOKING-CAULIFLOWER-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "cauliflower, extra virgin olive oil, salt, side dish, spring, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1623}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 43, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "268 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound cauliflower, about 1 medium-large head, trimmed and cut into 1/4-inch-thick slices", "Extra virgin olive oil, to coat", "Sea salt", "Coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Place cauliflower in a large mixing bowl. Pour on enough olive oil to coat (a few tablespoons). Season generously with salt and pepper and toss gently until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay cauliflower pieces out on a baking sheet. Drizzle any remaining oil from the bowl on top. Bake, turning once, until caramelized on edges and tender, 25 to 30 minutes. Serve warm or at room temperature, as a side dish. You can also sprinkle it with a very good aged vinegar. Or, cut florets into smaller pieces and add to salads."}]}