{"@context": "http://schema.org", "@type": "Recipe", "name": "Cardoon Soup With Coddled Oysters And Oyster Mushrooms", "description": "", "author": {"@type": "Person", "name": "Christopher Idone"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 - 8 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, cardoon, mushroom, oyster, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 584, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "5 grams", "proteinContent": "19 grams", "saturatedFatContent": "25 grams", "sodiumContent": "831 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds cardoons (see note)", "1 lemon", "6 shallots, finely chopped", "4 tablespoons unsalted butter", "2 cups cremant or Champagne", "3 cups heavy cream", "2 cups oyster liquor or combination of oyster liquor and clam juice, fresh or canned", "18 oysters, shucked", "1/4 pound fresh oyster mushrooms", "1 tablespoon parsley, chopped", "Fresh coarsely cracked black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and wash the cardoon stalks as you would celery and cut into small chunks. In a large mixing bowl, rapidly mix the chunks with the juice of one lemon, so they will not discolor. Add the squeezed lemon halves to a large nonreactive pot of lightly salted boiling water. Cover and cook 40 to 50 minutes or until tender. Drain, and when cool enough to handle, puree the cardoons in small batches in a food processor, about three minutes for each batch. Reserve two cups for the soup and the remainder for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a nonreactive saucepan over medium heat, melt the butter and sautee the shallots until they are wilted, about five minutes. Add the cremant or Champagne and bring to a rapid boil. Quickly blanch the oyster mushrooms, remove them with a slotted spoon and reserve. Continue to boil the mixture until it is reduced to a glaze, about 15 minutes. Add the cream and continue to boil, stirring frequently with a wire whisk until the mixture has reduced to two cups, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low and add the two cups of cardoon puree, and when the mixture begins to simmer, add the oyster liquor. When the soup is hot, add the shucked oysters and heat through, just until they plump up, about a minute or less. Season with cracked pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle into mugs or bowls and float a couple of mushrooms on top of the soup with a little chopped parsley."}], "link": "https://cooking.nytimes.com/recipes/759-cardoon-soup-with-coddled-oysters-and-oyster-mushrooms"}