{"@context": "http://schema.org", "@type": "Recipe", "name": "Seafood Paella", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, project", "keywords": "chicken thigh, clams, prosciutto, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 8}, "recipeIngredient": ["2 skinless chicken thighs, on the bone", "3 ounces prosciutto, cut into 1/4-inch dice", "2 tablespoons extra-virgin olive oil", "1 ounce chorizo, cut into 1/4-inch dice", "1/2 medium Spanish onion, finely chopped", "3 cloves garlic, lightly crushed", "1 cup uncooked long-grain rice, rinsed until water runs clear and drained", "1 jalapeño pepper, seeded and minced", "1 medium red bell pepper, skin removed with a peeler, stem and ribs removed, seeded and finely chopped", "2 cups homemade chicken broth, or canned low-sodium", "1 medium beefsteak tomato, blanched, peeled, seeded and coarsely chopped", "1 large pinch saffron threads", "3 ounces fresh shelled English peas, blanched in salted water and rinsed until cold", "4 mussels", "4 clams", "2 squid, cleaned and sliced into rings", "1 or 2 pinches cayenne pepper", "Salt and freshly ground white pepper to taste", "4 to 6 large heirloom tomatoes with stems attached, blanched and peeled", "3 cloves garlic, peeled and lightly crushed", "2 sprigs fresh thyme", "2 sprigs fresh rosemary", "6 tablespoons extra-virgin olive oil", "20 cockles or small clams", "1 pint red currant tomatoes", "1 teaspoon balsamic vinegar", "1 teaspoon sherry vinegar", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Sauté the chicken and prosciutto in oil in a casserole over medium heat for 5 minutes, until lightly brown. Add the chorizo and sauté 3 minutes more. Add the onions and garlic, cover and cook until the onions are soft. Stir in the rice, jalapeño and red peppers and cook for 3 minutes. Add the broth and tomato and bring to a boil. Stir in the saffron. Cover and bake for 15 minutes, until the rice is al dente. Stir in the peas and seafood and bake, uncovered, for 3 minutes, until the mussels and clams open. Remove the casserole from the oven and set aside for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the garlic, shellfish shells and chicken bones. Dice the mussels, clams and chicken and stir into the paella."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tomato shells, oil a shallow baking dish just large enough to hold the tomatoes. Cut 1/2 inch off the stem ends of the tomatoes and reserve. Scoop out and discard the insides of the tomatoes. Season with salt and pepper, fill with paella and cover each with a tomato ''lid.''"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes in the oiled dish, sprinkle with 2/3 of the garlic, the thyme and the rosemary and drizzle with 4 tablespoons of oil. Bake for 15 minutes or until the tomatoes soften, basting with the pan oil every 5 minutes. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, heat the remaining oil over high heat and add the cockles and remaining garlic. Cover and cook 2 minutes, until the cockles open. Add the currant tomatoes, vinegars, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each stuffed tomato in the center of a plate and surround with the cockle mixture. Serve."}], "link": "https://cooking.nytimes.com/recipes/7614-seafood-paella"}