{"@context": "http://schema.org", "@type": "Recipe", "name": "Eight-Treasure Rice Pudding", "description": "Here is a sticky, sweet end to a Chinese repast, and most of it can be prepared a few days ahead of time. Red-bean paste and candied fruits can be found in most Asian markets, or try the Asian-food aisle at a supermarket for lichees.", "author": {"@type": "Person", "name": "Betty Fussell"}, "image": null, "totalTime": "PT2H10M", "recipeYield": "Four to six servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "chinese candied fruits, red bean paste, rice, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 7}, "recipeIngredient": ["1 cup glutinous rice, red or white, see note", "2 tablespoons sugar", "2 tablespoons peanut oil", "1/2 cup sweetened red-bean paste, see note", "1 cup Chinese preserved or candied fruits, such as lotus nuts, gingko nuts, lichees, loquat, preserved lemons, ginger, plums, dates, see note", "1 cup water", "1/4 cup sugar", "1 teaspoon cornstarch", "Rind of 1 lemon, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the rice under running water, drain it and put it in a saucepan with one cup of cold water. Bring the water to a boil, cover the pot, lower heat and cook over very low heat for 30 minutes. Remove from the heat, add the sugar and oil and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a three- to four-cup mold or heat-proof bowl with a little oil or shortening. Cut the fruit in thin slices and press them onto the bottom and sides of the bowl in a decorative pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon half the rice over the fruit and press down to make an even layer. Spread on a layer of bean paste. Spread the remaining rice over the paste and pack down. (The rice can be refrigerated 3 or 4 days if needed)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, place the mold, covered with a lid or foil, in the top of a steamer and steam the mixture for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a sauce by combining the water and sugar in a saucepan. Dissolve the cornstarch in one tablespoon of water and add to the sugar water. Stir over low heat until the mixture thickens slightly. Stir in the lemon rind."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold the rice pudding onto a platter and pour the sauce over the top."}]}