{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken And Avocado Salad With Lime Mayonnaise", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H5M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "avocado, chicken, garlic, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 998, "unsaturatedFatContent": "67 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "86 grams", "fiberContent": "8 grams", "proteinContent": "43 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1215 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 2 3/4 pound chicken, with neck, rinsed and patted dry", "1 teaspoon black peppercorns", "8 cloves of whole unpeeled garlic, plus 1/2 clove garlic, peeled and chopped", "1 medium bulb fennel, with leaves", "Coarse sea salt", "2 scallions, thinly sliced", "1 1/2 avocados", "3 tablespoons fresh lime juice, or more to taste", "1 large egg yolk", "1 tablespoon Dijon mustard", "3/4 cup vegetable oil", "1/4 cup, plus 2 tablespoons whole milk yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large soup pot, combine chicken, chicken neck, peppercorns and whole garlic cloves. Cut fennel bulb into 1/4-inch dice, and reserve 1/2 cup; add remainder to pot. Chop fennel leaves, and reserve 2 tablespoons; add remainder to pot. Add just enough water to cover chicken, and season generously with sea salt. Bring to a boil, then reduce to a simmer. Cook until chicken juices run clear when sliced at a joint, 20 to 25 minutes. Transfer chicken to a plate and allow to cool completely. Reserve broth for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat from chicken, discarding skin and bones. Cut meat into 1/2-inch pieces. Place in a large bowl with reserved fennel bulb, reserved fennel leaves and scallions. Peel and cut one avocado into 1/2-inch cubes, and add to bowl. Sprinkle with 1 tablespoon lime juice, and toss gently to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare mayonnaise: In a small bowl, whisk together egg yolk, 1 tablespoon lime juice, mustard, chopped garlic and a large pinch of salt and pepper. Beginning a drop at a time, whisk in vegetable oil. As it emulsifies, add oil a little faster in a slow, steady stream. When all oil is incorporated and mixture is thick, press remaining half of avocado through a sieve into mixture. Add remaining tablespoon lime juice and yogurt, and whisk to blend. Season to taste with salt and pepper; it should be highly seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold 1/3 cup mayonnaise into chicken. There should be just enough mayonnaise to coat ingredients; add more if necessary. Cover and refrigerate for at least an hour. Adjust seasonings before serving, adding more lime juice as desired."}], "link": "https://cooking.nytimes.com/recipes/7625-chicken-and-avocado-salad-with-lime-mayonnaise"}