{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Asparagus With Lemon Dressing", "description": "Although steamed asparagus has an unmatched purity of taste, I love the earthy, charred flavor added by the grill, a flavor that can also be achieved with stove-top pan grilling, which combines high heat and a dry, heavy skillet.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/19/dining/Asparagus-With-Lemon-Dressing/Asparagus-With-Lemon-Dressing-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "asparagus, lemon, parsley, side dish, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 119, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "6 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "600 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 to 2 pounds large asparagus", "Olive oil as needed, about 2 tablespoons", "Salt and freshly ground black pepper to taste", "Juice of 3 lemons", "2 tablespoons minced shallots or scallions", "1/4 cup minced fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Snap off the woody ends of the asparagus; most spears will break an inch or two from the bottom. Peel the stalks up to the flower bud. Meanwhile, start a charcoal fire or heat a gas grill; if you're cooking indoors, heat a cast-iron or other heavy skillet over medium-high heat until it smokes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To grill the asparagus spears, toss them with about a tablespoon of oil, mixing with your hands until spears are coated. Season well with salt and pepper. Grill until tender and browned in spots, turning once or twice, in all 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To pan grill the asparagus, do not oil or season them. Just toss them in the hot skillet, and cook, turning the spears individually as they brown, until tender, 5 to 10 minutes. Remove as they finish, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the lemon juice and shallots, then stir in enough olive oil to add a little body and take the edge off the sharpness of the lemon; the mixture should still be strong. Season it well with salt and plenty of black pepper, and stir in the parsley. Serve the asparagus hot or at room temperature with grilled fish. Spoon the sauce over everything."}]}