{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Yellow Turnips With Crispy Shallots", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "butter, milk, turnip, side dish, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 711, "unsaturatedFatContent": "51 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "73 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "19 grams", "sodiumContent": "538 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups light vegetable or olive oil", "9 tablespoons butter", "5 to 6 shallots peeled and sliced into thin rings", "2 large yellow turnips (rutabagas), about four pounds", "2 teaspoons kosher salt", "1 cup milk", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, heat the oil with three tablespoons of butter over medium-low heat until it begins to bubble. Reduce the heat to low, add the shallots, and cook them until they are a rich golden brown, 30 to 40 minutes. Stir the shallots occasionally while they are cooking to make sure they brown evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the shallots from the oil with a slotted spoon and drain them on paper towels. Once the shallots have dried and crisped, in about 15 minutes, they can be stored in a cool place, covered, for several days. Serve the shallots at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the turnips to remove their waxy skins and cut them into generous one-inch chunks. Put them in a saucepan with water to cover and one teaspoon of salt. Bring to a boil and simmer covered, until the turnips are easily pierced by a paring knife, about 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate saucepan, heat the milk and the remaining six tablespoons of butter over low heat until the butter has melted and the milk just begins to simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the turnips and puree (in several batches, if necessary) in a food processor. With the motor running, add the melted butter and milk in a steady stream. The turnips should be very smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the turnip puree to the saucepan, season with one teaspoon salt and the pepper and reheat, stirring, over medium flame. Serve piping hot, sprinkle generously with crispy shallots."}]}