{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Rhubarb Soup and  Vanilla Ice Cream", "description": "", "author": {"@type": "Person", "name": "Bryan Miller And Pierre Franey"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, nuts, rhubarb, strawberry, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 433, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "85 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "28 milligrams", "sugarContent": "76 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon butter for greasing cookie sheet", "1/2 cup sugar", "1/4 cup crushed almonds", "1/3 cup crushed hazelnuts", "1 vanilla bean, chopped on a bias into 1/4-inch sections", "12 cups chopped fresh rhubarb, trimmed of leaves", "1 vanilla bean, split lengthwise", "2 cups sugar plus 3 tablespoons, or to taste", "3 cups fresh rhubarb, from the tender narrow end, sliced thinly on a bias (for garnish)", "1/3 cup fresh lemon juice", "1/2 cup strawberries (about 4, stems removed) diced into 1/8-inch cubes)", "3/4 pint vanilla ice cream, slightly softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the caramel, butter a cookie sheet and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy skillet over medium-high heat, caramelize the sugar by cooking it while stirring frequently, about 10 minutes. The caramel should be golden brown. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the almonds and hazelnuts. Return pan to low flame and cook, stirring, for 2 minutes. Add vanilla bean slivers and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the caramel onto the cookie sheet. Let it cool and harden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp, heavy knife, mince the caramel well. (Do not use a food processor because it will turn the caramel into powder.) You should have about 3/4 cup of crushed caramel. Spread the mixture over a baking sheet and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the soup, place the 12 cups of chopped rhubarb and the vanilla bean in a pot and cover with 8 cups water. Add 2 cups of the sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil, reduce heat, and simmer for 90 minutes. When the liquid has cooked for about 15 minutes, remove the vanilla bean and squeeze out the tiny black seeds inside into the pot. To do this, pinch the bean with your thumb and forefinger and run your fingers down the length of the bean. Toss the skin back into the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the 3 cups of rhubarb garnish in a pot and add 3/4 cup water and 3 tablespoons of sugar. Bring to a boil and simmer until soft, 2 to 3 minutes. When the rhubarb is cooked, remove the pot from the heat, and place it in a bowl filled with ice and water to stop the cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the other rhubarb soup mixture has finished cooking, strain it through a fine sieve or chinois (do not press the solids). You should have about 7 cups of liquid. Chill thoroughly. Before serving, season the soup and the rhubarb garnish slices with sugar and lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place equal amounts of the rhubarb garnish in serving bowls. Add equal portions of the minced strawberries. Ladle over the soup mixture. Place a scoop of vanilla ice cream in the center of the crushed caramel, and roll it to coat. Place the ice cream in the center of the soup, and sprinkle a little more caramel over the top."}], "link": "https://cooking.nytimes.com/recipes/7641-chilled-rhubarb-soup-and-vanilla-ice-cream"}