{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Chops With Sage", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "main course, sage, veal, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "recipeIngredient": ["4 rib veal chops", "6 tablespoons olive oil", "2 tablespoons lemon juice", "1 bunch fresh sage", "Kosher salt and freshly ground black pepper to taste", "1/2 cup dry white wine", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the veal chops in a large nonreactive pan. Whisk together 3 tablespoons of the olive oil and the lemon juice. Stir in 10 coarsely chopped sage leaves. Pour the mixture over the chops, cover and refrigerate for several hours, turning the chops occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, preheat the oven to 200 degrees and place 2 large skillets over high heat. Remove the chops from the marinade and remove and discard any pieces of sage that may be clinging to them. Sprinkle each chop generously with salt and pepper. Divide the remaining 3 tablespoons oil between the pans. When the oil is very hot, place 2 chops in each pan and cook until well browned on one side, about 5 minutes. Turn and cook until the other side is browned and the chops are cooked to the desired doneness, 4 to 6 minutes, depending on their thickness. Place the chops on a platter, cover with foil and put them in the oven to keep warm while you prepare the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the grease out of 1 pan and add the wine. Add 5 chopped sage leaves and place over medium heat. Cook, scraping the bottom of the pan, until the wine has reduced to about 1/4 of its original volume. Remove from the heat and whisk in the butter. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the veal chops to 4 plates and pour the sauce over them. Garnish each plate with a few whole sage leaves and serve immediately with potato galettes (see recipe) and pan-grilled scallions with sea salt (see recipe) if desired."}], "link": "https://cooking.nytimes.com/recipes/7652-veal-chops-with-sage"}