{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Galettes", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, potato, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 511, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "8 grams", "proteinContent": "8 grams", "saturatedFatContent": "16 grams", "sodiumContent": "920 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["4 large Idaho potatoes", "Kosher salt and freshly ground black pepper to taste", "8 tablespoons clarified butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes, making sure to keep their round shape, and rinse them under cold water. Using a mandoline, slice one of the potatoes almost paper-thin. (If they are not thin enough, you will have difficulty getting them to adhere to one another; also, do not rinse the slices, as you will remove the starch.) On a work surface, form a circle of overlapping slices about 5 inches in diameter. Continue to make layers of slices, sprinkling them with salt and pepper every couple of layers, until all the slices are used. Make another galette with another potato."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 200 degrees and place 2 small skillets over medium heat. When hot, add 2 tablespoons of the clarified butter to each. Using a large spatula, carefully transfer 1 galette to each skillet. Cook until the bottoms are golden brown, 4 to 5 minutes. (Lower the heat if they brown too quickly.) Turn and cook the other side until the potatoes are golden brown and cooked through, 4 to 5 minutes more. Transfer to a small sheet pan lined with paper towels and keep warm in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the first 2 galettes are cooking, prepare the remaining 2 in the same manner. Serve warm."}], "link": "https://cooking.nytimes.com/recipes/7653-potato-galettes"}