{"@context": "http://schema.org", "@type": "Recipe", "name": "Tarte Tatin", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "dessert, fall, pastry dough, tart apples", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 286, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "8 grams", "sodiumContent": "86 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup sifted all-purpose flour", "1 large egg", "1/4 teaspoon salt", "1 tablespoon heavy cream", "5 tablespoons chilled unsalted butter, cut into small cubes", "3 tablespoons unsalted butter", "1/2 cup sugar", "4 to 5 tart apples, like gala or Granny Smith, peeled, cored and quartered", "1 large egg yolk, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry dough, in the bowl of an electric mixer fitted with a paddle attachment, combine all the ingredients for the dough and mix at low speed until just smooth. Gather the dough into a ball (it will be quite soft), flatten to a thick disk, wrap in plastic wrap and refrigerate for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake the tart, preheat the oven to 400 degrees and prepare the apples. Use 1 tablespoon of the butter to grease the bottom and sides of a 9-inch tart pan with straight sides or a 9-inch cake pan. Sprinkle the bottom with 2 tablespoons of the sugar. Arrange the apples neatly in the pan, rounded side down. Sprinkle them with the remaining sugar and dot with the remaining butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll the dough out into a disk just slightly larger than the tart pan. Cover the apples with the pastry, tucking the edges of the dough over the apples. Using a pastry brush, brush the surface of the dough with some of the egg yolk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the tart in the middle of the oven until the dough is very lightly browned and the apples are just tender when poked through the dough with the tip of a paring knife, about 20 minutes. Remove from the oven and let stand 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a serving plate upside down on top of the tart pan. Using kitchen mitts, grasp the edges of the plate and the pan and quickly invert the pan. Remove the pan. Cut the tart into wedges and serve warm or at room temperature with vanilla ice cream."}], "link": "https://cooking.nytimes.com/recipes/7655-tarte-tatin"}