{"@context": "http://schema.org", "@type": "Recipe", "name": "Leg Of Lamb, North Indian Style", "description": "Lamb has a lot of flavor, and stands up to strong spices brilliantly. Here is a recipe for boneless leg of lamb that you could grill, broil or roast in a hot oven. Regardless, the result is a crisp, crunchy and highly seasoned exterior with a tender, sweet interior. Even better, because the boned leg is invariably irregular in thickness, the meat will be cooked to different stages of doneness. If, for example, you cook it so that the thickest part of the meat reaches 125 degrees (rare), the thinner parts will vary from medium rare to nearly well done at the edges. Because lamb also tastes great at all stages of doneness, this will make for a genuine crowd-pleaser. ", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, garlic, lamb, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["1 large onion, peeled", "4 cloves garlic, peeled", "1 inch-long piece of ginger, peeled and roughly chopped", "1 teaspoon fennel seeds", "1 teaspoon cardamom seeds (if you have pods, crush and remove seeds)", "6 whole cloves", "1 tablespoon cumin seeds", "1 3-inch-long cinnamon stick", "10 black peppercorns", "2 dried small red chilies, or 2 teaspoons dried red chili flakes, or to taste, optional", "1 butterflied leg of lamb, 3 to 4 pounds", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine onion, garlic and ginger in food processor and grind to paste. Press through fine strainer to extract liquid; discard liquid. Toast spices in small skillet over medium heat, shaking frequently until aromatic, about 3 minutes. Grind in spice mill or coffee grinder until very fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim lamb of fat; sprinkle with salt. Combine spices and onion mix, and rub over meat. Poke small holes in lamb and stick some of the mixture into each one. If time allows, fold meat in half, wrap tightly in plastic and refrigerate for a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start charcoal or wood fire or heat gas grill or broiler; fire should be quite hot, and the rack at least 4 inches from heat. Grill or broil until nicely browned, even a little charred, on both sides, about 20 minutes, until internal temperature at the thickest part is about 125 degrees. Some will be rare, some nearly well done. Let rest for 5 minutes and slice thinly."}]}