{"@context": "http://schema.org", "@type": "Recipe", "name": "Hanoi Beef And Rice-Noodle Soup", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT7H", "recipeYield": "Six to eight servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef, oxtail, spare ribs, dairy-free, main course", "aggregateRating": null, "recipeIngredient": ["5 pounds beef bones", "5 pounds oxtails", "2 pounds short ribs", "2 large onions, unpeeled, halved and studded with 8 whole cloves", "3 shallots, unpeeled", "1 2-ounce piece of fresh ginger, unpeeled", "8 star anise (see note)", "1 cinnamon stick", "4 medium parsnips, cut into 2-inch chunks", "2 teaspoons salt", "1 pound sirloin steak", "2 scallions, thinly sliced", "1 tablespoon minced fresh coriander leaves", "2 medium onions, sliced very thin", "1/4 cup hot chili sauce (see note)", "1 pound 1/4-inch dried rice sticks (see note)", "1/2 cup fish sauce", "Freshly ground black pepper", "2 cups fresh bean sprouts", "2 fresh red chili peppers, sliced, with seeds removed", "2 limes cut into wedges", "1 bunch fresh mint, leaves only", "1 bunch basil, leaves only (use Asian basil if available)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the beef broth (this takes about a day to prepare but can be made ahead of time and frozen). Clean the beef bones under cold running water, then place them in a pot, cover with water and soak overnight at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, place the beef bones, oxtails and short ribs in a large stockpot. Cover with water and bring to a boil. Cook for 10 minutes, then drain and rinse the pot and the bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the bones to the pot, add 6 quarts of water and boil. Skim the foam off the surface and stir occasionally. Add 3 quarts of water and bring to a boil. Skim whatever residue rises to the top. Turn heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, char the clove-studded onions, shallots and ginger - either by piercing them with a fork and holding them over a gas flame or by putting them in the broiler - until they release their fragrance. Tie the charred vegetables, star anise and cinnamon stick in a double thickness of dampened cheesecloth. Add the spice bag, parsnips and salt to the broth and simmer for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the short ribs and cut the meat away from the bones. Reserve the meat, discard the fat and return the bones to the pot. Continue simmering the broth, uncovered, for 4 to 5 hours. Keep an eye on it; as the liquid boils away, add enough water to cover the bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the sirloin steak against the grain into paper-thin slices, roughly 2 inches by 2 inches. Slice the meat from the short ribs paper-thin. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the scallions, coriander and half the onion slices. Place the remaining onion slices in another small bowl and stir in the hot chili sauce, blending well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the rice sticks in warm water for 30 minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard all the bones from the broth. Strain the broth into a clean pot through a strainer or colander lined with a double layer of dampened cheesecloth. Refrigerate for several hours to allow the fat to rise to the top and harden. Remove the fat, heat the broth and add the fish sauce. When the broth boils, reduce the heat and simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another pot, boil 4 quarts of water and put in the soaked rice sticks. Drain immediately. Divide the rice sticks among 6 to 8 large soup bowls and top them with the sliced meats. Bring broth to a rolling boil and ladle it directly over the meat in each bowl (the boiling broth will cook the raw sirloin instantly). Garnish with the scallion mixture and freshly ground black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the onions in hot chili sauce and the accompaniments on the side."}], "link": "https://cooking.nytimes.com/recipes/7700-hanoi-beef-and-rice-noodle-soup"}