{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage-Stuffed Cabbage With Blue Cheese", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "blue cheese, green cabbage, juniper berries, main course, vegetarian, winter", "aggregateRating": null, "recipeIngredient": ["1 savoy or green cabbage", "Salt", "1 1/2 tablespoons butter", "1 leek, including 1 inch of the greens, halved and thinly sliced", "10 juniper berries, bruised with the flat of a knife", "1/3 cup heavy cream", "Freshly ground pepper", "8 1/2-inch cubes Gorgonzola or Roquefort cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Cut deeply around the core at the base of the cabbage but do not remove it. Immerse the cabbage in the boiling water for 4 to 5 minutes, then use a strainer and large fork to remove it from the water. Peel off as many of the large outer leaves as come off easily. Return the head of cabbage to the water, boil for a few more minutes, remove from the water again and repeat until you have 8 leaves. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the remaining cabbage and remove the core. Cut the halves into wide ribbons and gently squeeze out any remaining water. Melt the butter in a large skillet and add the leek, juniper berries and 1 tablespoon of water and cook over medium heat until the leek is tender, about 5 minutes. Add the cut cabbage and cream, cover and cook over low heat for 10 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1/2 cup of chopped cabbage and 1 cheese cube in the center of each leaf. Roll up the leaf, folding in the sides as you go. Steam the cabbage rolls until heated through, about 10 minutes, and serve."}]}