{"@context": "http://schema.org", "@type": "Recipe", "name": "Zuccotto With Prune Cream", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cream, prune, sponge cake, dessert", "aggregateRating": null, "recipeIngredient": ["1 cup brandy", "1/2 pound pitted dried prunes", "Sponge cake (see note)", "1 cup heavy cream", "1/2 packet unflavored gelatin dissolved in 2 tablespoons cold water", "5 tablespoons sugar", "2 egg whites"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the brandy and 1 cup of water to a boil. Put the prunes in a bowl and pour the brandy-water over them. Refrigerate for 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the prunes, reserving the liquid. Chop the prunes, and place half of them in a blender with half the marinating liquid. Blend until smooth. This mixture will be the sauce and should have the consistency of thick cream. If it is too thick, add several tablespoons of water. When the sauce has been made, transfer it to a bowl, cover and refrigerate. Also refrigerate the remaining chopped prunes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 4-cup mixing bowl with a sheet of plastic wrap, then line that with thin slices of the sponge cake. Brush the cake with the remaining prune marinating liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream until stiff and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the sugar with 2 tablespoons of water in a very small saucepan. Heat to a temperature of about 240 degrees on a candy thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a standing electric mixer, beat the egg whites until they form very soft peaks. Stir the gelatin mixture into the sugar mixture and slowly add this to the egg whites, beating constantly. Continue beating until the egg whites are stiff and glossy and have cooled down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the reserved chopped prunes into the whipped cream, fold this into the egg-white mixture and fill the cake-lined bowl with it. Cover with slices of cake. Wrap tightly in plastic wrap and refrigerate at least one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, unmold the zuccotto and peel off the plastic wrap. Cut wedges of the dessert. Serve the prune and brandy sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/7709-zuccotto-with-prune-cream"}