{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Soup Molyvos", "description": "", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "6 to 8 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "chicken, chicken stock, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["1 whole 3- to 3 1/2-pound chicken, neck and gizzard removed", "Salt and freshly ground pepper", "3 quarts fresh chicken stock or canned low-sodium broth", "A cheesecloth bag tied with kitchen string and containing 2 bay leaves, 1/2 bunch parsley stems, 1 bunch dill stems, 1 head garlic sliced in half and 10 whole black peppercorns", "Avgolemono (<a href=\"http://cooking.nytimes.com/recipes/7717-avgolemono\">see recipe</a>)", "1/4 cup chopped dill leaves", "1 1/4 cups shredded romaine or baby greens", "1 cup thinly sliced scallions, both white and green parts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse chicken well inside and out with cold water, and pat dry with paper towels. Season inside and out with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken stock in a large pot, and bring to a boil, covered, over medium-high heat. Add chicken and cheesecloth sachet. (If the chicken is not totally covered by the stock, cut it in half through the backbone). Return the stock to a boil, uncovered, and reduce heat to a simmer. Cook the chicken, skimming frequently, about 45 minutes, or until it is so tender the meat begins to pull away from the leg bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken to a platter, and reserve chicken broth. When chicken is cool enough to handle, remove and discard the skin. Remove meat and discard bones. Cut meat into bite-size pieces, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain chicken broth into a large saucepan, and discard the sachet. (Soup can be refrigerated at this point and finished right before serving.) Remove 1 cup broth to a small saucepan, and bring to a simmer. Prepare avgolemono using this cup of broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the rest of the soup to a boil, and add the reserved chicken pieces. Keep hot over a low flame."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the avgolemono in a stainless steel bowl, and gradually add a few ladles of the hot chicken soup, whisking constantly. When thoroughly combined, slowly pour the avgolemono into the soup, whisking continously. Stir in the dill, and add salt and pepper if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle the soup into warm bowls, and sprinkle each with equal amounts of shredded lettuce and scallions."}], "link": "https://cooking.nytimes.com/recipes/7716-chicken-soup-molyvos"}