{"@context": "http://schema.org", "@type": "Recipe", "name": "Meyer Lemon-Ricotta Ravioli", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "butter, pasta, ricotta, main course, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "recipeIngredient": ["1 cup unbleached all-purpose flour", "1/8 teaspoon kosher salt", "6 large fresh egg yolks", "Semolina or cornmeal for dusting", "1 1/2 cups fresh ricotta cheese", "1/3 cup (1 ounce) freshly grated Parmesan cheese", "1 tablespoon finely grated Meyer lemon zest", "10 turns freshly ground black pepper", "1/4 teaspoon kosher salt", "12 tablespoons (1 1/2 sticks) unsalted butter", "2 tablespoons finely grated Meyer lemon zest", "Salt and freshly ground black pepper", "Grated Parmesan cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour and salt in a large bowl. Add yolks, and use a fork to mix them into the flour. Turn dough out onto a floured surface, and knead for about 8 minutes or until dough is smooth. If dough seems sticky, add up to 2 tablespoons more flour. Knead dough a few times by hand to form an elastic ball, wrap it in plastic, and let rest for a half-hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together all ingredients for filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a pasta roller, and spread a large work surface with kitchen towels. Divide dough in thirds, and pass each through widest setting twice. Reduce roller width one setting, and again run each piece of dough through twice. Continue through each setting until all three pieces of dough have gone through rollers at narrowest setting (No. 7 on most pasta machines). As you work lay sheets of pasta on towels, covering them with more towels to keep them moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fill ravioli, place a teaspoonful of filling at 1 1/2-inch intervals about 1 inch from edge of one length of dough. Dip a pastry brush in water, and brush dough around filling, moistening all the way to edges. Fold dough lengthwise over filling, and press around each scoop, pushing out any air and sealing ravioli. Use a crimped pasta wheel cutter (or press down with blade of a serrated knife) to slice through dough halfway between each scoop of filling, then trim edges to create 2-inch squares. Press edges to seal completely. Dust finished ravioli with semolina or cornmeal. Cover with a kitchen towel and refrigerate for up to 1 day if not using immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For sauce, melt butter in a large skillet with lemon zest and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook ravioli, bring a large pot of salted water to a boil. Add ravioli and cook just until very al dente, about 2 to 3 minutes. Use a slotted spoon or skimmer to scoop ravioli into a colander. Measure 2/3 cup pasta cooking water and gradually whisk it into butter sauce until it is smooth and creamy. Add ravioli, toss to coat with sauce, and simmer for 1 minute. Serve immediately, passing more Parmesan cheese at the table."}]}