{"@context": "http://schema.org", "@type": "Recipe", "name": "Kentucky Derby Mint Juleps", "description": "This is a real julep, the now classic julep first served to Derby guests in 1875 by Col. Meriwether Lewis Clark Jr., the founder of Churchill Downs. Now, as then, it is made with just four ingredients: finely crushed ice, a little sugar water, fresh spearmint and fine, aged, 90-proof straight Kentucky bourbon.", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": null, "totalTime": "PT12H5M", "recipeYield": "Up to 20 juleps", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "bourbon, simple syrup, spearmint, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["1 cup spring or bottled water", "1 cup granulated sugar", "1/2 cup small spearmint leaves, no stems", "Finely crushed or shaved ice, enough to fill the cups completely", "High-quality Kentucky bourbon like Maker's Mark or Woodford Reserve", "Sprigs of spearmint", "Metal julep cups, about 9 ounces, preferably silver"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before serving, or even earlier, put the julep cups in the freezer. Put the water and sugar in a small saucepan, bring to a boil without stirring, and boil for 2 minutes, or until sugar is completely dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mint leaves in a glass jar or cup, pour the slightly cooled syrup over them, let cool, then cover and refrigerate for 12 hours or longer. When ready to use, strain out the mint leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Half an hour before serving, pack the julep cups tightly up to the rim with crushed ice and return them to the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For each julep pour 3 ounces of bourbon over the ice, followed by two teaspoons of mint syrup. Do not stir or agitate. Use a cloth to hold each cup by the rim so as not to disturb the frost. Use a short straw or a chopstick to make a hole in the ice on the side of the cup and insert a sprig of mint. Serve immediately, preferably on a silver tray."}], "link": "https://cooking.nytimes.com/recipes/7743-kentucky-derby-mint-juleps"}