{"@context": "http://schema.org", "@type": "Recipe", "name": "‘Totally Local’ Gratin", "description": "All the ingredients listed in this recipe are local to New England. If you don't live there, do your best to substitute them with your own local ingredients. Or grow and make them yourself. (Just kidding.)", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/LocalGratin/LocalGratin-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "new england", "recipeCategory": "dinner, casseroles", "keywords": "eggs, kale, mustard greens, fall, spring, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 19}, "recipeIngredient": ["Maine Sea Salt", "4 tablespoons Hatchland", "Farm full fat butter", "1 pound medium-size Big Ox Farm mustard greens", "1 pound medium-size Big Ox Farm red Russian kale", "1/4 cup Rhode Island coarse cornmeal", "6 Chip-In Farm large brown eggs", "1 1/2 cups Hatchland Farm heavy cream", "8 ounces Bayley Hazen Blue cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil, and set out the butter. Rinse greens well and drain. Remove and discard any tough stems. Cut greens crosswise into thin strips. In batches, add the greens to the boiling water and let wilt for 30 seconds, then transfer to a bowl of ice water. In two or three handfuls, gather the greens into a ball and squeeze tightly to remove excess water. Evenly spread the greens in the base of a large gratin dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the room-temperature butter in a bowl. Add the cornmeal, and using a wooden spoon, work the cornmeal into the butter. Transfer to a piece of wax paper and roll into a log that is 1 to 2 inches in diameter. Chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. In a blender, purée the eggs and the cream. In a medium saucepan, melt the blue cheese over low heat, using a whisk to gently stir. Add yolk-and cream-mixture, and stir until smooth and slightly thickened, about 2 minutes; be careful not to scramble the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the cheese and egg mixture over the greens -- it should almost cover them. Cut 10 thin slices of cornmeal butter, then break them up and spread them over the top of the gratin. Bake for 10 minutes, then turn on the broiler to brown the top."}]}