{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallop-and-Halibut Ceviche Salad", "description": "This recipe came to The Times from Fanny Singer, the daughter of Alice Waters, the chef and food activist. It’s inspired by Ms. Singer’s favorite street food. Ceviche is almost always so astringent that the fish loses identity, but the freshness of the ingredients and softness of the lime marinade here are neither confrontational nor eye-squinching. It’s simple stuff: avocado, grapefruit, prickly chile, cilantro, lime and an absolutely fresh sea creature. Making the dish takes a bit of work, but it’s the perfect recipe for when you don’t want to turn on the stove.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2014/05/23/dining/Scallop-and-Halibut-Ceviche-Salad/Scallop-and-Halibut-Ceviche-Salad-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "serves 8", "recipeCuisine": "caribbean, latin american", "recipeCategory": "", "keywords": "appetizer, side dish, dairy-free, gluten-free, nut-free, halibut, lime juice, scallops, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 362, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "5 grams", "proteinContent": "24 grams", "saturatedFatContent": "3 grams", "sodiumContent": "824 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds fresh sea scallops, sliced in half horizontally and then quartered", "1 1/4 pounds fresh skinless halibut fillet, cut into half-inch cubes", "Sea salt to taste", "2 cups lime juice (from about 16 limes)", "4 to 6 Serrano or jalapeño peppers, halved, seeded and finely chopped", "2 medium shallots, finely chopped", "1/3 cup chopped cilantro leaves, plus more for sprinkling", "1/2 cup extra-virgin olive oil", "8 leaves Boston or butter lettuce", "2 grapefruits (one ruby, one white), peeled and segmented", "2 avocados, peeled and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the scallops and halibut in separate nonreactive bowls. Season each generously with salt. Add 3/4 cup lime juice to each bowl, toss again, cover and refrigerate. After 45 minutes, drain the halibut, discarding the lime juice, and return halibut to the bowl. Fifteen minutes later, repeat with the scallops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the peppers, shallots, cilantro and remaining 1/2 cup lime juice in a nonreactive bowl, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fifteen minutes before serving, whisk olive oil into shallot mixture. Pour half over the scallops and half over the halibut. Toss and refrigerate for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line each of eight plates with a lettuce leaf. Top with a layer of grapefruit and a layer of avocado. Adjust seasoning of scallops and halibut. Place a handful of each over the avocado slices and sprinkle with cilantro."}], "link": "https://cooking.nytimes.com/recipes/7752-scallop-and-halibut-ceviche-salad"}