{"@context": "http://schema.org", "@type": "Recipe", "name": "Fastest Pasta With Spinach Sauce", "description": "The very best pasta is often the simplest. Jack Bishop, the author of “The Complete Vegetarian Cookbook,” has refined his technique for pasta and vegetable sauce to breathtaking efficiency: He cooks the greens with the pasta and adds the seasonings at the last minute. While the pasta is cooking, Mr. Bishop prepares the seasonings.\n \nAllow at least a gallon of water to a pound of pasta, because you need a large pot to accommodate the greens and because, if there is too little water, the addition of the greens will slow the cooking too rapidly.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/27/dining/Pasta-With-Spinach-Sauce/Pasta-With-Spinach-Sauce-articleLarge-v4.jpg", "totalTime": "PT25M", "recipeYield": "3 to 4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weekday, pastas", "keywords": "calamata olives, pasta, spinach, dairy-free, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 739}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 613, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "90 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "7 grams", "proteinContent": "18 grams", "saturatedFatContent": "3 grams", "sodiumContent": "598 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 clove garlic", "1/2 teaspoon crushed red pepper flakes, or to taste (optional)", "About 15 calamata or other olives, pitted and roughly chopped", "1/4 cup plus 1 tablespoon extra virgin olive oil", "1 pound long pasta, like linguine", "1 pound spinach, washed, tough stems removed, roughly chopped", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, and salt it. Meanwhile, mince the garlic as finely as possible and combine it in the bottom of a warm bowl with the red pepper flakes, olives and olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pasta in the pot, and cook until it is nearly done (test it for doneness by tasting). Plunge the spinach into the water, and cook until it wilts, less than a minute. Drain quickly, allowing some water to cling to the pasta, and toss pasta and spinach in the bowl with the garlic and olive mixture. Season with salt and pepper, and serve."}], "link": "https://cooking.nytimes.com/recipes/7759-fastest-pasta-with-spinach-sauce"}