{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Breast of Veal", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT4H", "recipeYield": "8 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner, roasts", "keywords": "carrot, onion, veal, dairy-free, nut-free, main course, spring", "aggregateRating": null, "recipeIngredient": ["An 8- to 10-pound breast of veal", "1 1/2 cup chicken fat or vegetable oil", "3 cups chopped onions", "1 cup matzoh meal", "2 tart apples, cored and diced", "6 tablespoons chopped parsley", "Salt and freshly ground black pepper to taste", "1/4 to 1/2 cup water", "2 cups sliced onions", "6 unpeeled cloves garlic, or more, to taste", "6 carrots, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Have the butcher trim the breast of excess fat, cut a pocket into it and crack the large, flat chine bone to which the ribs are attached to make carving easier."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the fat in a large skillet. Add the onions and saute slowly until they are soft but not brown. Stir in the matzoh meal, apples, parsley, salt and pepper. Mix well. Add enough water to make the mixture moist, so it holds together without being gummy. You should have about four cups of stuffing. Remove from the heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before cooking, stuff the pocket of the veal with the stuffing and skewer the opening closed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the sliced onions, garlic and carrots in the bottom of a large roasting pan. Place the stuffed breast of veal on top and rub it with salt and pepper. Add enough water to the pan to cover the vegetables but not the roast. Cover the pan with aluminum foil, place in the oven and roast for two hours. Uncover the roast and roast for another hour or so, until the top is crisp and brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the roast to a large carving board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a slotted spoon remove the vegetables from the roasting pan and place them in a sieve suspended over a bowl. Skim as much fat as possible from the juices remaining in the roasting pan. Press the vegetables through the sieve and stir them back into the juices in the roasting pan. Place over medium high heat and cook, stirring and scraping the pan to loosen any particles clinging to the roasting pan. Taste the sauce for seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the roast into portions, cutting down between the ribs. Arrange the slices, each with a rib and stuffing, on a serving platter. Pass the sauce on the side. To serve a half portion, cut the slice of meat and stuffing away from the bone and divide it in half."}]}