{"@context": "http://schema.org", "@type": "Recipe", "name": "Easter Lamb From Sicily", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, roasts", "keywords": "eggs, heavy cream, lamb, gluten-free, nut-free, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 902, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "77 grams", "fiberContent": "1 gram", "proteinContent": "43 grams", "saturatedFatContent": "36 grams", "sodiumContent": "985 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1 onion, minced", "4 pounds well-trimmed boneless lamb shoulder for stew, in chunks", "2 1/2 cups lamb, chicken or beef stock, approximately", "2 tablespoons potato starch", "2 cups heavy cream", "6 egg yolks", "Juice of 4 lemons", "Salt and freshly ground black pepper", "1 tablespoon chopped fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy casserole, add the onion and saute until it is translucent. Stir in the lamb and add the stock, using enough to cover the lamb. Bring to a simmer; cover and cook over medium-low heat until the lamb is tender, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lamb from the broth. Strain the broth and remove as much of the fat as possible. You can do this by starting the preparation the night before and refrigerating the lamb, covered, overnight and also refrigerating the stock. When the stock has chilled sufficiently, the fat can be lifted off and discarded."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, measure the stock. You should have about two cups. Add a little water if there is less. If there is more you should plan to increase the amount of potato starch proportionately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly beat some of the cream into the potato starch, beating to blend the cream and the starch together. When the starch is liquefied stir in any remaining cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a casserole. Whisk the egg yolks and lemon juice together in a bowl. With the stock barely simmering, slowly whisk in the egg-yolk mixture. Then slowly beat the cream mixture into the stock mixture. Cook slowly, about five minutes, until the stock thickens and becomes sauce, then return the lamb to the sauce. When the lamb has been sufficiently reheated, season the sauce to taste with salt and pepper. Transfer the stew to a warm serving dish, sprinkle with the mint, then serve."}]}