{"@context": "http://schema.org", "@type": "Recipe", "name": "Cleaver-to-Wok Coq au Vin", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "chicken, mushroom, red wine, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 859, "unsaturatedFatContent": "43 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "62 grams", "fiberContent": "2 grams", "proteinContent": "44 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1215 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 whole chicken (about 4 pounds)", "Kosher salt and freshly ground pepper to taste", "1/2 cup all-purpose flour", "9 tablespoons vegetable oil", "4 ounces sliced bacon, finely chopped", "2 Spanish onions, thinly sliced", "3 cloves garlic, minced", "2 cups red wine", "1 bay leaf", "1 small package white button mushrooms (about 10 ounces), thinly sliced", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken on a cutting board breast-side up. Using a heavy cleaver, cut off the whole legs. Then at the joint cut the drumsticks from the thighs. Set aside. Chop off the wings and discard or save for another use. Turn the chicken over. Cut down either side of the backbone and discard the backbone. Cut through the sternum, cutting the chicken in half. Cut each breast piece in half widthwise, making 4 pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken with salt and pepper. Place the flour on a plate and coat the chicken with it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large wok, over medium heat, heat 1 tablespoon oil. Add bacon and cook, stirring, until crisp, about 1 minute. Transfer bacon to a paper-towel-lined plate. Discard the bacon fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat to high. Heat 2 tablespoons oil and add half the chicken to the wok. Brown on both sides, about 1 minute per side. Set aside. Drain the oil from the wok. Repeat with the remaining chicken and 2 tablespoons oil. Add onions and cook, stirring, until soft and brown, about 6 minutes. Add the garlic and cook, stirring, until fragrant, about 30 seconds. Return the chicken to the wok and add the red wine and bay leaf and bring to a boil. Cover the wok, lower the heat and simmer until the chicken is very tender, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, over high heat, heat 2 tablespoons oil. Add half the mushrooms. Cook, stirring occasionally, until browned, about 3 minutes. Set aside. Repeat with remaining oil and mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the wok from the heat and swirl the butter into the sauces in the pan. Transfer to a serving platter and cover with bacon and mushrooms. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7786-cleaver-to-wok-coq-au-vin"}