{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Chickpea Tagine", "description": "Like many dishes that rely on combinations of spices, a tagine, which is a slowly braised stew, may look more intimidating to cook than it is. Even with shortcuts, the results are exotic in flavor and appearance. My version of this tagine may not compare to those that begin with toasting and grinding spices and peeling grapes, but it is easily executed and, I think, divine.\n\nSome things to look out for: First, work with dark-meat chicken only and be aware that tagines are on the dry side, so don't add liquid to the sauce unless it is threatening to burn. Home-cooked chickpeas and fresh tomatoes are, of course, preferable to canned varieties, but in this dish the differences are not marked. Do, however, use a vanilla bean, not vanilla extract.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/01/23/dining/23COOKING_CHICKENTAGINE1/23COOKING_CHICKENTAGINE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, one pot", "keywords": "chicken, chickpea, tomato, fall, winter, gluten-free, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1236}, "recipeIngredient": ["2 tablespoons corn or canola oil", "2 tablespoons butter", "1 large onion, peeled and thinly sliced", "2 cloves garlic, minced", "Salt", "Pinch nutmeg", "1/2 teaspoon ground cinnamon", "1 teaspoon ground ginger", "1 teaspoon ground cumin", "1 teaspoon ground coriander", "1/2 teaspoon ground black pepper", "Pinch cayenne", "1 1/2 to 2 cups chopped tomatoes (canned are fine; drain excess liquid)", "4 cups chickpeas (canned are fine; drain and rinse first)", "1/2 cup raisins or chopped pitted dates", "1/2 vanilla bean", "8 chicken thighs, or 4 leg-thigh pieces, cut in two", "Chopped cilantro or parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil and butter in a large skillet or casserole, which can be covered later, and turn heat to medium high. When butter melts, add onion, and cook, stirring occasionally, until it softens, 5 to 10 minutes. Add garlic, a large pinch of salt and spices. Cook, stirring, for about 30 seconds. Add tomatoes, chickpeas, raisins and vanilla, and bring to a boil. (If mixture is very dry, add about 1/2 cup water.) Taste, and add salt as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle chicken pieces with salt, and nestle them into sauce. Cover, and 5 minutes later adjust heat so mixture simmers steadily. Cook until chicken is very tender, 45 minutes to an hour. Taste, and adjust seasoning. Then garnish, and serve with couscous."}]}