{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Cake With Coconut Icing", "description": "A version of this golden, tart-sweet confection was served at the 76th birthday of the legendary Southern chef, Edna Lewis. It is a true labor of love, so be sure to set aside a full afternoon to make it; this is not the sort of cake you want to rush.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2016/12/05/dining/05COOKING-LEMONCAKECOCONUTICING1/05COOKING-LEMONCAKECOCONUTICING1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "12 servings", "recipeCuisine": "southern", "recipeCategory": "cakes", "keywords": "coconut, flour, lemon, dessert, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 302}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 699, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "103 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "20 grams", "sodiumContent": "345 milligrams", "sugarContent": "70 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 cup/170 grams unsalted butter (1 1/2 sticks), softened, plus more for greasing the pans", "3 cups/435 grams all-purpose flour, plus more for dusting the pans", "1 teaspoon salt", "1 tablespoon baking powder", "1 cup/240 milliliters whole milk, at room temperature", "1 tablespoon vanilla", "1 1/2 cups/300 grams sugar", "3 eggs, at room temperature", "1 cup/200 grams sugar", "3 tablespoons flour", "1 tablespoon cornstarch", "2 tablespoons lemon zest", "1/2 cup lemon juice (from about 3 lemons)", "3 eggs", "4 tablespoons/57 grams unsalted butter (1/2 stick), at room temperature", "1 1/2 cups/300 grams sugar", "3 egg whites, at room temperature", "1 1/8 teaspoons vanilla extract", "3 1/2 cups/200 grams freshly grated or packaged unsweetened coconut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Grease three 9-inch cake pans with butter and dust with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake: In a medium bowl, sift together the flour, salt and baking powder and set aside. In a small bowl, combine the milk and vanilla and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a stand mixer fitted with the paddle attachment, cream the butter. Add the sugar and beat until light and fluffy. Scrape down the sides of the bowl, and beat in the eggs, one at a time, mixing well after each addition. Add a third of the flour mixture, then half the milk mixture in alternating additions, mixing in between just enough to incorporate, beginning and ending with the flour mixture. Scrape the bottom and sides of the bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter among the prepared pans and smooth the tops. Bake for 15 to 20 minutes. The cakes should be barely done in the middle. Cool 5 minutes in the pans, then unmold onto wire racks to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the lemon curd: In a medium saucepan combine the sugar, flour and cornstarch. In a bowl whisk together the lemon zest, lemon juice and 1 cup of water. Beat in the eggs. Slowly whisk the lemon mixture into the sugar mixture. Cook over medium heat, slowly whisking until the mixture thickens. Remove from the heat and stir in the butter. Set aside to cool, then refrigerate until ready to use. (This can be made several days ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the icing: In a small saucepan, combine the sugar with 1/2 cup cold water and bring to a boil over high heat without stirring. Boil for 2 to 3 minutes. Dip a spoon into the syrup and let it drip off. When a 2- to 3-inch thread hangs off, remove from heat. Meanwhile, change the mixer attachment to the whisk attachment and beat the egg whites on medium speed until they hold their shape, about 2 minutes. With the mixer running, slowly add in the syrup in a steady stream. Increase the speed and beat the mixture until firm, about 2 to 3 minutes. Add the vanilla and whisk briefly to combine. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Place 1 cake layer on a serving platter. Spread half the lemon curd on top, but do not let it spill down the sides. Repeat with the second layer, then top with the third cake. Spread the icing on the top and sides, then cover it with the coconut, pressing it in on the sides with the palms of your hands."}], "link": "https://cooking.nytimes.com/recipes/7800-lemon-cake-with-coconut-icing"}