{"@context": "http://schema.org", "@type": "Recipe", "name": "Chili-Stuffed Steak", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H16M", "recipeYield": "4 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner", "keywords": "anaheim chili, beef, steak, dairy-free, nut-free, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 470, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "1 gram", "proteinContent": "27 grams", "saturatedFatContent": "11 grams", "sodiumContent": "119 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["6 fresh green Anaheim, sandia No. 2 or other medium-hot chili peppers", "4 tablespoons canola or light olive oil", "1 tablespoon flour", "1/2 cup chicken stock", "1 clove garlic, peeled and minced", "1 pinch Greek or Mexican oregano", "2 (10-ounce) top sirloin or New York strip steaks, 1 1/2 to 2 inches thick, with excess fat cut away", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon cayenne pepper", "1/2 teaspoon garlic salt", "1/2 teaspoon citric acid crystals (sour salt), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a charcoal grill, start the fire."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare chili peppers by roasting them over a flame, or in the oven placed in a paper bag to steam slightly. Then rub the skin off. Cut off the big clump of seeds at the end of each chili pepper, but leave remaining seeds and ribs. Slice one pepper in quarters lengthwise and set aside to garnish steaks. Chop remaining chili peppers medium-fine and set aside. (This step may be done a day or more in advance. Refrigerate the peppers until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, heat 1 tablespoon of canola or olive oil. Add flour and cook briefly until it thickens to a roux. Add chicken stock, minced garlic and oregano, and cook briefly just to thicken. Then add the reserved chopped chilies, stir to mix, remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using oven broiler, preheat to high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare steaks: cut a deep horizontal pocket in each steak, being careful not to pierce sides. Rub steaks with remaining oil. Mix together black pepper, cayenne, garlic salt and citric acid crystals, if desired. Rub this dry marinade into steaks, top and bottom. Stuff each steak with some of the chili mixture, leaving aside about half a cup for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast reserved pepper strips briefly on the broiler grid just long enough to give them char marks. Set aside. Place steaks on broiler or grill approximately 3 inches from the source of heat and cook, about 8 minutes to a side for medium-rare. Cut each steak into two portions and serve immediately on a heated platter, garnished with the reserved chili sauce. Drape a chili strip over the top of each steak."}], "link": "https://cooking.nytimes.com/recipes/7814-chili-stuffed-steak"}