{"@context": "http://schema.org", "@type": "Recipe", "name": "Blanc-Manger", "description": "", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": null, "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "almonds, heavy cream, raspberries, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 394, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "15 grams", "sodiumContent": "47 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups heavy cream, chilled", "3/4 cup whole milk", "3/4 cup ground almonds", "1/2 cup sugar", "1 packet powdered gelatin", "1 to 2 tablespoons kirsch or 2 teaspoons pure vanilla extract", "1 cup raspberries or assorted soft ripe fruit cut in small cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with ice cubes and cold water. Have ready a smaller bowl that fits into the ice-water bath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip cream until it holds soft peaks. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring milk, almonds and sugar to a boil over medium heat, stirring occasionally to make certain the sugar dissolves. While milk heats, put gelatin and 3 tablespoons cold water in a microwave-safe bowl or a saucepan. When the gelatin is soft and spongy &#8212; it should take about 2 minutes &#8212; heat it in a microwave oven for 15 seconds (or cook it over low heat to dissolve). Stir the gelatin into the hot milk mixture, and remove the saucepan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the hot almond milk into the small reserved bowl, and set the bowl into the ice-water bath. Stir in kirsch or vanilla, and continue to stir until the mixture is cool but still liquid; you do not want the milk to gel in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very gently fold the cold whipped cream into the almond milk with a rubber spatula, then fold in the berries. Spoon the blanc-manger into an 8-inch cake pan that is 2 inches high, and refrigerate until set, about 2 hours. The blanc-manger can be covered and kept in the refrigerator for up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To unmold the blanc-manger, dip the cake pan up to its rim in hot water for 5 seconds, then wipe the pan and invert the blanc-manger onto a serving plate. Serve immediately or chill until needed. Serve raspberry coulis on the side."}]}