{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Red Snapper With Rhubarb Sauce", "description": "Here, the moderately rich snapper, lightly crisped, tasting of butter or olive oil works beautifully with the tart-sweet rhubarb sauce. The rhubarb cooks with no added liquid -- it contains plenty, as you'll see -- and needs almost no preparation other than a quick trim and rinse. If the stalks are very large -- more than an inch wide and a foot long -- use a vegetable peeler or a paring knife to remove the strings and cut into 4 or 5 inch pieces. (Never eat the rhubarb leaves; they contain toxic levels of oxalic acid, which gives rhubarb its astringency.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "fish, red snapper, rhubarb, gluten-free, nut-free, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 371, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "5 grams", "sodiumContent": "732 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound rhubarb, washed and trimmed", "1/3 cup sugar", "Pinch saffron", "Salt and pepper to taste", "2 tablespoons olive oil", "2 tablespoons butter (or a little more oil)", "4 6-ounce red snapper fillets", "Chopped mint or parsley for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the rhubarb, sugar and saffron in a small saucepan, cover and turn the heat to low. Cook, stirring only occasionally, for about 20 minutes, or until the rhubarb becomes saucy. Add salt to taste and a little more sugar if necessary. If the mixture is very soupy, continue to cook a little longer to make it thicker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you judge the rhubarb to be nearly done, put a large skillet, preferably nonstick, over medium-high heat. A minute later, add the oil and butter. When the butter foam subsides, add the fillets, skin side down. Cook for 4 or 5 minutes, or until the fish is nearly done; turn carefully; and lightly brown the flesh side, seasoning it with salt and pepper as it cooks. Transfer the fish to a plate lined with paper towels to absorb excess oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the fish napped with a bit of the sauce and garnished, if you like, with the herb."}], "link": "https://cooking.nytimes.com/recipes/7846-sauteed-red-snapper-with-rhubarb-sauce"}