{"@context": "http://schema.org", "@type": "Recipe", "name": "Tangy Chicken With Shiitake Crust", "description": "To reduce the amount of butter and cream in his dishes, the chef Michel Richard works with three elements: reductions or concentrations, sauces or juices; crusts to keep food moist; and firecrackers, the crunch from oven-dried vegetables and fruits.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H25M", "recipeYield": "6 servings", "recipeCuisine": "american, french", "recipeCategory": "dinner", "keywords": "balsamic vinegar, button mushrooms, chicken, shallot, shiitake, gluten-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 661, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "6 grams", "proteinContent": "84 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1652 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Zest from 1 orange (orange part only), coarsely chopped", "2 large shallots, peeled and coarsely chopped", "1 cup dry white wine", "1 cup balsamic vinegar", "2 cups low-sodium chicken broth", "2 tablespoons tomato paste", "Salt and freshly ground black pepper to taste", "2 tablespoons minced fresh chervil, thyme or chives", "2 tablespoons cold, unsalted butter, coarsely chopped", "2 tablespoons olive oil", "3/4 pound button mushrooms, trimmed and sliced", "3/4 pound shiitake mushrooms, stemmed and sliced", "2 large shallots, peeled and coarsely chopped", "2 large cloves garlic, peeled and minced", "Salt and freshly ground black pepper to taste", "6 large boneless, skinless chicken breasts, trimmed of fat, tendon removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, place orange zest, shallots, wine and vinegar in heavy medium saucepan. Boil over medium-high heat until reduced to 1/2 cup. Add chicken broth and tomato paste, boil until reduced to 1 cup. Strain through a fine sieve, pressing to extract liquid. Season with salt and pepper. (Can be prepared a day ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the chicken, heat olive oil in a large heavy skillet over medium-high heat. Add mushrooms, shallots and garlic and cook, stirring occasionally, until mushrooms are lightly browned, about 5 minutes. Cool completely. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove small fillets from underside of each chicken breast and place in a food processor. Pulse until chicken forms a smooth paste. Add mushroom mixture and pulse until coarsely chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large baking sheet with parchment paper. Pat chicken breasts dry. Pound them lightly between 2 sheets of waxed paper to an even thickness. Season with salt and pepper. Divide mushroom mixture into 6 parts. Place a 12-inch piece of plastic wrap on a work surface, placing 1 part of the mushroom mixture in the center. Fold the plastic in over the mushroom mixture and pat it to an even thickness, slightly larger than the chicken breasts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull back plastic and place 1 breast, rounded side down, on top of the mushroom mixture. Gather plastic tightly around the chicken breast until mushroom mixture adheres to the top and sides of the chicken. Unwrap and gently invert the breast, uncoated side down, onto baking sheet. Carefully peel away plastic. Repeat with remaining breasts and mushroom mixture. (Can be prepared ahead and refrigerated; bring to room temperature before baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Bake chicken for 12 minutes (10 minutes for medium or small breasts). Remove from oven and let stand for 12 minutes; chicken will continue to cook. Slice breasts diagonally. Arrange each breast on a plate, fanning out slices. Reheat sauce over medium high heat. Stir in chervil. Whisk in the butter and ladle around chicken. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7888-tangy-chicken-with-shiitake-crust"}