{"@context": "http://schema.org", "@type": "Recipe", "name": "A Chicken in Every Teapot", "description": "\"I heard what people thought about French food,\" the chef Michel Richard said to Marian Burros in a 1993 interview. \"They say it's too rich, it's too heavy, there's too much sauce. When I opened Citrus, immediately I had less butter and less cream. You don't need butter and cream. The Chinese don't use it.\" For this recipe, chicken is steamed over a broth made from chicken stock and tea.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, leek, rutabaga, tea, turnip, dairy-free, gluten-free, fall, winter, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1070, "unsaturatedFatContent": "44 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "70 grams", "fiberContent": "4 grams", "proteinContent": "83 grams", "saturatedFatContent": "20 grams", "sodiumContent": "2053 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium rutabaga (about 6 ounces), peeled and cut into 1-inch pieces", "1 medium turnip (abut 6 ounces), peeled and cut into 1-inch pieces", "1 large carrot, peeled and cut into 1-inch lengths", "2 medium red boiling potatoes (about 4 ounces each), peeled and cut into 1-inch pieces", "1 large leek (white and light green parts only), halved lengthwise and sliced into 1/8-inch pieces", "1 small onion, peeled and diced", "4 cups low-sodium chicken broth", "3 3/4 to 4-pound roasting chicken, at room temperature", "Salt and freshly ground black pepper to taste", "3 chamomile or other tea bags", "1 tablespoon Dijon mustard", "2 tablespoons minced fresh chervil or Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place vegetables in bottom of a large steamer. Pour chicken broth over vegetables. Bring to boil over medium-high heat. Place steamer basket above vegetables. Season chicken with salt and pepper, place in basket. Cover pot tightly, reduce heat and steam chicken for 20 minutes. Add tea bags to basket and pour in additional broth if liquid is reduced below about 2 cups. Turn chicken. Cover and steam until chicken is cooked and juices run yellow when thigh is pierced, about 1 hour more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove tea bags. Transfer chicken to cutting board, carve into serving pieces. Remove skin if desired. Bring vegetable mixture back to boil. Whisk in mustard. Season with salt and pepper. Ladle vegetables and broth into 4 soup plates. Place chicken pieces on top of vegetables. Sprinkle with chervil, serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7889-a-chicken-in-every-teapot"}