{"@context": "http://schema.org", "@type": "Recipe", "name": "Michel-Michel Shabu-Shabu", "description": "What Americans say they want to eat (light) and what they actually consume (rich) make life difficult for most chefs. Few of them have figured out how to succeed with the light without the rich. Not the chef Michel Richard. After working for 15 years in this country as a pastry chef, Mr. Richard said he has determined what people really want. Light, yes, but with strong taste.\"", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "french, japanese", "recipeCategory": "dinner, soups and stews", "keywords": "beef tenderloin, ginger, horseradish, napa cabbage, rutabaga, zucchini, dairy-free, gluten-free, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 302, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "26 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1250 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound to 1 pound beef tenderloin, in 1 piece, trimmed of fat", "4 to 5 cups beef broth, preferably unsalted", "1 2-inch piece fresh horseradish, peeled and grated or 1-inch piece fresh ginger, peeled and cut into fine julienne", "1 cup peeled, quartered and thinly sliced rutabaga", "1 small zucchini, trimmed and thinly sliced", "1 large carrot, peeled and sliced into 2 by 1/4-inch strips", "8 mushrooms, stemmed and quartered if large", "8 Napa cabbage leaves, thinly sliced", "1 cup snow peas, strung", "Salt and freshly ground black pepper to taste", "4 teaspoon Dijon mustard", "1 teaspoon prepared horseradish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze meat for 1 hour. Cut into 12 to 16 thin slices. Place 1 slice between 2 pieces of plastic wrap and pound until paper thin. Repeat with remaining slices. (Can be rewrapped and refrigerated until 1 hour before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 cups of broth to boil and add grated horseradish or ginger. Lower heat and simmer gently for 10 minutes. (Can be prepared ahead up to this point, covered and left at room temperature.) Strain and measure, adding additional broth if needed to make 4 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring broth back to boil. Add rutabaga, zucchini, carrot and mushrooms, cover and simmer gently for 5 minutes. Stir in cabbage and snow peas, cover and simmer for 5 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, arrange meat slices in the bottom of 4 soup plates. Combine mustard and horseradish and spread over meat. Pepper meat. Ladle the broth and vegetables over the meat and serve immediately."}]}