{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Chops With Sweet Pea and Spinach Sauce", "description": "For the chef Michel Richard, using less butter and cream requires making deft use of sauces. For these chops, a rich chicken stock is lightened by the addition of baby peas and spinach.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT55M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "champagne vinegar, lamb chop, peas, spinach, gluten-free, nut-free, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1019, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "92 grams", "fiberContent": "4 grams", "proteinContent": "38 grams", "saturatedFatContent": "39 grams", "sodiumContent": "976 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons unsalted butter", "1 small onion, peeled and chopped", "1 clove garlic, peeled and minced", "2 tablespoons Champagne- or white-wine vinegar", "1 cup low-sodium chicken broth", "3/4 cup frozen baby peas, defrosted", "1/2 pound small leaf spinach, stemmed, washed, well-dried and coarsely chopped", "Salt and freshly ground black pepper to taste", "2 tablespoons olive oil", "8 rib lamb chops, well-trimmed and patted dry", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, melt butter in a heavy large saucepan over medium-low heat. Add onion, then cover and cook until translucent, about 10 minutes, stirring occasionally. Add the garlic and vinegar. Boil until reduced to a glaze. Add 1/2 cup of the chicken broth and boil until reduced by half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the peas and remaining 1/2 cup chicken broth in a blender and blend until smooth. Add onion mixture and blend until smooth, stopping to scrape the sides of the jar. Strain through a fine sieve into a clean saucepan. (Can be prepared ahead, then covered and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the lamb, preheat oven to 425 degrees. Place a heavy, large, oven-proof nonstick or cast-iron skillet over medium-high heat until hot. Coat skillet with olive oil. Add lamb chops and quickly brown on both sides. Place skillet in oven and bake until just firm to the touch, about 5 minutes for medium-rare. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, rewarm sauce over medium heat. Add spinach and stir until wilted, about 3 minutes. Season with salt and pepper. Ladle some sauce into the center of 4 plates. Place 2 lamb chops in center of each plate. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7892-lamb-chops-with-sweet-pea-and-spinach-sauce"}