{"@context": "http://schema.org", "@type": "Recipe", "name": "Degustation of Wild Mushrooms With Soft Polenta", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, winter, main course, side dish, mushroom, polenta, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 399, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "8 grams", "sodiumContent": "278 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 teaspoons kosher salt", "1 1/2 cups yellow polenta meal", "2 tablespoons butter", "1/4 pound each of 4 different wild mushrooms (1 pound total)", "2 tablespoons unsalted butter", "2 tablespoons olive oil", "4 tablespoons finely minced shallots", "Kosher salt and freshly ground pepper to taste", "1 tablespoon finely minced parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the polenta, place 5 cups of water and the salt in a large saucepan and bring to a boil. Whisk in the polenta very slowly, whisking constantly to prevent lumps. Switch to a wooden spoon and lower the heat so that the polenta is just sputtering occasionally. Cook, stirring constantly, until the polenta is very thick and pulls away from the sides of the pan, 20 to 25 minutes. Stir in the butter, remove from heat, cover and set in a warm place while you cook the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mushrooms, clean each variety and remove the stem if it is fibrous. Slice any that are very large, but try to maintain their distinctive shapes. Place 2 small saute pans over medium heat and add 1 1/2 teaspoons butter and 1 1/2 teaspoons oil to each. When the butter is melted, add one variety of mushroom and 1 tablespoon of shallots to each. Season with salt and pepper and cook, stirring frequently, until the mushrooms have released all their liquid and are lightly browned, 5 to 8 minutes depending on variety."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooked mushrooms to a warmed serving platter, placing them in piles around the edge of the platter. Cover with foil. Wipe out the skillets, add more butter and oil to each, return them to the heat and cook the remaining mushrooms in the same manner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a generous amount of the polenta in the middle of the platter and garnish with the parsley. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/7914-degustation-of-wild-mushrooms-with-soft-polenta"}