{"@context": "http://schema.org", "@type": "Recipe", "name": "Pickled Peppers", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "5 pint jars", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "bell pepper, sugar, vinegar, dairy-free, gluten-free, nut-free, vegan, vegetarian, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 623, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "140 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1412 milligrams", "sugarContent": "126 grams", "transFatContent": null}, "recipeIngredient": ["4 red bell peppers, stemmed, seeded and cut into 1/2-inch-wide strips", "4 yellow bell peppers, stemmed, seeded and cut into 1/2-inch-wide strips", "4 green bell peppers, stemmed, seeded and cut into 1/2-inch-wide strips", "3 cups white vinegar", "3 cups sugar", "2 tablespoons kosher salt", "5 cloves garlic", "5 teaspoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sterilize jars: wash 5 pint (2-cup) canning jars with new 1- or 2-piece lids in hot, soapy water and rinse well. Place jars on a rack in a large kettle. (Jars should not touch the bottom of the kettle.) Fill kettle with water until jars are completely covered. Bring to a boil and boil 15 minutes. Leave jars in the hot water, removing them with tongs as you fill them. Place lids in a large saucepan and cover with water. Bring to a boil and boil 5 minutes. Leave lids in hot water, taking them out as you need them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large kettle 1/4 full of lightly salted water to a boil and add the peppers. Simmer until tender, about 10 minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return kettle to the heat and add the vinegar, sugar and salt. Bring to a boil, stirring, and add the peppers. Return to a boil. Place 1 clove of garlic and 1 teaspoon of olive oil in each jar and pack the peppers gently into the jars, leaving about 1/4inch of space below the lip. Pour enough liquid into the jars to cover the peppers. Wipe rims with a clean, damp towel and screw lids on securely but not too tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large kettle fitted with a rack halfway with water and bring to a boil. Meanwhile, bring a teapot full of water to a boil. Place the filled jars on the rack (they must not touch -- work in batches if necessary) and pour in boiling water from the teapot until jar tops are covered by 2 inches. Bring to a boil and boil 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, remove jars from the kettle. Using potholders, tighten lids. Allow to cool. Store in a cool, dark place."}], "link": "https://cooking.nytimes.com/recipes/7955-pickled-peppers"}