{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Roast Duck", "description": "Duck is so difficult to roast badly that all experienced cooks seem to claim their procedure is the best. Having tried many methods, I can say that the results are all about the same. So I chose the one presented here, which is the easiest way to guarantee a succulent but beautifully browned bird.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/20/dining/20COOKING-EASYROASTDUCK/20COOKING-EASYROASTDUCK-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, nut-free, duck, soy sauce, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 228}, "recipeIngredient": ["1 4- to 5-pound duck", "Freshly ground black pepper", "1/4 cup soy sauce, more or less"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Remove giblets and neck from duck cavity and discard or reserve for another use. Cut off excess fat from duck cavity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place duck, breast side down (wings up), on a rack in a roasting pan; add water to come just below the rack. Sprinkle duck with pepper and brush with a little soy sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast 30 minutes, undisturbed. Prick the back all over with point of a sharp knife, then flip bird onto its back. Sprinkle with pepper and brush with soy sauce again. Add a little more water to the pan if the juices are spattering (carefully--you don't want to get water on the duck)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast 20 minutes, then prick the breast all over , and brush with soy sauce. Roast 10 minutes; brush with soy sauce. Roast 5 or 10 minutes more if necessary, or until duck is a glorious brown all over and an instant-read thermometer inserted into the thigh measures at least 155 degrees. Let rest 5 minutes before carving and serving."}]}