{"@context": "http://schema.org", "@type": "Recipe", "name": "Culotte Steaks With Onion Glaze And Horseradish Bread Crumbs", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, project", "keywords": "fall, horseradish, onion, steak, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 843, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "1 gram", "proteinContent": "59 grams", "saturatedFatContent": "23 grams", "sodiumContent": "930 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup soft bread crumbs made from day-old bread", "1 tablespoon unsalted butter", "3 tablespoons bottled horseradish, drained", "2 teaspoons Dijon mustard", "Salt and freshly ground black pepper", "4 1-and-a-half-inch-thick culotte steaks (or hanging tenderloin, filet mignon, or New York strip steaks), 7 to 8 ounces each", "1 tablespoon olive oil", "1 medium onion, thinly sliced", "2 teaspoons minced garlic", "3/4 cup red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Spread the bread crumbs on a baking sheet and bake until dry and toasted, 5 to 10 minutes. Melt the butter in a small, heavy skillet set over medium heat and add the bread crumbs, horseradish, and mustard. Stir until the crumbs are well coated and golden brown, about 10 minutes. Season to taste with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the steaks generously on both sides with salt and pepper. In a heavy skillet large enough to hold the steaks without crowding, heat the oil over high heat. When very hot, add the steaks and brown them for 1 minute on each side. Reduce the heat to medium high and cook for 3 to 4 minutes more per side for rare to medium rare (internal temperature of 120 to 135 degrees). Transfer the steaks to a platter and cover them loosely with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but 1 tablespoon of the fat in the skillet and add the onion and garlic. Cook over medium heat until soft, about 5 minutes, stirring occasionally. Pour in the wine and bring to a boil, scraping up any browned bits from the bottom of the pan. Continue to cook until the liquid is reduced and syrupy and season to taste with salt and pepper. Spoon the onion mixture around the steaks on the platter, sprinkle the steaks with the bread crumbs and serve."}], "link": "https://cooking.nytimes.com/recipes/7982-culotte-steaks-with-onion-glaze-and-horseradish-bread-crumbs"}