{"@context": "http://schema.org", "@type": "Recipe", "name": "Marjoram-Scented Black Bass, Grilled Over Wood Fire", "description": "Grilling has become my favorite way to cook fish, especially when it's still whole. This way the meat is protected by the skin and bones, which allows for gentle cooking, even over low heat. Here, I use relatively strong flavorings and seasongs which, in combination with the mild wood smoke, produces a delicious result.''", "author": {"@type": "Person", "name": "William Norwich"}, "image": null, "totalTime": "PT2H25M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, project", "keywords": "black bass, garlic, marjoram, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1105, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "12 grams", "proteinContent": "145 grams", "saturatedFatContent": "8 grams", "sodiumContent": "2060 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 whole black bass, 3 to 4 pounds each, scaled and gutted", "Kosher salt and ground white pepper", "10 cloves garlic, peeled, crushed", "1/4 pound fresh marjoram", "2 lemons, thinly sliced", "1/2 cup olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly rinse the two black bass under gently running cold water and pat dry with paper towels. Season inside and out with a generous amount of salt and pepper. Fill the cavity of each fish with 2 1/2 cloves garlic, half of the marjoram and half the lemon slices. Drizzle half of the oil onto a very large platter, sprinkle each fish with salt and pepper and then with half of the remaining garlic, marjoram and lemon slices. Place both fish on top of the garnish, drizzle with the remaining oil and top with the remaining garlic, marjoram and lemon slices. Cover with plastic wrap and refrigerate 2 to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a grill rack or grill basket generously with oil and place 5 inches away from medium coals on a charcoal or gas grill. Cook the fish for about 10 minutes on each side, depending on its size, until done. Remove from the grill to a large platter with the help of two large spatulas. Filet and serve."}], "link": "https://cooking.nytimes.com/recipes/7988-marjoram-scented-black-bass-grilled-over-wood-fire"}