{"@context": "http://schema.org", "@type": "Recipe", "name": "Jean Halberstam's Deep-Fried Peaches", "description": "Jean Halberstam, who was married to the Pulitzer Prize-winning journalist David Halberstam until his death in 2007, is a well-known, accomplished cook. To make this dessert for a 2005 dinner party at their home on Nantucket, she plunged skinless peach halves into a batter, then sizzled them in a bath of boiling Crisco — yes, Crisco; “Nothing else makes them as crisp,” she said — until lightly browned, and rolled them in sugar. Her dinner guests could not believe how good these were.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2014/05/27/dining/Fried-Peaches/Fried-Peaches-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 8", "recipeCuisine": "american", "recipeCategory": "project", "keywords": "dessert, side dish, flour, peach, vegetable shortening, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1261, "unsaturatedFatContent": "81 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "117 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "29 grams", "sodiumContent": "65 milligrams", "sugarContent": "32 grams", "transFatContent": "15 grams"}, "recipeIngredient": ["1 1/2 cups all-purpose flour", "Pinch of salt", "1 1/2 tablespoons olive oil", "2 egg yolks", "2 tablespoons brandy", "4 ripe peaches", "Lemon juice", "4 egg whites", "2 pounds Crisco or other solid vegetable shortening", "1 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the flour and salt in a large bowl. Form a well and stir in oil and egg yolks, then 3/4 cup very cold water little by little until the flour is incorporated. Add brandy and stir for 10 minutes until batter is smooth and a bit thicker. Let batter rest for at least two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin the peaches by dropping them in boiling water for 5 to 10 seconds and plunging them immediately into ice water. Peel off the skin, then sprinkle the peaches with lemon juice to prevent browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the batter is ready, beat egg whites stiffly. Stir 1/4 of the egg whites into the batter to lighten it, then gently fold in the rest, as you would for a soufflé."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep pot, heat the shortening to 360 degrees. Cut the peaches in half, remove their pits, dip them in the batter, and fry a few at a time in the hot oil until golden, 30 to 90 seconds per side. Don't put all the peaches in at once or the oil temperature will drop too much. As soon as the peaches are golden, remove them to drain on a rack or paper towels and quickly roll them in sugar to coat completely."}], "link": "https://cooking.nytimes.com/recipes/7996-jean-halberstams-deep-fried-peaches"}