{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginger Duck", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "duck, ginger, onion, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "recipeIngredient": ["1 duck (thawed in the refrigerator), giblets removed", "1 onion, peeled and cut in half, or 3 shallots", "2 stalks celery, cut into 3-inch-long pieces", "2 teaspoons ground ginger", "1/2 cup sugar", "1/2 cup soy sauce", "1 teaspoon salt", "1/2 cup sherry", "1 small bunch watercress, trimmed and washed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before, stuff the duck with the onion and celery. Place the duck, breast side up, in a large soup pot with enough water to half cover it. Add the ginger and bring to a boil. Cover and reduce the heat so that it simmers gently for an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After one hour, turn the duck over. Add the sugar, soy sauce and salt. Continue simmering for another hour. Turn duck once again and simmer until tender and almost falling apart, about another hour. Turn off the heat and when cool enough, remove duck from pot and place in a roasting pan. Cover and refrigerate until the next day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the broth into a container and chill overnight. A layer of fat will form on top. Scrape off and discard. What remains is delicious in rice and soups and can be frozen for months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, bring duck to room temperature in roasting pan. Preheat oven to 350 degrees. Add the sherry and 1 cup of the defatted duck broth to the roasting pan and place in the oven. Roast uncovered for 30 to 45 minutes, basting occasionally with the juices from the pan. The duck is done when it is heated through and the skin is crisp and chestnut brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the duck to a serving platter and garnish with watercress."}], "link": "https://cooking.nytimes.com/recipes/8013-ginger-duck"}