{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread-Peach Summer Pudding", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, eggs, gingerbread, peach, vegetarian, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 800, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "156 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "10 grams", "sodiumContent": "776 milligrams", "sugarContent": "112 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 cup water", "1/2 cup unsalted butter, at room temperature, cut into 1/4-inch pieces", "3/4 cup molasses", "2 eggs, at room temperature", "2 1/2 cups all-purpose flour", "2/3 cup sugar", "2 teaspoons baking soda", "1 teaspoon kosher salt", "2 teaspoons ground ginger", "1 teaspoon ground cinnamon", "1 cup water", "1 cup sugar", "2 teaspoons minced fresh ginger", "10 large peaches, each peeled, pitted and cut into 6 slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the gingerbread, preheat the oven to 350 degrees. Butter a 9-by-5-by-3-inch loaf pan and set aside. Bring the water to a boil. Remove from the heat and whisk in the butter until melted. Whisk in the molasses and the eggs. Sift together the flour, sugar, soda, salt, ginger and cinnamon into a large bowl. Gradually stir in the molasses mixture. Scrape the batter into the prepared pan and bake until cake springs back when touched in the center, about 1 hour. Let cool. (Gingerbread can be baked 1 day ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the topping, combine the water, sugar and ginger in a medium saucepan. Bring to a boil, lower the heat and simmer for 2 minutes. Let stand at least 30 minutes; strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the gingerbread in half, reserving half for another use. (It can be wrapped tightly and frozen.) Slice the half into 8 pieces, about 3/8 inch thick. Arrange the gingerbread slices in a 7 1/2-by-11 1/2-inch shallow baking dish in a single or slightly overlapping layer. Brush with about 1/4 cup of the ginger syrup, especially around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the peaches in a large bowl and toss with the remaining syrup. Spread the peaches, with their syrup, over the gingerbread. Cover with aluminum foil. Bake until the peaches are very soft but not mushy, about 45 minutes to 1 1/2 hours, depending on the ripeness of the fruit. Serve warm or at room temperature."}]}