{"@context": "http://schema.org", "@type": "Recipe", "name": "Woodchuck au Vin", "description": "The gardener who created this dish notes that the herbs and vegetables in this recipe are available fresh from the garden because they have not been eaten by the dish's main ingredient.", "author": {"@type": "Person", "name": "Joyce Wadler"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "3 to 6 servings, depending on size of woodchuck", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "beef stock, carrot, woodchuck, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 223, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "550 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 to 3 tablespoons olive oil", "1 woodchuck, dressed and cleaned of scent glands, boned and cut into strips or bite-size chunks (see note)", "2 shallots, chopped", "2 large carrots, cut into 1/2-inch dice", "1 clove garlic, minced", "1 cup beef stock or water", "2 cups dry red wine", "3/4 cup plus 2 tablespoons white vermouth", "2 teaspoons coarsely ground black pepper", "1/4 teaspoon dried thyme", "1 fresh or dried bay leaf", "2 tablespoons chopped fresh rosemary", "1 1/2 cups pitted Cerignola olives, very coarsely chopped", "2 to 3 tablespoons flour", "Chopped fresh flat-leaf parsley", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a Dutch oven over medium-high heat for 1 minute. Add olive oil. When the oil is hot, add woodchuck meat and sauté until lightly browned on all sides. Transfer to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shallots and carrots to pan and sauté until lightly browned. Add garlic and sauté for 1 minute. Add stock or water, red wine and 3/4 cup of vermouth. Stir with a wooden spoon, scraping bottom of the pan. Return meat to pan, and add pepper, thyme, bay leaf, and 1 tablespoon of the rosemary. Cover, reduce heat to low, and simmer for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add olives and remaining 1 tablespoon rosemary. Cover and simmer, stirring occasionally, until meat is tender, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard bay leaf. Raise heat and boil uncovered until liquid is slightly reduced. In a small bowl, mix remaining 2 tablespoons vermouth with enough flour to make a soupy paste. Thicken sauce to taste by adding paste a tablespoon at a time, simmering for a minute after each addition; all of the paste may not be needed. Stir in parsley, and season with salt if needed. If desired, serve over rice or egg noodles, or with boiled potatoes."}]}