{"@context": "http://schema.org", "@type": "Recipe", "name": "Pecan Coffee Cake With Warm Caramel Sauce", "description": "This nutty sour cream coffee cake is rich enough to stand alone, but the bourbon caramel sauce elevates it to “special occasion dessert” status.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2015/11/19/dining/19COOKING-PECANCOFFEECAKE/19COOKING-PECANCOFFEECAKE-articleLarge.jpg", "totalTime": "PT1H35M", "recipeYield": "12 to 15 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "bourbon, pecans, sugar, dessert, side dish, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 433, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "11 grams", "sodiumContent": "193 milligrams", "sugarContent": "34 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup unsalted butter, at room temperature, plus more for greasing the pan", "2 cups all-purpose flour, plus more for the pan", "1 1/2 cups pecans, toasted and cooled", "1/2 teaspoon baking soda", "2 teaspoons baking powder", "1/2 teaspoon kosher salt", "1 1/4 cups sugar", "3 eggs", "1 teaspoon vanilla extract", "1 tablespoon bourbon", "1 cup sour cream", "1 cup sugar", "1/4 cup water", "1 cup heavy cream", "2 tablespoons bourbon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake, preheat the oven to 350 degrees. Butter and flour a 10-inch tube pan. Place the pecans in a food processor and pulse until they're chopped medium-fine; reserve 3/4 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together the flour, baking soda, baking powder and salt and add to the pecans in the food processor. Pulse until pecans are ground and well mixed with the flour. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, cream the butter and sugar together until very light. Add the eggs, 1 at a time, beating well after each addition. Mix in the vanilla and bourbon. Add the flour mixture alternately with the sour cream, beginning and ending with flour and mixing just to combine. Fold in the reserved pecans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the batter into the prepared pan and bake the cake until the top springs back when touched in the center, about 1 hour and 10 minutes. Let stand for 10 minutes, turn onto a rack, reinvert and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the sauce, place the sugar in a medium saucepan and stir in the water. Use a pastry brush dipped in water to wash down any sugar crystals clinging to the side of the pan. Place over medium heat and cook without stirring until mixture turns a deep caramel color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and carefully add the cream and bourbon. Return the pan to the heat and continue stirring until the mixture is smooth. The sauce can be made ahead and reheated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a slice of cake on each plate and spoon some of the warm sauce beside it."}]}