{"@context": "http://schema.org", "@type": "Recipe", "name": "Curried Duck", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H", "recipeYield": "Eight servings", "recipeCuisine": "indian", "recipeCategory": "dinner, project", "keywords": "duck, garlic, onion, fall, main course", "aggregateRating": null, "recipeIngredient": ["2 4-pound ducks (have the butcher remove the legs and separate them, remove the breasts and wings and reserve all trimmings)", "2 cloves garlic", "1 carrot", "1 stalk celery", "1 stalk lemongrass, smashed", "1 bay leaf or fresh lemon leaf", "2 onions, chopped", "6 shallots, chopped", "6 cloves garlic, peeled and chopped", "1 inch fresh ginger root, peeled and chopped", "1 teaspoon saffron threads", "1 teaspoon salt, plus more to taste", "1 tablespoon mild curry powder, plus more to taste", "1 tablespoon olive oil", "1 apple, seeded but not peeled", "1 banana, cut into 6 pieces", "1 teaspoon star anise", "2 stalks lemongrass, smashed", "1/2 cup brandy", "1 cup dry white wine", "2 tomatoes, coarsely chopped", "4 cups chicken broth", "8 okra, whole", "4 small zucchini, cut in 2-inch disks", "8 scallions", "Black pepper to taste", "2 tablespoons canned coconut milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the broth, heat a nonstick pot. Add the duck trimmings, neck and heart and stir to brown for about 2 minutes. Add the garlic, carrot, celery, lemongrass and bay or lemon leaf and 6 cups water and simmer for 2 hours, adding more cold water as needed to barely cover the trimmings. Strain, cool, remove fat and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the curry, place the onions, shallots, garlic, ginger and saffron in a food processor and pulverize to a fine paste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together 1 teaspoon of salt and 1 tablespoon of curry powder and dust each side of the duck meat. Place 1 tablespoon of olive oil in a heavy-bottomed casserole over high heat. When nearly smoking, add the duck legs and thighs, reduce heat to medium high and cook, turning to brown on all sides. Remove. Add the duck breasts, skin side down, and cook for 5 minutes. Remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain all but 1 tablespoon of the fat from the pot. Add the pureed vegetables and cook over medium-low heat, stirring as necessary to avoid burning, for about 5 minutes. Add the apple, the banana, the anise and the lemongrass and cook until the mixture is relatively dry, about 7 minutes. Add the duck and more curry (if desired), the brandy, the wine and the tomatoes and simmer for about 10 minutes. Add duck stock and simmer for 20 minutes. Add chicken broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mixture is once again simmering, add the okra, zucchini and scallions and allow to simmer until tender, about 10 minutes. Remove the zucchini and the scallions and keep in a warm place. Allow the duck to cook about 20 more minutes, remove and place on a warm platter with the zucchini and scallions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the sauce with the okra to the burner. Taste and adjust seasoning with salt, black pepper or curry powder. Simmer for 5 minutes. Carefully lift 2 tablespoons of the thick part of the coconut milk from the top of the can. Whisk this into the sauce and remove from heat immediately. Ladle the sauce over the duck and vegetables. Serve immediately with steamed rice."}], "link": "https://cooking.nytimes.com/recipes/8090-curried-duck"}