{"@context": "http://schema.org", "@type": "Recipe", "name": "Thyme-Smoked Shrimp", "description": "", "author": {"@type": "Person", "name": "Richard Sax"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, bell pepper, shrimp, thyme, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 162, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "6 grams", "proteinContent": "19 grams", "saturatedFatContent": "0 grams", "sodiumContent": "935 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small eggplant (about 12 ounces)", "1 red bell pepper", "1 green bell pepper", "1 yellow bell pepper", "2/3 cup extra-virgin olive oil, plus enough to coat the vegetables", "1/2 small zucchini, ends trimmed, cut into 1/4-inch dice", "1 ripe tomato, cored, seeded and cut into 1/4-inch dice", "1 small yellow onion, trimmed and cut into 1/4-inch dice", "1 small garlic clove, peeled and minced", "Pinch saffron threads", "1 teaspoon fresh thyme leaves, or 1/4 teaspoon dried", "1 tablespoon chopped parsley", "Juice of 1 1/2 lemons (about 1/4 cup), or to taste", "Salt and freshly ground black pepper", "1 bunch dried thyme sprigs, on the stem", "1 pound shrimp, peeled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the vinaigrette, preheat the oven to 400 degrees. Rub the eggplant and peppers with olive oil and place on a foil-lined baking sheet. Roast, turning the vegetables with tongs, until the eggplant is tender but not mushy and the peppers are scorched on all sides, about 45 minutes. Set the eggplant aside to cool. Place the peppers in a paper bag or bowl; close the bag tightly, or cover the bowl with plastic wrap, to steam off skins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut half of the eggplant into half-inch cubes; place in a mixing bowl. Remove the pepper skins; halve the peppers lengthwise and remove seeds and ribs. Cut half of each pepper into quarter-inch cubes and add to the bowl. Reserve remaining eggplant and peppers for another use. Add the zucchini, tomato, onion, garlic, saffron, thyme leaves and parsley and stir to combine the ingredients. Add two-thirds of a cup of olive oil, or just enough to cover the solids. Refrigerate several hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees, with a rack at central level. Bring the vinaigrette mixture to room temperature. Place a bed of thyme sprigs about one inch deep in a metal baking pan in which the shrimp will fit in a single layer. Arrange the shrimp over the thyme. Place in the oven and roast just until the shrimp are opaque and slightly firm when pressed gently, about five minutes. Remove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the shrimp are roasting, add lemon juice, salt and pepper to the vinaigrette. Spoon some of the vinaigrette on each of four serving plates; arrange the shrimp over it. Garnish each plate with one or two of the thyme sprigs and serve hot."}], "link": "https://cooking.nytimes.com/recipes/8092-thyme-smoked-shrimp"}