{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Leg Of Baby Lamb", "description": "", "author": {"@type": "Person", "name": "Richard Sax"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, project, roasts", "keywords": "fall, fava beans, lamb, leek, main course", "aggregateRating": null, "recipeIngredient": ["1 leg of baby lamb (2 to 2 1/2 pounds; see note), plus 2 or 3 extra lamb bones", "10 new garlic cloves, peeled, or 5 full-size garlic cloves, peeled and halved", "Olive oil, as needed", "Salt and freshly ground black pepper", "1/2 carrot, trimmed and cut into 1/2-inch dice", "1/2 onion, trimmed and cut into 1/2-inch dice", "1 small rib celery, trimmed and cut into 1/2-inch dice", "1 small leek, trimmed and cut into 1/2-inch dice", "1 branch fresh thyme, or pinch dried thyme leaves", "1 bay leaf", "2/3 cup dry white wine", "2/3 cup water", "3 to 4 pounds fresh fava beans (or substitute fresh lima or cranberry beans)", "2 tablespoons unsalted butter", "1 spring onion (or 3 scallions), trimmed and sliced", "2 tablespoons chopped fresh savory leaves (or fresh marjoram or oregano)", "Fresh savory sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut small slits in the lamb, inserting garlic cloves into the slits. Rub the lamb lightly with olive oil, wrap with plastic wrap and refrigerate several hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the lamb to room temperature. Preheat the oven to 400 degrees. Season the lamb with salt and pepper, rubbing seasonings into the flesh. Pour a thin film of olive oil into a heatproof roasting pan, gratin dish or ovenproof skillet. Place on top of the stove over medium heat. Brown the lamb, turning carefully once or twice, until golden on all sides, 10 to 15 minutes. Scatter lamb bones around the leg and place the pan in the oven. Roast 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the vegetables (except the fava beans) around the lamb and roast 10 minutes longer. Pour the wine and water around the lamb and roast another 10 minutes. Remove the pan from the oven. Transfer the lamb to a plate, wrap loosely in aluminum foil and let rest for 30 to 60 minutes. Strain the pan juices (do not degrease), then season the juices and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lamb is roasting, remove the fava beans from their pods, peeling off the thin skin that surrounds each bean. Blanch the beans, uncovered, in a large pot of boiling salted water for three minutes. Drain and rinse under cold water, drain again and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a saucepan over medium-low heat; add the spring onion and cook until softened, two or three minutes. Add the fava beans and cook gently, stirring, for five minutes. Stir in the reserved lamb juices; heat through for a moment. Add the savory leaves and correct seasonings. Place the fava beans in the center of a warm serving platter. Unwrap the lamb and place it carefully over the beans. Carve the lamb into slices at the table and serve with the fava beans and their juices, garnishing each portion with a sprig or two of savory."}], "link": "https://cooking.nytimes.com/recipes/8093-roast-leg-of-baby-lamb"}