{"@context": "http://schema.org", "@type": "Recipe", "name": "Pithiviers Of Rhubarb With Strawberry Sauce", "description": "", "author": {"@type": "Person", "name": "Richard Sax"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "dessert, side dish, rhubarb, strawberry, sugar, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 165, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "53 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces rhubarb, trimmed (about 6 stalks)", "1/4 cup, plus 2 tablespoons, sugar", "1/4 cup ground blanched almonds", "1 teaspooon cornstarch", "1/4 cup, plus 2 tablespoons, sour cream", "1 egg yolk", "1 teaspoon Cognac", "1/2 vanilla bean, split in half again lengthwise", "3 leaves phyllo dough", "2 1/2 tablespoons unsalted butter, melted", "1 egg yolk, lightly beaten, for glaze", "1 pint ripe strawberries, hulled", "1 teaspoon fresh lemon juice, or to taste", "2 to 4 tablespooons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pithiviers, peel any coarse strings from the rhubarb with a vegetable peeler. Cut into quarter-inch slices and place in a mixing bowl with a quarter-cup of the sugar. Set aside for two hours at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine the ground almonds, the remaining two tablespoons of sugar, cornstarch, sour cream, egg yolk and Cognac. Scrape the seeds from the vanilla bean and add to the mixture, whisking gently to combine. Drain the rhubarb in a sieve, pressing gently to remove liquid. Stir the rhubarb into the custard mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Cut leaves of phyllo dough in half. Place a sheet of phyllo on a lightly buttered baking sheet and brush with melted butter. Repeat twice, buttering each layer. Gently spoon the rhubarb mixture into the center of the pastry, leaving a one-inch border unfilled. Brush the edges of the pastry with egg yolk. Cover with three sheets of phyllo, buttering each as before. With a sharp paring knife, trim off the pastry edges, leaving a neat 8- to 10-inch circle (use a dinner plate as a guide). If desired, cut the pastry trimmings to form leaves and lay them over the center of the pastry. Brush the leaves with egg yolk to glaze, but do not glaze the top sheet of pastry. Use the back of a small knife blade to trace leaf ''veins.''"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the pastry is golden brown, about 20 minutes. Remove from the oven and cool briefly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pithiviers is baking, make the strawberry sauce. Reserve one well-shaped strawberry for garnish. Puree the remaining strawberries in a food processor with the lemon juice and sugar until smooth, scraping down the mixture as needed. Strain and correct seasoning with more lemon juice and/or sugar if necessary. Chill until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the reserved strawberry in the center of the warm pithiviers. Serve in wedges, with a little of the cool strawberry sauce spooned alongside each serving. Pass the remaining sauce."}], "link": "https://cooking.nytimes.com/recipes/8094-pithiviers-of-rhubarb-with-strawberry-sauce"}