{"@context": "http://schema.org", "@type": "Recipe", "name": "Macerated Peaches With Chamomile Ice Milk and Brioche", "description": "", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/Macerated-Peaches/Macerated-Peaches-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "brioche, chamomile, peach, dessert, side dish, spring", "aggregateRating": null, "recipeIngredient": ["1 cup fresh or dried chamomile blossoms (available in health food stores)", "1 cup sugar", "4 cups whole milk", "1 splash vanilla extract", "4 ripe cling peaches", "Juice of 1 lemon", "1/4 cup sugar", "1 to 2 tablespoons unsalted butter", "12 slices brioche about 2 1/2 inches round and 1/4- to 1/3-inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the ice milk:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine chamomile blossoms, sugar and milk. Place over medium-low heat just until steaming, then reduce heat as low as possible and allow to sit for 20 minutes. Strain. Mix in the vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and transfer to a metal mixing bowl. Place bowl in an ice water bath until mixture is chilled. (Mixture may be chilled in refrigerator if time allows.) Place 1/2 cup mixture in a covered container and refrigerate. Freeze remainder in an ice cream maker according to manufacturer's instructions. Transfer to an airtight container in freezer until needed."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the peaches:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pan of water to a boil. Add peaches and boil for 20 seconds. Remove and rinse with cold water until chilled. Slough off and discard skins. Cut peaches into 1/4-inch dice. Place in a bowl and mix in the lemon juice and sugar. (May be covered and refrigerated for up to 1 hour.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, melt butter in a medium skillet. Add brioche slices, turning until lightly browned on both sides. Place 2 slices on each of six serving plates, and top with equal portions of diced peaches. Top with a scoop of ice milk. With a whisk, froth unfrozen chamomile milk and drizzle a bit over each plate. Serve immediately."}]}]}