{"@context": "http://schema.org", "@type": "Recipe", "name": "Egidiana's Bollito Misto", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H", "recipeYield": "Eight servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "beef, chicken, ribs, fall, main course", "aggregateRating": null, "recipeIngredient": ["3-to-4 pound chicken", "2 pounds beef shank", "2 pounds short ribs", "1 red onion", "1 white onion", "3 stalks celery", "1 ripe tomato", "2 bay leaves", "3 stems parsley", "1 teaspoon salt", "4 black peppercorns", "4 cups chicken broth", "6 cups cold water", "4 carrots", "4 potatoes", "4 leeks, rinsed, trimmed and cut in half", "3 whole chicken breasts, boned", "1/4 teaspoon, plus a dash, freshly grated nutmeg", "1/2 cup Parmesan cheese", "2/3 pound mortadella, thinly sliced", "1/4 cup coarsely chopped flat-leaf parsley", "1 clove garlic, coarsely chopped", "2 eggs", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "3 eggs, lightly beaten", "1/2 cup Cream of Wheat", "1/4 cup Parmesan cheese", "1 tablespoon milk, with 3 additional tablespoons if necessary", "1 tablespoon butter, softened", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken, beef shank, short ribs, red and white onions, celery, tomato, bay leaves, parsley, salt and peppercorns in a large pot. Add the chicken broth and the cold water, bring to a boil, reduce heat and simmer for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broth is simmering, make the sausage. Place the chicken breasts and the nutmeg in a food processor and use the pulse button to coarsely chop the mixture. Do not overprocess: this will yield a weird, spongy, bolognalike creation. When coarsely chopped, add the Parmesan, mortadella, parsley, garlic, eggs, salt and pepper and pulse briefly to combine. Shape this mixture into a log about 3 to 4 inches in diameter, wrap securely in cheesecloth and, after the broth has cooked for 45 minutes, add the sausage to the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and cut the carrots into 2-inch chunks. Peel and cut the potatoes into 2-inch chunks. Forty-five minutes after the sausage has been added to the pot, add the carrots, potatoes and leeks and cook for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables are cooking, make the minestra di semolina. Place the lightly beaten eggs in a bowl, add the Cream of Wheat and stir to combine. Add the Parmesan, 1 tablespoon of milk, the butter, the salt and pepper and whisk. The mixture should resemble a thick pancake batter. Add more milk, if necessary, to achieve this texture. Heat a nonstick skillet over medium heat. When hot, add the batter, smoothing to make one even layer. Cook for 1 minute, reduce the heat to low and continue cooking for 4 more minutes. Gently turn the pancake, cook for 3 minutes on the second side, turn out onto a plate and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a slotted spoon to gently remove the carrots, potatoes and leeks from the broth. Arrange on a warm platter, cover lightly with broth to avoid drying and keep warm. Remove the sausage, unwrap it, cut it into 1/2-inch slices and arrange them on a platter along with the beef shank, ribs and chicken, hacked into serving-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth and return it to medium heat. Skim off any visible fat. Boil until the broth has reduced to 8 cups, about 7 minutes. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broth is simmering, use a sharp knife to cut the minestra di semolina into 1/4-inch chunks. Serve the broth liberally garnished with minestra di semolina as a first course, followed by the boiled meat and vegetables with the green and the red sauces below."}], "link": "https://cooking.nytimes.com/recipes/8122-egidianas-bollito-misto"}