{"@context": "http://schema.org", "@type": "Recipe", "name": "Paratha", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "12 breads", "recipeCuisine": "indian", "recipeCategory": "project", "keywords": "all-purpose flour, ghee, whole wheat flour, fall, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 144, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "5 grams", "sodiumContent": "105 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups all-purpose flour", "1 1/2 cups whole-wheat flour", "1 1/2 teaspoons salt", "9 tablespoons ghee (clarified butter), melted, plus more for cooking", "1 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flours and salt into a large bowl. Add 1 tablespoon of ghee and mix well. Add the water and mix to create a firm dough. Knead the dough for 10 minutes, form into a ball and wrap with plastic. Let rest 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 12 balls of equal size. On a lightly floured board, use a rolling pin to roll each ball into a thin disk about 7 inches in diameter. Brush each disk with 2 teaspoons of ghee. Using a knife, cut a straight line from the center to the outer edge of each disk. Starting at the cut edge, roll the dough into a cone shape. Stand each cone on its wide end and gently press down on the top, flattening it slightly into a roughly circular lump of dough. Lightly flour the board again and gently roll each lump into a circle about 5 inches in diameter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a griddle or cast-iron pan over medium heat and brush generously with ghee. Cook the parathas, 1 at a time, turning them and brushing them with ghee, until they are golden, 3 to 4 minutes. Lower the heat if they begin to scorch. Serve hot."}]}