{"@context": "http://schema.org", "@type": "Recipe", "name": "Nan", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H20M", "recipeYield": "8 breads", "recipeCuisine": "indian", "recipeCategory": "project", "keywords": "active dry yeast, all-purpose flour, ghee, fall, high fiber, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 128, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "104 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup lukewarm water", "1 packet ( 1/4 ounce) dry yeast", "1 tablespoon sugar", "1/4 cup plain yogurt", "1 egg, lightly beaten", "1/4 cup ghee, melted, plus more for greasing and brushing", "2 teaspoons salt", "3 1/2 cups all-purpose flour", "2 tablespoons poppy seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the water, yeast and 1 teaspoon of sugar in a small bowl and stir until sugar is dissolved. Set aside for 10 minutes, or until the mixture is frothy. Meanwhile, in a medium bowl, combine the yogurt, remaining 2 teaspoons of sugar, the egg, 1/4 cup of ghee and salt and stir until smooth. Stir in the yeast mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 cups of the flour in a large bowl. Pour in the yogurt-and-yeast mixture and stir until smooth. Gradually stir in more flour. When the dough becomes too difficult to stir, begin kneading, incorporating flour until you have a stiff dough. (You may use slightly more or less than the 3 1/2 cups of flour.) Knead for 10 to 12 minutes more, or until the dough is elastic. Grease a large bowl with ghee. Add the dough, turning to coat it all over with ghee. Cover with a cloth and leave the dough to rise in a warm place until doubled in size, 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, knead the dough briefly; shape into 8 balls of equal size. Cover with a cloth and allow to rest 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees and place 2 ungreased baking sheets inside. Pat the balls into disks that are slightly thinner in the center than at the edges and about 4 inches in diameter. Holding one edge, pull the opposite edge outward, forming a teardrop shape that is 6 to 8 inches long and 3 to 4 inches wide at the wider end. Brush each nan with ghee and sprinkle with poppy seeds. Divide the loaves between the 2 hot baking sheets and bake for 10 minutes, or until the breads are golden and puffy. (If they do not brown quickly enough, run them briefly under a preheated broiler.) Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/8129-nan"}