{"@context": "http://schema.org", "@type": "Recipe", "name": "Steak au Poivre", "description": "", "author": {"@type": "Person", "name": "Merrill Stubbs"}, "image": null, "totalTime": "PT45M", "recipeYield": "SERVES 4", "recipeCuisine": "french", "recipeCategory": "dinner, weekday", "keywords": "cognac, heavy cream, steak, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 862, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "2 grams", "proteinContent": "58 grams", "saturatedFatContent": "24 grams", "sodiumContent": "1171 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons mixed peppercorns (long pepper, Pondicherry, cubeb and Tasmanian black pepper)", "4 strip steaks, 1 1/2 inches thick, 10 to 12 ounces each", "Kosher salt", "1 to 2 tablespoons vegetable oil", "1 large shallot, finely sliced", "1/3 cup Cognac or brandy, plus additional for finishing sauce", "2 cups good-quality brown veal or beef stock", "1/3 cup heavy cream", "2 tablespoons green peppercorns in brine, rinsed and drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Crush the peppercorns between two layers of a kitchen towel with a rolling pin. Season both sides of the steaks with salt and sprinkle evenly with the crushed pepper, pressing gently so that it adheres."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large, heavy sauté pan over medium-high heat and add 1 tablespoon vegetable oil. When the oil starts to smoke, add two of the steaks to the pan and sear until browned, about 2 minutes a side. Transfer to a rack set in a shallow roasting pan. Repeat with the remaining steaks, adding more oil to the pan if necessary. Put in the oven to finish cooking. For medium-rare meat, remove the steaks when the internal temperature registers 135 degrees on a meat thermometer (10 to 12 minutes). Cover loosely with aluminum foil and let the meat rest for at least 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the steaks are in the oven, reduce heat under the pan to low and add the shallot. Cook, stirring frequently, until lightly browned, about 3 minutes. Add the Cognac (be careful, as it may ignite) and reduce by half, about 2 minutes. Add the stock and increase heat to medium. Simmer until thickened and reduced by about half, 8 to 10 minutes. Remove from heat and stir in the cream and green peppercorns. Season with salt if desired. Cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, return the sauce to a bare simmer over medium heat and add a splash of Cognac. Spoon the sauce evenly over the steaks and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8142-steak-au-poivre"}