{"@context": "http://schema.org", "@type": "Recipe", "name": "Kanom Jeen Nam-Prik (Rice Noodles With Spicy Shrimp and Coconut)", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/Kanom-Jeen-Nam-Prik/Kanom-Jeen-Nam-Prik-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday", "keywords": "coconut milk, rice noodles, shrimp, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 824, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "12 grams", "proteinContent": "43 grams", "saturatedFatContent": "26 grams", "sodiumContent": "2524 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium shallots, unpeeled", "2 large cloves garlic, unpeeled", "1 small (1/2-inch) round galangal", "1 teaspoon kosher salt", "1 14-ounce can coconut milk", "3/4 cup mung beans", "1/2 cup firmly packed shredded fresh (or frozen and defrosted) coconut", "1/4 cup vegetable oil", "2 teaspoons to 1 1/2 tablespoons chili ++powder, as needed", "1 1/2 pounds medium shrimp, peeled and deveined", "1/2 cup unsalted roasted peanuts, roughly chopped", "1/4 cup palm sugar", "1/4 cup fish sauce", "Juice of 1 lime", "Cooked Thai kanom jeen noodles, Japanese tomoshiraga noodles or white rice", "Thinly sliced green mango or papaya Handful cooked green beans, thinly sliced into rounds", "Deep-fried sliced shallots, garlic and chilies"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 450-degree oven or over an open flame from the stovetop, grill or broiler, roast the shallots, garlic and galangal until blackened. Peel and discard the skins, finely chop, then pound in a mortar or purée in a food processor to make a paste. Stir in the salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim off 1/2 cup of the creamy part of the can of coconut milk and set aside; pour the rest in a medium pot. Add 2 cups of water. Bring to a boil, then add the mung beans, reduce the heat and simmer for about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place a wok over low heat, then add the shredded coconut. Stir continuously until browned, 3 to 5 minutes. Transfer the coconut to a plate to cool. Clean the wok, return to the heat and add the oil. When the oil is hot, add the reserved paste and stir until fragrant, 1 to 2 minutes. Pour in the reserved coconut cream and cook, stirring, until a layer of oil appears, 3 to 5 minutes. Add the chili powder, beginning with 2 teaspoons and adding more to taste. Stir well for 30 seconds, then turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shrimp in the simmering coconut milk and poach until just pink, about 2 minutes. Remove the shrimp with a slotted spoon and roughly grind two-thirds of the shrimp in a food processor. Combine the whole and puréed shrimp in a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chili-paste mixture to the pot of coconut milk. Add the peanuts and two-thirds of the toasted coconut, crumbling it as you add it to the pot. Add the shrimp, palm sugar and fish sauce. Remove from heat and add lime juice to taste. Adjust the sugar, fish sauce and lime juice as needed; the dish should be sweet, sour and salty, with a kick of heat from the chili. Before serving, stir in the remaining toasted coconut. Serve over cooked noodles or rice and garnish with green mango, sliced green beans and fried shallots, garlic and chilies."}], "link": "https://cooking.nytimes.com/recipes/8147-kanom-jeen-nam-prik-rice-noodles-with-spicy-shrimp-and-coconut"}