{"@context": "http://schema.org", "@type": "Recipe", "name": "Great Roast Chicken", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H", "recipeYield": "2 servings", "recipeCuisine": "american", "recipeCategory": "dinner, project, roasts", "keywords": "chicken, rosemary, thyme, fall, main course", "aggregateRating": null, "recipeIngredient": ["1 3- to 3 1/2-pound natural chicken", "1 sprig thyme", "1 sprig rosemary", "1 sprig sage", "2 large cloves garlic, halved", "Salt and freshly ground black pepper", "1 lemon, halved", "Hungarian sweet paprika"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Boil enough water to fill half the bottom of a roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and dry the chicken. Remove the first two joints of the wings, and discard. Stuff the inside of the chicken with thyme, rosemary, sage and two garlic halves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub lemon, salt and pepper all over the chicken. Rub with remaining garlic, and sprinkle heavily with paprika to coat completely. Place the chicken on a rack set on top of the roasting pan, and steam over boiling water in the oven for 20 minutes. Remove from oven, place chicken on a vertical roaster and cross legs to catch inside the bars of roaster (to act as a truss). Pour off water, and place chicken in pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oven to 360 degrees, and roast the chicken about 20 minutes longer, until juices from the breast run clear when cut with a knife. Remove from vertical roaster, and cut off legs at the joint where the thigh meets the body. Return legs to pan, and roast about 10 minutes longer, until juices run clear. Allow chicken to rest 10 minutes, then remove herbs from cavity. Remove skin. Cut off each breast in one piece, and slice 1/4 inch thick on a diagonal. To serve legs, remove skin, remove meat from bone and cut into bite-size pieces."}]}