{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken in a Watermelon", "description": "“Consider the madness of roasting a hen inside a hollowed-out watermelon with soy sauce and a lemon,” Rozanne Gold wrote in 1994, when she brought this recipe to The Times, part of a roundup of April Fools’ Day recipes. It’s an unconventional recipe, with roots in Hawaii and meant to surprise. (Step 5 encourages cooks to show the full chicken and watermelon to guests before carving.) Do, as one commenter suggests, and have someone on hand to record the reactions. And what to do with the leftover watermelon pulp? Take Gold’s advice. “With some sugar, champagne and a little imagination, it makes a decent sorbet.”", "author": {"@type": "Person", "name": "Rozanne Gold"}, "image": null, "totalTime": "PT5H", "recipeYield": "8 servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "appetizer, chicken, soy sauce, watermelon, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "recipeIngredient": ["1 very large watermelon", "1 roaster chicken, about 5 to 6 pounds", "Salt and freshly ground pepper to taste", "1 lemon", "1/2 cup soy sauce", "1 teaspoon five-spice powder", "2 tablespoons chilled butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut a 1/4-inch-thick horizontal slice off bottom of watermelon, so it won't roll. Discard. Cut off the top third of the melon horizontally, then scoop out seeds and enough of the pulp from both remaining parts to make room for the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season cavity of chicken with salt and pepper. Insert lemon pricked with fork, along with 1 tablespoon of the soy sauce. Brush outside of chicken with remaining soy sauce, and sprinkle with five-spice powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken in the larger part of the melon, and position the other piece of melon on top, securing with long skewers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees, and bake 2 hours. Then, reduce heat to 300 degrees and bake 2 1/2 hours longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place watermelon on a tray and show it to guests. Return it to kitchen: remove chicken and carve. With a ladle, remove juices from watermelon and reduce in skillet until thickened; whisk in cold butter and spoon over chicken before serving"}]}