{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Butternut Squash With Scallions", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "butternut squash, garlic, ginger, fall, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 254, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "359 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large butternut squash, about 3 1/2 pounds", "5 1/2 tablespoons canola oil", "12 scallions, approximately, minced (1 1/2 cups)", "3 to 4 cloves garlic, peeled, crushed and finely chopped (1 tablespoon)", "1 tablespoon chopped ginger", "3/4 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "3 small slices bread, chopped in a food processor to make 1 1/2 cups fresh bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Split the squash in half lengthwise and remove the seeds. Score the flesh of the squash, making 1/2-inch deep cuts through it one way and then the other in a checkerboard pattern. Arrange the squash halves cut side up on a cookie sheet and place them in the oven for about 60 minutes, until the flesh is tender when pierced with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 4 tablespoons of the canola oil in a large skillet. When the oil is hot, add the scallions and saute for 1 1/2 minutes. Mix in the garlic and ginger, and set the pan aside off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the squash is cool enough to handle, gently scoop the flesh from the shells (reserving the shells) and add it to the scallions along with the salt and pepper. Mix well, stirring until the squash flesh and scallions are well combined, but the mixture is still chunky. Refill the reserved shells with the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep oven heated to 400 degrees. In a small bowl, lightly mix the bread crumbs with the remaining 1 1/2 tablespoons of oil and sprinkle the mixture over the stuffed squash. Arrange the squash halves on a cookie sheet and place them in the oven for about 20 minutes (a little longer if the stuffing is cool). The crumb mixture on top should be nicely browned; if it is not, place the squash under a hot broiler for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each of the squash halves into three pieces and serve one piece per person."}]}