{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked-Fish Risotto", "description": "", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": null, "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "fall, main course, rice, smoked cod, vegetable stock", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 455, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "24 grams", "saturatedFatContent": "5 grams", "sodiumContent": "568 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 ounces smoked cod (sable) or smoked haddock (finnan haddie)", "Freshly ground black pepper", "1 bay leaf", "Sprig of parsley", "2 cups high-quality vegetable stock, or as needed", "2 tablespoons plus 1 teaspoon butter", "1/2 teaspoon vegetable oil", "1 cup finely sliced leeks (white and light green parts only), well rinsed", "1 1/2 cups Arborio rice", "1/4 teaspoon ground mace", "1/4 teaspoon ground cumin", "1/4 teaspoon ground coriander", "1/4 teaspoon turmeric", "Finely grated zest of 1 lemon", "1/3 cup white wine", "1 teaspoon lemon juice", "2 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut fish into two or more pieces to fit into a skillet. Season with black pepper to taste, then add bay leaf, sprig of parsley and 2 cups water. Place pan over high heat, cover, and bring to a boil. Reduce heat to medium-low, and simmer until fish is heated through but not falling apart, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove fish with a slotted spatula, wrap in foil, and set aside. Strain cooking liquid into a 1-quart measuring pitcher, and add enough vegetable stock to make a total of 1 quart liquid. Transfer to a saucepan and place over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, wide saucepan, heat 2 tablespoons butter and the oil. Add leeks, and saut&#233; over low heat until softened, about 5 minutes. Add rice to pan, and stir until glossy, then add mace, cumin, coriander, turmeric and lemon zest. Raise heat to medium, and add wine, stirring until it is absorbed. Add a ladleful of vegetable stock mixture, stirring until it is absorbed. Add an additional ladleful of stock, stirring until it too is completely absorbed. Continue, ladleful by ladleful, until rice is cooked al dente, about 20 minutes. (Amount of liquid needed may vary and all the liquid may not be needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flake fish and add to rice along with remaining 1 teaspoon butter and the lemon juice. Remove from heat and mix well with a wooden spoon until mixture is creamy and well-blended. To serve, spoon risotto onto a large flat plate and sprinkle with chopped parsley. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8176-smoked-fish-risotto"}