{"@context": "http://schema.org", "@type": "Recipe", "name": "Lattice-Top Strawberry Pie", "description": "Here is a classic American strawberry pie. The filling is super simple – just strawberries, sugar, a bit of flour and butter – and the crosshatched crust is spectacular. If the thought of weaving together a lattice-top makes you quiver, check out <a href=\"http://cooking.nytimes.com/guides/3-how-to-make-a-pie-crust\">our pie guide</a> for a how-to video, or use a round biscuit cutter to cut out circles and lay them on top, like Melissa Clark did on this <a href=\"http://cooking.nytimes.com/recipes/1013181-twice-baked-sour-cherry-pie\">sour cherry pie</a>.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2016/06/02/dining/strawberry-pie/strawberry-pie-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "butter, flour, strawberry, dessert, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 89}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 493, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "11 grams", "sodiumContent": "520 milligrams", "sugarContent": "28 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["2 1/2 cups all-purpose flour, plus some for dusting the board", "2 teaspoons plus 1 tablespoon sugar", "2 teaspoons kosher salt", "1/2 cup cold unsalted butter, cut in small pieces", "6 tablespoons cold vegetable shortening", "About 6 tablespoons ice water, more as needed", "1 egg, lightly beaten", "2 1/2 pounds fresh strawberries, hulled and halved to make 6 cups", "3/4 cup sugar", "1 tablespoon fresh, strained lemon juice", "1/4 cup cornstarch", "Pinch salt", "1 tablespoon cold unsalted butter, cut into small pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, combine the flour, 2 teaspoons of the sugar and the salt in a large bowl. Add the butter and shortening and rub into the dry ingredients until the mixture resembles coarse meal. Gradually and gently stir in just enough water to make it come together. Divide the dough in halve and gently press each half into a ball. Wrap both in plastic, flatten into disks, and refrigerate until cold, at least 30 minutes and up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, preheat the oven to 425 degrees. In a large bowl, toss together the strawberries, sugar, cornstarch, lemon juice, and salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out one dough round to fit a 9-inch pie plate. Fit the dough in the pie plate and spoon in the filling. Scatter the butter evenly over the top. Roll out the remaining dough, cut it into 1-inch strips and weave a lattice top over the filling. Trim and crimp the edges. Brush the egg over the crust and sprinkle with the remaining tablespoon of sugar. Place on a rimmed baking sheet to catch any drips and bake for 15 minutes. Turn the oven down to 350 degrees. Continue baking until the crust is nicely browned and the filling bubbles thickly, 40-50 minutes. Place on a rack to cool completely, at least 3 hours and up to 1 day. Cut into wedges and serve."}]}