{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Pasta", "description": "", "author": {"@type": "Person", "name": "Celia Barbour"}, "image": null, "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "pastas", "keywords": "appetizer, side dish, pasta, sugar, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 527, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "8 grams", "proteinContent": "22 grams", "saturatedFatContent": "9 grams", "sodiumContent": "879 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds tomatoes (may be imperfect or overripe)", "2 tablespoons olive oil", "1 1/2 teaspoons salt", "2 teaspoons sugar", "Salt", "1 pound pasta like farfalle, penne or fusilli", "4 to 6 cloves garlic, finely minced and mashed", "2 tablespoons melted butter", "2 tablespoons extra virgin olive oil", "2 ears corn, raw if very fresh, or lightly steamed", "2 pints cherry or grape tomatoes (preferably low-acid orange or yellow), halved or quartered", "12 ounces fresh mozzarella or Valley Shepherd Jersey Fresh Mixte, diced (see note)", "1/4 cup grated Parmigiano-Reggiano", "1 cup mixed herbs, torn into small pieces (mostly basil, with a little purple basil, orange mint, summer savory and parsley)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the roasted tomatoes:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 275 degrees. Line a large baking sheet with parchment paper. Cut tomatoes into slices about 3/4 inch thick, reserving ends for another use. Lay slices on baking sheet, and brush with olive oil. Sprinkle with salt and sugar. Bake 15 minutes, and reduce heat to 200 degrees. Continue baking, turning halfway through, until tomatoes are shrunken and chewy but not crisp, 4 to 6 hours. (They may be started in the evening and finished the next morning. After partial baking, turn off oven, leaving door closed. In the morning, if tomatoes are not done, reheat oven and continue roasting.)"}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For assembly:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of lightly salted water to a boil. Add pasta, and cook until al dente. Meanwhile, chop roasted tomatoes very finely until they are almost a paste. Place in a large serving bowl, and add garlic, butter and olive oil. When pasta is cooked drain well, and add to the bowl while still hot. Toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stand ears of corn on end, and slice kernels from cobs. Add corn, cherry or grape tomatoes, mozzarella and Parmigiano-Reggiano to pasta-tomato mixture. Toss well. Add herbs, and toss again. Serve warm or at room temperature."}]}]}