{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Pork for Tacos", "description": "To make tacos for a crowd, you can’t do better than to begin with slow-roasted pork, scented with cumin and coriander, garlic and red pepper. Use shoulder or butt meat and you won’t go wrong, as the high fat content makes the meat self-basting. Slow, indirect grilling is ideal, but you don’t lose much by cooking the pork in the oven, using moderate heat. Shred and serve on warm tortillas.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "boneless pork shoulder, garlic, spices, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 119}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 279, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "0 grams", "proteinContent": "20 grams", "saturatedFatContent": "7 grams", "sodiumContent": "292 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["10 cloves garlic, peeled", "2 pounds pork shoulder, preferably boneless and in one piece", "1/2 teaspoon peppercorns", "1 teaspoon fresh oregano (or use dried Mexican oregano)", "1 teaspoon cumin seeds", "1 inch cinnamon stick", "1 teaspoon coriander seed", "1 teaspoon salt", "2 tablespoons fresh orange juice", "2 tablespoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sliver 4 cloves of the garlic and use a thin-bladed knife to poke holes all over the pork; insert garlic slivers in holes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the peppercorns, oregano, cumin, cinnamon and coriander in a small skillet and turn the heat to medium. Toast, shaking the pan occasionally, until the mixture is fragrant, 3 to 5 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the toasted spices, salt and remaining garlic in the container of a small food processor or blender. Turn on the machine and gradually add the orange and lemon juice until you have a smooth purée. Rub all over the pork; let the pork sit at room temperature for up to 2 hours or in the refrigerator for up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 2 hours before you plan to eat, turn the oven to 300 degrees or prepare a charcoal or gas grill to cook over low indirect heat. Put the pork in a roasting pan in the oven or directly on the grill rack; if you're grilling, cover the grill. Cook, checking occasionally and basting with the pan juices if you're roasting (add water to bottom of pan if mixture dries out), until pork is brown and very, very tender, at least 2 hours. Shred or slice pork and use hot or at room temperature (pork can be refrigerated for up to 2 days)."}], "link": "https://cooking.nytimes.com/recipes/8218-slow-roasted-pork-for-tacos"}