{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Smoked Outdoors", "description": "There are countless advantages to smoke-roasting (also known barbecuing) your turkey, as in this recipe from the barbecue expert Steven Raichlen. Smoking produces a bird of incomparable succulence, especially when combined with another traditional American barbecue technique, brining. There is the rich, evocative flavor of wood smoke, and the burnished mahogany sheen it gives the bird. Then there's the simplicity of the method: once you put the bird in the smoker or on the grill, you pretty much leave it there until it is done, while the kitchen and oven are freed up for side dishes and desserts. Last but certainly not least, you get an excuse to spend a fall afternoon outdoors, maybe with beer in hand.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2014/06/03/dining/Turkey-Smoked-Outdoors/Turkey-Smoked-Outdoors-articleLarge-v3.jpg", "totalTime": "PT3H", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "fall, main course, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 439, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": null, "proteinContent": "64 grams", "saturatedFatContent": "6 grams", "sodiumContent": "331 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 10- to 12-pound turkey, brined <a href=\"http://cooking.nytimes.com/recipes/8244-brined-turkey\">(see recipe)</a>", "2 tablespoons melted unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up an outdoor grill for indirect grilling, placing a large foil drip pan in center. (If using a smoker, light and set it up according to manufacturer's instructions and heat to 275 degrees. In a smoker, you will need to cook bird longer, 3 1/2 to 4 1/2 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain bird. Blot dry inside and out and truss if desired. Place in center of grill grate, over drip pan and between mounds of natural lump charcoal. Toss 1/2 cup of soaked wood chops on each mound of coals. Place lid on grill. Adjust vents to keep temperature between 325 and 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill turkey until darkly browned and cooked through, 2 1/2 to 3 hours. Baste turkey with melted butter after first hour and every hour thereafter. If skin starts to brown too much, loosely tent bird with foil. Use an instant-read thermometer to test for doneness; turkey is ready when internal temperature of the thigh is 180 degrees. Replenish charcoal every hour, adding 8 to 10 lumps of charcoal to each mound of coals and leaving grill uncovered for a few minutes to allow charcoal to light. After 1 hour, add 1 1/2 cups of soaked wood chips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer turkey to a platter, loosely tent with foil, and let rest for 10 minutes before carving. Reserve any drippings in drip pan for gravy."}]}