{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Broccoli With Toasted Garlic, Orange and Sesame", "description": "Broccoli was kicked around for years before anyone decided to have fun with it. For a while broccoli lay spent and lifeless, then went irritably crisp. This recipe advances at high speed with admirable results. I toasted garlic slivers in olive oil until sweet and nutty, added oyster sauce to round the edges, then a rustle of sesame seeds and a wisp of orange to pull the whole thing into focus.", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": "https://static01.nyt.com/images/2018/11/01/dining/20COOKING-SAUTEEDBROCCOLI-ORANGE2/20COOKING-SAUTEEDBROCCOLI-ORANGE2-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick, vegetables", "keywords": "fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 257}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 87, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "264 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 medium head broccoli", "2 teaspoons sesame seeds", "2 tablespoons olive oil", "2 1/2 tablespoons thinly sliced garlic cloves", "1/4 to 1/2 teaspoon red pepper flakes", "1/2 teaspoon salt", "1 tablespoon oyster sauce", "1/2 teaspoon finely grated orange peel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse broccoli. Cut off thick stem where it meets slender stalks, and reserve. With sharp paring knife separate stalks into florets, leaving stems about 1 1/2 inches long on each. Cut pieces in two lengthwise and lay flat-side down. Cut each piece lengthwise in two and repeat until you have 3-inch-long carved floret and stem pieces of approximately equal thickness (about 1/2-inch) top to bottom. Peel tough skin from stems, and cut crosswise into 1/4-inch medallions. There should be 12 ounces of broccoli, about 7 cups. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast sesame seeds in large nonstick skillet over low heat until golden, about 5 minutes. Transfer to small bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place olive oil and garlic in skillet over low heat. Toast garlic, stirring frequently, until garlic is deep golden brown, about 6 minutes. Add pepper flakes to hot oil, and stir. Transfer to small bowl, and set aside. Toss broccoli, salt and 1/4 cup water in same skillet, cover and set over high heat. Cook until broccoli is tender, shaking pan and stirring once, 4 minutes. Uncover skillet (water should be gone), and toss. Stir in garlic and oil, oyster sauce and orange peel. Transfer to warm serving platter, and sprinkle with sesame seeds."}], "link": "https://cooking.nytimes.com/recipes/8253-sauteed-broccoli-with-toasted-garlic-orange-and-sesame"}