{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish With Shiitakes", "description": "This dish is the kind that, with a little experience, many good cooks could assemble from scratch, without consulting a recipe. The aromatic triumvirate of garlic, ginger and scallions is matched with soy sauce, rice vinegar and fish sauce. Shiitake mushrooms give substance and flavor, cornstarch thickens and sesame oil adds a whiff of toasty richness.\n\nThough I spooned the sauce over simply poached fish, it would work just as well with grilled, pan-seared or broiled fish, or on stir-fried strips of chicken breast, slivers of pork or beef, shrimp or scallops. Steamed rice could help sop up the sauce, but I served boiled fingerling potatoes.\n\nPotatoes with Asian food? Don't scoff. Chinese restaurants here do not serve them, but potatoes are a major crop in China, where they are eaten with gusto, especially in the center and north. Besides, potatoes are certainly favored in the countries that produce the best pilsners, the beverage to drink while eating this.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/05/27/dining/Fish-with-Shiitakes/Fish-with-Shiitakes-articleLarge-v3.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "chicken stock, sea bass, shiitake, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 422}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "24 grams", "saturatedFatContent": "3 grams", "sodiumContent": "964 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups chicken stock", "1 1/3 pounds sea bass or gray sole fillets", "2 tablespoons peanut oil", "2 cloves garlic, minced", "1 tablespoon minced ginger", "1/2 cup chopped scallions", "7 ounces shiitake mushrooms, stemmed and sliced", "1 tablespoon soy sauce", "1 tablespoon rice vinegar", "1 teaspoon Vietnamese fish sauce", "1 tablespoon cornstarch", "2 teaspoons sesame oil", "1 tablespoon chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 175 degrees. Place chicken stock in a wok or skillet, and bring to a simmer. Cut fish into pieces about 3 inches square, place in stock, and simmer until just cooked, about 5 minutes. Use spatula to transfer to heatproof platter, cover loosely with foil, and place in oven. Drain and strain stock, and reserve. Wipe out pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat peanut oil in pan. Add garlic, ginger and scallions. Sauté briefly, and add mushrooms. Sauté until wilted. Add soy sauce, vinegar and fish sauce. Cook 30 seconds, then add reserved stock. Bring to a simmer. Dissolve cornstarch in 2 tablespoons cold water, and add, stirring. Simmer until sauce has thickened. Add sesame oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer fish to serving dish, spoon mushroom sauce over, scatter with cilantro, and serve."}]}