{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork and Mushroom Stir-Fry", "description": "I have always had an aversion to the stir-fry. For me it has seemed a technique that sounds easier than it is. Everyone is always impressed that a stir-fried dish takes so little time to cook, but I saw endless chopping followed by frenzied last-minute activity at the stove that I felt unsuited for. I am a clumsy person, and there simply isn't a wok large enough for me to do a stir-fry and not end up with half the ingredients over all the burners. The recipe that won me over was this pork and mushroom dish. Marinating the pork keeps it wonderfully tender and makes the dish deeply flavorsome. And slicing mushrooms is never an effortful activity. Many Chinese cooks add a cornstarch paste at the end of cooking to create a binding sauce, but I love this one starch-free and light. You get depth but sprightliness.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/porkstirfry-still/porkstirfry-still-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 85}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "29 grams", "saturatedFatContent": "2 grams", "sodiumContent": "707 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound pork tenderloin", "1/4 cup oyster sauce", "2 tablespoons plus 1/4 cup dry sherry or Chinese cooking wine", "2 teaspoons sesame oil", "1 clove garlic, minced", "1/8 teaspoon hot red pepper flakes", "1 1/2 teaspoons corn or canola oil", "4 scallions, trimmed, halved lengthwise and cut into 2-inch pieces", "1 cup baby corn, each cob halved crosswise", "1 1/2 cups sugar snap peas", "2 cups sliced bok choy", "1 cup sliced oyster mushrooms", "1 cup sliced shiitake mushrooms", "3 cups bean sprouts", "2 tablespoons finely chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice pork into strips about 2 inches long, 1 inch wide and 1/4 inch thick. Place in a bowl or sealable plastic bag, and add oyster sauce, 2 tablespoons sherry, sesame oil, garlic and red pepper flakes. Stir to coat well. Cover or seal, and allow to marinate at room temperature for 3 hours, or in refrigerator up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large wok or skillet over high heat, and add oil. Allow pan to heat for 1 to 2 minutes, then add pork and marinade. Toss meat until seared and no longer pink. Add scallions, corn and sugar snaps. Stir until sugar snaps turn bright green, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bok choy and mushrooms, and stir constantly for about 1 minute. Add bean sprouts and remaining 1/4 cup sherry. Continue to stir until wine is almost evaporated. Transfer to a large platter, sprinkle with cilantro, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8256-pork-and-mushroom-stir-fry"}