{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Souffle Cake", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "chocolate, eggs, espresso, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 693, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "27 grams", "sodiumContent": "107 milligrams", "sugarContent": "43 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons soft unsalted butter, plus butter for greasing pan", "1 pound 1 ounce good-quality semisweet chocolate", "5 1/2 tablespoons instant espresso powder", "1/3 cup plus 2 tablespoons boiling water", "8 extra-large eggs, separated and at room temperature", "2/3 cup plus 1 tablespoon sugar", "Pinch of salt", "3 cups heavy cream", "1 cup sifted confectioners' sugar", "1/4 cup cocoa (approximately)", "1 tablespoon walnut or hazelnut oil", "2 cups sliced almonds, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Butter a heavy-duty jellyroll pan 10 by 15 inches. Line the bottom of the pan with wax paper, allowing it to extend about two inches past the ends. Butter the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 9 ounces of the chocolate with 1 1/2 tablespoons of the espresso powder and 1/3 cup plus 1 tablespoon of the boiling water in the top of a double boiler. Stir until smooth and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg yolks until very thick and light. Gradually beat in the sugar. Stir in the cooled chocolate mixture and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites with a pinch of salt, by hand in a copper bowl if possible, until they form peaks but are still of a creamy consistency. Do not overbeat. Stir one-quarter of this mixture into the chocolate mixture, then fold in the rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the batter in the prepared pan. Bake about 20 minutes, until puffy and beginning to shrink from the sides of the pan. The surface will also have lost its sheen and will spring back when touched lightly. Remove the cake from the oven and allow to cool on a rack for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, dissolve the remaining 4 tablespoons espresso in the remaining tablespoon of boiling water. Stir until syrupy, then refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the cream in a chilled bowl until thick, like sour cream, but not yet stiff. Sift in the confectioner's sugar, beating, then the cooled espresso. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place remaining chocolate in the top of a double boiler. Stir when melted. Remove from heat and stir in the butter. Add the oil, stir; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the cake dust the top with half of the cocoa. Gently warm the bottom of the jellyroll pan by holding it over a low burner, moving it around. Cover the pan with a large flat baking sheet, invert the pan and the baking sheet together. Hold down the wax paper and lift off the jellyroll pan. Carefully peel off the wax paper. Dust the cake very lightly with the remaining cocoa."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cake in four equal portions crosswise. Using two broad spatulas, lift one of the portions onto a serving dish. Gently spread with some of the chilled espresso cream. Top with another portion of the cake, spread with more of the cream, add another cake layer, more cream, then the final cake layer. If any of the cake sections crack slightly while being transferred, don't worry. Icing will cover the flaws. Remove any excess cream from the sides of the cake with a spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate the cake for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mask the exposed parts of the platter with pieces of foil or wax paper, slipping them just under the edges of the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the glaze has set, warm it gently until it is fairly liquid. Pour about three-quarters of the glaze over the top of the cake, allowing it to drip down the sides. Smooth the top and cover the sides with the remaining glaze. Pat the toasted almonds all over the sides of the cake. Remove the protective paper or foil from the platter. Refrigerate at least one hour before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cake with a thin knife warmed in hot water and wiped dry."}]}