{"@context": "http://schema.org", "@type": "Recipe", "name": "Shellfish Stew Over Rice Noodles", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "fall, lobster, mixed vegetables, rice noodles, main course", "aggregateRating": null, "recipeIngredient": ["4 1 1/4-pound lobsters", "2 tablespoons, plus 1 teaspoon, peanut oil", "2 carrots, peeled and cut into 1/4-inch-thick slices", "3 ribs celery, cut into 1/4-inch-thick slices", "6 cloves garlic, peeled and coarsely chopped", "1/2 medium onion, peeled and coarsely chopped", "14 kaffir lime leaves", "2 stalks lemon grass, smashed and cut into 3-inch lengths", "1 5-inch piece ginger, unpeeled, coarsely chopped", "1 1/2 tablespoons tomato paste", "2 cups white wine", "6 ounces rice vermicelli", "1 cup julienned carrots", "1 cup julienned snow peas", "1 tablespoon unsalted butter", "6 large shallots, peeled, halved and thinly sliced", "4 cloves garlic, peeled and chopped", "2 Thai chilies or jalapenos, smashed", "5 kaffir lime leaves", "1 1/2 teaspoons Sichuan peppercorns", "1 1/2-inch piece ginger, unpeeled, coarsely chopped", "1 stalk lemon grass, smashed and cut into 3-inch lengths", "1 tablespoon hot chili paste", "1/2 cup white wine", "2 teaspoons peanut oil", "1 cup thinly sliced onion", "12 small mussels, scrubbed, beards pulled off", "12 littleneck clams, scrubbed", "12 sea scallops", "16 medium shrimp, peeled and deveined", "1 tablespoon nam pla (Thai fish sauce)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the stock, place enough water in a large lobster pot to make a depth of 1 inch. Bring to a boil over high heat. Add the lobsters, cover and steam for 5 minutes. Remove the lobsters. When cool enough to handle, twist off the tails and claws. Crack the claws and coarsely chop the heads. Split the tails in half lengthwise and refrigerate. Measure the steaming liquid and add enough additional water to make 10 cups. Place in the pot and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of peanut oil in a large, deep, heavy skillet over medium-high heat. Add half the heads and claws and sear, turning often, 10 to 15 minutes. Place in the pot with the water. Sear remaining heads and tails, adding another tablespoon of oil. Add these to the pot and place the remaining oil and the next 7 stock ingredients in the skillet. Lower heat to medium and cook for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste and cook for 2 minutes. Add the wine and stir, scraping the bottom. Add this mixture to the pot and bring to a boil. Reduce the heat and simmer for 40 minutes, skimming the foam. Strain, place in a saucepan and simmer until reduced to 7 1/2 cups, about 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the stew, place the vermicelli in a large bowl, cover with cold water and let stand for 1 hour. Bring a large pot of water to a boil. Add carrots and blanch for 30 seconds. Add snow peas and blanch for 10 seconds more. Drain and rinse under cold running water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a large skillet over medium-high heat. Add the shallots and cook until browned, about 5 minutes. Add the garlic, chilies, lime leaves, peppercorns, ginger and lemon grass. Lower heat and cook, stirring often, for 5 minutes. Stir in the chili paste and wine and cook for 2 minutes. Stir in the stock, bring to a boil, reduce heat and simmer for 15 minutes. Strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the peanut oil in a medium-size skillet until very hot. Add onion and cook until edges begin to brown, about 1 minute. Add carrots and snow peas and cook until heated through. Set aside; keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the stock in a clean lobster pot and bring to a boil. Add the mussels and clams, cover and cook until most are open, about 3 minutes. Lower the heat to a slow simmer. Lay the lobster tails, scallops and shrimp on top, cover and cook until just cooked through, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of water to a boil. Drain the vermicelli and place in the pot for 5 seconds. Drain and divide among 4 very large bowls. Add the nam pla to the stew, divide the shellfish among the bowls and ladle each with broth. Place the vegetables over top and serve."}]}