{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Yuba 'Omelet'", "description": "", "author": {"@type": "Person", "name": "Daniel Patterson"}, "image": null, "totalTime": "PT30M", "recipeYield": "Makes finger food for 6 to 8", "recipeCuisine": "asian", "recipeCategory": "breakfast", "keywords": "main course, soy sauce, sriracha, yuba, summer", "aggregateRating": null, "recipeIngredient": ["1/4 cup soy sauce", "2 tablespoons mirin", "1 tablespoon sugar", "3 sheets yuba", "Sriracha or other chili paste", "3 tablespoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, shallow baking dish or rimmed plate, combine the soy sauce, mirin, sugar and 1/4 cup water. Mix well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread one sheet of yuba on a work surface and draw a squiggle of chili paste horizontally across the middle. Fold the bottom third up over the middle third, then fold the top third down, as if folding a letter. Press the top down firmly. Set aside and repeat with another sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread out the last sheet, add chili paste and place the two folded sheets of yuba in the center, one on top of the other. Fold the bottom of the last sheet over the middle and the top over that to enclose the first two sheets. Press the package firmly, then place in the baking dish with the soy-sauce mixture. Allow to sit for 5 minutes, then turn and repeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the yuba and drain the liquid, pressing gently to expel any excess. Place between two paper towels and press out any remaining moisture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large cast-iron skillet or other wide, heavy pan over medium heat and add the vegetable oil. When the oil is hot, add the yuba (if it is too large, cut in half and cook in two pieces). Cook for about 1 minute, pressing gently with a spatula to keep the yuba in contact with the pan. Flip and cook for 1 minute, then repeat until both sides are browned and crisp. Transfer to paper towels and cut into pieces. Place on a serving plate and, if desired, dot with additional chili paste."}], "link": "https://cooking.nytimes.com/recipes/8297-spicy-yuba-omelet"}