{"@context": "http://schema.org", "@type": "Recipe", "name": "Boiled Leg of Lamb With Lemon-Caper Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "8 serving", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "capers, leg of lamb, lemon juice, main course, summer", "aggregateRating": null, "recipeIngredient": ["1 whole leg of lamb (about 8 pounds), bone in", "1 large onion, halved", "2 carrots", "1 stalk celery", "2 sprigs thyme", "3 bay leaves", "1/2 teaspoon peppercorns", "1 teaspoon kosher salt", "4 tablespoons unsalted butter", "3 tablespoons flour", "1 cup hot milk", "1 cup hot stock from lamb leg", "3 tablespoons chopped, drained capers", "2 tablespoons fresh lemon juice", "Pinch cayenne pepper", "Kosher salt and freshly ground white pepper to taste", "3 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Have the butcher cut off the end of the bone of the leg so that it will fit in a large kettle. Place the leg and cut-off bone portion in a large kettle. Add the onion, carrots, celery, thyme, bay leaves, peppercorns and salt and cover with cold water. Place over medium-high heat, bring to a boil, adjust the heat and simmer, covered, until very tender, 2 1/2 to 3 hours. Remove the lamb leg. Strain the stock, measure out 1 cup and reserve the rest for another use. Discard the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, melt the butter in a medium-size saucepan set over medium heat. Slowly stir in the flour, continuing to stir until no lumps remain. Slowly stir in the hot milk and 1 cup of hot stock. Cook, stirring constantly, until thick, about 3 to 4 minutes. Stir in the capers, lemon juice and cayenne and cook 1 more minute. Season to taste and stir in the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, carve the leg into thin slices. Reheat the sauce over low heat if necessary and serve over the lamb slices."}], "link": "https://cooking.nytimes.com/recipes/8308-boiled-leg-of-lamb-with-lemon-caper-sauce"}