{"@context": "http://schema.org", "@type": "Recipe", "name": "Colcannon", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "8 servings", "recipeCuisine": "irish", "recipeCategory": "weekday", "keywords": "kale, milk, potato, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 282, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "5 grams", "sodiumContent": "759 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 pounds baking potatoes (about 7 medium), well scrubbed", "1 bunch (about 3/4 pound) curly kale, cleaned, tough stems removed", "1 1/2 cups milk", "1/4 cup chopped scallions", "Kosher salt and freshly ground pepper to taste", "1/4 cup melted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes (skins on) in a kettle and cover them with cold, salted water. Bring to a boil, lower the heat and simmer for 20 minutes. Remove from the heat and pour out all but 1 inch of the water. Lower the heat, cover the pot and steam the potatoes until very tender, about 20 to 30 more minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring another kettle 2/3 full of salted water to a boil. Add the kale and cook for 5 minutes. Drain the kale and immediately plunge it into cold water to stop the cooking. Drain again and use your hands to wring out as much water as possible. Chop the kale and set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the potatoes are tender, drain. When cool enough to handle, peel away and discard the skins and transfer the potatoes to a large bowl. Place the milk and scallions in a saucepan and bring just to a boil. Using a potato masher, mash the potatoes while they are still warm. Stir in the hot milk. Add more milk if they are too stiff. Stir in the kale. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Transfer the potatoes to a shallow, ovenproof casserole. Make an indentation in the center of the potatoes (to hold the butter later) and place under the broiler until brown on top. Remove from the oven, pour the butter into the indentation and serve."}]}