{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Capon With Black Truffles and Chanterelle Stuffing", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "black truffle, capon, chanterelle mushrooms, main course, winter", "aggregateRating": null, "recipeIngredient": ["10 dried apricots, finely sliced", "3 tablespoons brandy", "2 tablespoons unsalted butter", "1 tablespoon olive oil", "3/4 pound chanterelles, coarsely chopped", "2 minced shallots", "1/2 cup homemade or low-salt chicken stock", "1 cup Japanese-style (panko) bread crumbs (see note)", "1 teaspoon minced thyme leaves", "Salt and freshly ground black pepper to taste", "18- to 9-pound capon or 1 very large roasting chicken", "Kosher salt and freshly ground black pepper to taste", "2 tablespoons softened unsalted butter", "1 tablespoon black truffle paste (see note) or 1 tablespoon very finely minced fresh truffle", "2 teaspoons minced shallot"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the stuffing, combine the apricots and brandy and set aside. In a large skillet set over medium heat, combine the butter and olive oil. Add the mushrooms and shallots and cook, stirring, until the mushrooms are tender and lightly browned, 7 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the apricots and brandy and cook until the brandy has evaporated. Add the stock and cook until almost dry. Remove the pan from the heat and add the bread crumbs and thyme. Season the stuffing with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the capon, preheat the oven to 475 degrees. Season the bird generously, inside and out, with salt and pepper. In a small bowl, combine the butter, truffle paste and shallot and stir until smooth. Use your fingers to gently separate the skin from the breast meat, and work your fingers under the skin at the leg. Push the butter mixture under the skin and over the leg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the bird loosely with the stuffing (do not pack it, as it expands during cooking) and truss the bird or tie the legs together securely with kitchen string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bird on a roasting pan fitted with a rack and roast for 15 minutes. Lower the temperature to 350 degrees and continue to roast until the juices of the bird run clear when it is pierced at the thickest part of the leg, about 1 1/2 to 2 hours more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bird from the oven and allow to rest at room temperature for 15 minutes. Remove the string, and then remove the stuffing. Carve and serve the capon with the stuffing on the side."}]}