{"@context": "http://schema.org", "@type": "Recipe", "name": "Sicilian Salt Cod Stew", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT1H21M", "recipeYield": "4 servings (about 5 1/2 cups)", "recipeCuisine": "italian", "recipeCategory": "dinner, soups and stews", "keywords": "cod, garlic, potato, fall, main course", "aggregateRating": null, "recipeIngredient": ["1 pound salt cod or stockfish", "2 (8 ounce) baking potatoes, scrubbed", "12 cups cold water", "1/4 cup olive oil", "5 cloves garlic, smashed, peeled and minced", "1 (28 ounce) can Italian plum tomatoes, coarsely chopped with their juice", "3/4 cup oil-cured black olives, pitted and roughly chopped", "1/2 cup white wine", "1 bay leaf", "1 sprig fresh thyme or 1/8 teaspoon dried", "Pinch sugar", "Freshly ground black pepper to taste", "1/3 cup golden raisins", "2 tablespoons pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse salt cod in a sieve under cold running water for 3 minutes. Place the cod in a 2 1/2-quart souffle dish with a tight-fitting lid. Add 4 cups water. Cover with lid and cook in a 650- to 700-watt oven at 100 for 7 minutes. Remove from oven, uncover and rinse the dish in a sieve under cold running water for 3 minutes. Return the fish to the souffle dish and repeat the cooking and rinsing two more times, for a total of three times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prick each potato several times with the point of a knife. Put a double sheet of paper toweling suitable for microwave use on the bottom of the oven. Place potatoes on paper at opposite ends. Cook at 100 percent power in a 650- to 700-watt microwave oven for 11 minutes. Remove from oven; let cool and peel as remaining cooking is done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine oil and garlic in a 2 1/2-quart souffle dish. Cook, uncovered, at 100 percent power for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and stir in tomatoes, olives, white wine, bay leaf, thyme, sugar and pepper. Place pieces of reserved fish in the mixture so that they are covered by the sauce. Cover with lid and cook at 100 percent power for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and uncover. Add raisins and pine nuts so that they are just under the surface but do not stir them in. Re-cover with lid and cook at 100 percent power for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and uncover. Gently stir together. Slice potatoes across, 1/4-inch thick. Divide potatoes among four large wide bowls. Spoon fish stew over potatoes and serve."}]}