{"@context": "http://schema.org", "@type": "Recipe", "name": "Linguine With Walnuts And Anchovies", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT20M", "recipeYield": "2 or 3 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, pastas", "keywords": "anchovy, linguine, walnut, main course, spring", "aggregateRating": null, "recipeIngredient": ["Salt", "1/2 pound linguine", "3 tablespoons extra virgin olive oil", "3 large cloves garlic, lightly smashed and peeled", "1/2 cup shelled walnuts, coarsely chopped (pieces of about 1/4 inch or a little less)", "Red pepper flakes to taste", "4 whole salted anchovies, rinsed and filleted, or 8 oil-packed anchovy fillets, rinsed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to the boil. Start the sauce in the next step, and start cooking the linguine when the water boils."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic and oil in a deep 10-inch skillet over medium-low heat. Cook the garlic, pressing it into the oil occasionally to release its flavor. When it is just beginning to color on one side, add the nuts and the pepper flakes. Remove the garlic when it colors on the other side; cook the sauce another minute or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the anchovies, and increase the heat to medium, mashing them into the oil as they cook. As soon as they dissolve, almost immediately, add 1/2 cup of the pasta's cooking water to the pan. Remove the sauce from the heat until the pasta is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta is still a little undercooked -- about 2 minutes less time than usual -- drain it, then turn it into the pan with the sauce. Cook the linguine in the sauce, stirring and tossing constantly, until all the liquid has been absorbed and the linguine are tender. Serve immediately."}]}