{"@context": "http://schema.org", "@type": "Recipe", "name": "Forest Fettuccine", "description": "", "author": {"@type": "Person", "name": "Jennifer Lang"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Four main-course servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas, project", "keywords": "chicken stock, fettuccine, pheasant, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 880, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "1 gram", "proteinContent": "58 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1035 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups small fresh morels or 1 ounce dried", "3 1/2 tablespoons unsalted butter", "2 tablespoons chopped shallots", "1 cup chicken stock (see note)", "1 cup heavy cream (see note)", "Salt, freshly ground pepper and freshly ground nutmeg to taste", "4 boneless pheasant breasts, about 6 ounces each, or 4 small boneless chicken breasts, about 6 ounces chicken breasts, about 6 ounces", "1 pound fresh fettuccine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the dried morels, put the mushrooms into a small saucepan with two cups of water and bring to a boil. Turn off heat and let mushrooms steep in the hot water for one hour. Drain the mushrooms, reserving the soaking liquid, and rinse them under running water to remove all residual sand and dirt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the stems from the mushrooms, and reserve for another recipe that calls for chopped mushrooms. To make the cream sauce, melt one and a half tablespoons of the butter over medium heat in a skillet and add the mushrooms and shallots. Stir and saute until the mushrooms are limp and most of the juices are evaporated, about four minutes. Add the stock and heavy cream (and reserved mushroom-soaking liquid, if using dried morels) and simmer, stirring occasionally, until the liquid is reduced by one-third. Season with salt, pepper and nutmeg and set aside. (The sauce can rest at room temperature for an hour or two and be reheated over low heat just before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 30 minutes before serving, sprinkle the pheasant or chicken breasts with salt and pepper and allow to rest at room temperature for 20 minutes. When ready to cook, heat the remaining two tablespoons of butter over medium-high heat in a heavy skillet large enough to hold all of the poultry. Add the breasts and cook until light brown on both sides and cooked through, about eight minutes. Remove breasts to a warm place until ready to assemble the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, boil the pasta in a large pot of salted water for 45 to 60 seconds, or just until cooked. Drain and toss with the warm morel-cream sauce and divide among four warm dinner plates. Cut each pheasant or chicken breast into six diagonal slices and fan out over a serving of pasta. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8363-forest-fettuccine"}