{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Herb Soup With Bread Salad and Chicken", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "project, soups and stews", "keywords": "appetizer, side dish, chicken breast, chicken broth, herbs, summer", "aggregateRating": null, "recipeIngredient": ["2 cups fresh peas", "2 heads lettuce", "1 clove garlic", "1 white onion", "1 cup chicken broth", "6 cups milk or light cream", "1 teaspoon of salt", "1/2 teaspoon black pepper", "1 loaf crusty, peasant-style bread", "1/4 cup fresh lemon juice", "2 teaspoons salt, plus more to taste", "1/2 teaspoon freshly ground pepper, plus more to taste", "1/2 cup olive oil", "2 tablespoons fresh tarragon, coarsely chopped", "2 scallions, minced", "3 tablespoons minced flat-leaf parsley", "1 teaspoon lemon zest", "2 cups white wine", "2 cloves garlic", "1 onion, coarsely chopped", "1 chili pepper, sliced in half", "3 black peppercorns", "3 chicken breasts, on the bone, split in the middle"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the soup, combine the peas, the lettuce, the garlic, the onion and the chicken broth in a large pot and bring to a boil. Cover and simmer until the peas are tender, about 15 minutes. Remove from heat and pass through a food mill. Whisk in the milk or cream to desired consistency, season and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salad, cut the bread loaf in half and cover with cold water. Soak for 30 minutes. Drain and wring with a dish towel. Combine the lemon, salt and black pepper in a large bowl. Slowly whisk in the oil. Add the tarragon, scallions, parsley and lemon zest and stir. Add the bread and stir well. Chill, stirring frequently to completely incorporate. After the salad is cold, adjust the seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the chicken, place all the ingredients in a shallow pan and bring to a boil. Reduce heat to medium, cover and steam for 20 minutes. Remove from heat and keep covered until chicken reaches room temperature. Strain and reserve liquid for another use. Slice the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle the soup into 6 bowls, garnish with the salad and fan the chicken slices around it."}]}