{"@context": "http://schema.org", "@type": "Recipe", "name": "Tiny-Dice Caponata on Parmesan Croutons", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT20M", "recipeYield": "6 appetizer servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "appetizer, bread, japanese eggplant, parmesan, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "409 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["7 tablespoons olive oil", "1 Japanese eggplant, cut into tiny dice", "Kosher salt and freshly ground pepper to taste", "1/2 red bell pepper, cored, seeded and cut into tiny dice", "1/2 yellow bell pepper, cored, seeded and cut into tiny dice", "1 small Spanish onion, peeled and finely chopped", "2 cloves garlic, peeled and finely chopped", "3 tablespoons raisins, soaked in hot water for 10 minutes, drained and coarsely chopped", "3 tablespoons coarsely chopped Spanish capers", "12 thin slices Italian bread, like ciabata or Pugliese", "1 tablespoon good-quality Parmesan cheese", "6 thinly sliced basil leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. In a large skillet, over high heat, heat 3 tablespoons oil. Add the eggplant and cook, stirring, until well browned and soft, about 5 minutes. Season with salt and pepper. Transfer to medium bowl. Wipe out the skillet, return to the heat and heat 1 tablespoon oil. Add the bell peppers and cook, stirring occasionally, until soft, about 3 minutes. Season with salt and pepper and transfer to the bowl. Wipe out the skillet, return to the heat and add 1 tablespoon oil. Add the onion and cook, stirring, until browned and soft, about 1 minute. Season with salt and pepper and transfer to the bowl. Wipe out the skillet, return to the heat and add 1 tablespoon oil. Add the garlic and cook, stirring frequently, until fragrant, about 45 seconds. Transfer to the bowl. Stir in the raisins and capers. Set the mixture aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the bread slices with the remaining 1 tablespoon olive oil and season with salt. Arrange the slices on a baking sheet, sprinkle with the cheese and bake until golden brown, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a dollop of the eggplant mixture on each crouton, garnish with basil and serve."}], "link": "https://cooking.nytimes.com/recipes/8385-tiny-dice-caponata-on-parmesan-croutons"}