{"@context": "http://schema.org", "@type": "Recipe", "name": "Jason's Best Crab Cakes Ever", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "10 to 12 large crab cakes", "recipeCuisine": "new england", "recipeCategory": "dinner", "keywords": "bread crumbs, crab meat, eggs, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 277, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "16 grams", "saturatedFatContent": "12 grams", "sodiumContent": "479 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 sticks unsalted butter, plus 1 to 2 tablespoons for sautéeing", "1 cup finely chopped scallions (including some green stem)", "1/2 cup finely chopped jalapeño pepper", "3/4 cup heavy cream", "2 teaspoons dry mustard", "Pinch cayenne pepper", "2 pounds jumbo lump crabmeat, drained well, patted dry, picked over for shells", "2 eggs, beaten", "2 cups fresh white-bread crumbs, spread out in a baking dish", "1 to 2 tablespoons vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 1/2 sticks butter in a large skillet over medium-high heat and sauté scallions and jalapeño about 2 minutes, until bright green. Add the heavy cream and heat to boiling. Stir over medium heat 3 to 4 minutes, until the mixture thickens. Remove from the heat and stir in the mustard and pepper. Cool 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the crabmeat in a large bowl. Gently stir in the scallion mixture. Form uniform cakes by placing spoonfuls of the crab mixture on a cookie sheet. Immediately place in refrigerator to harden, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, beat the eggs in a shallow bowl and place the bread crumbs in another shallow bowl. Melt 1 tablespoon butter and 1 to 2 tablespoons oil in a large skillet over medium heat. Working with half of the crab cakes at a time (keep remaining cakes in the refrigerator), dip each cake into the beaten eggs and coat with crumbs. Sauté until browned, 2 to 3 minutes on each side (turning cakes only once or they will break up). Drain on paper towels and serve immediately."}]}