{"@context": "http://schema.org", "@type": "Recipe", "name": "New York Maple-Walnut Cheesecake", "description": "Why doesn't maple syrup find its way to American cheese platters the way chestnut honey does to Italian ones? We think it works particularly well with subtle, creamy cheeses, a conviction that inspired our riff on a classic New York cheesecake.", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": "https://static01.nyt.com/images/2015/12/10/dining/10COOKING-MAPLEWALNUTCHZCAKE3/10COOKING-MAPLEWALNUTCHEESECAKE3-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "10 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "cream cheese, graham cracker crumbs, maple syrup, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 437}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 675, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "0 grams", "proteinContent": "11 grams", "saturatedFatContent": "27 grams", "sodiumContent": "474 milligrams", "sugarContent": "43 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup graham-cracker crumbs", "1 cup plus 6 tablespoons sugar, divided", "3 tablespoons unsalted butter, melted", "2 1/2 pounds cream cheese", "3 tablespoons flour", "1/2 cup grade A medium amber maple syrup", "4 eggs", "2 egg yolks", "1/4 cup heavy cream", "1 teaspoon cornstarch", "4 ounces walnut halves (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. In a bowl, mix the graham-cracker crumbs with 2 tablespoons of the sugar and stir with a fork to combine. Grease the sides of a 9-inch springform pan and sprinkle it with the cracker mixture, shaking any excess back into the bowl. Add the melted butter to the bowl and toss with a fork until the butter has moistened the crumb mixture. Scatter the crumbs evenly over the pan bottom and press into it using the bottom of a straight-sided glass. Bake for 10 minutes and let cool. Raise the heat in the oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With an electric mixer, beat the cream cheese until it is soft and fluffy, about 2 minutes. Mix the flour with the remaining sugar and add it and half the maple syrup to the cheese in thirds, mixing after each addition. Add the eggs and the yolks to the batter one by one, beating after each addition. Add the heavy cream and mix again. Pour the batter into the crust and bake for 15 minutes. Lower the oven to 200 degrees and bake for an hour more. Turn off the oven, leave the door halfway open and let the cheesecake cool in the oven for a half-hour. Chill in the refrigerator for 4 hours and not more than 24."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat the remaining maple syrup over low heat in a small saucepan until it bubbles and let simmer gently for 1 minute, until it has thickened slightly. Whisk in the cornstarch and turn off the flame. Add the walnuts and turn to coat. Spread them out on a piece of parchment paper to cool and harden into praline, then sprinkle over the cheesecake."}], "link": "https://cooking.nytimes.com/recipes/8413-new-york-maple-walnut-cheesecake"}