{"@context": "http://schema.org", "@type": "Recipe", "name": "Leek, Mushroom and Goat Cheese Tart", "description": "This savory tart is built upon a layer of store-bought puff pastry and topped with goat cheese, fennel, mushrooms and leeks. It makes an impressive (and easy) party appetizer or weeknight dinner for two.", "author": {"@type": "Person", "name": "Celia Barbour"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/goatcheesetart-still/goatcheesetart-still-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 335}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 283, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "7 grams", "sodiumContent": "307 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small bulb fennel", "2 medium leeks, white and light green parts only, halved lengthwise and rinsed carefully to remove any dirt from inner layers", "16 medium cremini or white mushrooms (about 1 pound)", "1 tablespoon plus 1 teaspoon olive oil", "Salt and pepper", "1 14-ounce package puff pastry (like Dufour), defrosted according to package directions", "3 eggs", "8 ounces goat cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Trim fennel of green top and root end, reserving fronds, and quarter bulb from top to bottom. Using a mandoline or very sharp knife, cut fennel and leeks into paper-thin slices. Clean and slice mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a skillet over medium heat; add fennel and leeks and sauté until just tender but not brown, about 6 minutes. Transfer to a bowl and set aside. Heat remaining teaspoon of oil in skillet over medium-high heat; add mushrooms and sauté until they release all their liquid and most of it boils away, about 5 minutes. Combine fennel mixture with mushrooms and sauté together briefly; season with salt and pepper. Remove pan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unfold puff pastry onto lightly floured surface; cut in half lengthwise to form two long rectangles. Gently roll out each rectangle to approximately 5 by 14 inches and place on cookie sheet (or cut into two circles, if desired). Trim edges by 1/4 inch strips all around; set strips aside. Break one egg into a small bowl; beat slightly. Brush edges of pastry with some egg. Use trimmed strips to make a raised border on each. (Or, fold pastry edges over to form a rim.) Brush entire surface with remaining beaten egg. Prick interior of pastry all over with a fork. Bake until pale gold, about 10 minutes. If pastry has puffed up inside edge, press it down gently. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine remaining eggs with 6 ounces goat cheese and blend until smooth. Spread onto pastry. Return to oven and bake just until set, about 4 minutes. Remove from oven and spread with mushroom-leek mixture. Crumble remaining cheese on top. Just before serving, broil tarts on low heat for 2 to 3 minutes, until tarts are warm and cheese softens. Garnish with fennel fronds."}], "link": "https://cooking.nytimes.com/recipes/8422-leek-mushroom-and-goat-cheese-tart"}