{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Tart", "description": "Hana says: This tart is not kosher for Passover, so wait until after the holiday to make it. Gitta Friedenson, an old friend, passed along the recipe. Use a glass dish so you can check how brown the bottom gets. And don't serve it too hot, because it falls apart.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "24 servings plus one hour for chilling the dough.", "recipeCuisine": "american", "recipeCategory": "", "keywords": "apple, cinnamon, walnut, dessert, side dish, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 192, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "89 milligrams", "sugarContent": "14 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 pound (2 sticks) margarine", "2 large eggs", "1/2 cup sugar", "2 cups flour, or more as needed", "1 teaspoon baking powder", "2/3 cup apricot marmalade", "1/2 cup chopped walnuts", "5 Granny Smith apples, peeled, cored and thinly sliced", "1 1/2 teaspoons cinnamon", "4 tablespoons confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare dough: In the bowl of an electric mixer, combine margarine, eggs and sugar. Mix until blended. Add flour and baking powder, and mix until smooth. Dough should be very soft but not sticky; if necessary, gradually add up to 1/2 cup flour. Cover, and refrigerate 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Divide dough in two. Lightly oil a 7-by-11-inch glass baking pan. On a lightly floured surface, roll out half the dough to fit into bottom of pan. Spread marmalade evenly over dough in pan. Sprinkle with walnuts. Toss apples with cinnamon, and spread evenly over walnuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out remaining dough to about 8 by 12 inches, so that it will blanket apples. Place dough in pan, tucking in edges. Bake until surface is golden brown and bottom is light brown, 45 minutes to 1 hour. (If surface browns too quickly, cover with foil.) Remove from oven. Through a sieve, dust 2 tablespoons confectioners' sugar over hot tart. Allow tart to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tart into 24 squares. Sprinkle with remaining sugar and serve."}]}