{"@context": "http://schema.org", "@type": "Recipe", "name": "Paupiette of Sea Bass", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project", "keywords": "barolo wine, potato, sea bass, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 832, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "5 grams", "proteinContent": "33 grams", "saturatedFatContent": "24 grams", "sodiumContent": "1510 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 bottle Barolo wine", "3 shallots, peeled and finely chopped", "1 sprig thyme", "1 tablespoon heavy cream", "2 extra-large baking potatoes, peeled", "4 tablespoons melted clarified butter", "Salt to taste", "4 5-ounce sea bass fillets", "2 leeks, washed and trimmed, white and tender green parts cut into 3-inch-long julienne strips", "Freshly ground black pepper to taste", "1/2 cup chilled unsalted butter, cut into chunks", "Pinch of sugar", "Minced chives for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine the wine, shallots and thyme and simmer, uncovered, until the wine is almost evaporated, about 45 minutes. Whisk in the heavy cream and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mandoline, cut the potatoes lengthwise into paper-thin slices. Place the slices in a large bowl, toss with 2 tablespoons of the clarified butter and season lightly with salt. Season the fish fillets with salt and shape them, tucking in thin portions as necessary, to form compact rectangles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a square of baking parchment or wax paper, overlap the narrow ends of 2 potato slices by 1 inch. Lay 2 more slices down in the same manner, overlapping the sides of the first 2 by 1/2 inch. Repeat until you have 4 rows of slices. Place each fillet lengthwise across a row of potatoes. Wrap the potato slices around the fillets, using the parchment paper to help lift the slices. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saute pan, heat 1 tablespoon of the clarified butter over medium heat. Add the leeks and cook, stirring occasionally, until they are cooked through, 8 to 10 minutes. Season the leeks with salt and pepper and set aside to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over a low flame, bring the reduced wine and cream to a simmer and whisk in the butter chunks, 1 at a time. Remove from the flame, season with salt, pepper and the sugar and strain the sauce through a fine-mesh sieve. Return the sauce to the pan and set aside to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Place a large nonstick skillet on top of the stove over high heat. Add the remaining tablespoon of clarified butter and the wrapped fish fillets, seam sides down. Saute, turning once, until the potatoes are crisp and golden brown, about 8 minutes. Check the fish for doneness, and transfer the skillet to the oven if the fish needs to cook longer. Serve the fish on a bed of leeks with the sauce spooned around. Garnish with chives."}]}