{"@context": "http://schema.org", "@type": "Recipe", "name": "Coffee Walnut Layer Cake", "description": "This is a subtle cake: the coffee tempers the sweetness, and the buttery sweetness keeps it all mellow. Even if you don't make cakes, this one is a cinch. Don't be alarmed if the two sponge layers look thin when you unmold them. They are meant to be, because the cake gains a lot of height with its frosting. This cake is all about old-fashioned, homespun charm, so don't worry about how messy it looks: however the frosting goes on is fine. If you want to fully cover the sides of the cake, make a double batch of the frosting.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2015/12/10/dining/10COOKING-COFFEEWALNUTCAKE1/10COOKING-COFFEEWALNUTCAKE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "project", "keywords": "butter, instant coffee, walnut, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 554}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 721, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "85 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "23 grams", "sodiumContent": "301 milligrams", "sugarContent": "76 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Butter for pans", "1/2 cup (60 grams) walnut pieces", "1 cup plus 2 tablespoons (245 grams) sugar", "2 sticks (8 ounces) unsalted butter at room temperature", "1 2/3 cups (230 grams) flour", "1 tablespoon (14 grams) baking powder", "1/2 teaspoon salt", "4 large eggs", "2 tablespoons milk at room temperature, more as needed", "1 tablespoon (3 grams) instant coffee dissolved in 1 tablespoon boiling water", "", "2 1/2 cups (300 grams) confectioners' sugar", "1/8 teaspoon salt", "1 1/2 sticks (6 ounces) unsalted butter at room temperature", "1 tablespoon (3 grams) instant coffee dissolved in 1 tablespoon boiling water", "1/4 cup walnut halves, for decoration"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter two 8-inch cake pans, and line base of each with parchment paper. In food processor, combine 1/2 cup walnut pieces and sugar. Process to a fine powder. Add butter, flour, baking powder, salt and eggs. Process to a smooth batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons milk to coffee mixture and pour this down feed tube with motor running. Mixture should be just soft enough to drop from a spoon; if not, add more milk. Divide cake batter between two pans. Bake until risen and springy to touch, about 25 minutes. Cool on a rack for 10 minutes, then remove from pan and place on rack. Remove parchment paper. Cool completely. You may want to level them if they domed in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For frosting: Place confectioners' sugar and salt in food processor and pulse until lump-free. Add butter and process until smooth. Add coffee mixture down feed tube and pulse until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one cake upside down on a plate or cake stand. Spread with about half the frosting. Place second cake right side up on frosting, and cover top and sides in a swirly pattern. Place a walnut half in center of cake, and gently press remaining halves into top of cake, around the edge."}], "link": "https://cooking.nytimes.com/recipes/8463-coffee-walnut-layer-cake"}