{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Tart Pastry", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "1 9- to 9 1/2-inch tart shell", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "butter, flour, sugar, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "4 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["14 tablespoons unsalted butter, cut in 14 pieces", "1/3 cup confectioners' sugar", "1 large egg yolk", "1 1/2 cups plus 2 tablespoons unbleached all-purpose flour, plus flour for dusting work surface", "4 teaspoons heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the butter sit at room temperature for 10 to 15 minutes. It should be malleable but still cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the confectioners' sugar in the bowl of a standing mixer or into a medium-size mixing bowl. Using a paddle attachment for a standing mixer or a hand-held electric mixer, cream the butter and sugar at medium speed until the sugar is no longer visible. Scrape down the sides of the bowl. Add the egg yolk, and beat until well blended; then, scrape down the sides of the bowl again. Add 1 cup of the flour, and beat just until the dough looks crumbly. Add the remaining flour and the cream, and beat until the dough forms a sticky mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the dough into a disk, and wrap in plastic. Refrigerate until firm, 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust a work surface with flour. Cut the chilled dough into 1-inch pieces. Using the heel of your hand, knead the pieces back together and reform the dough into an even, flattened disk about 6 inches in diameter. Lift it off the work surface, and dust the surface with flour again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust a rolling pin with flour. Roll the dough into a 12-inch round about 1/8-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very lightly dust the surface of the dough with flour, gently fold it in half and slip the flat bottom of a 9- to 9 1/2-inch fluted straight-sided flan ring under the dough so the dough covers half of it, with plenty of overlap. Carefully place the bottom of the pan into the flan ring, allowing the excess dough to sit up against the sides. Unfold the dough, and with your thumbs on the inside and the tips of your fingers on the outside of the ring, use light pressure to fit the dough into the pan so the bottom and sides are completely covered and the dough extends about 1/2-inch above the rim of the pan. Cut the pastry so it is flush with the rim of the pan. Any tears can be pressed back together or patched with scraps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fork or a pastry docker, prick the bottom of the dough all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tart pan in the freezer for 30 minutes. Preheat oven to 375 degrees, and position a rack in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dough from the freezer, place in the oven and bake 5 minutes. Check the dough. If it seems to slip down a bit from the sides, use your fingertips and gently push it back. Rotate the pan in the oven. Check again after another 5 minutes. If the dough bulges up in the center, prick it in one or two places with a thin skewer. Rotate it again. Continue baking another 5 to 8 minutes, until the pastry is golden brown. Total baking time should be 15 to 18 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven, and allow the dough to cool completely on a rack."}], "link": "https://cooking.nytimes.com/recipes/8474-sweet-tart-pastry"}