{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Chops With Dijon Sauce", "description": "In the Burgundy region of France, home of Dijon, pork chops are traditionally served in a sauce made with mustard, cream and white wine, and there are very few pairings that are better. Richard Olney, a prominent food writer and authority on French cooking, sautéed sliced apples and chops and then baked them all together with cream and mustard dribbled on top. I prefer the method here, but you could always fry up some apples and serve them on the side. (For a dish with roots closer to Normandy than Burgundy, make the same recipe but omit the mustard, deglaze the pan with Calvados instead of wine and stir sliced sautéed Granny Smiths into the sauce itself.)", "author": {"@type": "Person", "name": "Julia Reed"}, "image": "https://static01.nyt.com/images/2017/04/14/dining/14COOKING-PORK-CHOPS-DIJON/14COOKING-PORK-CHOPS-DIJON-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, weekday", "keywords": "dijon mustard, dry white wine, pork chops, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 885}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 533, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "1 gram", "proteinContent": "43 grams", "saturatedFatContent": "15 grams", "sodiumContent": "744 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon butter", "1 tablespoon vegetable oil", "4 1 1/4-inch-thick center-cut rib or loin pork chops, bone in", "Salt and freshly ground black pepper", "1/4 cup chopped green onions or shallots", "1/2 cup dry white wine", "3/4 cup chicken or veal stock", "1/2 cup heavy cream", "1 tablespoon Dijon mustard (or more to taste)", "1 tablespoon chopped parsley (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in the oil in a large deep skillet over high heat. Season chops with salt and pepper and add them, browning well, about 2 or 3 minutes a side, reducing the heat slightly if chops brown too quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chops to a platter and pour off most of the fat. Add green onions or shallots and cook over medium-high heat until softened, about 1 minute. Add wine and bring to a boil, scraping brown bits off the bottom. Stir in the stock and return chops to the pan. Bring the sauce to a simmer, cover and cook until chops are tender, about 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chops to a warm platter; cover with foil to keep warm. Raise the heat and boil pan juices to reduce by half, about 2 minutes. Add cream and boil 2 minutes more, until sauce reduces a bit and thickens. Remove from the heat and whisk in mustard and the parsley, if using. Taste and add more mustard if desired. Immediately spoon sauce over the chops and serve."}]}