{"@context": "http://schema.org", "@type": "Recipe", "name": "Crostini of Rabbit With Mache and Green Almonds", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT11H40M", "recipeYield": "Serves 4", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, ciabatta bread, duck fat, rabbit, fall", "aggregateRating": null, "recipeIngredient": ["4 rabbit legs (2 hind and 2 fore)", "1 tablespoon plus 1 teaspoon kosher salt", "1 teaspoon freshly ground black pepper", "2 garlic cloves, thinly sliced", "2 shallots, thinly sliced", "1 bay leaf", "2 sprigs fresh thyme", "2 cups goose or duck fat (goose fat is available at www.frenchfeast.com)", "4 ounces shelled green or toasted almonds", "1 tablespoon minced shallot", "1/8 teaspoon kosher salt", "1/8 teaspoon freshly ground black pepper", "2 teaspoons red wine vinegar", "1 teaspoon sherry vinegar", "1/8 teaspoon hazelnut or walnut oil", "2 leaves spearmint or other mint, minced", "1/8 teaspoon Dijon mustard", "1 garlic clove, crushed", "3 tablespoons extra virgin olive oil", "4 slices, 1-inch thick, pain de campagne or ciabatta", "1 garlic clove", "1 pound mache, washed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "A day in advance, season the rabbit with salt and pepper and place in a sealable plastic bag. Add the garlic, shallots, bay leaf and thyme. Refrigerate for at least 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook, wipe off and discard the herbs and aromatics. Place the goose fat in a flameproof casserole just big enough to hold the rabbit in one layer. Heat fat until warm, then add the rabbit. Cover and cook over low heat, turning it halfway during cooking, until meat pulls away easily from the bone, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the rabbit, keeping the fat over low heat. Pick the meat from the bones and place in a bowl. Add the almonds to the fat and cook about 10 minutes. Reserve 4 almonds for garnish; smash the rest in a mortar into coarse pieces with a pestle. Add the almond pieces to the bowl of rabbit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the vinaigrette: in a small bowl, combine the shallot, salt, pepper and vinegars. Let macerate for 10 minutes. Add the hazelnut oil, mint, mustard and crushed garlic. Whisk in the olive oil. Add half the vinaigrette to the bowl of rabbit and almonds and toss to mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, grill bread slices (over a wood fire, if possible) until toasted. Gently rub each slice with a garlic clove and spread on the rabbit mixture. Place one slice on each of 4 plates. Garnish each crostini with a reserved almond. Toss the mâche with the remaining vinaigrette, and serve with crostini."}], "link": "https://cooking.nytimes.com/recipes/8522-crostini-of-rabbit-with-mache-and-green-almonds"}