{"@context": "http://schema.org", "@type": "Recipe", "name": "Crostata With Warm Salad of Garden Greens and Weeds", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/27/dining/Crostata/Crostata-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "appetizer, feta, garden greens, pastry dough, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "18 grams", "sodiumContent": "899 milligrams", "sugarContent": "13 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/3 cup extra virgin olive oil", "2 cloves garlic, thinly sliced", "10 cups of greens, washed and trimmed: radish tops, spinach, chard, fennel tops, wild asparagus, onion shoots, beet tops, pea leaves, sorrel, nettles, mustard greens and flowers", "Sea salt", "1/4 cup to 1/2 cup feta cheese, crumbled", "1 teaspoon Aleppo pepper", "2 cups flour", "1 teaspoon sugar", "1/2 teaspoon salt", "12 tablespoons unsalted butter, chilled and diced", "1/2 cup ice water, more as needed", "1 egg", "1 tablespoon milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat the olive oil over medium-low heat and soften garlic. Add greens in batches to pan and cook until they just start to wilt. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dough, place flour, sugar and salt in a mixer with a paddle attachment. On low speed, add the butter. Mix until the square edges of the butter begin to become round, 30 seconds. Remove the bowl from the mixer and, with your fingers, smear the butter pieces between your fingertips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the bowl to the mixer and, on low speed, drizzle in the ice water. Stop the mixer as soon as the water is incorporated. Remove the bowl again and finish incorporating the dough with your hands. Gather the dough into a ball and cover in plastic wrap. Flatten into a disc and refrigerate for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Lightly flour a sheet of parchment paper, and place the dough on it. Flour the dough lightly and cover with another piece of parchment. Roll the dough out to form a 14-inch circle. Remove the top piece of parchment. Invert the dough onto an oiled baking sheet and remove the other piece of parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the dough with aluminum foil and prick with a fork. Shape the foil into a 12 1/2-inch circle so that there is a 1 1/2-inch border of dough. Spread the pie weights on the foil. Fold the dough border over the foil border, making an edge for a round tart, pinching the dough in every 2 inches or so. Whisk together the egg and milk and brush this on the dough's edge. Blind-bake the crostata dough for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the foil with weights and spread the wilted-greens mixture on top of the crostata. Sprinkle with the feta and Aleppo pepper. Cover the entire crostata with foil and bake for 15 minutes. Remove the foil and bake for 5 more minutes, or until the pastry edges are nicely browned."}], "link": "https://cooking.nytimes.com/recipes/8525-crostata-with-warm-salad-of-garden-greens-and-weeds"}