{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat Noodles (Pezzoccheri)", "description": "Buckwheat noodles are often served cold in Japan and Korea, and are especially welcome during hot weather.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/07/16/dining/16KITCH3/16KITCH3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "1 1/2 pounds", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "bread flour, buckwheat flour, grappa, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "0 grams", "sodiumContent": "80 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups buckwheat flour plus about 1/4 for dusting noodles", "1 1/4 cups all-purpose or bread flour", "Pinch of salt", "2/3 cup tepid water, approximately (see note)", "1 tablespoon grappa (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flours and salt in a food processor or mixer with a dough hook. Process briefly to blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the machine running, slowly add enough of the water along with the grappa so that the mixture forms a very stiff dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in thirds and cover with a lightly dampened cloth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a section of the dough through the widest setting of a pasta machine three or four times, until it comes out in a smooth sheet. Each time fold the dough in thirds before reinserting it in the machine. Then run the sheet of dough through successively finer settings, again folding it in thirds each time. Do not run the dough through the very finest setting. Place the finished sheet of dough, stretched out, on a clean cloth or paper towel. Repeat this step with the remaining portions of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the sheets of dough to dry slightly. While they are still flexible, run them through the fettuccine cutter of the pasta machine or cut them into 1/2-inch-wide noodles across the width of the sheet of dough by hand. Dust finished noodles lightly with buckwheat flour to prevent them from sticking together and set them, loosely rolled, on a tray lined with paper towels or a clean cloth. Cook them while they are still soft or allow them to dry completely and store them for future use. You can speed up the drying by using a blow dryer on the cool setting."}]}