{"@context": "http://schema.org", "@type": "Recipe", "name": "Kasha in Phyllo", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "greek", "recipeCategory": "project", "keywords": "appetizer, chicken stock, kasha, phyllo, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 365, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "8 grams", "sodiumContent": "536 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil or unsalted butter", "1 cup chopped onion", "12 ounces mushrooms, chopped fine", "1 egg white", "3/4 cup medium- or coarse-grain kasha", "1 2/3 cups chicken, beef or vegetable stock", "Salt and ground black pepper", "1/2 pound phyllo", "1/3 cup melted butter (see note)", "Sour cream or plain yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil or butter in a heavy 3-quart saucepan. Add onion and cook, stirring, over medium heat until it turns golden. Add mushrooms and saute, stirring, until they give off their liquid, the liquid evaporates and the mushrooms begin to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg white until it is bubbly, then stir in the kasha. Mix well to coat the grains of kasha. Add kasha to onion and mushroom mixture and stir until the grains look separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a boil, stir it into the kasha mixture, cover the pan and cook over low heat until the kasha is tender and fluffy and the liquid is absorbed, about 12 minutes. Remove from heat and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Depending on the size of the sheets of phyllo, cut them in half or quarters to make about 48 small sheets about 6 by 8 inches. Keep unused sheets of phyllo covered with a lightly dampened cloth while you work with the individual sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a sheet of phyllo lightly with melted butter then repeat with three more sheets of phyllo. Center three heaping tablespoons of the kasha and mushroom mixture in a high mound on the sheet of phyllo and fold one side of the sheet over the top. Brush edge with butter, fold the other side over, brush with butter again and fold the ends over the top to form a plump pillow-shaped pastry turnover. Place the pastry, seam-side down, on a lightly greased baking sheet. Brush the top and sides with butter. Repeat this step until you have used all the phyllo and the filling. There should be about 12 pastries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Bake the phyllo pastries about 30 minutes, until golden brown. If they seem to be browning much faster on the bottom, invert them halfway through the baking time. The fully baked pastries can be frozen for future use and reheated in the oven or frozen unbaked and baked before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with sour cream or yogurt on the side."}]}