{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant-Mushroom 'Lasagna' for a Crowd", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "12 to 16 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles", "keywords": "eggplant, mushroom, main course, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["4 medium-large eggplants, about 5 pounds total", "6 tablespoons extra-virgin olive oil", "1 1/2 pounds fresh mushrooms, sliced", "1 cup chopped onions", "1 1/2 cups chopped sweet red pepper", "6 cloves garlic, minced", "8 cups well-drained canned Italian plum tomatoes, about 4 cans (28 ounces each)", "2 teaspoons chopped fresh oregano", "1 teaspoon chopped Italian parsley", "1 teaspoon fennel seeds", "Salt and freshly ground black pepper", "4 tablespoons unsalted butter", "4 tablespoons flour", "5 cups low-fat or skim milk", "4 cups shredded smoked mozzarella cheese", "2/3 cup dry bread crumbs", "1 cup, about 4 ounces, freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a broiler. Line a large broiler pan with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the eggplants one-half-inch thick, discarding the stems and the very bottom slices. Place as many of the slices as fit in a single layer on the broiler pan and broil until lightly browned, turning the slices once to brown both sides. Repeat until all the slices have been browned, then set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat three tablespoons of the oil in a very large, heavy nonstick skillet over high heat. If you do not have a very large skillet, one that holds about four quarts, use two skillets. Add the mushrooms and stir-fry until they have wilted. Remove them from the pan and place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one tablespoon oil to the pan or pans along with the onions, sweet pepper and garlic. Reduce heat to medium-low and cook vegetables, stirring until soft, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes to the pan, bring to a simmer and cook until fairly smooth, about 20 minutes. Add the oregano, parsley and fennel and season to taste with salt and pepper. Mix half the tomato sauce with the mushrooms and set the rest aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a medium-size saucepan. Whisk in the flour then slowly whisk in the milk. Cook over medium heat, whisking constantly, until the sauce is thickened and smooth. It will not be a very thick sauce. Season to taste with salt and pepper and remove from the heat. Mix in the shredded mozzarella."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use one-half tablespoon of oil to grease two baking dishes each about 9 by 13 inches and 2 inches deep. Spread a little of the plain tomato sauce in the bottom of each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a layer of eggplant in each dish, using a total of one-third of the eggplant. Spread with one-half of the tomato and mushroom mixture, then sprinkle with one-third of the bread crumbs. Spoon on half the mozzarella and white sauce mixture. Then repeat the layers of eggplant, mushrooms with tomato, bread crumbs and mozzarella and white sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finally, top each baking dish with a layer of eggplant and spread with a thin layer of the plain tomato sauce. Sprinkle with the remaining bread crumbs, then sprinkle on the Parmesan cheese. Drizzle with the remaining oil. Cover the baking dishes with foil. If the dishes are prepared more than two hours before serving they should be refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have the baking dishes at room temperature. Preheat the oven to 350 degrees. Place the baking dishes in the oven and bake for 15 minutes. Uncover the dishes and bake 25 to 30 minutes longer, until the ingredients bubble and the top lightly browns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, reheat the remaining tomato sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the baking dishes are removed from the oven allow them to stand for five minutes before serving. Serve a dish of the tomato sauce alongside. If you cannot fit both baking dishes in your oven at one time, either bake the second one after the first has come out of the oven or you can bake them an hour or so in advance of serving, cover them with foil when they have come out of the oven, then reheat each at 425 degrees for about 15 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/855-eggplant-mushroom-lasagna-for-a-crowd"}