{"@context": "http://schema.org", "@type": "Recipe", "name": "New Orleans Cold Drip Coffee", "description": "Unless you’re familiar with coffee concentrate, New Orleans iced coffee is a puzzling ritual. The first time I had it, I watched skeptically as a friend’s mother filled a plastic Mardi Gras cup with ice, poured in an inch of inky coffee from a mayonnaise jar, then topped it off with milk. It was as smooth as a milkshake but had a rich coffee flavor and packed a caffeinated punch. It was easily the best iced coffee I’d ever had, yet another thing that tastes better in New Orleans.", "author": {"@type": "Person", "name": "Oliver Schwaner-Albright"}, "image": "https://static01.nyt.com/images/2014/06/03/dining/IcedCoffee/IcedCoffee-articleLarge.jpg", "recipeYield": "makes 8 cups coffee concentrate", "recipeCuisine": "southern", "recipeCategory": "non-alcoholic drinks, one pot", "keywords": "dark roast coffee, milk, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 56}, "recipeIngredient": ["1 pound dark roast coffee and chicory, medium ground", "10 cups cold water", "Ice", "Milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put coffee in a nonreactive container, like a stainless-steel stockpot. Add 2 cups water, stirring gently to wet the grounds, then add remaining 8 cups water, agitating the grounds as little as possible. Cover and let steep at room temperature for 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain coffee concentrate through a medium sieve, then again through a fine-mesh sieve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make iced coffee, fill a glass with ice, add 1/4 cup coffee concentrate and 3/4 to 1 cup milk, then stir. To make café au lait, warm 3/4 to 1 cup milk in a saucepan or microwave, then pour into a mug and add 1/4 cup coffee concentrate. (Concentrate will keep in the refrigerator for up to two weeks.)"}], "link": "https://cooking.nytimes.com/recipes/8578-new-orleans-cold-drip-coffee"}