{"@context": "http://schema.org", "@type": "Recipe", "name": "Whiting Stew With White Beans, Butternut Squash and Chorizo", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H40M", "recipeYield": "10 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, project", "keywords": "butternut squash, fish bones, white beans, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 838, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "10 grams", "proteinContent": "102 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1524 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 pounds fish bones and heads, well rinsed", "1 medium yellow onion, peeled", "1/4 cup annatto seeds", "1 bay leaf", "1 pound (2 1/2 cups) small white beans, rinsed", "1/2 cup white wine", "2 cups butternut squash, diced into half-inch pieces", "1 tablespoon unsalted butter", "1 pound chorizo sausage, skin removed and diced", "3 medium yellow onions, peeled and diced", "2 pounds whiting fillets, cut into bite-size chunks", "1 pound cleaned squid, cut in half-inch rings, tentacles chopped", "Kosher salt and freshly ground black pepper to taste", "1 1/2 tablespoons chopped fresh rosemary"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large kettle, combine the fish bones and heads, the whole onion, the annatto seeds and bay leaf with 5 quarts of water. Place over medium heat and bring to a boil. Reduce heat and simmer, uncovered, for 20 minutes, skimming off any foam that accumulates on the surface. Strain the stock and discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the stock to the pan and bring to a boil. Add the beans and wine, reduce the heat and simmer, uncovered, for 60 to 90 minutes until the beans are just tender. Add the squash and simmer until tender, about 20 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet over medium-low heat, melt the butter and fry the chorizo until browned, about 10 minutes. Remove the sausage from the pan with a slotted spoon, set it aside and add the diced onions to the pan. Cook until golden, 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the squash is cooked, increase the heat to medium and stir in the cooked onions, the whiting and the squid. Season with salt and pepper and simmer 5 minutes. Place the stew in a large serving bowl and garnish with the chorizo and rosemary. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8582-whiting-stew-with-white-beans-butternut-squash-and-chorizo"}