{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Under a Brick", "description": "It isn't easy to cook chicken so that its skin is crisp and its interior juicy. Grilling, roasting and sauteing all have their problems. But there is an effective and easy method for getting it right, using two ovenproof skillets. A split chicken is placed in one of them, skin side down. The other skillet goes on top as a weight, which helps retain moisture and insures thorough browning. A couple of clean rocks or bricks can be used instead of the second skillet. (If the weight of choice doesn't seem terribly pristine, it can be wrapped in foil.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/02/01/dining/01COOKING_CHICKEN1/01COOKING_CHICKEN1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, lunch", "keywords": "chicken, garlic, rosemary, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 328}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 566, "unsaturatedFatContent": "27 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "1 gram", "proteinContent": "43 grams", "saturatedFatContent": "11 grams", "sodiumContent": "593 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 whole 3- to 4-pound chicken, trimmed of excess fat, rinsed, dried and split, backbone removed", "1 tablespoon fresh minced rosemary or 1 teaspoon dried rosemary", "Salt and freshly ground black pepper to taste", "1 tablespoon peeled and coarsely chopped garlic", "2 tablespoons extra virgin olive oil", "2 sprigs fresh rosemary, optional", "1 lemon, cut into quarters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken on a cutting board, skin side down, and using your hands, press down hard to make it as flat as possible. Mix together the rosemary leaves, salt, pepper, garlic and 1 tablespoon of the olive oil, and rub this all over the chicken. Tuck some of the mixture under the skin as well. If time permits, cover and marinate in the refrigerator for up to a day (even 20 minutes of marinating boosts the flavor)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to cook, preheat the oven to 500 degrees. Preheat an ovenproof 12-inch skillet (preferably nonstick) over medium-high heat for about 3 minutes. Press rosemary sprigs, if using, into the skin side of the chicken. Put remaining olive oil in the pan and wait about 30 seconds for it to heat up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken in the skillet, skin side down, along with any remaining pieces of rosemary and garlic; weight it with another skillet or with one or two bricks or rocks, wrapped in aluminum foil. The idea is to flatten the chicken by applying weight evenly over its surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook over medium-high to high heat for 5 minutes, then transfer to the oven. Roast for 15 minutes more. Remove from the oven and remove the weights; turn the chicken over (it will now be skin side up) and roast 10 minutes more, or until done (large chickens may take an additional 5 minutes or so). Serve hot or at room temperature, with lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/8589-chicken-under-a-brick"}