{"@context": "http://schema.org", "@type": "Recipe", "name": "Piquillo Peppers Stuffed With Brandade", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 appetizer-size servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "appetizer, cod, piquillo peppers, potato, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 709, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "9 grams", "proteinContent": "48 grams", "saturatedFatContent": "14 grams", "sodiumContent": "4093 milligrams", "sugarContent": "21 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound salt cod", "1/4 teaspoon black peppercorns", "1 bay leaf", "2 sprigs thyme", "1 head garlic", "1/2 cup cream", "6 tablespoons extra virgin olive oil", "3 cups milk", "1/2 pound Yukon gold potatoes, peeled and cut into 1-inch chunks", "Salt and freshly ground white pepper to taste", "12 piquillo peppers", "1 small red pepper, trimmed, seeded and finely sliced", "1 shallot, peeled and sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak salt cod in cold water to cover for about 12 hours, changing the water twice during this period. Divide peppercorns, bay leaf and thyme into two batches, and wrap each in cheesecloth to make sachets. Reserve one clove of garlic, then slice the head in half crosswise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour cream into a small saucepan, and add half a head of garlic. Bring to a boil, then turn heat to a minimum and infuse for 45 minutes. At the same time, pour 1/4 cup of olive oil into a small saucepan and add the other half head of garlic. Heat until garlic starts to sizzle, reduce heat to very low and infuse for 45 minutes. Strain cream and oil separately, and keep them warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the garlic and the cream have infused for 30 minutes, combine 2 cups of the milk, a herb sachet and the cod in a medium saucepan. Bring to a boil, lower heat and cook until cod flakes easily, about 15 minutes. While cod simmers, cook potatoes with remaining milk and herb sachet. Bring to a boil, and simmer for 10 to 15 minutes, until potatoes are tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain cod and potatoes, discard sachets, and transfer to a food processor. With machine running, slowly add the infused oil, followed by the cream. Pulse until smooth, then season with white pepper to taste. Use a small spoon or piping bag to stuff 8 of the peppers with this mixture. Cover with plastic wrap, and refrigerate until ready to serve. (You can prepare the dish several hours in advance up to this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut remaining piquillos into thin strips; crush and peel the reserved garlic clove. Warm 1 tablespoon of olive oil in a medium skillet over moderate heat. Add the sliced piquillos, red pepper, shallot and garlic to the pan, season with salt and pepper, and saute for 2 or 3 minutes, stirring. Add 2 tablespoons water, cover pan and lower heat. Cook for about 20 minutes, or until vegetables are completely tender. Discard garlic, transfer the mixture to a blender, and puree, then strain through a sieve and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 250 degrees. Warm 1 tablespoon of the olive oil in a medium skillet over medium heat. Add stuffed peppers, and transfer to the oven for 20 minutes. Ladle pepper puree onto 4 plates, and top with 2 peppers each; then serve."}], "link": "https://cooking.nytimes.com/recipes/8595-piquillo-peppers-stuffed-with-brandade"}