{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Burgers", "description": "You can make a burger out of anything, as most home cooks know; the challenge is in choosing a central element that delivers superior flavor and texture. Shrimp, like scallops, contain a high amount of natural gelatin, which allows you to incorporate a considerable amount of flavorings without worrying about the burger falling apart. \n\nIf you purée just a portion of the shrimp, leaving the rest — along with the flavorings — just roughly chopped, you produce a good-textured burger with powerful flavor. Feel free to vary the heat, reducing or increasing the amount of chile. And as with any burgers, these can be seasoned pretty much according to your whim.\n\nNo grill? Go ahead and pan-fry these burgers with a little bit of oil over medium-high heat.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/07/19/dining/19COOKING-BURGER2/19COOKING-BURGER2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, project", "keywords": "bell pepper, cilantro, shrimp, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 445}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 170, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "24 grams", "saturatedFatContent": "1 gram", "sodiumContent": "967 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large clove garlic, peeled", "1 dried or fresh chile, stemmed, seeded and deveined, or more to taste", "1 1-inch piece ginger, peeled and roughly chopped", "1 1/2 pounds peeled shrimp, deveined if you like", "1/4 cup roughly chopped shallots, scallions or red onion", "1/4 cup roughly chopped red or yellow bell pepper, optional", "Salt and pepper", "1/2 cup cilantro leaves, or to taste", "Neutral oil, like corn or canola, as needed", "Toasted buns, optional", "Lime wedges or ketchup for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or gas grill; fire should be moderately hot and rack about 4 inches from heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine garlic, chili, ginger and 1/3 of the shrimp in a food processor and purée, stopping machine to scrape down sides of container as necessary. Add remaining shrimp along with shallots, bell pepper, salt, pepper and cilantro, and pulse as many times as necessary to chop shrimp, but not too finely. Shape mixture into 4 patties. Chill for 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush grill or patties lightly with oil and place them on grill. Cook undisturbed until a dark crust appears on bottom and they release fairly easily with a spatula, about 5 minutes. Turn and cook an additional 3 to 4 minutes on the other side. Serve on buns or not, as you like, with ketchup or lime juice as a condiment."}]}