{"@context": "http://schema.org", "@type": "Recipe", "name": "Cassoulet with Fresh Beans", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H", "recipeYield": "Six servings", "recipeCuisine": "french", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "appetizer, chicken, chicken broth, fava beans, fall", "aggregateRating": null, "recipeIngredient": ["6 cloves garlic, roasted and peeled", "2 tablespoons olive oil", "4 chicken drumsticks, ball joint removed", "4 large leeks, rinsed and minced, white part only", "6 small onions, roasted", "2 cloves garlic, peeled and minced", "2 cup navy beans, soaked overnight and drained", "1 cup white wine", "3 quarts chicken broth, homemade or low-sodium canned", "2 cloves", "1 bouquet garni (1 bay leaf, 4 sprigs fresh thyme and 4 sprigs parsley tied together)", "6 tomatoes, peeled, seeded, cored and diced", "4 cups shelled fava beans", "8 carrots, peeled and cut into 2-inch pieces", "1/2 cup minced parsley leaves", "1/4 cup minced basil leaves", "1/2 teaspoon salt, plus more to taste", "1 teaspoon fresh ground pepper, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic and 1 tablespoon of the olive oil in a blender or food processor. Puree until smooth. Set aside. Grill the chicken drumsticks over hot coals until lightly charred, about 3 minutes on each side. Skin. Brush with 1/2 the roasted garlic puree. Lay a piece of foil over the grill. Put the chicken on the foil. Cover the grill and continue cooking until the meat is opaque at the bone, about 5 to 8 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the remaining olive oil, leeks, roasted onions and garlic in a heavy-bottom pot. Saute over medium-high heat until the leeks begin to wilt, about 3 minutes. Add the navy beans, wine, broth, cloves, bouquet garni and tomatoes. Simmer until the beans are tender, about 2 to 3 hours. Take out 1 cup of the broth and pour it into a glass or ceramic bowl. Set aside to cool slightly. Whisk in the remaining roasted garlic puree. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the fava beans in boiling water for 1 minute. Drain. Rinse under cold running water. Peel off their outer skins. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the carrots and chicken to the cassoulet and simmer for 10 additional minutes. Turn off the heat, whisk in the roasted garlic sauce and add the fava beans. Let the fava beans sit in the hot liquid for 3 to 5 minutes before serving. Divide among 4 bowls. Garnish with fresh parsley and basil. Season to taste with salt and pepper. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8618-cassoulet-with-fresh-beans"}