{"@context": "http://schema.org", "@type": "Recipe", "name": "Passion-Fruit Soufflé", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Passion-Fruit-Souffle/Passion-Fruit-Souffle-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, eggs, passion fruit purée, dessert, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 257, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "0 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "74 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons butter, softened", "1/4 cup plus 9 tablespoons sugar, plus more to dust ramekins", "2 tablespoons apple jam (or the peel of 2 Golden Delicious apples, all apple flesh removed)", "1 cup passion-fruit purée", "6 large eggs, separated, at room temperature", "Confectioners' sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lower racks of the oven and preheat to 410 degrees. Brush 6 1-cup ramekins with a thin layer of butter, then dust with sugar. Tap out excess sugar. Place the ramekins on a small sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix 1/4 cup sugar with the jam or apple peels until well combined. In a small saucepan, bring the passion-fruit purée to a boil. Add the sugar mixture and stir with a whisk. Lower the heat and bring to a steady simmer. Whisk continually for about 10 minutes, or until reduced by about one-fourth. Cool to room temperature and strain through a fine sieve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the base: in a large bowl, whisk together the egg yolks and 1/4 cup of the cooled purée. Add 3 tablespoons sugar and whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer, whisk the egg whites until they are foamy and no longer increase in volume. Add the remaining 6 tablespoons sugar. Continue whisking until the sugar dissolves and the whites form shiny stiff peaks. Gently but rapidly fold the whites into the base."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture to the top of each ramekin. Dust with confectioners' sugar and bake on the oven floor for 10 minutes, or until the tops are golden brown. The soufflés should rise between 1 1/2 to 2 inches over the top of the ramekins. Dust again with confectioners' sugar if you choose. To serve, gently tap a small hole into the top of each soufflé and pour in a few teaspoons of the remaining passion-fruit purée."}], "link": "https://cooking.nytimes.com/recipes/8627-passion-fruit-souffle"}