{"@context": "http://schema.org", "@type": "Recipe", "name": "Tandoori Squab (Or Quail)", "description": "", "author": {"@type": "Person", "name": "Julie Sahni"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "indian", "recipeCategory": "dinner", "keywords": "lemon juice, quail, squab, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1043, "unsaturatedFatContent": "44 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "88 grams", "fiberContent": "0 grams", "proteinContent": "56 grams", "saturatedFatContent": "36 grams", "sodiumContent": "797 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["4 squabs or 8 quails, ready to cook", "3 tablespoons clarified butter", "1/4 cup plain yogurt", "1 1/2 tablespoons lemon juice", "1 tablespoon prune butter", "2 large cloves of garlic ( 1/2 ounce), peeled", "1 3/4-inch piece fresh ginger ( 1/2 ounce), peeled and cut into chunks", "1/2 teaspoon lemon zest", "1/2 teaspoon saffron threads, crushed", "1 teaspoon ground cardamom", "1/4 teaspoon cayenne pepper", "1/2 teaspoon black pepper", "Salt to taste", "Clarified butter for basting", "Radishes and lime juice for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With poultry shears, cut the backbones of the squabs. If you are using quails, split them lengthwise. Pull the skin off the squabs or quail, using paper towel to get a better grip. Place the squabs or quail, breast side up, on the work surface. Press down with the heel of your palm to break the breastbone and flatten. If you are using squabs, prick all over with a fork and make diagonal slashes, a half-inch-deep and one-inch-apart, on the meat, along the grain. Make a slit with a paring knife in the meat between the thigh and the breast and secure the ends of the leg through the slit. Place the squabs or quails in a shallow dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Process all the ingredients of the marinade in a blender or a food processor until they are liquefied. Pour the marinade over the squabs or quail. Turn and toss to coat thoroughly. Cover and marinate at room temperature for 15 minutes, or four hours in the refrigerator (maximum, overnight). Take the squabs or quail from the refrigerator at least 30 minutes before cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light and prepare a covered charcoal grill until white ash covers the coals and the heat subdues to a moderately hot level. Scatter presoaked grapevine cuttings over the coals. Lightly brush the racks with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat the squabs or quail lightly with clarified butter and place them breast side down, on rack. Barbecue, covered, with the vents open, turning three times, for 17 minutes (15 minutes for quail) or until the meat is cooked medium rare (the meat will be pink near the joints). Transfer the squabs or quail to a heated platter and surround with radishes. Serve sprinkled generously with lime juice."}]}