{"@context": "http://schema.org", "@type": "Recipe", "name": "Rack of Pork Roasted With Sherry and Pears", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "fall, main course, pear, pork, sherry", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 982, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "6 grams", "proteinContent": "81 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1313 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["7 small pears, preferably Seckel", "Juice from one lemon", "2 to 3 tablespoons unsalted butter", "2 shallots, peeled and minced", "2 cloves garlic, peeled and minced", "1/4 cup Jerez-style sherry", "3 cups chicken broth, homemade or low-sodium canned", "2 racks of pork, trimmed of excess fat", "1 tablespoon kosher salt, plus more to taste", "1 teaspoon freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Peel and core the pears and cut each into quarters. Reserve the peelings and place the pears in enough ice water to cover. Add the lemon juice to the pears, stir and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan over medium heat, melt 2 tablespoons of butter. Add the shallots and 1 clove of minced garlic and the pear peelings and allow to soften for 5 minutes, stirring occasionally to avoid burning. Add the sherry and the chicken broth, bring to a boil and then reduce the heat to a simmer. Continue to simmer the sauce until it has reduced by half. Strain the sauce and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pork on a rack in a roasting pan and season with salt, pepper and the remaining garlic. Place in the oven for 10 minutes. Drain the pears and pat them dry and place them around the roast, glazing each with the drippings from the meat. If, at this point, the pork has not rendered enough fat to lightly coat the pears, melt the additional butter and brush over the pears. Return to the oven for 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pork from the oven and allow to rest for 5 minutes while reheating the sauce. Carefully slice the pork between the bones and place two chops, flanked by the roasted pears, on each of 6 plates. The pork can be served with glazed carrots (see recipe) and wild rice."}], "link": "https://cooking.nytimes.com/recipes/8642-rack-of-pork-roasted-with-sherry-and-pears"}