{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear-Pecan Tart With Maple Ice Cream", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H40M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "dessert, maple ice cream, pear, pecan, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 672, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "17 grams", "sodiumContent": "211 milligrams", "sugarContent": "50 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups whole milk", "1 cup heavy cream", "1 cup pure maple syrup", "Pinch salt", "3 egg yolks", "1 teaspoon vanilla extract", "1 1/2 cups pecans, toasted and coarsely chopped", "1 cup all-purpose flour", "1/2 teaspoon kosher salt", "1/2 cup cold unsalted butter, cut into small pieces", "1 egg, beaten", "4 ripe Bosc pears", "1/2 cup pure maple syrup", "1 tablespoon Cognac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ice cream, combine the milk, cream, maple syrup and salt in a medium saucepan. Bring just to a boil. Meanwhile, whisk the egg yolks in a mixing bowl. Whisking constantly and rapidly, add the milk mixture to the yolks. Pour the mixture back into the pan and place over low heat. Cook, stirring constantly, until mixture is thick enough to coat the back of a spoon, about 15 minutes; do not let it come to a simmer. Pour into a bowl, let cool and refrigerate until cold. Stir in the vanilla. Pour into an ice-cream maker and freeze according to the directions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the tart, place 1/2 cup of pecans, the flour and the salt in a food processor and pulse until the pecans are ground. Add the butter and pulse until mixture resembles coarse meal. Add the egg and pulse just until dough begins to come together. Gather dough into a ball, flatten into a disk, wrap in plastic and refrigerate 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Roll the dough into a circle about 3/8-inch thick and fit it into a 10-inch tart pan. Line the pan with parchment paper, fill with pie weights or raw beans and bake for 20 minutes. Remove the paper and the weights and bake for 5 minutes more. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, halve and core the pears. Arrange the pear halves in a circle over the crust, cut side down. Scatter the remaining pecans over and around the pears. Drizzle 1/4 cup of maple syrup over the top. Bake until the pears are soft but hold their shape, about 45 minutes, covering the top loosely with aluminum foil if the crust browns too much before the pears are done. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together 1/4 cup of maple syrup and the Cognac. Brush the mixture over the pears. Cut into wedges and serve with a scoop of maple ice cream."}]}