{"@context": "http://schema.org", "@type": "Recipe", "name": "Le Cirque 2000'S Ultimate Clown Pie", "description": "", "author": {"@type": "Person", "name": "Sandra Ballentine"}, "image": null, "totalTime": "PT3H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "dessert, fall, pear, sugar dough, vanilla bean", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 507, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "16 grams", "sodiumContent": "50 milligrams", "sugarContent": "40 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces (1 stick) cold butter, cut into 1-tablespoon pieces", "1 cup confectioners' sugar", "1/4 vanilla bean (seeds only )", "Small pinch of salt", "1 egg", "2 cups all-purpose flour", "2 firm pears", "1 teaspoon butter", "1 teaspoon sugar", "1/3 cup honey", "13-inch cinnamon stick", "1 clove", "1 star anise", "1/2 vanilla bean (seeds only)", "1 pound fresh ripe pears", "1/3 cup honey", "1 small piece star anise", "4 large egg yolks", "1 2/3 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the crust: cream the butter and sugar in a food processor or with an electric mixer. Add the vanilla bean seeds and salt and mix until smooth. Add the egg and mix until blended. Add all the flour at once and mix just until all the flour is incorporated. Flatten into a disk and place in a zip-top plastic bag. Seal and refrigerate several hours or overnight. Allow the dough to soften slightly at room temperature for 1 hour before continuing. Roll the dough into a round no thicker than 1/4 inch and use it to line a 10- or 12-inch tart pan with a removable bottom. Prick the bottom of the crust with a fork and refrigerate for 20 minutes. Preheat the oven to 350 degrees. Line the pastry crust with parchment and fill with pie weights or dried beans. Bake the crust for 10 minutes, until set and pale brown. Remove the weights and paper and bake again until the crust is cooked through, about 5 minutes longer. Place the pan on a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauteed pears: peel the pears and cut in half. Remove the cores and seeds and cut the pears into small dice. Melt the butter in a medium nonstick skillet over medium-high heat. Add the pears and sugar and saute until the pears start to caramelize. Add the honey, cinnamon, clove and star anise and continue to saute until the pears are tender and caramelized, about 5 minutes. Remove to a bowl and stir in the vanilla. When the pears are cool, remove the whole spices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pear cream:place a fine-mesh sieve over a bowl set in an ice-water bath.Peel the pears and cut in half. Remove the cores and seeds.Dice the pears,place in a food processor and puree.Pour the puree into a 2-quart saucepan and stir in the honey and star anise.Heat to boiling over medium heat and cook until the liquid has evaporated and the mixture starts to stick to the pan,stirring occasionally. Have the egg yolks ready in a medium bowl. Gradually whisk the thickened hot-pear puree into the egg yolks.Then return the mixture to the pan and cook, stirring constantly,over medium heat until the mixture coats the back of a spoon,about 3 minutes.Do not allow the mixture to boil or it will curdle.Immediately pour the hot pear cream through the sieve into the bowl over the ice bath.Whisk until cold and thick.Whip the heavy cream.When it is almost stiff,gently fold the whipped cream into the pear cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: remove the sides of the tart pan and place the pastry shell on a serving plate. Spread the sauteed pears over the bottom of pastry shell. Frost the pie thickly with the pear cream, or place the pear cream in a pastry bag fitted with a large star tip and pipe the cream over the sauteed pears. Chill for 1 hour before serving."}], "link": "https://cooking.nytimes.com/recipes/8661-le-cirque-2000s-ultimate-clown-pie"}