{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Fresh Tomato and Basil Sauce", "description": "This recipe came to The Times in 2003 from the chef Scott Conant, who was then cooking at his restaurant L'Impero in Manhattan. It is simple, classic Italian fare that makes the most of summer's tomatoes, but you can also make it with hothouse offerings and it will be delicious.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/07/27/dining/27SPAGHETTI/27SPAGHETTI-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "basil, spaghetti, tomato, fall, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 716}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 852, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "99 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "8 grams", "proteinContent": "21 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1167 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds fresh plum tomatoes, blanched, peeled, seeded and quartered", "3 ounces olive oil", "Salt and freshly ground pepper to taste", "1 pinch crushed red-pepper flakes", "1 pound dry spaghetti", "2 ounces extra-virgin olive oil", "1 tablespoon butter", "6 leaves fresh basil, shredded", "2 tablespoons freshly grated Parmigiano-Reggiano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the tomatoes and remove the skins. Cut in half lengthwise and scoop out the seeds. Cut the tomatoes crosswise. Set aside in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 ounces olive oil in a large, deep skillet over medium-high heat until it smokes slightly. Add tomatoes, salt, pepper and crushed red pepper. Since the tomatoes will reduce and the salt will be concentrated, it is better to season initially with a lighter hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the tomatoes with a potato masher until they are in fine chunks and all their liquid is released. Be sure they are chopped and crushed fine, for a semichunky sauce. Simmer for 25 minutes over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce simmers, heat the water for the pasta. Cook the spaghetti in salted water about half of the way cooked. Drain, reserving some of the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the sauce and adjust the seasoning if necessary. Add the pasta to the sauce and cook over medium-high heat until all the liquid is absorbed and the pasta is al dente. If the sauce is over-reduced, use the pasta cooking liquid to adjust it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the last moment, remove the pan from the heat; add the extra-virgin olive oil, butter, basil and cheese. Mix thoroughly until the pasta is an orangy color. Taste again and adjust the salt if necessary. Remove to a platter. Serve."}]}