{"@context": "http://schema.org", "@type": "Recipe", "name": "Valentino's Spinach-Ricotta-Parmesan Ravioli", "description": "", "author": {"@type": "Person", "name": "Cathy Horyn"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "pastas", "keywords": "appetizer, fall, pasta, ricotta, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1007, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "64 grams", "fiberContent": "4 grams", "proteinContent": "28 grams", "saturatedFatContent": "31 grams", "sodiumContent": "1046 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups unsifted all-purpose flour, plus extra to roll out the dough", "1/2 teaspoon salt", "1 whole large egg", "2 large egg yolks", "5 tablespoons olive oil", "1 tablespoon butter", "1 tablespoon olive oil", "1 large onion (8 ounces), finely chopped", "3 cups dry white wine", "10 branches fresh basil leaves, removed, washed and shredded", "2 cups heavy cream", "Salt and freshly ground pepper to taste", "2 cups freshly steamed spinach (16 cups washed leaves, about 5 pounds organic bunches), drained and squeezed dry", "10 ounces ricotta cheese, drained overnight and pressed dry", "1 1/3 cups fresh, finely shredded Parmesan cheese, plus more for serving", "1 large egg", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the pasta dough: combine 2 1/2 cups flour and the salt in a food processor. Combine the whole egg, yolks, oil and 5 tablespoons water in a cup and mix with a fork to blend. With the food processor running, add the egg mixture in a steady stream and process until the dry ingredients look like coarse crumbs. Stop and mix the ingredients to clear out any dry pockets of flour. Process until the mixture forms a dough that cleans the sides of the bowl. Turn out onto a work surface and knead about 10 times. If the dough is sticky, sprinkle with some flour and knead it in. Place the dough in a zip-top plastic bag and let it rest while starting the sauce and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the basil-cream sauce: melt the butter in the oil in a large skillet over medium-high heat and add the onion. Sauté until softened and caramelized, about 8 minutes. Add the wine and 1 cup water and stir until boiling. Add half of the shredded basil and boil until reduced to 1 1/2 cups, about 20 minutes. Stir in the heavy cream and boil until reduced to 2 1/2 cups, about 15 minutes. Stir in the remaining shredded basil and season with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: finely chop the spinach; place in a bowl. Add cheeses, egg, salt and pepper, and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the ravioli: roll out one-third of the pasta dough onto a lightly floured surface until paper-thin, or roll gradually through a pasta machine. Working with a 6-by-30-inch piece of dough, place heaping teaspoonfuls of filling on the upper half of the length of dough, making 2 rows of 10 mounds. Wet the pasta dough between the mounds with water and fold over the empty pasta half. Press from the fold to seal, trying to eliminate air pockets. Trim the pasta edges with a cutter or knife, and separate the individual raviolo. Repeat with the remaining dough and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the ravioli in a stockpot of boiling salted water until the pasta is al dente, about 5 minutes. Drain and spread out into a large serving bowl. Reheat the sauce and pour on top. Gently toss to coat. Sprinkle with additional Parmesan and serve."}]}