{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple Chicken ‘n’ Ribs", "description": "If meat is involved, you can find me covering it in flavor-enhancing tenderizing liquids before grilling, broiling, baking or roasting it. The more you do to the meat before you cook it, the less you have to do during or after. In this case apple juice or cider gives tang and wards off stringiness, a small amount of oil keeps things juicy and maple syrup, soy, star anise, cinnamon and garlic impart deep, luscious flavor. These two meats work well in conjunction: the relatively lean chicken is enhanced in taste and texture by the pork ribs, which give off flavorsome fat as they roast. You can use whatever ribs you like; meaty ones are best, but as long as the ribs are separated, rather than in a slab, they'll do just fine. As for the chicken, I implore you to use thighs, bone-in, skin-on because the meat is more tender and the taste infinitely better. (Make sure you use a large enough roasting pan so you don't have to crowd the pan. If the pan is crowded, the meat will steam, not brown.)", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2017/02/07/dining/07COOKING-MAPLE-CHICKNRIBS2/07COOKING-MAPLE-CHICKNRIBS2-articleLarge.jpg", "totalTime": "PT1H25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "barbecues, poultry, project", "keywords": "chicken, maple syrup, ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 105}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 833, "unsaturatedFatContent": "38 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "63 grams", "fiberContent": "1 gram", "proteinContent": "48 grams", "saturatedFatContent": "18 grams", "sodiumContent": "534 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup apple cider or juice, as sharp as possible", "1/4 cup maple syrup", "2 tablespoons vegetable oil", "2 tablespoons soy sauce", "2 star anise", "1 cinnamon stick", "6 unpeeled garlic cloves", "1/2 teaspoon hot red pepper flakes (optional)", "8 pork spareribs, separated", "6 chicken thighs with skin and bone"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small mixing bowl whisk together the apple cider, maple syrup, vegetable oil and soy sauce. Add star anise, cinnamon stick, garlic and hot pepper flakes and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large freezer bag or bowl combine pork and chicken. Pour in the apple cider mixture, and seal bag or cover bowl. Refrigerate overnight or up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove marinated mixture from refrigerator, and heat oven to 400 degrees. Pour contents of bag or bowl (including liquid) into a large enough roasting pan to avoid crowding. Turn chicken pieces skin side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until chicken is opaque throughout and ribs are tender, about 1 1/4 hours; 35 to 40 minutes into roasting turn ribs over, but leave chicken skin side up and turn the heat to 425 degrees to increase browning if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken and ribs are finished roasting, there will be quite a lot of fat in the sauce. Strain the sauce and use a fat separator to remove this excess. Place the meat in a large dish along with the strained sauce and serve hot."}]}