{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Bass Fillets with Mushroom Beurre Noisette", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/Bass-Fillets/Bass-Fillets-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "cherry tomatoes, mushroom, sea bass, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 576, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "6 grams", "proteinContent": "42 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1048 milligrams", "sugarContent": "15 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["7 tablespoons butter", "8 ounces white mushrooms, washed and sliced", "1 1/2 tablespoons honey", "1 tablespoon fresh lime juice", "1 tablespoon sherry vinegar", "1 tablespoon soy sauce", "2 hazelnuts", "2 almonds", "1 tablespoon coriander seeds", "1 tablespoon sesame seeds", "1/2 tablespoon freshly ground black pepper", "Salt", "10 pearl onions, peeled and halved", "20 lima or peeled fava beans", "4 sea bass, red snapper or other fillets, 6 ounces each", "Pinch cayenne pepper", "1/2 cup cream", "20 cherry tomatoes, halved", "2 tablespoons minced fresh marjoram or oregano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 tablespoons of butter and mushrooms in skillet and turn heat to high. Cook for about 2 minutes, stirring occasionally, then drizzle with honey. When mushrooms brown, add lime juice, vinegar and soy sauce, and pour into small saucepan. Do not clean skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 cup water to skillet and cook over high heat, stirring occasionally, for about 1 minute. Pour into saucepan and simmer mixture over medium-low heat for about 30 minutes. Strain; reserve liquid and discard solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine nuts, coriander, sesame seeds and pepper in a small dry skillet. Turn heat to medium and toast mixture, shaking pan occasionally, until spices are fragrant, just a minute or two. Grind to powder in mortar and pestle or in a spice or coffee mill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of water to a boil and salt it. Add onions and cook about 5 minutes, or just until tender. Remove with slotted spoon. Add beans and cook for about 2 minutes, or just until tender. Remove with slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 3 tablespoons of butter in small saucepan over medium heat. Stir, scraping down the sides with rubber spatula, until butter foam subsides and butter turns nut brown. Immerse bottom of pan in bowl or pan of ice water to stop cooking (about 30 seconds), then keep warm over lowest possible heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put nut and seed powder onto plate. Season fillets with salt and cayenne, and brush with cream on all sides. Dredge only flesh sides in spice mixture and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put remaining 2 tablespoons butter in skillet large enough to hold fish in one layer (work in batches if needed and use a little more butter). Turn heat to medium-high. When butter melts, add fish and turn heat to high. Cook 3 to 4 minutes per side, turning once, until fish is cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine mushroom stock and browned butter and heat through; season to taste, then stir in onions, beans and tomatoes. Put fish fillets in individual bowls and surround with broth and vegetables. Garnish with marjoram and serve."}]}