{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Fish in Fennel", "description": "Grilling fish is not daunting when you master a few details, like selecting the right type of fish, keeping your grill clean and — the moment of truth — knowing how to turn. A whole fish can simply be rolled over: make sure you have room on the grill to achieve this. For a very large fish, like a seven-pound wild striped bass, you will need to shovel two spatulas under it, then roll it.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Fish-in-Fennel/Fish-in-Fennel-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy", "keywords": "extra virgin olive oil, fennel, sea bass, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 766, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "8 grams", "proteinContent": "94 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1686 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["4 heads fennel with branches and fronds", "1 4-pound whole black sea bass or bluefish, cleaned", "4 tablespoons extra virgin olive oil, more for oiling grill and serving", "Salt and freshly ground black pepper", "1 1/2 lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice stems and fronds from fennel bulbs and lay on a work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub fish inside and out with 1 tablespoon olive oil and season with salt and pepper. Tuck some fennel stems in fish cavity. Cover fish with remaining fennel stems and fronds. Use butcher's cord to tie fennel to fish, enclosing it. Rub fennel with another tablespoon olive oil. Trim fennel bulbs and slice 1/2-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat grill to very hot and oil grates. Place fish in fennel on grill, preferably at least 8 inches from coals or fire. Grill about 15 minutes on one side. Fennel will char."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While fish grills, place sliced bulbs in a saucepan of boiling, salted water and blanch for 5 minutes. Drain well on paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn fish and grill about 15 minutes on other side, or until flesh in cavity looks opaque and can easily be separated from the bone when poked with a knife. Remove to a platter and snip off cords."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub fennel slices with remaining 2 tablespoons oil and place on grill. Sear on each side. Season with salt and pepper and sprinkle with the juice of 1/2 lemon. Bone fish and serve, with lemon wedges, additional oil for drizzling and seared fennel alongside."}]}