{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Halibut With Indian Spices and Corn Relish", "description": "Here, a fragrant combination of ground cumin, turmeric, coriander and fennel seed is rubbed all over fresh halibut steaks (Pacific salmon, wild striped bass and hake also work well here). The steaks are then left to marinate for a few hours in the refrigerator before grilling. The cooked fish is topped with a quick relish made of fresh corn, ginger, onion, cilantro and a bit of the spice mixture that's been sautéed in clarified butter. It's an unexpected yet extraordinary way to prepare fish that might just win over the self-proclaimed seafood-haters at the table.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/07/31/dining/halibut-corn-salsa/halibut-corn-salsa-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, quick", "keywords": "corn, ghee, halibut, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 134}, "recipeIngredient": ["2 teaspoons ground cumin", "1 1/2 teaspoons ground turmeric", "1 teaspoon ground coriander", "1/2 teaspoon ground fennel seeds", "Salt and freshly ground black pepper", "4 halibut steaks, 1 inch thick, 2 to 2 1/2 pounds total (Pacific salmon, wild striped bass, hake steaks or fillets of these fish can be substituted)", "2 lemons", "4 tablespoons ghee (sold in Indian stores and fancy food shops) or clarified butter; vegetable oil can be substituted", "1 tablespoon minced fresh ginger", "1/2 cup finely chopped onion", "1 cup cooked fresh corn kernels (about 1 ear of corn)", "Oil for grill", "1 tablespoon chopped fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine cumin, turmeric, coriander, fennel, 1/2 teaspoon black pepper and 1/2 teaspoon salt or to taste. Rub fish steaks on both sides with juice of 1/2 lemon, then rub with all but 2 teaspoons of spice mixture. Refrigerate 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While fish marinates, heat 2 tablespoons ghee in a skillet, add ginger and onion and sauté until onion just starts to brown. Stir in remaining spices and sauté, stirring, until spices smell toasty, then add corn and juice of 1/2 lemon. Cook briefly and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove fish from refrigerator and brush on both sides with remaining ghee or butter. Heat grill and oil grates. When hot, place fish on grill over medium-hot coals or gas fire and cook about 5 minutes. Use a spatula to turn fish and grill 3 to 4 minutes, until a little liquid just begins to pool on surface of fish and a paring knife inserted just at the bone can move flesh away from it easily. Salmon should be cooked about 3 minutes on each side. Remove fish to a warm platter or individual plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat corn mixture, adding cilantro and a couple tablespoons water to moisten it. Spoon corn on fish, garnish with wedges cut from remaining lemon and serve."}], "link": "https://cooking.nytimes.com/recipes/8698-grilled-halibut-with-indian-spices-and-corn-relish"}