{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterscotch Peaches", "description": "I make a peach-butterscotch sauce that I dreamed up to impress my children, whose love for me, though unwavering, I am nonetheless constantly trying to cement with food. The result was delectable. We ate the sauce straight from the pot. We ate it from the serving dish. And we ate what was left for dessert that night, poured over Ronnybrook vanilla ice cream with chewy gingersnaps from Hawthorne Valley on the side. My children’s adoration of me was unaffected by the butterscotch, but their energy level definitely got a boost from all the sugar.", "author": {"@type": "Person", "name": "Celia Barbour"}, "image": "https://static01.nyt.com/images/2014/04/15/dining/Butterscotch-Peaches/Butterscotch-Peaches-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "weekday", "keywords": "dessert, peach, sugar, vanilla ice cream, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "recipeIngredient": ["6 medium or 5 large ripe peaches", "4 tablespoons unsalted butter", "1/2 cup cream", "1/2 cup sugar", "1 tablespoon honey", "Pinch of salt", "3/4 teaspoon vanilla, 1/2 teaspoon ground ginger or 1/2 teaspoon almond extract", "Vanilla ice cream", "Almond biscotti, gingersnaps or other cookies"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with ice and water, and set aside. Bring a large pot of water to a boil. Place peaches in boiling water for 2 minutes. Using a slotted spoon, transfer to ice water. When cool, drain and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working over a bowl to catch the juice, peel skins from peaches, squeezing as much juice as possible from the skins. Slice each peach into 10 to 12 slices, and set aside with juice; discard skin and pits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium skillet over low heat, melt butter. Raise heat to medium-high and cook butter until it foams, subsides, foams again and begins to brown. As soon as butter is nut-brown, add the peaches with juices. Sauté 2 to 3 minutes, then place skillet over low heat to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium heavy-bottomed saucepan, combine cream, sugar, honey and salt. Place over low heat and cook, stirring occasionally, until sugar is completely melted. Raise heat to medium and let boil without stirring until it turns a rich golden brown, 12 to 15 minutes. (Because of honey and cream it will appear to turn pale brown before it has caramelized; wait until it has darkened noticeably, thickened and reduced before proceeding.) Carefully pour contents of skillet into saucepan; it will boil and spatter; stir to combine. Remove from heat and allow to cool slightly. Add vanilla or other flavoring. Serve warm or at room temperature over ice cream, with cookies on the side."}]}