{"@context": "http://schema.org", "@type": "Recipe", "name": "Brandade of Cod With Langoustines and Gazpacho Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "appetizer, cod, langoustines, mixed baby greens, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 593, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "27 grams", "sodiumContent": "1049 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 tablespoons unsalted butter", "1/2 medium onion, finely diced", "1 leek, white part only, cleaned and finely diced", "12 ounces cod or scrod fillets, skinned, boned and cut into 1/2-inch dice", "2 cups plus 2 tablespoons double or heavy cream", "1/2 package unflavored gelatin", "1 1/2 teaspoons salt, plus more to taste", "4 cups ripe cherry tomatoes", "4 tablespoons extra-virgin olive oil", "3 cups fish stock", "36 langoustines (or medium shrimps)", "3 ounces baby spring greens, washed and dried", "Freshly ground black pepper to taste", "1 teaspoon lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon of the butter in a large pan. Add the onion and leek and cook, covered, until soft but not browned. Add the cod and cook for 30 seconds. Add 1 cup of the cream, bring to a boil and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soften the gelatin in 2 tablespoons of tepid water. Add 2 tablespoons of the cream mixture, stirring constantly. Add the gelatin mixture to the cream mixture and stir until smooth. Puree in a blender with 1/2 teaspoon of salt, then pass through a chinois or fine-mesh sieve into a metal bowl set on ice. Refrigerate to set lightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip 1 cup of cream until it forms soft peaks. Fold the cod mixture into the whipped cream to make a mousse. If the mixture becomes loose in the process, briefly whisk to restore texture. Refrigerate to set, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the tomatoes in a food processor or blender, then push them through a fine-mesh sieve. In a pan over low heat, simmer them for 20 minutes, until reduced by half. Add the remaining 2 tablespoons of cream as well as the remaining 4 tablespoons of butter, diced, and 2 tablespoons of the olive oil. Season to taste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the fish stock to a boil in a large pan. Immerse the langoustines in the stock for about 1 minute, turn and cook for another 30 seconds. Remove them with a slotted spoon. Reserve the stock for another purpose."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the greens with the remaining 2 tablespoons of oil and sprinkle with salt, pepper and lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a small mound of the greens on each of 6 plates. Form the brandade into neat \"footballs\" about 1 inches long, using the bowls of 2 teaspoons as a mold. Place 6 of these and 6 langoustines on each plate. Spoon the sauce around them."}], "link": "https://cooking.nytimes.com/recipes/8710-brandade-of-cod-with-langoustines-and-gazpacho-sauce"}