{"@context": "http://schema.org", "@type": "Recipe", "name": "Gordon Ramsay's Sea Bass With Vanilla-Bean Foam", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "butter, sea bass, vanilla bean, fall, main course", "aggregateRating": null, "recipeIngredient": ["1 sea bass (about 2 1/4 pounds), filleted but not skinned", "4 1/2 cups fish stock", "1 large vanilla bean", "14 ounces salsify", "Juice of 1 lemon", "6 tablespoons butter (2 of them ice-cold for finishing the sauce)", "1/2 teaspoon sea salt, plus more to taste", "8 whole baby fennel bulbs, or 1 large bulb, halved, cored and sliced", "1 sprig fresh thyme", "1 bay leaf", "5 white peppercorns", "5 black peppercorns", "5 coriander seeds", "1/2 star anise", "1 whole green cardamom", "Freshly ground black pepper to taste", "2 tablespoons olive oil", "1 tablespoon double or heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the fillets into rectangles. Lightly score the skin to help it caramelize and to help prevent curling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the fish stock through a fine-mesh sieve into a saucepan and bring to a boil. Split the vanilla bean open and scrape the seeds into the hot stock followed by the pod. Remove the stock from the heat and allow the vanilla to infuse and the stock to cool completely. Return the stock to the stove and boil for about 20 minutes, until reduced by . Remove from heat, discard the vanilla and set the stock aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the salsify, then immediately drop it into cold water with 1 tablespoon of the lemon juice. Blanch in a large pot of boiling salted water for 2 minutes, drain, refresh in ice-cold water and drain again. Pat dry and cut into batons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon of the butter in a saucepan and add 1 cup of the fish stock. Bring to a light boil, toss in the salsify batons and cook until the stock has reduced to a glossy glaze. Stir in 1 tablespoon of the butter and season with i teaspoon sea salt. The batons should be lightly colored; if they are not, cook for another minute or so. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt another tablespoon of the butter in a medium pan and cook the fennel until nicely colored. Add 1/2 cup of the stock to the pan along with the thyme and the bay leaf. Cover and braise over gentle heat for 8 to 10 minutes. Remove the thyme and the bay leaf and set the fennel aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a spice mill or using a mortar and pestle, grind the white and black peppercorns, coriander seeds, star anise and cardamom into a powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a heavy frying pan. Season the bass with salt, pepper and the remaining lemon juice. Add 2 tablespoons of butter to the pan. When it has stopped foaming, add the fish skin side down. Cook for 3 to 4 minutes, then flip the fillets over and cook another 3 to 4 minutes, until firm and lightly springy. Season with the spice mixture and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the remaining stock and stir in the tablespoon of cream and 1/2 teaspoon of salt, or more to taste. Remove from the heat, add the 2 tablespoons ice-cold butter and reheat the stock, frothing it with an electric hand mixer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the fennel among 4 warmed plates. Put the fish on top, skin side up. Arrange the salsify around it in a circle. Spoon the sauce over the fish and drizzle the rest over the salsify."}], "link": "https://cooking.nytimes.com/recipes/8711-gordon-ramsays-sea-bass-with-vanilla-bean-foam"}