{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Orange Fool", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "buttermilk, orange, sugar, dessert, side dish, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 879, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "92 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "3 grams", "proteinContent": "16 grams", "saturatedFatContent": "33 grams", "sodiumContent": "384 milligrams", "sugarContent": "89 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 cups heavy cream", "1 cup sugar", "6 tablespoons cold water", "2 packages powdered gelatin", "3 cups buttermilk", "1/4 teaspoon kosher salt", "1 cup sugar", "6 tablespoons water", "1 cup heavy cream", "6 oranges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pudding, place the cream and sugar in a medium saucepan over medium heat just until the sugar dissolves. Meanwhile, place the water in a small bowl and sprinkle the gelatin over it (do not stir). Let stand for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the gelatin into the warm cream until melted. Let cool slightly. Stir in the buttermilk and salt. Refrigerate until just set (the mixture should be niether liquid nor firm), about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the caramel, place the sugar in a medium saucepana nd stir in the water. Use a pastry brush dipped in water to wash down any sugar crystals on the side of the pan. Place over medium heat and cook without stirring until mixture turns a deep caramel color. Remove from heat and carefully add the cream. Return the pan to the heat and stir until all of the caramel is dissolved. Place in a bowl and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a paring knife to remove all peel and pith from the oranges. Working over a bowl to collect any orange juice, cut out the orange sections from between the membranes. Stirs the juice into the caramel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, whisk the pudding. Spoon about 1/4 cup of pudding into 6 large wineglasses. Top each with a scant 2 tablespoons of caramel sauce and a few orange slices, making sure both show around the edge of the glass. Repeat the layers. Top with the remaining pudding drizzle with a little caramel sauce. Refrigerate for several hours before serving."}], "link": "https://cooking.nytimes.com/recipes/8731-caramel-orange-fool"}