{"@context": "http://schema.org", "@type": "Recipe", "name": "The Lamb Base", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT2H", "recipeYield": "Eight to 10 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, chicken stock, lamb, potato, winter", "aggregateRating": null, "recipeIngredient": ["2 tablespoons vegetable oil", "1 5-pound boneless lean leg of lamb, cut into 1 1/2- inch cubes", "Salt to taste, if desired", "Freshly ground pepper to taste", "1 cup finely chopped onions", "1 tablespoon finely minced garlic cloves", "1/2 cup finely diced celery", "4 tablespoons all-purpose flour", "1 cup dry white wine", "5 cups chicken stock (or lamb stock or water)", "3 tablespoons tomato paste", "Bouquet garni consisting of 1 bay leaf, 4 sprigs thyme, 6 sprigs parsley, the green of 1 leek", "4 turnips, about 1 pound", "12 small red potatoes, about 1 1/2 pounds", "24 baby carrots, about 8 ounces", "1/2 pound string beans, trimmed and cut in 3-inch pieces", "3 ears shucked corn, with kernels cut from the cob, about 2 cups", "1 cup shelled peas", "scallions, cut into one-inch pieces", "asparagus, cut up lengthwise", "spring onions, blanched in unsalted water for one minute", "green, red and yellow peppers, cut into strips, blanched for one minute", "eggplant, cut into one-half-inch dice, blanched for one minute", "zucchini, cut into one-by-one-quarter-inch sticks, blanched for one minute", "shallots, roasted on a tray in their skins for one-half hour at 400 degrees, then peeled", "cauliflower and broccoli, cut into florets and blanched for one minute", "summer squash, cut into one-by-one-quarter-inch sticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast-iron kettle, heat the oil over very high heat and add the meat cubes. Sprinkle with salt and pepper. Brown well over high heat on all sides, turning as necessary. If the pot is not large enough to hold all the meat in one layer, saute the meat in several batches. The browning will take from 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off the fat from the kettle, add the onions, garlic and celery, and stir well. Add the flour and cook over medium heat for three minutes, stirring occasionally. Add the wine, stock, tomato paste and bouquet garni. Stir to loosen the brown particles that may cling to the inside of the kettle. Bring to a boil, cover, and simmer for one hour and 15 minutes or until the lamb is tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bouquet garni. Transfer the stew base to a freezer container and cool for about two hours. Then place in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before serving, remove the stew from the freezer and defrost it in the refrigerator for 24 hours. Or, if you have a microwave oven, you can defrost the stew the day you want to serve it by heating it on medium power for 30 to 45 minutes or on the defrost cycle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to reheat the defrosted stew, trim and peel the turnips, potatoes and baby carrots. Cut the peeled turnips and potatoes lengthwise into approximately one-and-one-half-inch wedges, so that all are roughly the same size. This makes cooking time uniform and adds to the visual appeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot, add the turnips, potatoes, carrots, string beans, corn and peas, and cover with cold water. Bring to a rolling boil and blanch for one minute. Drain and set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the defrosted lamb stew into a large kettle and bring to a boil over medium-low heat. Add the vegetables and simmer gently for 10 minutes. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/8745-the-lamb-base"}