{"@context": "http://schema.org", "@type": "Recipe", "name": "Craig Claiborne's Fried Chicken", "description": "This fried chicken is classic Mississippi picnic fare, and goes hand in hand with a cold repast of deviled eggs, coleslaw and frosty drinks. A well-seasoned cast iron pan is best for cooking it, but you can do all that work the day before your feast. Drain it on a paper bag and cover it tightly with plastic wrap. It will keep until you unpack the basket. (The New York Times)", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT40M", "recipeYield": "Six servings", "recipeCuisine": "american", "recipeCategory": "dinner, project, times classics", "keywords": "chicken, lard, milk, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1256, "unsaturatedFatContent": "71 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "104 grams", "fiberContent": "1 gram", "proteinContent": "49 grams", "saturatedFatContent": "26 grams", "sodiumContent": "1217 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 2- to 2 1/2-pound chickens, cut into serving pieces", "2 cups milk, approximately", "3/4 teaspoon Tabasco sauce", "1 1/2 cups flour", "Salt to taste, if desired", "1 tablespoon freshly ground pepper", "2 cups lard or corn oil for frying", "1/2 cup butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken pieces in a mixing bowl and add enough milk to cover. Stir in the Tabasco sauce and refrigerate for at least one hour, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, salt and pepper in a flat baking dish or, preferably, in a large, heavy paper bag or strong plastic bag. Drain the chicken pieces, but don't pat them dry. Put them in the dish or the paper or plastic bag with the flour. Turn the pieces or shake to coat them thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the lard or oil with the butter in a heavy skillet, preferably cast-iron, large enough to hold half of the chicken pieces in one layer so they don't touch. Add half of the chicken pieces, skin side down, in one layer. Turn the heat to high and cook uncovered until golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the pieces and reduce the heat to medium low. Cook until golden brown. The total cooking time should be 20 to 25 minutes. Remove the cooked pieces of chicken and drain on paper towels. Repeat the process with the remaining chicken. (If this is made the day before, you do not have to refrigerate overnight.)"}]}