{"@context": "http://schema.org", "@type": "Recipe", "name": "Meat Patties", "description": "This is a recipe for the Greek dish kephtethakia. Ground lamb spiced with cumin provides the bulk of the flavor in these pan-fried meat patties.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 dozen patties, 8 appetizer servings or 4 main-course servings", "recipeCuisine": "greek", "recipeCategory": "", "keywords": "ground beef, ground lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 308, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "213 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups minced onion", "1/2 cup water", "1 pound lean lamb or beef or a mixture of both, ground fine", "1 large potato, peeled and grated", "1/2 cup fresh bread crumbs", "2 eggs, lightly beaten", "1 tablespoon aged red-wine vinegar, or more to taste", "1/4 cup chopped flat-leaf parsley", "1 tablespoon ground cumin", "Sea salt and freshly ground black pepper to taste", "All-purpose flour for dredging", "Olive oil for frying or baking", "Juice of 1 large lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the onion and water in a small saucepan, bring to a boil and simmer until liquid has evaporated, about 6 minutes. Combine the onion, meat, potato, bread crumbs, eggs, vinegar, parsley, cumin and a generous amount of salt and pepper in a large bowl. With your hands or a wooden spoon, mix until blended well. Add additional vinegar, salt and pepper to taste; the mixture should be highly flavored. Cover and refrigerate for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Moisten your hands with cold water. Form the meat mixture into 3/4-inch balls, flattening each slightly between your palms, and lightly dredge with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fry, pour 1/4 inch of olive oil into a heavy skillet over medium-low heat. When the oil is hot but not smoking, add the first batch of patties; they should fit comfortably in a single layer. Fry until golden brown on both sides and cooked through. Drain between two layers of paper towels. Repeat with the remainder. If you prefer to bake the patties instead of frying them, heat the oven to 325 degrees, and warm two or more heavy baking sheets. Brush the sheets with olive oil, and arrange the patties 1 inch apart. Lightly brush the patties with olive oil, and bake 20 to 25 minutes, turning once. Drain between two layers of paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange the patties on a platter; sprinkle with lemon juice."}]}