{"@context": "http://schema.org", "@type": "Recipe", "name": "Raisin-and-Nut-Studded Biscotti", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 dozen biscotti", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "almond, eggs, raisins, dessert, side dish, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 51, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "19 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup dark raisins", "1 tablespoon Curacao or cognac", "5 1/2 tablespoons unsalted butter or best-quality lard, or half of each, plus butter for greasing", "2 3/4 cups all-purpose flour, plus more for dusting work surface", "1 cup sugar", "1 1/2 teaspoons baking powder", "1/4 teaspoon salt", "3 egg yolks", "cup milk", "2 tablespoons pine nuts", "1/2 cup raw almonds, toasted and roughly chopped", "2 tablespoons candied orange peel", "1/4 teaspoon aniseeds", "1 large egg beaten with a little water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the raisins in the liquor for 30 minutes. Drain, reserving the liquid. Heat the oven to 350 degrees. Lightly grease and flour 2 cookie sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are making the biscotti by hand, sift together the flour, sugar, baking powder and salt. With your fingers, rub in the butter until the mixture has the texture of coarse cornmeal. Place them in a mixing bowl, making a well in the center. Beat together the egg yolks, reserved liquor and the milk and pour them into the well. Gradually draw the dry ingredients into the egg mixture, turning the bowl and working from the outside toward the center. When the dough is evenly mixed, scrape it onto a lightly floured work surface and flatten it into a rectangle. Scatter half the raisins, pine nuts, almonds, candied orange peel and aniseeds over the dough, and fold the dough over on itself several times to distribute them evenly. Add more flour to the work surface if necessary to keep the dough from sticking, and repeat the process with the remaining raisins, pine nuts, almond, orange peel and aniseeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are using an electric mixer, combine the flour, baking powder and salt and set aside. In the mixing bowl, cream the butter and sugar and beat for about 3 minutes, until light and creamy. Add the yolks, one at a time, incorporating each fully before adding another. Stir in the liquor and the milk. Sift the flour mixture over the top and fold in at the lowest speed. Add the remaining ingredients by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour the work surface and your hands and shape the dough into 6 equal 9-by-2-inch logs. If the dough is too soft to roll, cover and refrigerate it for 1 to 2 hours. Transfer the logs to the cookie sheets, setting them at least 2 inches apart. Flatten the tops and brush with the egg wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until pale golden and barely firm, about 20 minutes. Remove the logs from the cookie sheets, let them cool until you can handle them, about 10 minutes, then cut each one on the diagonal at -inch intervals. Set the slices on their edges on the cookie sheets, leaving 1-inch space between them, and bake until golden and firm, about 15 to 18 minutes. Alternatively, you can lay the slices on their sides and turn them after 7 minutes. Cool on a rack."}], "link": "https://cooking.nytimes.com/recipes/8804-raisin-and-nut-studded-biscotti"}