{"@context": "http://schema.org", "@type": "Recipe", "name": "Yunnan Steamed Chicken Soup (QiguoJi)", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "soups and stews", "keywords": "chicken, rice, main course", "aggregateRating": null, "recipeIngredient": ["1 4- to 5-pound chicken, chopped through bones and skin into 2- or 3-inch pieces (have butcher do this)", "2 cups water", "4 thin slices peeled fresh ginger", "5 small scallions, green and white portions, sliced", "2 to 3 tablespoons Chinese rice", "wine or dry sherry", "1/2 to 1 teaspoon kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "You will need a 3- to 4-quart heatproof glass or ceramic casserole with a tightly fitting lid; a larger pot, with a lid, that will hold the casserole, and a rack that will fit inside the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the chicken in boiling water for 5 minutes. Drain and rinse. Place the chicken, 2 cups of water, ginger, scallions, rice wine or sherry and a pinch of salt in the casserole and cover with the lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rack inside the larger pot. Completely wrap the casserole and lid with plastic wrap and place on the rack. Add water to the pot to come 1/3 up the sides of the casserole. Cover the outside pot. Bring the water to a boil, then lower the heat so that the water simmers steadily and creates steam. Keep a kettle of hot water ready to refill the pot as water evaporates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam until the chicken is tender and well covered with broth, about 2 1/2 to 3 hours. Strain the soup, discarding the ginger and scallions. Skim off fat and add salt to taste. Just before serving, reheat in a saucepan, preferably enamel or glass. Chicken can be nibbled on as a snack or served at room temperature with small bowls of vinegar and soy sauce for dipping."}]}