{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Skewers With Peanut Sauce", "description": "That peanut butter is relegated to the sandwich while sesame butter (tahini) is seen as an exotic food item is one of the wonderfully preposterous anomalies of American cooking. In the rest of the world, especially Asia, peanuts are special, used not only as a garnish but as a main ingredient in sauces. One such sauce incorporates coconut milk and classic Thai seasonings: curry paste or powder, nam pla, lime and cilantro. The coconut milk and peanuts make the mixture too powerful-tasting for most fish and too heavy for most meat. It is perfect, however, when teamed with chicken on the grill, especially boneless thighs.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/06/23/dining/23COOKING-CHICKEN-PEANUT-SAUCE2/23COOKING-CHICKEN-PEANUT-SAUCE2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner", "keywords": "chicken thigh, chunky peanut butter, coconut milk, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 636}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 723, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "2 grams", "proteinContent": "41 grams", "saturatedFatContent": "20 grams", "sodiumContent": "669 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup natural peanut butter, preferably chunky", "1 tablespoon curry paste or curry powder, or to taste", "1/2 teaspoon salt", "3/4 cup fresh or canned coconut milk, approximately", "1 tablespoon nam pla or soy sauce", "1 tablespoon lime juice", "1 1/2 to 2 pounds boneless chicken thighs, cut into large chunks", "Chopped fresh cilantro leaves for garnish", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start charcoal or gas grill or heat broiler; fire should be moderately hot, and rack should be at least 4 inches from heat. If using wood skewers, soak them in water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put peanut butter in a small saucepan over medium heat; add curry paste or powder, salt and enough coconut milk to achieve a creamy but quite thick consistency. Cook over low heat, whisking, until smooth; do not boil. Cool a bit, then stir in nam pla and lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate chicken in this mixture for 5 minutes to an hour. Skewer chicken chunks, then grill or broil slowly, until nicely browned and cooked through, 10 minutes or longer. Serve hot, garnished with cilantro and accompanied by lime."}]}