{"@context": "http://schema.org", "@type": "Recipe", "name": "Barbecued Beef", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "lunch", "keywords": "garlic, rib steak, soy sauce, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 605, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "3 grams", "proteinContent": "38 grams", "saturatedFatContent": "16 grams", "sodiumContent": "3134 milligrams", "sugarContent": "16 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 1/2 pounds boneless rib steak, trimmed of fat", "1/2 cup soy sauce", "1/2 cup water", "1/4 cup sugar", "1 tablespoon sake", "1 tablespoon minced scallion", "1 teaspoon finely chopped garlic", "1 teaspoon sesame oil", "1/2 cup soybean paste mixed with 1/4 cup water", "2 green Korean or Thai hot peppers, seeds and veins removed, sliced", "2 large cloves garlic, very thinly sliced", "Large outer leaves from two heads of red-leaf lettuce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a very sharp knife, cut the beef into very thin slices, each about 5 inches long and 2 inches wide. Place them in a large nonreactive bowl and set aside. In another bowl, combine the soy sauce, water, sugar, sake, scallion, garlic and sesame oil and stir until the sugar is dissolved. Pour the mixture over the meat and set aside to marinate at room temperature for 1 hour, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, prepare a charcoal or table-top grill with a fairly fine grill surface. When very hot, remove the meat from the marinade and discard the marinade. Grill the meat until nicely browned, about 2 to 3 minutes per side. (Alternatively, preheat a large cast-iron skillet over high heat and cook the meat slices a few at a time, turning once, until browned.) Transfer to a warmed platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place soybean paste, hot peppers and garlic in separate bowls and place lettuce leaves on a plate. Serve with rice and side dishes (recipes follow). To eat, top a lettuce leaf with a piece of meat and your choice of garnishes or side dishes, fold the leaf over the filling and eat with your fingers."}]}