{"@context": "http://schema.org", "@type": "Recipe", "name": "Helen Kent's Apple Pie With Quince", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "2 pies", "recipeCuisine": "", "recipeCategory": "project", "keywords": "apple, flour, quince, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 429, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "6 grams", "sodiumContent": "104 milligrams", "sugarContent": "17 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["2 quinces, peeled", "3 cups flour, plus more for dusting the board", "1/2 teaspoon salt", "1/3 cup plus 1 teaspoon sugar", "1 1/2 cups vegetable shortening", "1 egg white, lightly beaten", "4 tablespoons cold water", "1 tablespoon cider vinegar", "6 to 8 medium apples, peeled, cored and cut in 1/4-inch-thick slices", "1/2 teaspoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Place the quinces in a saucepan, cover with water and place over high heat. Boil until they begin to soften, 10 to 15 minutes. Drain. When cool, core and cut them into thin slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the flour, salt and 1 teaspoon of the sugar. Using a fork, gently blend the shortening into the flour mixture until it resembles coarse meal. Combine the egg white, water and vinegar and add to the mixture. Blend gently with a fork until the ingredients just hold together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 4 equal balls. On a floured surface, roll out one ball of the dough to about 16 -inch thick. Ease the crust into a 9-inch dish and trim the edge with scissors. Repeat with another ball of dough and a second pie dish. Refrigerate the remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine the sliced apples with the remaining sugar and the cinnamon. Place the apples into the pie crusts. Lay the slices of one quince on top of the apples of each pie. Roll out the 2 remaining balls into 10-inch circles for the top crusts and cover the apple mixture, pinching along the perimeter to seal the edge. With a sharp knife make 8 small cuts in the top crusts. Bake for 35 to 40 minutes in the middle of the oven until the crust is golden and the apples are bubbly. Serve warm with cheddar cheese."}]}