{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Pomegranate Glaze And Fresh Mint", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "3 to 4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, project", "keywords": "chicken, mint, pomegranate, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "recipeIngredient": ["1 bunch (1 ounce) fresh mint", "1 5- to 6-pound chicken, excess fat trimmed; wingtips, neck and giblets reserved for stock", "2 to 3 teaspoons kosher salt", "Freshly ground black pepper, to taste", "4 whole cloves garlic, unpeeled", "Seeds from 1 large or 2 small pomegranates (1 1/2 cups)", "Juice from 1 large or 2 small ripe pomegranates (1/2 cup)", "1/2 cup chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rack on second level from bottom of oven. Preheat oven to 500 degrees. Remove leaves from half the mint, reserving stems. Stack the leaves, roll and cut them across into thin strips, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken, breast-side up, in a 12-by-8-by-1 1/2-inch heavy roasting pan. Sprinkle chicken cavity with some of the salt and pepper, and stuff it with garlic, 1/2 cup pomegranate seeds, the reserved mint stems and the remaining half bunch of mint with leaves attached. Pour 1/4 cup pomegranate juice over chicken. Sprinkle with 1 teaspoon salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken in oven, legs first. Roast for 50 minutes. Move chicken once after the first 10 minutes with wooden spatula to keep it from sticking. The chicken should not burn. (If chicken smells as if it is burning, reduce heat to 400 degrees, and open oven door for a minute to lower the temperature quickly. Continue roasting at lower temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The chicken will be a beautiful mahogany brown. Tilt chicken over pan to drain juices, and then remove chicken to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tilt roasting pan, and spoon out fat, leaving any juices. Place pan over medium-high heat. Pour in chicken stock and remaining 1/4 cup pomegranate juice. Bring liquid to a boil, scraping up any browned bits from bottom of pan with a wooden spoon. Stir in remaining mint leaves. Lower heat, and simmer for 1 minute. Season with salt and pepper. Add any juices that have collected on the platter. Simmer for 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour about half the pan juices over the bird, taking care that the platter does not overflow. Top with a few remaining seeds. Combine the rest of the juices into a sauce boat with remaining seeds, and serve with chicken."}], "link": "https://cooking.nytimes.com/recipes/8868-roast-chicken-with-pomegranate-glaze-and-fresh-mint"}