{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Ricotta", "description": "At Quince in San Francisco, Michael Tusk, the chef, smokes fresh ricotta over fruitwood and spices until it's lightly browned and crumbly. If you have a stove-top smoker, this is the time to use it, but you can improvise using a wok, a round baking rack and a vegetable steamer. (Fruitwood chips are available at barbecuewood.com.)", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT40M", "recipeYield": "Makes 1 1/2 cups", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "appetizer, juniper berries, ricotta, rosemary, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "6 grams", "sodiumContent": "348 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["2 cups whole-milk ricotta", "1 1/2 cups kosher salt", "1/2 cup sugar", "14 juniper berries", "1 tablespoon white peppercorns", "3 tablespoons coriander seeds", "6 bay leaves", "6 sprigs rosemary", "1 cup fruitwood chips", "2 cups ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sieve with cheesecloth and set over a bowl. Spoon the ricotta onto the cheesecloth and let drain overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, line the inside of a stove-top smoker (or wok) with aluminum foil so that it comes at least 2 inches up the sides of the pan. Spoon the ricotta from the cheesecloth into a steel flower-petal steamer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the salt, sugar, juniper berries, peppercorns, coriander seeds, bay leaves and rosemary. Pour this into the base of the smoker. Sprinkle the wood chips around the edges of the spice mixture. Place a small (10-inch) baking rack on top of the spice mixture. Turn the heat to high (and turn on the exhaust fan above your stove), and when smoke appears, spread the ice on the baking rack. Top with the steamer. Cover the smoker (or wok) tightly with either the lid or aluminum foil. Regulate the heat so the mixture is smoking but not scorching. Smoke until the ricotta is golden brown on top and dry enough on the edges to crumble, 15 to 20 minutes. Scrape the ricotta into a bowl and chill immediately."}], "link": "https://cooking.nytimes.com/recipes/8872-smoked-ricotta"}