{"@context": "http://schema.org", "@type": "Recipe", "name": "Payard's Apricot", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apricot, honey, puff pastry, dessert, spring", "aggregateRating": null, "recipeIngredient": ["Tarte Tatin", "2/3 cup sugar", "2 tablespoons honey, lavender preferred", "1 tablespoon unsalted butter", "6 beautifully ripe large apricots (or 4 large peaches), halved", "4 almonds from apricot pits, halved", "1 sheet frozen puff pastry, thawed", "1 teaspoon corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Arrange four 3-inch-by-2-inch aluminum molds or ramekins on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir sugar, honey and 1 tablespoon water in a small saucepan over medium-high heat until sugar is dissolved. Boil syrup, shaking occasionally, until thick and light brown, about 5 minutes. Remove pan from heat and carefully stir in the butter. Pour syrup into molds to make a 1/4-inch layer in each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange 3 apricot halves (or 1 large peach half), cut sides up, in each mold. Place 1/2 almond between two apricot halves and bake 10 to 15 minutes, until apricots are tender and juices bubble. (Time will depend upon ripeness of fruit.) Remove from oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roll out pastry on floured surface to 1/8-inch thickness. Cut into four 3 1/4-inch rounds with a biscuit cutter. Prick rounds on a parchment-lined baking sheet with a fork and bake at 400 degrees for 12 to 15 minutes, until puffed and golden brown. Using your thumb, smear each round with a very thin layer of corn syrup to glaze and prevent sogginess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard almond halves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a pastry round over fruit in each mold, glazed side down. Wrap the bottom of a drinking glass with plastic wrap and press the glass onto the pastry round to compress the dessert and infuse pastry with fruit. Collect overflowing juice for use as a sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully invert each onto a serving dish; serve with sauce."}]}