{"@context": "http://schema.org", "@type": "Recipe", "name": "Pineapple And Molasses Spareribs", "description": "", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2015/02/25/dining/spareribs/spareribs-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, project", "keywords": "fall, main course, molasses, pineapple, pork spareribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 113}, "recipeIngredient": ["16 pork spareribs", "Finely grated zest and juice of 1 lime", "3 tablespoons soy sauce", "3 green Thai chilies or other small hot chilies, roughly chopped", "1 2-inch piece of ginger, peeled and thinly sliced", "2 tablespoons peanut oil", "4 tablespoons molasses", "2 star anise", "1 cinnamon stick, broken into shards", "1 onion, peeled and cut into eighths", "1/2 cup canned pineapple juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place ribs in a large plastic bag and set aside. In a bowl, combine lime zest and juice, soy sauce, chilies, ginger, oil and 2 tablespoons molasses. Add star anise, cinnamon, onion and pineapple juice, and stir to mix well. Add contents of bowl to bag, seal bag well, and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Remove ribs from refrigerator, and pour contents of bag, including marinade, into a roasting pan. Allow ribs to come to room temperature. Cover pan tightly with foil, place in oven, and bake for 1 hour, turning ribs once halfway through cooking. Remove pan from oven (leave oven on), discard foil, and carefully spoon only the liquid from pan into a saucepan. Return pan to oven, and continue to bake ribs uncovered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons molasses to saucepan, and place over medium heat. Cook until mixture is foamy and syrupy, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove ribs from oven, and pour sauce over them, turning ribs until they are well coated. Transfer to a large platter, and serve."}], "link": "https://cooking.nytimes.com/recipes/8883-pineapple-and-molasses-spareribs"}