{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Stuffed Breast Of Veal", "description": "", "author": {"@type": "Person", "name": "Tom Colicchio"}, "image": null, "totalTime": "PT5H", "recipeYield": "12 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project, roasts", "keywords": "fall, main course, prosciutto, swiss chard, veal", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 433, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "1 gram", "proteinContent": "30 grams", "saturatedFatContent": "9 grams", "sodiumContent": "986 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 head garlic", "5 to 6 tablespoons extra virgin olive oil", "Leaves from 2 large bunches white Swiss chard, rinsed and drained", "Salt", "1/4 pound prosciutto di Parma", "1/4 cup freshly grated Parmigiano-Reggiano", "Freshly ground black pepper to taste", "1 whole 10- to 12-pound breast of veal, boned", "4 sprigs fresh thyme", "2 tablespoons finely chopped flat-leaf parsley", "2 carrots, quartered", "2 onions, quartered", "1 leek, quartered", "1 stalk celery, quartered", "12 cups liquid: light veal or chicken stock or water, or a blend", "Herbed vinaigrette, salsa verde or aioli, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an oven to 450 degrees. Rub the garlic with a little olive oil, wrap in foil and roast until soft, about 30 minutes. Remove the garlic and reduce the oven temperature to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons olive oil in a large saucepan, add the Swiss chard leaves, sprinkle with a little salt, and cook a few minutes, turning with tongs, until wilted. Place in a colander and press out as much liquid as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the Swiss chard. Shred the prosciutto and scatter over the chard. Dust with the cheese and chop ingredients together until the chard is finely chopped. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a sharp knife to remove excess fat from the surface of the veal. With boned side up, lightly score surface of veal in crisscross pattern. Season with salt and pepper. Squeeze the garlic out of cloves and mash. Spread on the meat. Spread with an even layer of chard mixture. Strew with the thyme and parsley. Tightly roll the slab of veal the long way. Use a butcher's cord to tie the veal at 1 1/2-inch intervals, tucking in any stuffing that oozes out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in large, deep casserole over medium heat. Cut the roast in half or thirds if necessary to fit in the casserole, and lightly brown on all sides, one section at a time. If the pan blackens, wash the casserole after browning the veal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter carrots, onions, leek and celery over the veal in the casserole. Add enough liquid to nearly cover the meat. Bring to simmer on top of stove. Place in the oven and cook 2 1/2 to 3 hours, basting frequently, until the meat is fork-tender. Remove from the oven and allow to cool in liquid to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove veal from cooking liquid, reserving liquid. Wrap veal in foil; refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce cooking liquid by half and skim off fat. Strain and freeze for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, snip and remove cord from veal. Slice veal. Arrange on platter with vinaigrette, salsa verde or aioli alongside."}], "link": "https://cooking.nytimes.com/recipes/8886-braised-stuffed-breast-of-veal"}