{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Pots De Crème", "description": "All the textbooks say the same thing: cooking granulated sugar until it turns into caramel involves complex chemistry. And I'm sure they are right. But I'm just as sure that what turns sugar into caramel is magic. Not only is caramel simple, but it is also versatile. Caramelized sugar mixed with butter and cream makes candies soft as taffy or hard as lollipops; thinned with water, it makes a glaze; thinned with cream, it makes a sauce; added to chocolate, it provides complexity; and added to custards, it can provide all the flavor needed for a spoon dessert. This luscious, golden pudding is a perfect example.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2017/01/30/dining/30COOKING-CARATS-DE-CREME1/30COOKING-CARATS-DE-CREME1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "custards and puddings", "keywords": "dessert, eggs, heavy cream, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 67}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 349, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": null, "proteinContent": "5 grams", "saturatedFatContent": "16 grams", "sodiumContent": "59 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups heavy cream", "1 cup whole milk", "3/4 cup sugar", "5 large egg yolks", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in oven, and heat to 300 degrees. Put 8 4-ounce custard cups or ramekins in a large roasting pan, and set aside. Combine cream and milk, and warm them in a microwave oven or on the stove top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure out 1/4 cup sugar, and set aside. Place a heavy-bottom metal pot over medium-high heat, and sprinkle in about 2 tablespoons sugar. As soon as sugar melts and starts to caramelize, stir. When color is uniform, stir in 2 more tablespoons sugar, and continue to stir until it is melted and colored. Continue with remaining sugar. When all sugar is mahogany color, stand away from pot, and stir in warm liquid bit by bit. Mixture will bubble furiously and may form lumps; stir to smooth it out. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place yolks, eggs and reserved 1/4 cup sugar in a very large measuring cup with a lip, and whisk to blend. Still whisking, stir in caramel liquid. Skim off foam, and fill custard cups. Set into roasting pan and pour enough hot tap water into pan to come halfway up sides of cups. Cover pan with plastic wrap or foil, poke 2 holes in opposite corners, and bake 35 to 40 minutes or until tops darken and custards jiggle a little in center when tapped. Cool custards in refrigerator; serve at room temperature."}]}