{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic-Bread-and-Asparagus Salad", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "appetizer, asparagus, garlic, goat cheese, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 297, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "14 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1051 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound asparagus, trimmed", "1 tablespoon plus 2 teaspoons extra-virgin olive oil", "1 cup chopped onion", "1 teaspoon minced garlic", "8 ounces fresh morels, or 1 ounce dried morels submerged in boiling water for 20 minutes and drained", "1 cup white wine", "1 cup chicken stock", "2 tablespoons chopped tarragon, plus more for garnish", "2 tablespoons chopped parsley, plus more for garnish", "3 tablespoons tamari sauce", "2 tablespoons balsamic vinegar", "2 teaspoons (1/3 fluid ounce) liquid ginseng (optional)", "Salt and freshly ground black pepper to taste", "4 1-inch-thick slices country-style French bread", "2 cloves garlic, peeled and halved", "4 ounces goat cheese, cut into 4 slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot 2/3 full of lightly salted water to a boil. Add the asparagus and cook until tender, 6 to 10 minutes. Drain and plunge the asparagus into a large bowl of cold water to stop cooking. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saute pan set over medium heat, heat 1 tablespoon of the olive oil. Add the onion and garlic and cook, stirring, until the onion is soft, about 5 minutes. Add the morels and continue to cook for 2 to 4 minutes until the mushrooms are tender (cook for 2 minutes if using dried). Add the wine and stock and simmer for 2 minutes. Using a slotted spoon, remove half of the mushrooms and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining mushrooms and liquid into a blender and add the tarragon, parsley, tamari and vinegar. Process until smooth. Strain through a fine-mesh sieve into a bowl, pressing on the solids to extract as much liquid as possible. Discard the solids; you should have about 2 cups liquid. Whisk in the ginseng and remaining oil and season to taste with salt and pepper. Set vinaigrette aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast the bread slices until lightly browned and rub them with the garlic cloves. Place each slice in a shallow soup bowl and top with a few asparagus spears. Slice the remaining spears into half-inch pieces and toss with the reserved morels and 1/4 cup of the vinaigrette. Divide among the bowls. Pour the remaining vinaigrette around the toast and crumble one slice of goat cheese over each. Microwave each bowl on high for 30 seconds or until the cheese just melts. Garnish with chopped parsley and tarragon and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8895-garlic-bread-and-asparagus-salad"}