{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Strawberry Alaska", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "project", "keywords": "dessert, fall, flour, strawberry, sugar", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 783, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "125 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "4 grams", "proteinContent": "14 grams", "saturatedFatContent": "16 grams", "sodiumContent": "610 milligrams", "sugarContent": "67 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups all-purpose flour", "3 1/2 teaspoons sugar", "2 teaspoons baking powder", "1/2 teaspoon salt", "3 tablespoons unsalted, chilled butter, cut into small pieces", "1/2 cup heavy cream", "1 pint strawberries, hulled and sliced", "1 cup plus 2 tablespoons sugar", "1/4 cup orange juice", "2 tablespoons port wine", "6 large egg whites", "1 pint strawberry ice cream or strawberry frozen yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the shortcake, preheat the oven to 375 degrees. Sift the flour into the bowl of a food processor and add the sugar, baking powder and salt. Pulse to combine. Add the butter and pulse until the mixture resembles coarse bread crumbs. Pour in the cream and process just until the mixture begins to pull away from the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a lightly floured surface and shape into a ball. Divide into 4 equal portions and shape each into a round about 4 inches in diameter and 1/2 inch thick. Transfer to a parchment-lined baking sheet and bake until just golden, about 15 to 20 minutes. Transfer to a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the topping, combine the strawberries, 2 tablespoons of the sugar, the orange juice and port and set aside to marinate for 30 minutes. Meanwhile, preheat the oven to 450 degrees. Place the egg whites in the bowl of an electric mixer and beat until they hold soft peaks. Beat in the remaining sugar 1 tablespoon at a time. Set meringue aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shortcake rounds on a cookie sheet. Pile each with strawberries and spoon some of the strawberry juice over the shortcakes. Top each with a scoop of ice cream and cover each with a generous layer of meringue (you may have some meringue left over). Use the back of a spoon to make decorative swirls in the meringue. Bake immediately until the meringue is delicately browned, about 4 to 5 minutes. Serve at once with chocolate sauce (recipe follows) on the side."}], "link": "https://cooking.nytimes.com/recipes/8897-baked-strawberry-alaska"}