{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Pork With Turnips", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "chicken stock, pork, turnip, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 544, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "3 grams", "proteinContent": "31 grams", "saturatedFatContent": "13 grams", "sodiumContent": "913 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon neutral oil, like canola", "1 tablespoon butter (or another tablespoon of oil)", "1 1/2 pounds boneless pork (shoulder or loin), trimmed of excess fat and cut into 1- to 1 1/2-inch chunks", "1 1/2 pounds purple-top turnips or rutabagas, peeled and cut into 1-inch chunks", "3/4 cup white wine, chicken stock or water", "Salt and freshly ground black pepper to taste", "2 tablespoons minced fresh lovage, celery leaves or parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 12-inch skillet, preferably nonstick, over medium-high heat, and heat at least a minute. Add the oil and butter. When the butter foam subsides or the oil is hot, add the pork a few chunks at a time. When it is all in the skillet, turn the heat to high. Cook about 5 minutes, undisturbed, until the pork is nicely browned on one side. Turn each piece, return the heat to medium-high and cook about 3 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the turnip chunks, and shake the skillet so that the pork and turnips are all sitting in one layer, or nearly so. Cook another 3 or 4 minutes, or until turnips begin to brown. Add the liquid, and stir once or twice. Add salt, pepper and half the herb, turn heat to medium-low and cover skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, stirring every 10 minutes, until both pork and turnips are quite tender, about 30 minutes. Remove the cover, and raise the heat to medium-high; boil the liquid until it is reduced to a syrupy glaze. Taste and add more salt and pepper if necessary; then, garnish with the remaining herb and serve."}], "link": "https://cooking.nytimes.com/recipes/8905-braised-pork-with-turnips"}