{"@context": "http://schema.org", "@type": "Recipe", "name": "Mint Chocolate Chip Ice Cream", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT1H", "recipeYield": "About 1 1/2 quarts", "recipeCuisine": "american", "recipeCategory": "ice creams and sorbets, project", "keywords": "chocolate chips, heavy cream, mint, dessert, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 337, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "16 grams", "sodiumContent": "30 milligrams", "sugarContent": "21 grams", "transFatContent": null}, "recipeIngredient": ["1 quart heavy cream", "5 cups packed fresh mint leaves (about 4 ounces), coarsely chopped", "1 cup sugar", "10 large egg yolks", "10 ounces bittersweet chocolate, chopped", "1 cup whole mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium saucepan, bring cream and chopped mint to a simmer. Turn off heat, and let steep 5 minutes. Strain out mint, and return cream to saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3/4 cup sugar to cream, and bring to a simmer. Whisk together egg yolks and remaining sugar. Remove cream from heat, and add a little to egg mixture to warm, stirring constantly to keep yolks from cooking. Pour egg mixture into cream, stirring constantly. Return custard to heat, and cook over low heat, stirring constantly with a wooden spoon, until mixture thickens enough to coat back of spoon. Remove from heat, and pour into bowl. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain custard, then chill until thoroughly cold, at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare mint chips. Melt chocolate in top of double boiler over simmering water. Cool slightly. Lay a 12-by-24-inch sheet of parchment paper on a work surface. Pour melted chocolate onto parchment, spreading evenly to cover entire surface. Lay mint leaves onto chocolate until half the surface is covered, being careful not to overlap. Lift parchment, and lay plain chocolate over mint-covered chocolate to cover. Place in refrigerator for 20 minutes to set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chocolate from refrigerator, and peel off parchment. Break chocolate into large pieces, and then roughly chop. Refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze ice cream mixture in an ice cream maker, following manufacturer's instructions. Using a spatula, fold in chocolate mint chips by hand. Place in freezer for at least 2 hours before serving."}]}