{"@context": "http://schema.org", "@type": "Recipe", "name": "Il Mulino's Tartuffo", "description": "At a few spots in New York, the tartuffo rises to exceptional heights. At Il Mulino in the Village, the kitchen pays attention to the last course and transcends the customarily disappointing Italian dessert tray. Here, by combining tartuffo with a superbly foamy zabaglione, which is then strewn with crushed amaretti and fresh berries, dessert would seem reason enough to go to the restaurant.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT4H", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "berries, chocolate, ice cream, dessert, side dish, spring", "aggregateRating": null, "recipeIngredient": ["1/2 gallon good vanilla ice cream", "1/2 gallon good chocolate ice cream", "3 brandied Italian sour cherries (amarena), drained and halved", "1 1/2 teaspoons toasted slivered almonds", "1 pound Callebaut dark Belgian chocolate or other good chocolate", "1/2 cup vegetable oil", "1 Zabaglione (<a href=\"http://cooking.nytimes.com/recipes/8919-zabaglione\">see recipe</a>) OR", "1 Whipped cream (<a href=\"http://cooking.nytimes.com/recipes/8920-whipped-cream\">see recipe</a>)", "Seasonal berries", "2 crushed amaretto cookies", "Confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least a day ahead of serving, shape the ice cream by arranging 6 squares of plastic wrap on a countertop and placing about 3/4 cup of vanilla ice cream in the center of 3 squares and 3/4 cup of chocolate ice cream in the center of each remaining square. Bring the wrap around the ice cream and twist the ends together to enclose. Mold each into a sphere (the shape doesn't have to be perfect at this point) and freeze for 1 hour. Line a baking sheet with waxed paper. Unwrap and cut each ball in half. Push half a cherry and 1/2 teaspoon of slivered almonds into the middle of each vanilla half. Press a chocolate half over each, rewrap and freeze on a prepared baking sheet for at least 6 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To coat the ice-cream balls, melt the chocolate in the oil in the top of a double boiler over simmering water. Remove from the heat and cool to room temperature. Quickly dip each ball into the mixture and place on the prepared baking sheet. Freeze 2 hours to harden and then wrap in wax paper and store in the freezer until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Right before serving, split open each ball into quarters. Ladle the zabaglione or whipped cream to one side. Garnish with berries, cookies and confectioners' sugar."}], "link": "https://cooking.nytimes.com/recipes/8918-il-mulinos-tartuffo"}