{"@context": "http://schema.org", "@type": "Recipe", "name": "Hazelnut Tartuffo", "description": "Although originally made by surrounding a sour cherry with chocolate ice cream, then encrusting it with a chocolate shell, the variations on tartuffo are as myriad as they are on a sundae -- the ice cream can be any flavor and so can the shell. You can freeze coconut ice cream or strawberry or Burpled Rumple; bury a fruit or a nut inside or not; helmet it with dark or white chocolate or liquefied lemon. As long as it's a globe and cold and the inside is softer than the out, it's tartuffo.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT9H", "recipeYield": "5 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "chocolate chips, hazelnut, heavy cream, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 775, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "87 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "16 grams", "sodiumContent": "548 milligrams", "sugarContent": "51 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 quart Ciao Bella hazelnut biscotti gelato", "5 brandied Italian sour cherries (amarena), drained", "1/2 cup chopped semiweet chocolate or chocolate chips", "3/4 cup heavy cream", "1/2 cup ground skinned and roasted hazelnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least a day ahead of serving, shape the gelato into balls by arranging 5 squares of plastic wrap on a countertop and placing a portion of the gelato in the center of each. Bring the wrap around each and twist together to enclose. Mold each into a ball (the shape doesn't have to be perfect at this point), unwrap and push a cherry into each center. Rewrap. Place the balls on a baking sheet and freeze for at least 6 hours, rounding out the shape for the first hour. Remove plastic wrap from balls after about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the ganache coating, melt the chocolate in the top of a double boiler over simmering water and whisk in 1/2 cup heavy cream until completely smooth. Remove from the heat and cool completely. (Do not refrigerate.) The mixture should be about 70 degrees and will be thick enough to make a ribbon on itself when the whisk is lifted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with waxed paper. Working with one ball at a time, dip into the ganache to coat. Immediately sprinkle with some hazelnuts. Freeze 2 hours to harden and then store in a covered container in freezer until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm the remaining 1/4 cup of heavy cream and whisk into remaining ganache. Add the remaining hazelnuts. Serve as a sauce for tartuffo."}], "link": "https://cooking.nytimes.com/recipes/8921-hazelnut-tartuffo"}