{"@context": "http://schema.org", "@type": "Recipe", "name": "Vitello Tonnato", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "carrot, veal, white wine, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 875, "unsaturatedFatContent": "58 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "75 grams", "fiberContent": "1 gram", "proteinContent": "37 grams", "saturatedFatContent": "13 grams", "sodiumContent": "732 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups dry white wine", "1 stalk celery, roughly chopped", "1 medium onion, peeled and cut into quarters", "1 carrot, roughly chopped", "1 leek, white part only, rinsed and chopped", "4 sprigs marjoram", "4 sprigs thyme", "5 cloves garlic, peeled", "2 to 2 1/2 pounds veal roast, top round, trussed (it should be no thicker than 3 inches", "2 egg yolks at room temperature", "Sea salt", "2 1/4 cups extra virgin olive oil", "5 tablespoons freshly squeezed lemon juice", "1 7-ounce can tuna packed in oil", "5 anchovy fillets", "3 tablespoons capers, drained", "Thin slices of lemon, pitted black olives sliced thinly, capers, parsley leaves or anchovy fillets, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot just large enough to fit veal, put wine, celery, onion, carrot, leek, marjoram, thyme and garlic. Add 3 inches of water, and bring to a boil. Add veal, and bring back to a boil. Immediately turn off heat, cover pot and let veal cool in its liquid 2 to 3 hours. When completely cool, thinly slice veal. Slices should be about 1/16 to 1/8 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While veal cools, make sauce: In a large bowl, whisk together egg yolks and 1/4 teaspoon salt until pale yellow and the consistency of cream. Beginning a drop at a time, add 1 1/4 cups oil, whisking continually. As mixture thickens, you can add oil more quickly. When it gets quite thick, whisk in 1 tablespoon lemon juice. Continue adding oil until all of it has been absorbed and mayonnaise is quite thick and shiny. Whisk in another tablespoon of lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain tuna, and put it in a food processor with anchovies, remaining cup olive oil, remaining lemon juice and capers. Process until you get a creamy, uniformly blended sauce. Scrape sauce into bowl with mayonnaise and fold to combine. Taste. It should be quite tangy and highly seasoned. Refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble dish: remove 3/4 cup sauce, and reserve to serve alongside veal. Smear bottom of a large serving platter with some of the remaining tuna sauce. Place a layer of veal slices on top, meeting edge to edge without overlapping. Cover with sauce, then make another layer of meat and sauce. Repeat until all the meat is used. Leave yourself enough sauce to blanket top layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with plastic wrap, and refrigerate for at least 24 hours. Bring to room temperature before serving. Garnish with some or all suggested ingredients. Serve with reserved sauce on the side."}]}