{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Veal Soup With Salsa Verde", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "mexican", "recipeCategory": "project, soups and stews", "keywords": "appetizer, celery, peppercorns, veal, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 402, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "40 grams", "saturatedFatContent": "6 grams", "sodiumContent": "538 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ounces kosher salt", "2 ounces sugar", "2 to 2 1/2 pounds veal roast, top round, trussed", "1 bay leaf", "10 peppercorns", "2 stalks celery, very thinly sliced diagonally", "1/4 cup almonds", "2 1/2 cups packed parsley leaves", "1/2 cup lovage leaves (if available)", "2 tablespoons capers", "about 1 1/2 tablespoons extra virgin olive oil", "Sea salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Four days before: In a large bowl or plastic container, combine kosher salt, sugar and 2 quarts water. Stir until sugar and salt are dissolved. Using a meat syringe, inject some brine into 4 to 6 places in veal. Place veal in brine; refrigerate 4 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove veal from brine, rinse and place in a bowl. Cover with water; let sit 10 minutes. Remove from water, place in a deep pot, and cover with cold water by 1 inch. Add bay leaf and peppercorns, and heat gently over medium heat, skimming occasionally. Do not boil; keep at a bare simmer. Cook until a thermometer inserted into center of meat reads 160 degrees, about 1 hour. Transfer veal to a medium bowl, and strain half the cooking liquid over veal. Let cool. Return pot to stove, and taste remaining cooking liquid. If salty, add water until it tastes balanced. Bring to a simmer. Place celery in a bowl or container large enough to hold broth. When it just reaches a simmer, strain into bowl with celery. Let cool. Then separately chill veal with its liquid, and celery with its broth, in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make salsa verde: Preheat oven to 350. Place almonds on a cookie sheet, and toast in oven, about 5 minutes. Remove from oven, and pour warm almonds into a food processor (or mortar). Let almonds cool a few minutes. Then, while warm, add parsley, lovage, capers and 1 tablespoon olive oil, and pulse until coarse (or pound with a pestle). Sauce should be dry and coarse, just bound with olive oil, so add oil sparingly, a few drops at a time. Season with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Remove veal from liquid; carve into 1/8-inch slices. Ladle a 1/2 inch of broth and celery into each of six bowls. In each, arrange three slices, overlapping (so that some is above liquid). Dollop about 1 tablespoon of salsa verde on veal. Serve."}]}