{"@context": "http://schema.org", "@type": "Recipe", "name": "Breaded Oysters With Spinach", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, bread crumbs, oyster, spinach, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 828, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "5 grams", "proteinContent": "46 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1391 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["24 large oysters, like Malpeques, Belons or bluepoints", "1 egg", "1 1/2 cups fresh bread crumbs", "Juice of one lemon", "10 tablespoons butter", "2 tablespoons olive oil", "4 cups fresh spinach leaves (one pound), washed, drained and trimmed", "Salt and freshly ground pepper", "Pinch of paprika"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the palm of your hand with a folded kitchen towel, and place an oyster in the center. With an oyster knife, scrape away any barnacles. Wipe the knife and thrust it into the hinge of the shell. Run the knife around the oyster and flip it open. Discard the top shell. Cut the muscle that holds the meat to the shell and transfer the meat and oyster brine to a saucepan. Repeat with remaining oysters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the saucepan over medium heat, bring the juices to a simmer and poach the oysters 1 minute, flipping them once while cooking. Transfer the oysters to a plate, and reserve the juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small mixing bowl, beat the egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip the oysters in the egg. Then, dredge them in the bread crumbs, tapping to remove excess. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the reserved cooking juices through a fine sieve into a small saucepan, and cook over medium heat until reduced to about 1/2 cup. Using a wire whisk, beat in the lemon juice and 6 tablespoons butter, 1 tablespoon at a time. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick pan over medium-high heat, heat the olive oil and add the spinach. Cook, stirring, until just wilted and season to taste with salt and pepper. Remove and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another nonstick pan large enough to hold the oysters in a single layer, melt the 4 remaining tablespoons butter over high heat. When the butter begins to bubble, add the oysters and cook on one side until slightly browned, about 1 1/2 minutes. Flip the oysters gently, and cook a minute or so, just until golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the spinach over 4 warmed serving plates. Spoon the sauce around the spinach. Arrange 6 oysters on each plate over the sauce. Sprinkle the border of the plate with paprika for color."}], "link": "https://cooking.nytimes.com/recipes/897-breaded-oysters-with-spinach"}