{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted and Caramelized Pears", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, heavy cream, lemon, pear, spring", "aggregateRating": null, "recipeIngredient": ["1 lemon", "6 Bosc pears", "1 1/2 cups sugar", "1 tablespoon cider vinegar", "1/2 cup water", "1/4 cup heavy cream", "Vanilla ice cream or frozen yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with water and squeeze a lemon into it. Peel each pear, leaving a small crown of skin around the stem. Carefully core each, keeping pear intact. As the pears are peeled, place in the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large nonreactive ovenproof skillet, combine sugar, vinegar and 1/2 cup of water. Cook, without stirring, over medium heat until mixture is lightly caramelized. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While caramel is cooking, remove pears from water, draining them well. When caramel is done, roll pears in caramel, turning them with 2 wooden spoons. Do not touch caramel. Stand pears up in the pan, place pan in oven, and roast pears about 45 minutes, basting them frequently with caramel in the pan, until they are tender and golden brown. Keep the basting spoon in a dish of warm water to prevent it from getting sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using wooden spoons, carefully transfer pears to a rack placed over a sheet of foil, and allow them to drain. Return skillet to top of stove, whisk in the cream and bring to a simmer. Set aside until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve pears with warm sauce and vanilla ice cream or frozen yogurt on the side."}]}