{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp and Tomato Tartlets", "description": "This is not difficult to make if you are organized. I first prepared these while staying at the magnificent Chateau de Pray near the Loire Valley city of Amboise. This region is famous for crisp tart wines like Sancerre and the sweeter Vouvray, as well as cheese and freshwater fish and shellfish.\n\nThe pastry dough can be made in a few minutes with a food processor; it can be done in advance and chilled. The tomato-based filling can also be made in advance. At the last minute, the tart shells are filled and baked. The shrimp are quickly sauteed and flavored with curry and then distributed over the finished tartlets. These tartlets look terrific and can be garnished in any number of ways -- maybe with red radicchio and green bibb lettuce.", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, jumbo shrimp, tomato, winter", "aggregateRating": null, "recipeIngredient": ["1 cup all-purpose flour, plus flour for working the dough", "6 tablespoons butter, chilled and cubed", "1/2 cup Gruyere cheese, grated", "1/4 teaspoon salt", "Tomato compote <a href=\"http://cooking.nytimes.com/recipes/900-tomato-compote\">(see recipe)</a>", "1 tablespoon olive oil", "16 jumbo shrimp (shelled), or scallops, crab meat, lobster or other shellfish", "1/4 teaspoon curry powder", "Salt and freshly ground pepper to taste", "2 cups lamb's lettuce or bibb lettuce", "Vinaigrette <a href=\"http://cooking.nytimes.com/recipes/899-lemon-vinaigrette\">(see recipe)</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the flour, butter, cheese and salt in the container of a food processor, and blend until a ball forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dough, and chill for half an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is ready, heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough ball to a floured surface, and flatten it slightly with the palm of your hand before beginning to roll. Sprinkle the dough with flour, and roll it evenly, making quarter turns after every few rolls. The dough should be about 1/8 inch thick. Using a 3- to 3 1/2-inch cookie cutter, cut out 4 circles to fit individual tartlet molds of roughly the same measurement. Lift the dough circles carefully with a spatula, and place them in the individual molds, pressing the dough into the molds firmly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill each tart shell with about 3 tablespoons of tomato compote. Bake about 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the olive oil and the shrimp into a nonstick pan over high heat. Sprinkle the shrimp with curry powder. Season with salt and pepper. Cook, stirring, 2 to 3 minutes; do not overcook. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, toss the lettuce and vinaigrette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold the tartlets, and place in the middle of serving plates. Top each tartlet with 4 shrimp. Arrange some lettuce decoratively around tartlets."}]}