{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple-and-Bread Dumplings in Juniper-Scented Chicken Broth", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, project", "keywords": "appetizer, apple, bread dumplings, chicken broth, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 373, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "15 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1390 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["31-day-old Kaiser or other white bread rolls (about 12 ounces), thickly sliced", "1 tablespoon vegetable oil", "1/2 small Spanish onion, minced", "1 clove garlic, minced", "1 Granny Smith apple, peeled, cored and cut into small dice", "1/4 cup coarsely chopped flat-leaf parsley", "1/2 cup whole milk", "2 teaspoons juniper berries, crushed", "4 cups homemade or low-sodium canned chicken broth", "Kosher salt and freshly ground pepper", "1 large egg, beaten", "1/4 cup all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Arrange the bread slices on a baking sheet and bake until dry, about 30 minutes. Remove from the oven and cool enough to handle. Cut bread into large cubes and transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, over medium-high heat, heat 1 tablespoon oil. Add the onion and garlic and cook, stirring, until lightly browned, about 2 minutes. Add the apple and cook, stirring, until somewhat soft, about 2 minutes more. Add 3 tablespoons of parsley and the milk and bring to a boil. Pour the boiling mixture over the bread, stir to combine and let sit for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the juniper berries and broth in a saucepan and bring to a boil. Remove from heat and set aside, covered, for 10 minutes. Strain broth and discard the juniper. Return broth to the saucepan. Season with salt and pepper to taste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil, then lower the heat to a simmer. Season the bread mixture with salt and pepper to taste and stir in the egg. Using wet hands, form the bread mixture into 8 firmly packed balls. Place flour on a plate. Roll the balls in the flour. Cook in the simmering water until firm, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, remove the dumplings from the water and divide among 4 soup bowls. Reheat the broth over high heat and pour it over them. Sprinkle with the remaining 1 tablespoon parsley and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/8986-apple-and-bread-dumplings-in-juniper-scented-chicken-broth"}