{"@context": "http://schema.org", "@type": "Recipe", "name": "Juniper-and-Beer-Braised Short Ribs", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "beef short ribs, juniper berries, onion, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "recipeIngredient": ["3/4 cup plus 2 tablespoons vegetable oil", "3 1/2 pounds beef short ribs, trimmed of excess fat", "Kosher salt and freshly ground pepper", "1/2 cup all-purpose flour", "1/2 large Spanish onion, coarsely chopped", "1 small carrot, peeled and coarsely chopped", "1 rib celery, coarsely chopped", "2 teaspoons tomato paste", "1 1/2 teaspoons juniper berries, crushed", "5 sprigs fresh thyme", "1 12-ounce bottle dark beer", "1 1/2 cups homemade or low-sodium canned chicken broth", "1 teaspoon honey", "Chopped parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. In a Dutch oven or large casserole with a tightly fitting lid, over high heat, heat 3/4cup of the oil. Sprinkle the ribs with salt and pepper. Place the flour on a plate. Roll ribs in flour until well coated. Working in 2 batches, cook the ribs, turning occasionally until well browned, 7 minutes per batch. Using tongs, transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the oil and return the Dutch oven to medium-high heat. Add the remaining 2 tablespoons oil and the onion, carrot and celery. Cook, stirring, until soft and brown, about 7 minutes. Add the tomato paste and cook, stirring, about 1 minute more. Return the ribs to the Dutch oven, add the juniper, thyme, beer and broth. Bring to a boil, cover, place in the oven and bake until tender, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the ribs to a baking sheet, cover with foil and keep warm. Using a sieve over a saucepan, strain the liquid. Place saucepan over high heat, bring to a boil and cook, uncovered, until reduced to 1 cup, about 8 minutes. Season with salt and pepper to taste and stir in the honey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the ribs to a serving platter, pour the reduced beef liquid over them and sprinkle with parsley. Serve with buttered pasta, rice or mashed potatoes."}], "link": "https://cooking.nytimes.com/recipes/8987-juniper-and-beer-braised-short-ribs"}