{"@context": "http://schema.org", "@type": "Recipe", "name": "Gnocchi With Scallops", "description": "", "author": {"@type": "Person", "name": "Maura Egan"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "fall, flour, potato, sea scallop, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "7 grams", "proteinContent": "24 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1214 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds potatoes", "Salt and pepper to taste", "1 1/2 cups all-purpose flour, plus extra for shaping dumplings", "1/4 cup freshly grated Parmigiano-Reggiano", "1 egg, lightly beaten", "16 large sea scallops", "2 medium yellow squash", "2 medium zucchini", "2 ounces unsalted butter", "1 large clove garlic, minced", "1/8 teaspoon freshly grated nutmeg", "lemon and orange zest for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the unpeeled potatoes in a saucepan and cover with cold water. Add 2 teaspoons salt, cover and heat to boiling. Simmer over medium heat until tender, about 40 minutes. Drain and peel while hot. Pass through a ricer or food mill to make a high mound in a bowl. Sprinkle the potatoes with 1 cup of the flour and cheese. Make a small crater in the center of the mound and add the egg. With your hand, gradually draw the potatoes around the outside of the mound into the egg and knead to mix, sprinkling with 1/2 cup more flour. Knead dough in bowl until smooth, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 8 equal pieces. Flour work surface and hands, and working with one piece of the dough at a time, roll to a 1-inch-thick rope. (If dough is sticky, sprinkle with additional flour.) Cut rope crosswise into 3/4-inch-wide pieces. Working with one dumpling at a time, dip in flour and press lightly onto a grater or the back of a fork so that a fingertip leaves an indentation. Repeat with the remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large kettle of water to boiling. While water heats, slice the scallops, yellow squash and zucchini into 1/2-inch rounds and then quarter the rounds from cut side. Place the pieces in a skillet with butter and garlic and sauté over medium-low heat for about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, cook the dumplings, in about 4 batches, until they float to the surface; cook for 30 seconds. Remove with a strainer and drain while the next batch cooks. Place the dumplings on a large platter and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: season the scallop mixture with nutmeg, salt and pepper and pour over dumplings. Garnish with lemon and orange zest."}], "link": "https://cooking.nytimes.com/recipes/9019-gnocchi-with-scallops"}