{"@context": "http://schema.org", "@type": "Recipe", "name": "Tiny Pancakes For Caviar", "description": "Eating caviar in a restaurant or supplying it for a group of people is extravagant to the point of recklessness. Buying a small tin and demolishing it entirely yourself is hedonistic heaven. I love these pancakes with caviar. Unlike regular blini, they do not need yeast, so they take only a few minutes to rustle up. I think of them as potato pancakes, but actually they use only a little potato starch, not real potatoes. They are very plain and not enormously potatoey, but they are the best carrier imaginable for anything salty. (Try them with sour cream and lox.)", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/caviarpancakes/caviarpancakes-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "24 2-inch pancakes", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, caviar, eggs, flour, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 25, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "37 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup potato starch", "1/2 cup all-purpose flour", "Pinch of salt", "1/2 teaspoon baking powder", "1/4 teaspoon baking soda", "2/3 cup buttermilk", "1 large egg", "1 tablespoon melted butter, more for greasing griddle", "Caviar and sour cream for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In mixing bowl, combine potato starch, flour, salt, baking powder and baking soda. In separate bowl, mix buttermilk, egg and 1 tablespoon melted butter. Pour wet ingredients into dry, and whisk into a batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a griddle or skillet over medium heat, and brush with melted butter. When griddle is hot, spoon scant tablespoons of batter onto it, about 2 inches apart. After a few minutes pancakes will rise. There will not be many bubbles on the surface. When bottoms are set and golden brown, flip them over, and cook until the other side is golden brown. Serve with caviar and sour cream. Pancakes may be frozen."}]}