{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Kale", "description": "Kale: The ubiquitous dark and leafy green that people either love or love to hate. If you fall into the latter camp, this recipe for a savory-sweet variation adapted from North Pond, a restaurant in Chicago, might change your mind. It requires a bit more work than a typical garlic and olive oil sauté, but it's well worth it. Start with blanching the kale in a pot of boiling water (skip this if you don't mind your kale a bit more toothsome). Sauté some onion, carrot and celery in a little oil, then add 1/3 cup sherry vinegar and reduce. Toss in the kale with a little honey, chicken broth and salt and pepper, then cook until the leaves are tender. At this point, you can either go ahead and eat it, or do as they do at the restaurant: strain the liquid and reduce to make a flavorful sauce to pour over the greens.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2009/03/02/health/02recipehealth_600.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, vegetables", "keywords": "celery, chicken broth, kale, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 139}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "551 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "8 ounces dinosaur or lacinato kale leaves, stems removed", "1 tablespoon vegetable oil", "1/2 medium onion, cut into large dice", "1/2 medium carrot, cut into large dice", "1/2 celery stalk, cut into large dice", "1/3 cup sherry vinegar", "2 cups chicken broth", "1 to 3 tablespoons honey, to taste", "Pinch of ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil. Meanwhile, set aside a large bowl of ice water. Add kale to boiling water, return to a boil, and after 1 minute transfer to ice bath. Drain well, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan, heat oil over low heat and sauté onion, carrot and celery until just softened. Add sherry vinegar and cook until reduced by two-thirds. Add kale and stir to coat, then add chicken broth, honey, 2 teaspoons salt and the pepper. Bring to a simmer and cook, partly covered, until kale is tender, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer kale leaves to a warm bowl, leaving onion, carrot and celery in broth. Strain broth, discarding solids. If there is more than * cup, it may be boiled in a small saucepan until reduced. Adjust salt and pepper as needed, and pour over kale. Serve immediately, or cover and refrigerate for up to 24 hours; gently reheat before serving."}], "link": "https://cooking.nytimes.com/recipes/9058-braised-kale"}