{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Scallop Sandwiches With Citrus Juices", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "citrus, potato, sea scallop, main course, summer", "aggregateRating": null, "recipeIngredient": ["4 large baking potatoes, peeled and washed", "8 large, very fresh sea scallops, sliced into 1/2-inch disks", "2 tablespoons superfine flour (like Wondra)", "1/2 teaspoon kosher or sea salt", "Freshly ground white pepper", "2 cups safflower or other vegetable oil", "Citrus sauce (<a href=\"http://cooking.nytimes.com/recipes/9095-citrus-sauce\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Have all ingredients and utensils ready because it is important to work quickly. Finely shred the potatoes, using a grater, food processor or mandoline. Place in the center of a clean kitchen towel. Pull up the corners of the towel, and squeeze all of the water from the shredded potatoes. Fluff up the potatoes, and divide them in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a baking sheet divide half of the potatoes into 8 small mounds. Dust each mound with a bit of the flour. Place 2 slices of scallop on each mound. Season liberally with salt and pepper. Place the remaining potatoes evenly over the scallops to make 8 sandwiches. Season lightly with salt and pepper, and dust with a pinch of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 9- or 10-inch saute pans over medium heat, and add 1 cup of oil to each pan. Heat until almost smoking. Carefully place 4 sandwiches in each pan with a spatula, making sure they keep their shape. Reduce the heat slightly. Cook until golden brown and crisp on the bottom, 3 to 4 minutes. Carefully turn the sandwiches, using 2 spatulas. Brown the other side, about 3 minutes. Remove from the pans, and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl the sauce in circles onto each of 4 plates. Place 2 sandwiches on each plate, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9094-sea-scallop-sandwiches-with-citrus-juices"}