{"@context": "http://schema.org", "@type": "Recipe", "name": "Saucissons a l'Ail (French garlic sausages)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H", "recipeYield": "5 sausages", "recipeCuisine": "french", "recipeCategory": "", "keywords": "lean beef, pork butt, pork fatback", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1260, "unsaturatedFatContent": "57 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "94 grams", "fiberContent": "0 grams", "proteinContent": "93 grams", "saturatedFatContent": "33 grams", "sodiumContent": "1390 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound skinless fatback about one inch thick", "2 1/4 pounds fairly but not totally lean pork butt (there should be about one-quarter fat), cut into one-inch cubes", "2 1/4 pounds lean beef, cut into one-inch cubes", "Salt to taste, if desired", "1 teaspoon freshly ground pepper, preferably white", "1 teaspoon finely minced garlic", "1/4 cup potato starch, cornstarch or arrowroot", "1 1/4 cups ice cold water", "8 feet natural beef round sausage casings, 40 to 43 millimeters in diameter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the fatback into the thinnest possible slices. Cut the slices into the thinnest possible strips. Stack the strips uniformly and cut them into the finest possible dice, about 1/16th-of-an-inch cubes. There should be about three cups. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pork, beef, salt, pepper and garlic into a mixing bowl. Add the diced fatback. Blend the potato starch and ice water and add it to meat mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the sausage casings into five lengths of about 18 inches each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Outfit a meat grinder (see an alternative technique for stuffing sausages) with a medium cutting blade and add the sausage stuffer, screwing it on securely. Slip the sausage casing onto the stuffer. Tie it at the end."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the meat cubes with seasonings and liquid to the open feeder of the grinder, grinding constantly, allowing the casing to be filled to a length of 15 inches. Cut off the end of the casing and tie it on both ends. Repeat this action, cutting off each sausage with a 15-inch length and tying at the end. This will make about five sausages weighing about one and one-quarter pounds each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the garlic sausages, bring enough water to the simmer to cover one or more sausages. Add the sausage or sausages and let simmer (the ideal temperature is 180 degrees) for 30 minutes. Serve sliced. The sausages could also be grilled until done or they may be smoked. If they are to be smoked, use a home smoker and follow the manufacturer's instructions."}], "link": "https://cooking.nytimes.com/recipes/91-saucissons-a-lail-french-garlic-sausages"}