{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Chicken With Rice", "description": "You can make a big deal out of chicken with rice -- at its zenith, it becomes paella -- but it is a dish that takes well to short cuts. And even at its simplest, it's a crowd-pleaser.\n\nFor fast weeknight meals, I strip chicken and rice to its essentials: oil, onion, chicken and rice. Stock makes the best cooking liquid, but water works almost as well, because as it simmers with the chicken they combine to produce a flavorful broth. To reduce greasiness, I remove the skin from the chicken before cooking it. (In a moist dish like this one, the skin is not especially appetizing anyway.)\n\nYou can easily vary this dish by using any stock instead of water; by substituting another grain, like pearled barley, for the rice; by sautéing or roasting the chicken separately and combining it with the rice at the last minute; by adding sausage or shellfish, like shrimp, along with the chicken, or, most excitingly, by adding strips of red pepper, pitted olives, capers, chopped tomatoes or shelled peas to the initial onion mix.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/12/dining/Chicken-With-Rice-The-Easy-Way/Chicken-With-Rice-The-Easy-Way-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weeknight", "keywords": "chicken, onion, rice, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1116}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 581, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "1 gram", "proteinContent": "32 grams", "saturatedFatContent": "8 grams", "sodiumContent": "578 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons olive oil", "2 medium onions, about 8 ounces, peeled and sliced", "Salt and freshly ground black pepper", "1 chicken, cut up into serving pieces", "1 1/2 cups white rice", "Pinch saffron, optional", "Freshly minced parsley or cilantro for garnish", "Lemon or lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set 3 cups of water to boil. Place olive oil in a large skillet that can be covered, and turn heat to medium-high. Add onions and a sprinkling of salt and pepper. Cook, stirring occasionally, until onions soften and become translucent, 5 to 10 minutes. Remove skin from chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice to onions; stir until each grain glistens; sprinkle with saffron, and stir. Nestle chicken in rice, add a little more salt and pepper and pour in the boiling water. Turn heat to medium-low, and cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook 20 minutes, until all water is absorbed and chicken is cooked through. (You can keep this warm over a very low flame for another 15 minutes; it will retain its heat for 15 minutes beyond that.) Garnish and serve with lemon or lime."}]}