{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Braised with Turnips and Shallots", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project, roasts", "keywords": "duck, shallot, turnip, main course, winter", "aggregateRating": null, "recipeIngredient": ["1 5-pound duck, cut up, backbone and wing tips removed", "Salt and freshly ground black pepper", "8 shallots (about 10 ounces), peeled", "6 medium-size white turnips (about 1 pound), trimmed, peeled and quartered", "1/2 cup dry red wine", "8 cloves garlic", "3/4 cup well-seasoned duck, veal or chicken stock", "5 sprigs fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim excess fat from duck and reserve. Season flesh side with salt and pepper. Place a 4-quart oven-proof casserole over medium-high heat, and put a 2-inch piece of fat in casserole; when fat starts to render, remove it. Add duck pieces, skin side down, and sear without turning until skin is golden brown. Do not crowd duck; add pieces a few at a time. When duck is seared discard all but a thin film of the fat in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Place shallots and turnips in casserole and sear, turning gently, over medium heat until golden. Remove to a dish and season with salt and pepper. Pour wine into casserole and simmer briefly, scraping bottom of pan. Add garlic and stock. Return duck to casserole, skin side up. Add thyme, cover and bake 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove casserole from oven. Remove duck. Skim excess fat from casserole. Place shallots and turnips in casserole, place duck pieces on top of vegetables, cover and bake 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck from casserole and skim excess fat from sauce. Season to taste with salt and pepper. Return duck to casserole. Just before serving, reheat briefly on top of stove."}], "link": "https://cooking.nytimes.com/recipes/9120-duck-braised-with-turnips-and-shallots"}