{"@context": "http://schema.org", "@type": "Recipe", "name": "Lime-Leaf-Braised Veal Shanks", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "chicken stock, lime, veal shank, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 857, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "5 grams", "proteinContent": "105 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1975 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["7 cups chicken stock, homemade or low-sodium canned", "8 kaffir lime leaves", "1 stalk lemongrass, bulbous end only, coarsely chopped", "1 2-inch piece fresh ginger, peeled and coarsely chopped", "9 medium leeks, white part only, washed and coarsely chopped", "5 carrots, peeled and coarsely chopped", "4 tablespoons unsalted butter", "3 1/2 teaspoons kosher salt, plus more to taste", "1 teaspoon freshly ground black pepper, plus more to taste", "6 1/2-pound slices of veal shank from the thick end of the shank, about 2 inches wide", "1/4 cup flour", "Juice of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan combine the chicken stock and 4 kaffir lime leaves. Simmer for 45 minutes. Cool the broth to room temperature and remove the lime leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lemongrass, ginger and remaining lime leaves in the bowl of a food processor and process until very fine. Add the leeks and pulse to a coarse dice. Add the carrots and pulse to a coarse dice. Melt 2 tablespoons of butter in a pot large enough to hold the meat in one layer over medium heat. Stir in the processed vegetables. Season with 1/2 teaspoon of salt and 1/2 teaspoon of black pepper. Cook, stirring occasionally, for 15 minutes, until the vegetables are soft. Remove the vegetables and set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pot, melt 2 tablespoons of butter over medium-high heat. Season the meat with 1 teaspoon of salt and 1/4 teaspoon of pepper. Season the flour with 1 teaspoon of salt and 1/4 teaspoon of pepper. Lightly dust the meat with the flour. Place the meat in the pot to brown, and cook about 3 minutes per side. Set the meat aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 4 cups of the lime-leaf broth into the pot and bring to a boil using a wooden spoon to scrape any browned pieces from the bottom of the pot. Return the meat to the pot in one layer. Top with 2 cups of the cooked vegetables, reserving the rest. The broth should almost cover the meat. If it doesn't, add remaining broth. Simmer, covered, for 1 1/2 hours, until the meat is very, very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat to a platter. Strain the broth, discard the solids and skim off fat. Stir the reserved vegetables into the broth. Tear the meat into bite-size pieces, discarding the bones. Return the meat to the broth and heat through. Season with 1 teaspoon salt, pepper and lemon juice. Serve over steamed basmati rice."}]}