{"@context": "http://schema.org", "@type": "Recipe", "name": "Bay Apple Pie", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "1 9-inch pie", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, heavy cream, pie dough, dessert, side dish, spring", "aggregateRating": null, "recipeIngredient": ["2 1/2 cups all-purpose flour", "1 teaspoon kosher salt", "3/4 cup Crisco", "1 tablespoon heavy cream", "6 tablespoons unsalted butter", "12 medium Granny Smith apples, peeled, cored and cut into 1/3-inch wedges", "3/4 cup sugar, plus 1 teaspoon", "1/8 teaspoon allspice", "1/8 teaspoon mace", "1/4 teaspoon powdered ginger", "2 tablespoons all-purpose flour", "6 fresh bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crust, sift together the flour and salt. Cut the Crisco into the flour with a pastry cutter, until it has the grain of coarse cornmeal. Sprinkle with 8 tablespoons of water and blend it in with a fork. If the dough doesn't come together in a mass, stir in 1 more tablespoon of water. Shape the dough into a ball, divide into 2 pieces and pat them into disks. Wrap in plastic and refrigerate for 45 minutes. Roll out 1 disk of dough on a lightly floured piece of wax paper and fit it into a 9-inch pie pan. Preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling, melt half the butter in a large frying pan over high heat. Add half of the apples. Cook, stirring, for 2 minutes. Sprinkle the apples with 6 tablespoons of the sugar and cook for 3 to 5 minutes. When the apples begin to turn golden, place in a large bowl and reserve at room temperature. Repeat with remaining butter, apples and all but 1 teaspoon of the sugar. Combine all the apples. Stir in the allspice, mace and ginger and 2 tablespoons of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the apples into the crust and top with bay leaves. Roll out the remaining dough on a lightly floured piece of wax paper. Cut 4 small bay-leaf-shaped holes in the center, lay over the top of the pie and cut away excess dough. Use a fork to firmly press the top and buttom crust together. Brush the top with cream and sprinkle with remaining sugar. Bake for 10 minutes. Reduce the heat to 350 and bake for 40 to 50 minutes, until juices bubble. Cool before serving."}], "link": "https://cooking.nytimes.com/recipes/9154-bay-apple-pie"}