{"@context": "http://schema.org", "@type": "Recipe", "name": "Stone-Ground Grits With Poached Eggs and Shaved Summer Truffle", "description": "", "author": {"@type": "Person", "name": "Oliver Schwaner-Albright"}, "image": null, "totalTime": "PT40M", "recipeYield": "SERVES 2", "recipeCuisine": "southern", "recipeCategory": "brunch", "keywords": "eggs, grits, truffle, high fiber, side dish, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 725, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "12 grams", "proteinContent": "30 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1230 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups whole milk", "Salt", "1/2 cup instant coarse stone-ground grits", "4 slices hickory-smoked bacon", "2 large eggs", "Freshly ground black pepper", "1 ounce summer truffle, brushed or wiped with a paper towel (do not wash)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a 2-quart saucepan with 3 cups milk and add 1/4 teaspoon salt. Bring to a boil, and slowly stir in grits with a wooden spoon. Reduce heat to a bare simmer, and stir the grits twice every minute. (The grits may cake on bottom and sides, so scrape the pan well.) After 10 minutes, taste the grits and add salt as needed. After 20 minutes, the grits should be tender and maybe a little runny (they will continue to congeal as they cool). They will remain warm in the covered pan for another 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the grits are cooking, heat a cast-iron skillet over medium-high heat. Add the bacon and reduce heat to low; cook until just before desired crispness. (Residual heat will continue to cook the bacon after it is out of the skillet.) Cooking time varies according to bacon's thickness, but it should be at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a 7-inch stainless-steel or nonstick skillet with water to 12 inch below the rim. Place over medium heat and bring to a rolling boil. Crack the eggs on opposite sides of the pan; some of the white may break off and float to the top. Cook for 4 minutes for a thick but runny yolk, 6 minutes for a firm yolk. Remove with a slotted spoon and let sit on a small plate until water drains off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, scoop a generous dollop of grits into a shallow bowl. Place a bacon slice on opposite sides of the grits and top the grits with a poached egg. Season with salt and pepper. Present the plates at the table and, using a truffle shaver adjusted to its thinnest setting, shave the truffle over the eggs."}], "link": "https://cooking.nytimes.com/recipes/9155-stone-ground-grits-with-poached-eggs-and-shaved-summer-truffle"}