{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Gratin With Mascarpone Custard", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, side dish, eggs, mascarpone, pear, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1067, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "106 grams", "cholesterolContent": null, "fatContent": "71 grams", "fiberContent": "6 grams", "proteinContent": "8 grams", "saturatedFatContent": "43 grams", "sodiumContent": "208 milligrams", "sugarContent": "91 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup milk", "2 egg yolks", "1 cup sugar", "1/4 cup flour", "1 cup mascarpone", "3 cups heavy cream", "1 teaspoon pure vanilla extract", "6 tablespoons unsalted butter", "1 cup sugar", "6 pears, peeled, halved lengthwise, cores removed", "2 pieces candied ginger, minced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the custard, heat the milk in a heavy saucepan until it is almost boiling. In a separate bowl, beat egg yolks until they are light and pale-colored. Beat sugar into the yolks, tablespoon by tablespoon. Add flour and beat until smooth. Add heated milk to the yolk mixture in a slow stream, beating constantly. Beat until smooth. Return the mixture to the saucepan and cook, stirring constantly, until mixture comes to a boil. Boil for 2 minutes. Remove from heat and chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mixture is thoroughly chilled, remove from refrigerator and whisk until smooth. Fold the mascarpone into the mixture. In a separate bowl, beat the cream until medium-stiff and fold into the custard mixture. Stir in vanilla and chill until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the gratin, preheat the oven to 450 degrees. Melt the butter in a large cast-iron skillet over medium heat. Add sugar and stir constantly until a golden brown caramel develops. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the pear halves, cut side down, on top of the caramel and scatter minced ginger, if desired, over the pears. Cover the pears with foil and bake for 15 minutes or until tender when pierced with a skewer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place two pear halves in each of six individual gratin dishes. Divide the caramel among the dishes. Pour about 1 cup of custard into each gratin dish, covering the pears. Place the gratin dishes on a baking sheet for easier handling and bake for 5 minutes. Remove from oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Change the oven setting to broil. Place gratins on the upper rack of the oven and broil carefully until the custard bubbles and browns, about 1 1/2 minutes. Watch very carefully; do not burn."}], "link": "https://cooking.nytimes.com/recipes/9157-pear-gratin-with-mascarpone-custard"}