{"@context": "http://schema.org", "@type": "Recipe", "name": "Spoon Lamb", "description": "Ana Sortun, the chef at Oleana restaurant in Cambridge, Mass., finished culinary school in Paris in 1988. But the education of her palate wasn't complete, she said, until she apprenticed herself to the Tunisian chef Moncef Meddeb in Boston, then began traveling to Turkey and Greece in the 1990's. \n\nNow, Ms. Sortun's food at Oleana is defined by its generous use of seasonings used in balance. Her signature lamb stew has a juicy dose of pomegranate, but its intensity is smoothed out with a final squeeze of lemon juice and (that old cooking school favorite) cold butter.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Spoon-Lamb/Spoon-Lamb-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "carrot, garlic, lamb, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1066, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "80 grams", "fiberContent": "2 grams", "proteinContent": "53 grams", "saturatedFatContent": "34 grams", "sodiumContent": "1134 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons canola oil", "6 lamb shoulder chops, 10 to 12 ounces each", "2 1/2 cups dry red wine", "1 tablespoon plus 1 teaspoon ground cumin", "6 cloves garlic, smashed", "2 carrots, peeled and thickly sliced", "1 large onion, peeled and quartered", "2 tablespoons pomegranate molasses (sold in Middle Eastern markets)", "4 tablespoons cold unsalted butter, cut into 4 pieces", "Salt and pepper to taste", "1 lemon, halved", "2 tablespoons finely chopped mint (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Heat 1 tablespoon oil in a large skillet over medium-high heat. Add 3 lamb chops and brown on both sides, about 4 minutes a side. Remove chops to a roasting pan big enough to hold all the lamb; they can be fitted in snugly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off any fat from skillet and deglaze with 1/4 cup red wine, scraping up browned bits. Pour over chops in roasting pan. Wipe skillet clean with paper towels and repeat with remaining 3 chops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle cumin over lamb in roasting pan. Add garlic, carrot, onion, remaining 2 cups wine and enough water to reach halfway up chops. Cover with two sheets of aluminum foil and seal tightly. Braise in oven 2 1/2 hours, until falling off bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lamb from pan and strain juices into a bowl. Reserve carrots and discard remaining solids. Refrigerate braising liquid until fat rises to surface and can be skimmed off and discarded, at least 1 hour or up to 2 days. (Lamb and carrots can be refrigerated separately.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet big enough to hold lamb, simmer liquid until reduced by about half and thickened but not syrupy. Stir in pomegranate molasses and butter and season with salt and pepper. Squeeze in one lemon half. Taste and add more lemon and salt, if necessary. Reheat lamb and carrots in sauce over low heat, turning occasionally, for 10 minutes. Serve, sprinkled with mint, if desired."}], "link": "https://cooking.nytimes.com/recipes/9184-spoon-lamb"}