{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Halibut With Rosemary Served With Parsnip Purée", "description": "In this case do not add ginger to the parsnip purée since the halibut steamed with rosemary will have its own flavoring.", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "halibut, parsnip, rosemary, main course, spring", "aggregateRating": null, "recipeIngredient": ["2 pounds boneless halibut fillet or steaks, at least 1 1/2 inches thick", "4 cabbage leaves, preferably Savoy", "2 large rosemary sprigs", "1 lemon, halved", "2 teaspoons salt", "1 teaspoon cracked pink peppercorns", "1/2 teaspoon cracked white peppercorns", "1/4 cup extra-virgin olive oil", "Parsnip purée, warm"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the halibut into four equal pieces. In a wok or 8-quart stockpot bring water to a boil and boil cabbage leaves until soft and pliable, about 3 minutes. Carefully remove with tongs to a colander and refresh under cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 rosemary sprig, half a lemon and 1 teaspoon salt to the still boiling cabbage-cooking water and place a bamboo or other steamer basket on top. Finely chop the leaves from the remaining rosemary sprig and mix with the remaining 1 teaspoon salt and the cracked pink and white peppercorns in a custard cup. Sprinkle the cabbage leaves with some of the rosemary mixture and place 1 piece of halibut on each leaf. Brush the fish pieces with half of the olive oil and sprinkle with the remaining rosemary mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cabbage leaves and fish in the steamer basket. Cover and steam until the halibut is cooked though, 6 or 7 minutes. Serve the halibut on the cabbage leaves and drizzle sparingly with the juice from the remaining lemon half and the remaining olive oil. Serve with parsnip purée made without ginger."}]}