{"@context": "http://schema.org", "@type": "Recipe", "name": "Luxury Chicken Potpies", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, project", "keywords": "chicken, puff pastry, vegetables, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 807, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "4 grams", "proteinContent": "40 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1166 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds boneless, skinless chicken breast", "2 cups chicken stock", "4 tablespoons unsalted butter", "1 medium onion, chopped", "1/2 pound red potatoes (about 3 small), cut into 1/3-inch dice", "8 baby carrots, peeled and halved lengthwise", "1/2 cup fresh shelled peas", "1/4 pound baby patty-pan squash, halved", "1/4 pound baby zucchini", "Kosher salt and freshly ground black pepper to taste", "6 tablespoons flour", "1 1/4 cups milk", "3/4 cup heavy cream, or another cup milk", "4 drops Tabasco sauce", "2 tablespoons sherry", "2 tablespoons mixed herbs (parsley, chives, thyme)", "1 pound frozen puff pastry, thawed", "1 egg, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken and stock in a large saucepan. Bring to a boil, lower the heat and simmer until the chicken is cooked through, 15 to 20 minutes. Remove from the heat and strain, reserving the stock and setting the meat aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, melt 1 tablespoon of the butter. Add the onion and potatoes and cook, stirring frequently, for 10 minutes. (Do not let them brown.) Add the carrots, peas, squash and zucchini and cook until the vegetables just become tender, 6 to 7 more minutes. Season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan over low heat, melt the remaining 3 tablespoons of butter. Add the flour and cook, stirring, for 1 minute. Slowly whisk in the reserved chicken broth. Whisk in the milk and cream. Raise the heat to medium and continue whisking until the mixture boils. Remove from the heat and stir in the Tabasco, sherry and herbs. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the chicken into bite-size pieces. Combine the chicken, cooked vegetables and cream sauce. Divide the mixture among 6 oven-proof bowls with a capacity of at least 2 cups each. (Potpies may be prepared to this point and refrigerated for up to 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. On a lightly floured surface, roll the pastry dough out to a thickness of 1/6 inch. Cut 6 circles of pastry, each just slightly bigger than the diameter of your bowls. Fit the pastry over the tops of the bowls, brush them lightly with egg and use the tip of a knife to poke a few holes in the pastry. Bake until browned and the filling bubbles, about 25 minutes."}]}