{"@context": "http://schema.org", "@type": "Recipe", "name": "Bone Marrow Flan With Steak", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT6H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef marrow bones, shallot, steak, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1146, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "91 grams", "fiberContent": "1 gram", "proteinContent": "64 grams", "saturatedFatContent": "28 grams", "sodiumContent": "1071 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 2-inch beef marrow bones, both ends cut to expose the marrow (the bones should be smooth and cylindrical for the most attractive appearance)", "1/2 cup minced shallots", "1 cup dry red wine", "3/4 cup heavy cream", "2 large eggs", "Salt and freshly ground black pepper", "1 1/2 cups milk", "8 10-12 ounce boneless sirloin strip steaks", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill the marrow bones at least one hour. Using a long thin knife, cut around the inside surface of the bone, and push out the marrow in one piece. Place the marrow in a bowl of cold water, and refrigerate at least 3 hours, up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the marrow is refrigerated, place the empty bones in a pot and cover with water. Simmer until all the fat and meat can easily be scraped away, about 2 hours. Remove the bones from the water, scrape them clean, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the flan: In a small nonreactive saucepan, combine the shallots and wine. Bring to a simmer, and cook until almost all the wine has evaporated, about 30 minutes. Remove from the heat and allow to cool. In the container of a blender or food processor, combine the cream, eggs, and shallot mixture. Puree until smooth. Season to taste with salt and pepper. Strain through a fine strainer, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Place teakettle of water over high heat to bring to a boil. Wrap the bottom half of each bone tightly, first with plastic wrap, then with foil. Stand each bone up in a deep roasting pan with the foil on the bottom. Pour the flan mixture into each bone, filling them up halfway. Cover the pan with a lid or heavy-duty foil, and place in the oven. Bake for 45 minutes. Remove from the oven but keep in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a hot grill or broiler. Remove the marrow from the ice water, and cut into slices 1/2 inch thick. Grill or broil the steaks to taste. While the steaks are cooking, place the milk in a small skillet over low heat and bring to a slow simmer. Add the marrow slices, and poach until the surfaces are smooth and they are heated through, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place each steak on a plate. Carefully remove the foil and plastic from each bone, and place a bone, flan side down, on each plate. Fill the empty top halves of each bone with the poached marrow slices. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9225-bone-marrow-flan-with-steak"}