{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Lamb with Chile, Cumin and Garlic", "description": "Start with lamb shoulder; leg is not lean or tender enough for this treatment. You can use loin if you prefer, but the dish will cost at least 10 times as much and it won’t be any better. Marinate it dry (or nearly so; I use a little soy sauce, for complexity) for as long as you like — 10 minutes, an hour, a day. The flavor will get a little stronger, though not much.\n\nMore important than the length of time is the freshness of your cumin. You absolutely need cumin seeds, not ground cumin. It’s worth the two or three minutes it takes to toast the seeds before marinating the meat. You can grind them if you like, but I like the little bit of crunch the seeds add.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, easy", "keywords": "cumin, lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 51}, "recipeIngredient": ["1 1/2 pounds lamb shoulder", "1 tablespoon cumin seeds", "1/2 teaspoon crushed red chile flakes, or to taste", "1 tablespoon chopped garlic", "1 tablespoon soy sauce", "Salt and freshly ground black pepper", "Peanut or neutral oil, like grapeseed or corn, to film the bottom of the skillet", "1 cup trimmed and roughly chopped scallions, optional", "Chopped fresh cilantro leaves for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut lamb into 1/2-inch cubes (easier if meat is firmed in the freezer for 15 to 45 minutes). Toast cumin seeds in dry skillet over medium heat, shaking pan occasionally, until fragrant, a minute or 2. Toss together lamb with cumin, chili, garlic, soy sauce, a large pinch of salt and a healthy grinding of pepper. If you like, cover and refrigerate until ready to cook, up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, put a tablespoon of oil in a large skillet (ideally, it will hold the lamb in one layer, or nearly so) and turn heat to high. When hot, add lamb. Cook, undisturbed, for about a minute, then stir once or twice to loosen lamb from skillet. Cook another minute, then stir again. Add scallions, if using, and cook, stirring occasionally, until scallions glisten and shrink a bit and the meat is about medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you want a slightly saucier mixture, stir in 1/4 cup water and cook another minute. Serve hot over rice, garnished, if you like, with cilantro."}], "link": "https://cooking.nytimes.com/recipes/9239-stir-fried-lamb-with-chile-cumin-and-garlic"}