{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft-Shell Crabs in Surrey Bacon Dressing", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, bacon, red onion, soft-shell crab, summer", "aggregateRating": null, "recipeIngredient": ["1/4 pound Surrey or other smoky slab bacon, diced", "1 medium-size red onion, diced", "1/4 cup sugar", "2 cups mayonnaise, preferably homemade", "4 leaves red-leaf lettuce, washed and thoroughly dried", "8 slices ripe tomato", "4 tablespoons clarified butter or vegetable oil", "2 cups flour seasoned with salt and pepper", "8 soft-shell crabs, cleaned"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place diced bacon in a large, heavy skillet and cook over medium-low heat until all the fat is rendered and bacon bits are very crisp, about 15 to 20 minutes. Remove bacon with a slotted spoon, drain on a paper towel and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add diced red onion to skillet and cook over medium heat until very soft, about 5 to 7 minutes. Sprinkle sugar evenly over onions and cook over low heat, without stirring, until the sugar caramelizes, about 10 to 15 minutes. Cool completely, then fold into mayonnaise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a lettuce leaf on each of 4 serving plates. Put 2 tomato slices to one side on each plate. Spoon chilled dressing over lettuce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour clarified butter or oil into a large heavy skillet and heat over a medium flame. Dredge 4 soft-shell crabs in seasoned flour, shaking off excess, and place in skillet. Cook 2 to 3 minutes per side (jumbos will take longer), until crisp. Hold in a warm place while cooking remaining crabs. Transfer to prepared plates and sprinkle with reserved bacon bits. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/9240-soft-shell-crabs-in-surrey-bacon-dressing"}