{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Chocolate Dacquoise", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "Eight to 12 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "bittersweet chocolate, egg whites, orange, dessert, vegetarian", "aggregateRating": null, "recipeIngredient": ["6 extra-large egg whites (1 scant cup), at room temperature", "Pinch of cream of tartar", "1/2 cup sugar", "1 2/3 cups (6 ounces) ground almonds", "1 navel orange", "3 ounces imported bittersweet chocolate", "1 teaspoon vegetable oil", "6 extra-large egg whites (1 scant cup), at room temperature", "1 1/2 cups superfine sugar (or processed regular sugar)", "1 pound unsalted butter, cut into pieces, at room temperature", "6 ounces imported bittersweet chocolate, plus chocolate left over from dipping the orange pieces", "1 tablespoon water", "1 tablespoon orange extract", "Zest of 1 orange, minced", "2 tablespoons Grand Marnier", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the meringue layers, preheat the oven to 250 degrees. Generously butter and flour two cookie sheets. Shake extra flour from sheets. Trace three circles about eight inches in diameter on them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg whites in a large bowl, add cream of tartar and beat until soft peaks form. Gradually add 1/4 cup sugar and beat until egg whites are stiff. Add another 1/4 cup sugar to the ground almonds and, reserving 1/3 cup of the mixture, fold the rest into the egg whites."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pastry bag fitted with a plain (No. 3) tip with the egg-white mixture, and pipe circles following the patterns on the cookie sheets, working from the outside toward the center. Smooth any missed spaces with a spatula. Pipe or spoon extra mixture in dollops on cookie sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the meringues in the middle of the oven, rotating for even cooking, for 55 to 75 minutes, until firm to the touch and lightly colored. Remove from the oven and run a long, thin-bladed knife or spatula carefully under the meringues. If they are not firm, return to oven and check again in five-minute increments. Once firm, transfer them to cake racks. They will become crisper when cooled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the orange segments, remove and mince the orange zest. Set aside. Remove as much pith as possible and carefully separate the fruit into segments without breaking the membranes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the chocolate in a double boiler and stir in the vegetable oil. Allow the mixture to cool slightly, then dip each orange segment halfway into the chocolate, letting extra chocolate drip back into the pan. Place the segments on wax paper to harden. Once hardened, cover lightly with plastic wrap and refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the buttercream, place egg whites in a large metal mixing bowl and set over (not touching) boiling water. Using a wire whisk, beat, while gradually adding sugar, until the mixture is slightly thickened and reaches 105 degrees on an instant-read or candy thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately remove bowl from the heat and begin beating the mixture with an electric mixer. Continue to beat while gradually adding pieces of butter. Beat until the mixture reaches room temperature and thickens into the consistency of stiff filling - about 10 to 15 minutes. (The buttercream will look ugly and you will think that it won't come together. Keep beating. It will!)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the six ounces of chocolate and tablespoon of water to the double boiler used for the garnish. Let it all melt, then add the orange extract, zest, Grand Marnier and salt, and stir to blend. Stir in half a cup of the buttercream and beat until chocolate is smooth. Scrape the mixture into the bowl of buttercream and mix well. Refrigerate for 10 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the dacquoise, save the best meringue for the top. Put a small amount of buttercream in the center of a dessert plate, or a cardboard circle on a turntable, and place a meringue over it. Spread a generous quarter of the filling over this, making it a little thicker toward the outside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently place the second meringue on top, pushing down lightly, and spread another fourth of the filling. Add the final meringue layer and cover the top and sides of the dacquoise with another fourth of the buttercream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble the reserved pieces of meringue and combine them with the sugar-nut mixture. Pat this around the sides of the dacquoise. Arrange the chocolate-dipped orange segments on top like spokes of a wheel and pipe the remaining buttercream through a pastry bag fitted with a star tip, making rosettes on the outside edge. Refrigerate, uncovered, until an hour before serving."}]}