{"@context": "http://schema.org", "@type": "Recipe", "name": "Individual Apple Tart With Ice Cream And Caramel Walnuts", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT1H", "recipeYield": "One serving and one pint of ice cream", "recipeCuisine": "", "recipeCategory": "for one, ice creams and sorbets", "keywords": "apple, milk, phyllo, dessert", "aggregateRating": null, "recipeIngredient": ["2 cups milk", "1/2 vanilla bean", "6 egg yolks", "2/3 cup sugar", "1/2 cup sugar", "1 teaspoon lemon juice", "2 teaspoons water", "1/4 cup large walnut pieces", "1 sheet phyllo", "1 Granny Smith apple, peeled and cored", "1 tablespoon sugar mixed with the scrapings from inside of 1 vanilla bean and a pinch of cinnamon", "1 teaspoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the ice cream, scald the milk with one-half vanilla bean in a small saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the egg yolks with sugar until they are pale yellow. Pour the scalded milk mixture slowly over the eggs, beating constantly. Transfer the mixture to a small saucepan, and cook over low heat for four or five minutes, stirring constantly with a wooden spoon. Do not boil!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and cool. Add to an ice cream machine and follow directions to freeze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare caramel walnuts, combine sugar, lemon juice and water in a small saucepan and bring to a boil. Continue boiling until syrup is golden caramel in color. Turn off heat, stir in nuts, then remove them with a slotted spoon to a sheet of wax paper or a buttered cookie sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tart, preheat oven to 375 degrees. Lightly butter a cookie sheet. Fold phyllo into approximately a 7-inch square. Cut out a 6- or 7-inch circle from the phyllo. Discard scraps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the apple in half from stem to blossom end. With flat side down, cut apple into thin-as-possible slices. Layer slices on the phyllo, starting from the outside and working toward the middle. Sprinkle with the sugar, vanilla and cinnamon mixture, and place butter in the middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the tart to a cookie sheet, and bake for 12 to 15 minutes, or until the tart is nicely browned and the sugar is glazed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with slightly softened vanilla ice cream and the caramel walnuts."}], "link": "https://cooking.nytimes.com/recipes/9247-individual-apple-tart-with-ice-cream-and-caramel-walnuts"}