{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Duck", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "duck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "recipeIngredient": ["2 ducks, about 4 1/2 pounds each, defrosted if frozen", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each duck in half lengthwise, slicing through the carcass bones. Then cut each half duck into two pieces (the leg, and the breast with wing attached)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat two large skillets or saucepans that have lids, either nonstick or heavy aluminum, until hot. Place one duck (4 pieces) skin side down in one layer in each of the hot skillets. Sprinkle with the salt, and cook over high heat for 5 minutes. Lift the pieces to dislodge them from the bottom of the skillets, then return to the skillets, skin side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the duck necks and gizzards to the pans, cover, reduce the heat to low, and cook for 15 minutes. (The skin on the duck pieces should be very brown at this point.) Reduce the heat to very low, cover, and cook for 25 minutes. Add the livers and hearts, cover, and continue cooking for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the duck pieces on a large tray, and keep them warm until serving time in a 170-degree oven. Pour the fat (about 4 cups total) from the two skillets into a bowl, and reserve 1 1/2 tablespoons of it for the green salad (see recipe). Cover and refrigerate the remainder. (It can be used for up to two months for sauteeing potatoes or other vegetables.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "There should be a residue of glaze or solidified juices in the bottom of the skillets. Add 1/4 cup of water to each skillet, and stir to melt the solidified juices. Set these drippings aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the pieces of duck sprinkled with the reserved drippings and with the green salad (see recipe.)"}], "link": "https://cooking.nytimes.com/recipes/926-skillet-duck"}