{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Sea Scallop Saganaki With Feta", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H45M", "recipeYield": "12 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "appetizer, feta, sea scallop, tomato", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "428 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 plum tomatoes, halved lengthwise", "1/2 cup plus 1 tablespoon olive oil", "Kosher salt and freshly ground black pepper to taste", "6 sprigs oregano", "4 sprigs rosemary", "6 cloves garlic, peeled and mashed, plus 2 cloves, peeled and thinly sliced", "12 large sea scallops", "1 cup white wine", "2 cups homemade or low-sodium canned chicken broth", "Juice of 2 lemons", "Green ends from 2 scallions, thinly sliced on the diagonal", "1 teaspoon Dijon mustard", "2 tablespoons coarsely chopped parsley, plus 12 sprigs for garnish", "2 tablespoons coarsely chopped dill", "5 ounces feta cheese, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. In a medium nonreactive bowl, toss the tomatoes with 1/4 cup of the oil. Drain off the excess oil and reserve. Place the tomatoes, cut side up, on a parchment-paper-lined baking sheet spaced well apart. Sprinkle with salt and pepper and bake until almost dried, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tomatoes from the oven and transfer to a shallow dish, cut side up. Arrange the oregano, rosemary and mashed garlic over the tomatoes. Drizzle with the reserved oil from the tomatoes and season with salt and pepper. Cover with plastic wrap and set aside to marinate at room temperature for 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over high heat, heat 1/4 cup of the oil. Season the scallops with salt and pepper, place in the skillet and cook, turning once, until well browned and slightly firm to the touch, about 2 minutes per side. Transfer to a plate and cover with aluminum foil. Discard the oil, wipe out the skillet and return to the heat. Heat the remaining 1 tablespoon oil, add the thinly sliced garlic and cook until fragrant, about 30 seconds. Add the wine and cook until reduced by half, about 2 1/2 minutes. Add the broth, bring to a boil and cook until reduced to 3/4cup, about 5 minutes. Remove from the heat and stir in the lemon juice, scallions, mustard, chopped parsley and dill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the herb sprigs from the tomatoes and discard. Divide the tomatoes among 12 small bowls. Top each tomato half with a scallop, spoon some sauce over, sprinkle with feta, garnish with the parsley sprigs and serve."}], "link": "https://cooking.nytimes.com/recipes/9276-seared-sea-scallop-saganaki-with-feta"}