{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Sour Cream Shortcake", "description": "", "author": {"@type": "Person", "name": "R. W. Apple Jr."}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, flour, sour cream, strawberry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 392, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "12 grams", "sodiumContent": "565 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups sifted all-purpose flour", "3 teaspoons baking powder", "1/4 cup sugar, plus additional for sweetening berries and sour cream", "3/4 teaspoon salt", "3 ounce package cream cheese", "2 tablespoons chilled butter", "1 large egg", "About 1/2 cup milk", "1 tablespoon butter, melted", "1 quart fresh strawberries, hulled and thinly sliced", "1 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Into a large mixing bowl, sift together the flour, baking powder, 1/4 cup of the sugar, and the salt. Add the cream cheese and 2 tablespoons chilled butter. Using a pastry blender or two knives, cut the cream cheese and butter into the mixture until it resembles coarse cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the egg into a measuring cup, and beat lightly with a fork. Add enough milk to make 3/4 cup. Pour the egg mixture into the flour mixture, and stir. Knead the dough inside the bowl just until it is blended and cohesive, about 20 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape half of the dough into a flattened ball, and place in a greased 8 round cake pan. Pat the dough flat to the edges of the pan. Brush the top of the dough with the melted butter. Shape the remaining dough into a flattened ball, and place in the pan on the buttered dough, patting flat to the edges. Bake until golden brown, about 17 to 20 minutes. Remove from heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sliced strawberries in a mixing bowl, add sugar to taste, and mix well. Place the sour cream in a small bowl, and add sugar to taste, mixing to blend well. To serve, remove the cake from the pan, and use a knife to help pry the layers apart; they should split naturally where the dough had been buttered. Place the bottom layer on a serving plate, and top with sweetened strawberries. Place the second layer over the strawberries, and top with sweetened sour cream. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9280-strawberry-sour-cream-shortcake"}