{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Pork", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, roasts", "keywords": "boneless pork shoulder, hoisin sauce, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["4 pounds boneless pork butt (shoulder), neither too fat nor too lean", "2 green onions, trimmed, cut into 1-inch lengths", "3 thin slices peeled fresh ginger", "1/2 cup soy sauce", "1/2 cup dry sherry", "3 tablespoons brown sugar", "1/2 cup five-flavored spice powder", "1 cup hoisin sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut meat with the grain into 2-inch-by-1-inch slices as long as the shoulder. Combine 2 cups water, onions, ginger, soy sauce, sherry and sugar in a deep 3 1/2-quart saucepan and stir to dissolve sugar. Add pork; stir to coat. Cover and simmer over medium-low heat (do not stir) for 15 minutes. Turn off the heat; let steep until liquid is cool, about 1 hour. Drain the pork in a colander and pat dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a top broiler, arrange oven racks in top third and lowest parts of oven and preheat the broiler to medium. Or place a rack in the middle and preheat oven to 425 degrees. Line a roasting pan with foil and top with a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub meat with five-spice powder, then with hoisin, and place on a rack over the roasting pan. Broil slices on the top rack for 10 minutes and then switch to the bottom rack for 5 to 10 minutes (or roast on middle rack for 20 to 30 minutes), until glaze is slightly crispy and meat is cooked through, turning the pieces every 5 to 10 minutes. Do not burn the glaze! Serve at room temperature with plum sauce and hot English mustard."}], "link": "https://cooking.nytimes.com/recipes/9284-roast-pork"}