{"@context": "http://schema.org", "@type": "Recipe", "name": "La Vignarola Roman-Style Spring-Vegetable Stew", "description": "", "author": {"@type": "Person", "name": "Sara Dickerman"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Spring-Vegetable-Stew/Spring-Vegetable-Stew-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 as a side dish or first course", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "appetizer, artichoke, fava beans, peas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 255, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "12 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "998 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 lemons, halved", "5 large artichokes (about 12 ounces each)", "1 1/2 cups shelled fresh or frozen fava beans, or shelled frozen edamame", "1/4 cup extra-virgin olive oil, plus more as needed", "1 large onion, thinly sliced", "1 sprig oregano, optional", "2 ounces guanciale or pancetta, slivered", "Salt", "2 cups shelled fresh or frozen peas", "1/4 cup chopped parsley", "2 tablespoons chopped mint", "* teaspoon lemon juice, plus more to taste", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl halfway with cold water. Squeeze the lemons into the water and add the rinds to the bowl. Using a serrated knife, cut off the top third of an artichoke. Pull back and snap off the dark green, leafy blades, one by one, until only the pale yellow leaves remain. Using a paring knife, trim the artichoke bottom and stem to the pale green flesh, then cut it in half lengthwise. Drop into the water (to keep the artichoke from turning brown) and repeat with the remaining artichokes. Using a spoon, scoop out the prickly leaves and hairy choke. Cut each half into 4 wedges and return to the water until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using fresh fava beans, bring a large pot of water to a boil. Fill a large bowl two-thirds full with ice water. When the water comes to a boil, add the beans and cook for 1 minute, then drain and immediately submerge the beans in the ice water. Peel the beans by gently tearing the pale skins and pinching at one end. Discard the skins, reserving the dark green interiors."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 12-inch nonreactive pan over medium heat. Add 1/4 cup olive oil and when hot, add the onion, oregano (if using) and guanciale. Cook, stirring occasionally until the onion and guanciale are translucent, about 10 minutes. Drain artichokes and add to the pan, along with 2 cups water and 11/4 teaspoons salt. Bring the liquid to a boil, then reduce heat to a simmer and cook until artichokes are just tender, about 25 minutes. If using frozen favas, add them and cook for 2 minutes. If using fresh favas or frozen edamame, add them, along with the peas, and cook until warm and tender, about 5 minutes more. Remove the oregano sprig. Sprinkle in parsley and mint. Season with lemon juice, freshly ground black pepper and, if desired, additional salt. Drizzle with extra-virgin olive oil and serve."}], "link": "https://cooking.nytimes.com/recipes/9330-la-vignarola-roman-style-spring-vegetable-stew"}