{"@context": "http://schema.org", "@type": "Recipe", "name": "Artichokes and Preserved Lemons With Honey and Spices", "description": "", "author": {"@type": "Person", "name": "Sara Dickerman"}, "image": null, "totalTime": "PT40M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "artichoke, honey, lemon, side dish, vegetarian", "aggregateRating": null, "recipeIngredient": ["2 lemons", "2* pounds small artichokes (2 1/2 to 3 ounces each) or 1 pound frozen artichoke hearts", "3 tablespoons extra-virgin olive oil", "3 cloves garlic, crushed", "1/4 teaspoon powdered ginger", "1/8 teaspoon turmeric", "1 1/2 tablespoons honey", "Peel from 1 to 1 1/2 preserved lemons, cut into 1/4 -inch strips (available at Middle Eastern and specialty food stores)", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using fresh artichokes, squeeze 1 lemon into a large bowl of water, and drop the rinds into the water. Using a serrated knife, cut off the top third of an artichoke. Pull back and snap off the leafy blades, one by one and in layers, until only the pale yellow leaves remain. Using a paring knife, trim the artichoke bottom and stem to the pale green flesh. Cut the artichokes in half lengthwise. (If using frozen, they may already be halved or quartered and have the chokes removed.) With a teaspoon, scoop out the choke, deep in the flower between the leaves and the base of the stem. Be careful not to scoop out the firm heart. Drop trimmed artichokes into lemon water until ready for use. Repeat with each artichoke."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large nonreactive saucepan (at least 12 inches wide) over medium heat. Drop in the garlic and cook for a few seconds only, stirring."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the pan off the heat and add the ginger, turmeric, the juice from the remaining lemon, honey and the preserved lemon. Transfer the artichokes from the water bath to the pan. Add 1 cup plus 2tablespoons water and 1/2 teaspoon salt to the pan. Cover, return to the heat and simmer for about 15 minutes or until the artichokes are tender, turning them from time to time, and adding a little water as necessary. Remove the lid and simmer until the mixture is very moist but most of the liquid has evaporated, 5 to 10 more minutes."}], "link": "https://cooking.nytimes.com/recipes/9331-artichokes-and-preserved-lemons-with-honey-and-spices"}