{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Lavender, Maple Syrup And Carrot Ice Milk", "description": "In 2000, R. W. Apple Jr. called Sooke Harbour House, in British Columbia, \"one of Canada's half-dozen best restaurants,\" praising its kitchen garden and its \"more than two acres of herbs, vegetables and edible flowers, many of them rarities, gradually devouring the lawns around the house, tumbling down to the sea, scaling hillsides in every direction, a living tapestry of leaf, shrub and color.\" It seldom snows at Sooke, which lies in hardiness Zone 8, the same as Charleston, S.C., a beneficiary of benign Pacific breezes and currents. This recipe utilizes some of the herbs that grow year-round on the property.", "author": {"@type": "Person", "name": "R. W. Apple Jr."}, "image": null, "totalTime": "PT1H40M", "recipeYield": "1 1/2 quarts (about 6 servings)", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "carrot, maple syrup, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 342, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "161 milligrams", "sugarContent": "48 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds organic carrots, trimmed and peeled", "1 tablespoon fresh organic rosemary or 2 tablespoons dried", "1 cup unfiltered organic apple juice", "2 tablespoons brown sugar", "2 cups 2 percent milk", "1 1/2 teaspoons fresh or dried organic lavender flowers or a 2-inch cinnamon stick", "8 large egg yolks", "1/2 cup maple syrup", "1/4 cup granulated sugar", "1/4 cup brown sugar", "1 ounce brandy, Cognac, rye or rum"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare carrot puree, combine carrots, rosemary, apple juice and brown sugar in a medium nonreactive saucepan. Place over high heat until simmering, then cover, and reduce heat to medium-low. Cook until carrots are soft, 35 to 40 minutes. Remove from heat, and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, puree the carrots with any remaining juice. Process until the puree is very smooth, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare ice milk, combine carrot puree, milk and lavender in a medium saucepan. Place mixture over medium heat until it just reaches a simmer. Remove from heat, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium nonreactive bowl, combine egg yolks, maple syrup, granulated sugar and brown sugar. Heat mixture over a double boiler, whisking until it is thick and light in color, about 15 minutes. Remove from heat, and place a strainer over mixture. Pour in carrot puree, stirring and pressing with a rubber spatula until puree passes through into egg mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return double boiler to heat. Whisk until mixture is steaming and thick enough to coat the back of a spoon, about 15 minutes. Remove from heat, and whisk occasionally as it cools. (If mixture begins to curdle, pour into a blender and process until smooth.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When mixture has cooled, stir in brandy. Freeze in an ice-cream maker, according to manufacturer's instructions."}]}