{"@context": "http://schema.org", "@type": "Recipe", "name": "Faux Babbo Ravioli", "description": "One of the singular pleasures of eating out in New York City in the early years of the new century was the arrival of a plate of steaming beef-cheek ravioli at Babbo, Mario Batali's flagship restaurant on Waverly Place in Greenwich Village. The delicate pasta triangles glistened beneath a velvety sauce made of crushed squab liver livened with capers and anchovies.\n\nSo I set out to make the things myself, at home. To do so required a few adjustments, of course. \n\nThe truth is, Italian food demands but does not require the best ingredients and the haughtiest treatment. No cuisine so rooted in poverty ever can. So substitute chicken liver for the squab in the sauce. Substitute brisket for beef cheeks in the filling. As Batali said one day over coffee, you could use anything braised, anything soft.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/05/26/dining/Faux-Babbo-Ravioli/Faux-Babbo-Ravioli-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "1 medium white onion, chopped", "1 celery stalk, chopped", "1 pound beef brisket cut into 1-inch cubes (or short ribs)", "1 cup red wine, plus more as needed", "1/2 cup chopped fresh or canned tomatoes, plus more as needed", "1 large pinch chopped fresh rosemary", "Kosher salt and freshly ground black pepper", "Pasta dough for ravioli <a href=\"http://cooking.nytimes.com/recipes/9355-pasta-dough-for-ravioli\">(see recipe)</a>", "5 tablespoons unsalted butter", "Chicken livers Toscani <a href=\"http://cooking.nytimes.com/recipes/9356-chicken-livers-toscani\">(see recipe)</a>", "1 handful Italian parsley, chopped", "1/2 cup grated pecorino Romano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Place a large, ovenproof skillet over medium heat and add the oil. Add onion and celery and sauté until softened, about 10 minutes. Increase heat to high and (working in batches, if necessary) brown beef on all sides. Add the wine and deglaze the pan. Add tomatoes and rosemary. Season with salt and pepper. When the mixture returns to a boil, cover and place in oven until meat is fork-tender, 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pot from oven and allow to cool. Skim off excess fat, transfer to a food processor, and pulse until smooth. If the mixture seems dry, add a tablespoon of wine or 1 or 2 tablespoons of tomatoes. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut sheets of pasta into 4-inch squares. Place 1 tablespoon beef filling into the center of each square. Wet edges of pasta with warm water, and bring two opposite corners of each square together to form a triangle. Press edges to seal. Put finished ravioli on a cookie sheet, cover with plastic and place in freezer until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to a boil. Heat butter in a large sauté pan until it browns but does not burn. Add about half the chicken livers Toscani and sauté for 1 minute. Add 3 tablespoons of the salted water to loosen the sauce. Reduce heat to low and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ravioli to the boiling water and cook until they float to the surface, about 3 minutes. Using a slotted spoon, transfer ravioli to pan of chicken liver sauce. Add parsley and 1/4 cup grated pecorino. Toss lightly. Divide ravioli on four warm plates. Spoon extra sauce over each serving and top with cheese. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9357-faux-babbo-ravioli"}