{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Christmas Goose", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "goose, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "recipeIngredient": ["1 8- to 10-pound goose", "Juice of 1/2 lemon", "Coarse salt and freshly ground pepper", "Giblets, neck and wing tips of the goose", "1 medium onion, chopped", "1 carrot, chopped", "1 stalk celery, chopped", "Herb bouquet (thyme, parsley and bay leaf tied in cheesecloth)", "1 cup dry white wine", "1 tablespoon cornstarch", "1 cup port", "3 tablespoons red currant jelly", "Lemon juice to taste", "Chopped parsley to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove excess fat from goose cavity. Cut off the wing tips. Rub the goose with lemon juice, salt and pepper. Tie the legs together. Prick the skin of the goose all over lightly (without piercing the flesh underneath) with a skewer or darning needle. This will help the fat escape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the goose, breast up, on a rack in a roasting pan. Pour in a couple of inches of water. Cover the pan and bring to a boil on top of the stove. Turn down the heat and steam the goose for 45 minutes to an hour, depending on its size. If the water boils off, add a little more hot water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stock. Simmer the gizzard, heart, neck and wing tips with the onion, carrot, celery and herb bouquet in lightly salted water to cover for two hours. Strain and put in the freezer while the goose roasts (this will help solidify the fat quickly and it can be easily removed)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the goose from the steamer and cool it. Save the liquid from the roaster. Stuff the goose (see below)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. Place the goose, breast down, on a roasting rack and place the stock vegetables around the goose with the white wine and a cup of goose-steaming liquid. Cover and braise for an hour to an hour and a half, depending on the weight of the goose. Baste from time to time, and if necessary, add more steaming liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the goose breast up and brown it for 30 minutes, uncovered. Put it on a serving platter and let it rest in the oven with the door open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce. Pour the fat from the roasting pan and stir in the cornstarch, blending it first to a smooth paste with a little water. Cook for two minutes, scraping up the juices, then add the port. Bring to a boil and add the stock. Stir well and simmer until the sauce has thickened enough to coat the spoon (about five minutes). Stir in the red currant jelly and add a little lemon juice if necessary. Correct seasoning and serve in a heated sauceboat, sprinkled with parsley."}], "link": "https://cooking.nytimes.com/recipes/936-roast-christmas-goose"}