{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Rhubarb Ravioli With Spiced Strawberry Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, rhubarb, ricotta, strawberry", "aggregateRating": null, "recipeIngredient": ["1 pint strawberries, stemmed and cut in half, plus 12 strawberries, stemmed and cut lengthwise into quarters", "1/4 cup sugar", "1 teaspoon black peppercorns", "1/2 bay leaf", "1/2 cinnamon stick", "1 teaspoon grated lemon rind", "1 teaspoon grated orange rind", "2 tablespoons fresh lemon juice", "3 tablespoons fresh orange juice", "1/2 pound rhubarb, trimmed and cut into 1/2-inch thick slices", "1 cup sugar", "1 tablespoon water", "6 tablespoons fresh orange juice", "1 tablespoon grated orange rind", "1 1/2 teaspoons grated lemon rind", "2 tablespoons ricotta cheese", "16 wonton skins", "1 egg beaten with 1 teaspoon water", "Vegetable oil for deep-fat frying", "1 1/2 teaspoons cinnamon", "1 1/2 cups vanilla ice cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all the sauce ingredients except the 12 strawberries in a medium saucepan and bring to a boil. Reduce the heat and simmer for 10 minutes. Remove from the heat and let cool. Take out the bay leaf and cinnamon stick. Puree in a food processor and strain through a fine sieve. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rhubarb, 1/2 cup of the sugar, water and orange juice in a medium saucepan. Bring to a boil and cook just until the rhubarb is soft, about 5 minutes. Drain well and place in a small bowl. Stir in the orange and lemon rinds and ricotta. Place the wonton skins on a work surface in a single layer and brush lightly with the egg mixture. Place a rounded tablespoon of the filling in the center of 8 of the wonton skins. Top with a second skin and press around the filling to the edges to make a tight seal. Place on a baking sheet and freeze while heating the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a deep-fryer or large pot until it reaches 375 degrees. Carefully drop the ravioli in the oil and fry until golden on both sides. Drain on paper towels. Combine the remaining 1/2 cup of sugar with the cinnamon and coat the ravioli in the mixture. Place the strawberry sauce and reserved strawberries in a small saucepan and heat until warm. Spoon some of the sauce on each of 4 plates. Place 2 raviolis on each plate with a scoop of vanilla ice cream."}], "link": "https://cooking.nytimes.com/recipes/9402-fried-rhubarb-ravioli-with-spiced-strawberry-sauce"}