{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Dump-It Cake", "description": "“A couple of years ago, my mother taught me to make her dense but moist chocolate birthday cake. She calls it 'dump-it cake' because you mix all of the ingredients in a pot over medium heat, then dump the batter into a cake pan to bake. For the icing, you melt Nestlé's semisweet-chocolate chips and swirl them together with sour cream. It sounds as if it's straight from the Pillsbury Bake-Off, but it tastes as if it's straight from Payard. Everyone loves it.”", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2019/01/11/dining/ah-chocolate-dump-it-cake/merlin_147611010_cc3b9466-1485-485c-a638-f464b3cabcec-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, sugar, unsweetened chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 3488}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 619, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "19 grams", "sodiumContent": "426 milligrams", "sugarContent": "57 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups sugar", "4 ounces unsweetened chocolate", "1 stick unsalted butter, plus more for greasing the pan", "2 cups all-purpose flour, plus more for dusting the pan", "2 teaspoons baking soda", "1 teaspoon baking powder", "1 teaspoon salt", "1 cup milk", "1 teaspoon cider vinegar", "2 eggs", "1 teaspoon vanilla", "1 1/2 cups Nestle's semisweet-chocolate chips", "1 1/2 cups sour cream, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees and place a baking sheet on the lowest rack to catch any drips as the cake bakes on the middle rack. In a 2- to 3-quart pot, mix together the sugar, unsweetened chocolate, butter and 1 cup of water. Place over medium heat and stir occasionally until all of the ingredients are melted and blended. Remove from the heat and let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, sift together the flour, baking soda, baking powder and salt. In a small bowl, stir together the milk and vinegar. Grease and flour a 9-inch tube pan (Tip: Be meticulous, and really work the butter and flour into the crevices of the pan. This is a moist cake, so it really needs a well-prepared pan to keep it from sticking)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chocolate in the pot has cooled a bit, whisk in the milk mixture and eggs. In several additions, and without overmixing, whisk in the dry ingredients. When the mixture is smooth, add the vanilla and whisk once or twice to blend. Pour the batter into the tube pan and bake on the middle rack until a skewer inserted in the center comes out clean, about 30 to 35 minutes. Let the cake cool for 10 minutes, then remove from the pan and cool on a rack. (This can be tricky -- if someone is around to help, enlist him.) Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the chocolate chips in a double boiler, then let cool to room temperature. Stir in the sour cream, 1/4 cup at a time, until the mixture is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cake is cool, you may frost it as is or cut it in half so that you have 2 layers. There will be extra icing whether you have 1 or 2 layers. My mother always uses it to make flowers on top. She makes a small rosette, or button, then uses toasted slices of almond as the petals, pushing them in around the base of the rosette."}], "link": "https://cooking.nytimes.com/recipes/9404-chocolate-dump-it-cake"}