{"@context": "http://schema.org", "@type": "Recipe", "name": "Guinea Fowl", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "australian", "recipeCategory": "dinner", "keywords": "bread, chicken stock, guinea fowl, main course", "aggregateRating": null, "recipeIngredient": ["2 guinea fowl or poussins", "1/2 cup goose, duck or bacon fat", "Salt, white pepper, sugar and sea salt", "2 cups rich chicken stock", "2/3 cup port", "2 teaspoons soy sauce", "1/2 teaspoon walnut oil, or light olive oil", "1 pinch salt", "6 slices white bread, crusts removed", "1 clove garlic", "Pinch each salt", "Pinch each white pepper", "Pinch each sugar", "1 cup grapeseed oil", "1/3 cup grapeseed oil", "1/2 cup loosely packed Italian parsley leaves", "3 1/2 ounces spinach leaves, steamed", "18-inch piece daikon, peeled, cooked and sliced into 1/2-inch rounds", "2 leeks, cleaned, cut in half lengthwise and poached", "4 small Yukon gold potatoes, peeled and boiled", "8 ounces soy beans, shelled and cooked"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Split guinea fowl or poussins. Remove wing portions and backbones. Bone breasts and thighs, leaving breast and thigh pieces attached with skin. Place each piece in a separate zip-top plastic freezer bag and spoon in 2 tablespoons fat. Add a pinch of pepper, sugar and salt to each, expel air from the bags, seal. Squeeze to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For chicken jus: Boil chicken stock in a saucepan until reduced to about 1 1/2 cups. Add port and boil until mixture is syrupy and reduced to 2/3 cup, about 20 minutes. Season with soy sauce, walnut oil and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For bread sauce: Place bread, garlic, salt, pepper and sugar in a food processor and blend into crumbs. Drizzle in oil and blend into a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For parsley oil: Combine oil and parsley in a blender and purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 quarts of water in a 5-quart saucepan to 140 degrees. Place the fowl packets in the water, cover and cook 35 minutes, until you can push your finger into the thigh of the bird. Do not test flesh through the skin side. Remove from bags and arrange on a foil-lined baking sheet. Sprinkle with sea salt and broil until golden on each side, about 8 minutes total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat jus. Divide the spinach and daikon among 4 plates and drizzle with 2 tablespoons jus. Top each with a half fowl, then the remaining jus. Drizzle with parsley oil and arrange a leek half over top. Place the potatoes, beans and a dollop of bread sauce to the side."}], "link": "https://cooking.nytimes.com/recipes/9419-guinea-fowl"}