{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Grits With Fontina Fonduta And Mushroom Stew", "description": "", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/creamygrits/creamygrits-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "italian, southern", "recipeCategory": "", "keywords": "cheese, grits, mushroom, main course, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 616, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "21 grams", "sodiumContent": "664 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup Anson Mills coarse yellow or white grits", "1 teaspoon fine sea salt", "1 to 2 tablespoons cold butter", "Freshly ground black pepper", "1/4 pound fontina cheese, diced", "1/4 cup whole milk", "2/3 cup heavy cream", "1/2 cup Parmesan cheese", "1 egg yolk", "6 teaspoons extra virgin olive oil", "3/4 pound assorted mushrooms, cut into 1/4-inch slices", "2 shallots, minced", "3 cloves garlic, minced", "1 tablespoon chopped thyme", "2 ounces cabbage, shaved paper thin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place grits in a medium heavy-bottomed saucepan. Add 2 1/2 cups cold water, and stir once. Allow grits to settle in saucepan, then skim off chaff and hulls that float to surface. Turn heat to medium-high, and bring grits to low simmer, stirring constantly with a wooden spoon, about 5 minutes. Reduce heat to lowest setting, and cover saucepan. Heat 2 cups water in a small saucepan. Keep hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook grits, covered, over very low heat, stirring every 10 minutes or so with wooden spoon, and adding 1/4 cup hot water to pan when grits become thick. Cook grits until creamy and tender but not mushy, about 90 minutes. Stir in salt after 45 minutes. At end of cooking, stir in butter, and season to taste with black pepper. Keep warm. (Grits can be served at this point, as a side dish.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While grits cook, make fonduta. In a small stainless steel bowl, combine fontina with milk and let sit 30 minutes. In a small saucepan, combine cream with Parmesan cheese. Cook over low heat, stirring constantly, until parmesan has melted. Season with salt and pepper. Remove from heat, but keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set bowl with fontina over a pot of simmering water, and stir constantly to melt cheese into threads. Transfer both cheese mixtures to a blender, add egg yolk, and blend until smooth. Taste, and adjust seasonings. Return to saucepan. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare mushrooms, heat 2 teaspoons olive oil in a large saut&#233; pan. Add half the mushrooms, season with salt and pepper, and cook until seared, about 4 minutes. Transfer to a plate. Add 2 more teaspoons oil to pan, and cook remaining mushrooms. Transfer to plate. Add remaining olive oil to pan, add shallots and garlic, and cook 3 minutes. Return mushrooms to pan, cover, and cook about 4 minutes. Stir in thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, distribute shaved cabbage evenly over 4 warm plates. Put a spoonful of grits on top. Pour fonduta over grits. Top with mushrooms. Serve immediately with lots of freshly ground black pepper."}]}