{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach Semifreddo With Raspberry Sauce", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, peach, raspberries, ricotta, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 398, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "16 grams", "sodiumContent": "47 milligrams", "sugarContent": "33 grams", "transFatContent": null}, "recipeIngredient": ["3 medium-size ripe peaches", "Juice of one lemon", "2/3 cup sugar", "2/3 cup part-skim ricotta cheese", "1 1/2 cups heavy cream", "1 pint fresh raspberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 4-cup metal loaf pan with a piece of waxed paper that covers the bottom and both long sides and extends three inches beyond the edges of the pan. The ends of the pan do not need to be covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the peaches in half, remove the pits and cut each peach half in quarters. Place the peaches in a food processor with the lemon juice, 1/2 cup of the sugar and the ricotta, then puree. Push the puree through a sieve to remove bits of skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate the peach mixture while continuing with the recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream until stiff. Fold the whipped cream into the peach mixture, then pour the mixture into the prepared loaf pan, smoothing the top. Fold the ends of the waxed paper over the top to cover mixture. Place the pan in the freezer for 8 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 6 attractive raspberries for garnish and make the sauce by forcing the remaining raspberries through a sieve; or puree the raspberries in a food processor, then sieve them to remove the seeds. Sweeten the puree to taste with some or all of the remaining sugar. Transfer the sauce to a bowl, cover and refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "An hour and a half to 3 hours before serving, unmold it. Run a knife down the narrow ends and along the sides of the pan, lift the waxed paper off the top and unmold the semifreddo onto a large piece of foil. Peel off the waxed paper, wrap the block of dessert in foil and place it in the refrigerator on its serving dish until ready to serve. It can remain in the refrigerator up to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, unwrap the semifreddo, place on its chilled serving dish and garnish with the reserved raspberries. Cut thick slices and spoon some sauce on each serving."}], "link": "https://cooking.nytimes.com/recipes/9444-peach-semifreddo-with-raspberry-sauce"}