{"@context": "http://schema.org", "@type": "Recipe", "name": "Mustard-and-Chile-Rubbed Roasted Beef Tenderloin", "description": "For parties or picnics, meat that you've prepared the day before is a time-saving trick worth adopting. Everyone knows that beef tenderloin, served hot, is a fail-safe dish for a dinner party. It comes out of the oven caramelized, glistening and perfect. If the primary goal is to serve it chilled or room temperature, however, the trick is to swab the meat with flavor — lots of chile powder, oregano, garlic, mustard and olive oil — before sliding it into the oven (roast it rare so it stays tender and juicy). The next day all you need to do is slice and serve, no compensatory condiments necessary. The flavors of mustard and chile, carried by the fat in the olive oil, have penetrated the meat beautifully.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/06/05/dining/05COOKING-BEEF-TENDERLOIN2/05COOKING-BEEF-TENDERLOIN2-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "beef tenderloin, chile powder, dijon mustard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 241}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 427, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "0 grams", "proteinContent": "29 grams", "saturatedFatContent": "12 grams", "sodiumContent": "378 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 2-pound beef tenderloin, trimmed, rinsed and patted dry", "3 tablespoons extra virgin olive oil", "1 tablespoon Dijon mustard", "1 teaspoon dried oregano", "1 teaspoon chipotle chile powder", "1/2 teaspoon chile powder", "1/2 teaspoon ground cumin", "1/2 teaspoon freshly ground black pepper", "1 large garlic clove, passed through a garlic press", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Tie roast with kitchen string in three evenly spaced places to help keep its tubular shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together 1 tablespoon oil, the mustard, oregano, chipotle chile, chile powder, cumin, black pepper and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat remaining 2 tablespoons oil until very hot. Season beef generously all over with salt. Place it in pan and sear bottom without moving until it forms a golden brown crust, about 3 to 4 minutes. Turn and repeat with remaining sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer beef to a rimmed baking sheet. Using a pastry brush, smear mustard-chile rub all over beef. Roast until a thermometer registers 115 degrees for rare and 120 for medium-rare (beef will continue to cook as it rests), 12 to 15 minutes. Let cool completely, then wrap and refrigerate. Bring to room temperature for at least 2 hours before slicing and serving."}]}