{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon-Basil Risotto With Zucchini and Fava Beans", "description": "", "author": {"@type": "Person", "name": "Celia Barbour"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/ZucchiniLemonBalmFavaBean/ZucchiniLemonBalmFavaBean-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "fava beans, rice, zucchini, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 563, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "89 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "13 grams", "proteinContent": "20 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1376 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds fava beans in their pods", "6 cups chicken or vegetable broth", "5 tablespoons butter or oil or a combination", "3 shoots spring garlic or 3 to 4 cloves garlic, minced", "4 shoots spring shallots or 4 shallots, minced", "2 cups arborio rice", "1 cup dry white wine", "Finely grated zest of 1 lemon", "3/4 pound zucchini, cut into matchsticks", "1/2 cup grated shepherd's basket or pecorino cheese", "Salt and freshly ground black pepper", "25 basil leaves, shredded", "1 tablespoon minced lemon balm leaves or 1 tablespoon lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove fava beans from pods. Bring a pot of water to a boil, and submerge beans for 1 minute, then drain and chill in cold water. Slit translucent skin of each bean and discard. Test a bean for tenderness: if hard, simmer for 2 to 8 minutes, until tender. Cover and refrigerate until needed, up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour broth into a saucepan, bring to a simmer and keep warm. Place a heavy-bottomed pot or Dutch oven and a large skillet on stove. Divide butter or oil, garlic and shallots between the two pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place Dutch oven over medium heat and saut&#233; garlic and shallots until translucent. Add rice and stir for 2 minutes. Add wine and lemon zest and continue stirring until all the wine is absorbed. Begin stirring in the broth, one ladleful at a time, allowing each addition to be absorbed before adding the next. Meanwhile (after about the second ladleful of broth), place skillet over medium-high heat. Stir until garlic is light gold. Add zucchini and saut&#233; 2 to 3 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When most of the broth is incorporated, taste rice; it should be creamy with a slightly firm center. Remove from heat and mix in cheese. Cover and allow to rest for 1 minute. Meanwhile, return zucchini mixture to medium heat. Add favas and season with salt and pepper to taste. Stir just until mixture is warm, then remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the basil to zucchini and mix gently. Stir remaining basil and lemon balm or lemon juice into risotto. Place a portion of each on plates and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9454-lemon-basil-risotto-with-zucchini-and-fava-beans"}