{"@context": "http://schema.org", "@type": "Recipe", "name": "Bread and Onion Soup", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, french bread, garlic, onion", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 321, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "7 grams", "sodiumContent": "652 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons chicken, goose or duck fat, or 4 tablespoons peanut oil and 2 tablespoons unsalted butter", "2 pounds onions, peeled and sliced thin (8 cups)", "10 to 12 cloves garlic, peeled, crushed and chopped fine (2 tablespoons)", "1 teaspoon salt", "1 teaspoon freshly ground black pepper", "12 cups water", "10 ounces French-style bread, preferably left over, cut into 1/4-inch slices", "3 egg yolks (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the fat in a large saucepan until hot but not smoking and add the onions. Saute the onions over medium to low heat for 30 minutes, stirring occasionally to release the dark, caramelized juices from the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the onions are dark brown, stir in the garlic, salt and pepper and add the water. Mix well to release all the crusty particles in the bottom of the pan. Bring the mixture to a boil, and boil gently, uncovered, for 10 minutes. You should end up with 11 to 12 cups of broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast the bread slices until brown and crusty, break them into pieces, and divide the pieces among six soup bowls. The recipe can be prepared ahead to this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If forgoing the egg yolk enrichment, at serving time bring the soup to a boil, pour it over the toast pieces in each bowl and serve immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are adding the egg yolks, at serving time place the yolks in a mixing bowl and whisk in one ladle of the hot soup. Then add another ladle of soup, whisk it in, and stir the yolk mixture into the remainder of the soup in the saucepan. Mix well and pour the hot soup over the toast in each bowl. Serve immediately."}]}