{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Cabbage Rolls", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "bread crumbs, cabbage, sweet italian sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 51}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 376, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1079 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 head Savoy cabbage (about 1 1/2 pounds)", "8 cups water", "2 tablespoons corn or peanut oil", "1 cup chopped onion", "6 cloves garlic, peeled, crushed and chopped fine (1 tablespoon)", "1 pound sweet Italian sausage", "1/2 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon powdered allspice", "1/3 cup chopped parsley", "2 cups fresh bread crumbs, made from processing 4 to 5 slices of bread (preferably rye) in a food processor", "2 1/2 cups no-salt-added chicken stock (preferably homemade)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard any damaged outer leaves of cabbage and cut away enough of the core to make the leaves easy to remove from the head. Carefully remove and reserve the 12 largest leaves and set the heart aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut out the thick, lower part of the central rib in each of the 12 leaves without disturbing the shape of the leaves. Chop these rib sections with the cabbage heart. You should have about 5 cups. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water to a boil in a pot. Add the 12 cabbage leaves, and bring the water back to a boil. Place an inverted plate on top of the leaves to keep them submerged in the water, and boil them gently for 10 minutes. Drain the leaves in a colander, and immediately place them in a pot of cold water to cool them. When the leaves are cool, lift them out of the water as carefully as possible, gently shake off excess water, and spread them out on a flat work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, heat the oil until hot but not smoking. Add the onion and saute it for 1 minute. Stir in the garlic, and cook the mixture for a few seconds; then add the reserved chopped cabbage and 1 cup of water. Bring to a boil, cover, and boil gently for 10 minutes. Most of the moisture should have evaporated; if it has not, remove the lid, and cook until the mixture is just slightly moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooked cabbage mixture to a bowl. When it is cool enough to handle, add the sausage, salt, pepper, allspice and parsley, and mix well. Finally, add the bread crumbs and mix them in lightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the sausage mixture among 9 of the cabbage leaves, spooning it onto the center bottom of each leaf. (Although the outer leaves of the cabbage are large enough to contain a serving of the filling, the interior leaves are smaller, and you may need to use 1 1/2 or 2 of them together to contain a portion of the filling.) Fold in the sides of the leaves, and roll them tightly to enclose the filling. You should have 9 individual cabbage rolls, 1 1/2 per person."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, arrange the cabbage rolls in one layer, with seam side down, and pour the chicken stock around them. Bring to a boil, cover, reduce the heat, and cook gently for 45 minutes. You should have about 1 cup of juice remaining around the rolls. Divide the cabbage rolls among six plates, spoon some of the juice over them, and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9474-stuffed-cabbage-rolls"}