{"@context": "http://schema.org", "@type": "Recipe", "name": "Safe Caesar Salad", "description": "This recipe came to The Times in the early 1990s, when there was a resurgence of Caesar salads on restaurant menus. All of the work in a classic Caesar salad is in the preparation of the dressing, and in the toasting, basting and frying of the croutons. This recipe omits the coddled egg that is sometimes mixed into the salad at the end of the preparation.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "anchovy, mayonnaise, romaine, appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 359, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "5 grams", "sodiumContent": "645 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large cloves garlic, crushed", "3/4 cup extra-virgin olive oil", "3 thick slices stale white bread", "2 medium-size heads romaine lettuce", "Salt and freshly ground black pepper to taste", "1 teaspoon Worcestershire sauce", "1/3 cup fresh lemon juice", "2 tablespoons commercial mayonnaise or liquid egg product (see note) (optional)", "6 flat anchovies, drained and cut in small pieces (optional)", "1/2 cup freshly grated imported Italian Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Early in the day, mix garlic and oil together and set aside, covered, at room temperature. Garlic and oil should be allowed to marinate at least 8 hours and can be left to marinate up to 4 days in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven (or toaster oven) to 300 degrees. Remove crusts from bread and cut bread into 3/4-inch cubes. Remove garlic from oil, toss bread cubes with 4 tablespoons of the oil, spread them on a baking sheet and allow them to toast about 20 minutes until they are golden brown, turning them so that they toast evenly. Remove from oven and allow to cool briefly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove heavy outer leaves and cores of the heads of lettuce. Tear remaining leaves in 2-inch pieces. Place them in a salad bowl and season to taste with salt and pepper. Toss with the remaining garlic-flavored oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix Worcestershire sauce with lemon juice and, if using, the mayonnaise or egg substitute. Pour over the lettuce, and toss. Add croutons and, if using, the anchovies. Toss again. Sprinkle with grated cheese and serve."}], "link": "https://cooking.nytimes.com/recipes/9476-safe-caesar-salad"}