{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Chicken With Walnut Sauce", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "bread, chicken, walnut, main course", "aggregateRating": null, "recipeIngredient": ["1 chicken, cut into serving pieces (legs and thighs should be severed at the joint)", "Salt and pepper", "2 ounces French or Italian bread", "1 cup milk or stock", "4 ounces walnuts, about 1 cup", "1 small clove garlic, peeled", "1/4 cup walnut, hazelnut or olive oil", "Paprika or chili powder to taste", "1/2 cup chopped fresh parsley leaves, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to medium under a nonstick skillet large enough to hold the chicken pieces without crowding them; use two skillets if necessary. Cook on the first side about 10 minutes, rotating the pieces and adjusting the heat as necessary to brown the pieces evenly. As the pieces brown, season with salt and pepper. Cook the second side as you did the first, then turn once or twice more until done, a total of 20 to 30 minutes. (You can check for doneness by cutting into the pieces; there should be no sign of blood, although traces of pink are all right. The breast and wing pieces will finish cooking first; keep them warm in a low oven, or just set them aside and serve them less than piping hot.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, soak the bread in the milk or stock. Put the walnuts, garlic and some salt in the container of a food processor, and pulse to grind coarsely. Gently squeeze some liquid from the bread, and add the bread to the container, along with the oil. Process until combined but not pur&eacute;ed. Add as much of the remaining milk or stock as necessary to give the mixture a mayonnaise-like consistency. By hand, add the paprika or chili powder, and stir in the parsley if you are using it. Taste and adjust seasoning as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the chicken hot or at room temperature with the sauce spooned over it."}], "link": "https://cooking.nytimes.com/recipes/9485-sauteed-chicken-with-walnut-sauce"}