{"@context": "http://schema.org", "@type": "Recipe", "name": "Napa Cabbage 'steak'", "description": "", "author": {"@type": "Person", "name": "Nobu Matsuhisa"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "japanese", "recipeCategory": "", "keywords": "extra virgin olive oil, mushroom, napa cabbage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 130, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "513 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large head Napa cabbage", "Sea salt", "3 tablespoons extra virgin olive oil", "1 tablespoon yuzu juice or lemon juice", "1 1/2 teaspoons soy sauce", "2 tablespoons grapeseed oil", "6 ounces shiitake mushrooms, stems removed, or thick slices of portobello mushrooms", "1 tablespoon bonito flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice off bottom inch of cabbage at stem end. Remove one layer of leaves and discard. Carefully remove remaining leaves until you get to smaller central ones. Reserve smaller leaves for another use. You should have about 12 large leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one leaf on work surface. Top with another leaf facing the opposite direction, that is, with cut end at leafy end. Dust with pinch of sea salt. Continue stacking leaves, alternating their direction, and dusting every second leaf with salt. Place stack four inches from end of a 16-inch sheet of foil. Lift end of foil over stack of leaves and tightly roll, wrapping the foil as you go. Be careful that foil is wrapped around only the outside of cabbage roll. Tightly tie roll with butcher's cord at 1 1/2- to 2-inch intervals. You should be able to make 6 ties. Use large knife to slice about 1/2 inch from ends of roll, so cut sides are smooth. Then slice roll in sections between cord. You should have 6 thick rounds of cabbage, each wrapped in foil and tied."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 250 degrees. Heat 1 tablespoon olive oil in skillet large enough to hold rolls, a cut side down, in single layer. Cook rolls over medium-low heat until lightly browned on bottom and steam rises from center, 5 to 8 minutes. Turn rolls and cook on other side until lightly browned. Remove rolls to baking dish and place in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cabbage is cooking, mix yuzu juice, soy sauce and grapeseed oil together and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place remaining olive oil in skillet. Add mushrooms and saut&#233; over medium-high heat until softened and lightly browned. Remove from heat. If not serving dish immediately, place mushrooms in small baking dish in oven to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove cabbage from oven and, keeping rolls standing on a cut side, transfer to serving dish or put each on a salad plate. Snip cords and carefully remove foil. Cabbage rolls should hold together neatly. Sprinkle cabbage rolls with bonito flakes. Toss mushrooms with yuzu mixture, place a few mushroom pieces on top of each cabbage roll and serve."}], "link": "https://cooking.nytimes.com/recipes/9496-napa-cabbage-steak"}