{"@context": "http://schema.org", "@type": "Recipe", "name": "Chef Chan's Ma Paul Tofu With Minced Pork", "description": "At Wu Liang Ye in Manhattan, the Ma Paul Tofu is zippy with flavor, and yet its braised cubes melt creamily. With a little ground pork and leek for texture, the dish is simple to make, once the shopping is done, and comes together quickly. Take care not to overcook the tofu.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT30M", "recipeYield": "3 servings (or 2 for addicts)", "recipeCuisine": "chinese", "recipeCategory": "easy, quick", "keywords": "leek, pork, tofu, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "recipeIngredient": ["1 container (about 15 ounces drained) soft tofu", "4 ounces pork, ground fine", "1 tablespoon peanut or other favorite cooking oil", "1 large leek, trimmed, quartered lengthwise and cut crosswise into 1/4-inch-thick slices (use both white and tender green portions)", "1/4 cup chili-soybean paste", "1 tablespoon minced garlic", "1/2 teaspoon ground toasted Sichuan peppercorns", "1/2 cup chicken broth (homemade or from bouillon granules or cubes)", "Cooked white rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain tofu and place on a cutting board. Slice horizontally into thirds. Return stack of slices to tofu container and cut into the tofu crosswise and lengthwise to make 1/2-inch to 3/4-inch cubes. Cover with water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet or wok over medium-high heat, stir-fry pork until no longer pink, about 1 minute. Add the oil, and when hot, add the leek, chili-soybean paste, garlic and peppercorns. Stir-fry for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken broth and bring to a boil. Pour the water off the tofu, and add the tofu to the skillet, shaking the pan so the tofu settles into the broth. Simmer until very tender, about 5 minutes. Serve with or over rice but never under it."}]}