{"@context": "http://schema.org", "@type": "Recipe", "name": "Nettie's Caramel Pie", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "1 pie", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, egg yolks, meringue, pie dough", "aggregateRating": null, "recipeIngredient": ["Dough for 1 pie crust (<a href=\"http://cooking.nytimes.com/recipes/9509-butter-and-shortening-pastry-dough\">see recipe</a>)", "1 cup sugar", "1 cup flour", "2 cups milk", "1/4 teaspoon salt", "3 large egg yolks, lightly beaten", "2 tablespoons unsalted butter", "Triple recipe for Aunt Chick's Egg Meringue (<a href=\"http://cooking.nytimes.com/recipes/9513-aunt-chicks-egg-meringue\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Roll dough out to a disk 11 inches in diameter and ease it into a 9-inch pie pan. Trim the edges. Place parchment paper on the dough and fill with pie weights or dry beans. Bake until the edges of the crust are golden brown, about 20 minutes. Remove the paper and weights and set the crust aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine 3/4 cup of sugar and the flour, milk and salt and set over medium-high heat. Cook, stirring, until the mixture thickens and is smooth, about 6 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining sugar in a small skillet set over medium-low heat. Stir occasionally with a fork until the sugar melts and turns amber in color. Carefully add 1/2 cup of water. (The mixture will sputter.) Raise the heat to medium, and continue to cook, stirring, until the caramel is dissolved and the mixture is slightly reduced, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the caramel to the flour- and-milk mixture. In a large bowl, whisk the egg yolks together and slowly whisk in the hot caramel mixture. Return the mixture to the saucepan and cook over medium heat, stirring, for 3 minutes. Remove from heat and whisk in the butter. Refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble the pie, preheat oven to 425 degrees. Stir the chilled caramel mixture before pouring it into the baked crust. Spread meringue over the top and bake until lightly browned, about 15 minutes. Serve warm or chilled."}], "link": "https://cooking.nytimes.com/recipes/9512-netties-caramel-pie"}