{"@context": "http://schema.org", "@type": "Recipe", "name": "Balinese Thousand-Spice Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT40M", "recipeYield": "About 1/4 cup", "recipeCuisine": "asian", "recipeCategory": "condiments", "keywords": "galangal, shrimp paste, soy sauce, side dish", "aggregateRating": null, "recipeIngredient": ["4 teaspoons vegetable oil", "1 large shallot, finely chopped", "4 cloves garlic, finely chopped", "3-4 red bird chilies, seeded and finely chopped (see note)", "2 1/2 tablespoons galangal, peeled and finely chopped (see note)", "1 tablespoon kentjur (lesser galangal), peeled and finely chopped (see note)", "1 tablespoon fresh turmeric root (see note), peeled and finely chopped, or 1 teaspoon ground dried turmeric", "1/2 tablespoon ground coriander", "3 candlenuts or macadamia nuts, ground or finely chopped (see note)", "1 tablespoon shrimp paste (see note)", "1/2 tablespoon black peppercorns, cracked", "1/4 teaspoon ground nutmeg", "2 cloves, crushed", "1/2 cup sweet soy sauce (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, over medium heat, heat the oil. Add all the ingredients except the sweet soy sauce and cook, scraping the bottom of the pan frequently, until fragrant, about 5 minutes. Reduce the heat to low and continue to cook, stirring occasionally, for 10 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the mixture to a blender. Add 3/4cup water and process until smooth. Return the puree to the skillet, place over medium heat and cook, stirring, for 5 minutes. Add the soy sauce, lower the heat and simmer, covered, stirring occasionally, for 15 minutes. If the mixture seems too thick, stir in a few tablespoons cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the mixture in a sieve over a large bowl. Use in the spiced lobster sate (see recipe)."}], "link": "https://cooking.nytimes.com/recipes/9553-balinese-thousand-spice-sauce"}