{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy White Bean Soup With Bacalao And Piquillo Peppers", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "french, spanish", "recipeCategory": "soups and stews", "keywords": "appetizer, piquillo peppers, salted cod, white beans", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 677, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "10 grams", "proteinContent": "42 grams", "saturatedFatContent": "11 grams", "sodiumContent": "2568 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["9 ounces boneless salt cod", "1 pound dried white beans, preferably Tarbais", "3 tablespoons duck fat or unsalted butter", "3 1/2 ounces pancetta, cubed", "1 medium onion, peeled and diced", "2 carrots, peeled and diced", "4 cups chicken stock or water", "1 sprig fresh thyme", "4 sprigs flat-leaf parsley", "4 bay leaves", "Salt, freshly ground white pepper and Espelette pepper or hot paprika to taste", "2 cups light cream or 1 cup each heavy cream and half-and-half", "1 1/2 tablespoons sherry vinegar", "2 cups whole milk", "2 cloves garlic, crushed", "3 jarred piquillo peppers, drained and cut into slivers", "1/2 cup extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place salt cod in a bowl, cover with cold water and refrigerate for 48 hours, changing water 7 times. Place beans in a bowl, and cover with cold water to a depth of 2 inches. Soak overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt duck fat or butter in a large saucepan. Add pancetta, onion and carrots, and saute over medium heat until golden. Drain beans and add them, then pour in the chicken stock. Tie sprig of thyme, 1 sprig parsley and 2 bay leaves together and add. Simmer, partly covered, about 40 minutes, skimming if necessary, until beans are tender. Remove from heat and cool to room temperature. Season to taste with salt, white pepper and Espelette pepper or paprika."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard herb bundle. Remove 6 tablespoons beans and reserve. Place remaining contents of saucepan in a food processor or blender, puree, then pass through a fine strainer. Return to saucepan, add cream and reheat. Add vinegar and adjust seasonings as needed. Set aside until serving time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain salt cod, place in a saucepan and add milk, garlic and remaining bay leaves. Bring barely to a simmer and cook 7 minutes, until cooked through. Reserve milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a nonstick skillet, warm reserved beans over medium heat and crush with fork. Drain and break up salt cod and mix it with beans, along with piquillo peppers, 1/3 cup olive oil and leaves from remaining sprigs of parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat soup and check seasonings. Thin with a little reserved milk if needed. Place a mound of bean and salt cod mixture in center of each of 8 soup plates. At table, pour soup from a pitcher or carafe into each bowl, and drizzle each with a little remaining olive oil."}]}