{"@context": "http://schema.org", "@type": "Recipe", "name": "Gâteau de Crêpes", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/Gteau-de-Crpes/Gteau-de-Crpes-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "Serves 10", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, flour, vanilla bean, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 615, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "22 grams", "sodiumContent": "143 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons butter", "3 cups milk", "6 eggs", "1 1/2 cups flour", "7 tablespoons sugar", "Pinch salt", "2 cups milk", "1 vanilla bean, halved and scraped", "6 egg yolks", "1/2 cup sugar", "1/3 cup cornstarch, sifted", "3 1/2 tablespoons butter", "Corn oil", "2 cups heavy cream", "1 tablespoon sugar or more", "3 tablespoons Kirsch", "Confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before, make the crepe batter and the pastry cream. Batter: In a small pan, cook the butter until brown like hazelnuts. Set aside. In another small pan, heat the milk until steaming; allow to cool for 10 minutes. In a mixer on medium-low speed, beat together the eggs, flour, sugar and salt. Slowly add the hot milk and browned butter. Pour into a container with a spout, cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pastry cream: Bring the milk with the vanilla bean (and scrapings) to a boil, then set aside for 10 minutes; remove bean. Fill a large bowl with ice and set aside a small bowl that can hold the finished pastry cream and be placed in this ice bath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium heavy-bottomed pan, whisk together the egg yolks, sugar and cornstarch. Gradually whisk in the hot milk, then place pan over high heat and bring to a boil, whisking vigorously for 1 to 2 minutes. Press the pastry cream through a fine-meshed sieve into the small bowl. Set the bowl in the ice bath and stir until the temperature reaches 140 degrees on an instant-read thermometer. Stir in the butter. When completely cool, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake the next day: Bring the batter to room temperature. Place a nonstick or seasoned 9-inch crepe pan over medium heat. Swab the surface with the oil, then add about 3 tablespoons batter and swirl to cover the surface. Cook until the bottom just begins to brown, about 1 minute, then carefully lift an edge and flip the crepe with your fingers. Cook on the other side for no longer than 5 seconds. Flip the crepe onto a baking sheet lined with parchment. Repeat until you have 20 perfect crepes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pass the pastry cream through a sieve once more. Whip the heavy cream with the tablespoon sugar and the Kirsch. It won't hold peaks. Fold it into the pastry cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay 1 crepe on a cake plate. Using an icing spatula, completely cover with a thin layer of pastry cream (about 1/4 cup). Cover with a crepe and repeat to make a stack of 20, with the best-looking crepe on top. Chill for at least 2 hours. Set out for 30 minutes before serving. If you have a blowtorch for crème brûlée, sprinkle the top crepe with 2 tablespoons sugar and caramelize with the torch; otherwise, dust with confectioners' sugar. Slice like a cake. Batter adapted from ''Joy of Cooking.'' Pastry cream adapted from ''Desserts,'' by Pierre Hermé and Dorie Greenspan."}]}