{"@context": "http://schema.org", "@type": "Recipe", "name": "Rabe With Pasta", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "broccoli rabe, olive oil, penne, side dish", "aggregateRating": null, "recipeIngredient": ["1 1/2 pounds rabe", "1/4 cup olive oil", "1 teaspoon finely minced garlic", "1/8 teaspoon dried hot red pepper flakes", "4 anchovy fillets, finely minced", "8 cups water", "Salt to taste, if desired", "1/4 pound penne or ziti", "1 tablespoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the larger, tough stems of the rabe, leaving only the tender, slender stems, leaves and bulbous offshoots. If desired, you may trim the outer tougher stems by scraping the sides or, preferably, pulling away the outer coating of the stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the reserved edible portions, leaving the water that clings to the pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan heat the oil and add the garlic, pepper flakes and anchovy. Add the rabe with the water that clings to the pieces. It is not necessary to add more liquid, but watch the vegetable carefully as it cooks so that it does not stick and burn. Cover closely and cook over moderate heat. Turn the broccoli pieces over and over so that they cook evenly. Cook 4 to 5 minutes, or until the pieces are tender. Do not overcook, or they will become mushy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring the water to the boil with salt to taste. Add the pasta and cook, stirring often, until tender, 10 minutes or longer. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the pasta onto the rabe and stir in the butter. Toss gently to blend."}]}