{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Flank Steak With Kimchi-Style Coleslaw", "description": "It is easy enough to take the basic ingredients and flavors of kimchi and create a fast cabbage salad that puts ordinary coleslaw to shame. Use it as a bed for grilled beef – or anything else that has the flavor to stand up to it – and you have a great summer dish.  All kimchi packs a punch, thanks to plenty of garlic and chili peppers, and appropriate quantities are listed here. Increase the amounts if you like, though these should be strong enough. If you can get to a Korean market, buy some of the ground chili powder labeled <i>co chu karo</i>, which is hot but also flavorful. Otherwise substitute any good ground chiles or crushed red pepper flakes. Fish sauce is traditional, although you can use soy sauce if you prefer.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/06/13/dining/13COOKING-GRILLED-FLANK-STEAK1/13COOKING-GRILLED-FLANK-STEAK1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner, steaks and chops", "keywords": "fish sauce, flank steak, napa cabbage, low-carb, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "38 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1166 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 small head Napa or Savoy cabbage, about 3 pounds", "Coarse salt", "3 spring onions or 6 large scallions, trimmed and chopped", "3 cloves garlic, minced, or to taste", "1 tablespoon co chu karo or crushed red pepper flakes, or to taste", "1 tablespoon peeled and minced ginger", "3 tablespoons fish sauce or soy sauce", "2 tablespoons rice wine or other vinegar", "1 flank steak, about 1 1/2 pounds", "Ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove tough exterior leaves of cabbage; core it by cutting a cone-shape wedge out of the stem end. Shred cabbage into thin strips, and separate the strips by hand. Put in a colander, and toss with about 1 tablespoon salt and the onions or scallions. Let sit for at least an hour, preferably two, tossing occasionally, until cabbage wilts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare a grill. Combine garlic, co chu karo, ginger, fish sauce and vinegar in a bowl. Grill steak for about 4 minutes to a side for medium rare (more time or less according to the degree of doneness you prefer), turning once. Sprinkle steak with salt and pepper as it cooks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove steak from grill, and let it rest. Squeeze as much liquid as you can out of the cabbage, and toss it with 1 or 2 tablespoons of dressing, or more to taste. To serve, carve steak. Place a portion of cabbage on a plate, and top with slices of steak. Lightly drizzle steaks with dressing, and serve. Remaining dressing can be refrigerated in an airtight container for several days."}], "link": "https://cooking.nytimes.com/recipes/9606-grilled-flank-steak-with-kimchi-style-coleslaw"}