{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach Lasagna", "description": "Equal parts indulgent and virtuous, this meatless lasagna from Mark Bittman will please everyone at the table. Serve it with a green salad on a weeknight, or alongside a platter of meatballs for Sunday dinner. And listen: We won't tell anyone if you use no-boil noodles or frozen spinach. It's all good either way.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/12/dining/12COOKING-LASAGNA1/12COOKING-LASAGNA1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings or more", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles", "keywords": "lasagna noodles, spinach, tomato sauce, main course, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1185}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 588, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "36 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1451 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["12 to 16 dried or fresh lasagna noodles", "3 to 4 cups good tomato sauce", "2 tablespoons extra virgin olive oil", "3 cups cooked spinach, squeezed dry and chopped (about 1 1/2 pounds fresh)", "1 1/2 cups ricotta", "1 1/2 cups coarsely grated mozzarella", "2 cups grated Parmesan", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you're using dried pasta, bring a large pot of salted water to a boil. If you're using fresh pasta sheets, cut them into long wide noodles approximately 3 inches by 13 inches, or a size that will fit into your lasagna dish. Cook the noodles (6 at a time for dried noodles) until they are tender but still underdone (they will finish cooking as the lasagna bakes); fresh pasta will take only a minute. Drain and then lay the noodles flat on a towel so they won't stick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Grease a rectangular baking dish with the olive oil, add a large dollop of tomato sauce and spread it around. Put a layer of noodles (use four) in the dish, trimming any overhanging edges; top with a layer of tomato sauce, one-third of the spinach, and one-fourth of the ricotta (use your fingers to spread it evenly), the mozzarella and the Parmesan. Season with salt and pepper if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the layers twice, and top with the remaining noodles, tomato sauce, ricotta, mozzarella and Parmesan; the top should be covered with cheese; add more ricotta and Parmesan as needed. (The lasagna may be made ahead to this point, wrapped tightly and refrigerated for up to a day or frozen. Bring to room temperature before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the lasagna is bubbling and the cheese is melted and lightly browned on top, about 30 minutes. Remove from the oven and let rest a few minutes before serving, or cool completely, cover well, and refrigerate for up to 3 days, or freeze."}]}