{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon With Salsa Fresca", "description": "There was a time when the appearance of the first ripe tomatoes would have inspired me to make the southern Italian sauce of raw tomatoes, basil, garlic and olive oil. These days, I turn to a Mexican-style salsa fresca: tomatoes, white onion, chili and loads of cilantro and lime. I love salsa with fish, and since it is wild salmon season, the marriage seems opportune. Halibut and swordfish, whether grilled, broiled, roasted, or even steamed, are equally fine. Though the salsa is quick to prepare, it's best if allowed to sit for 15 to 30 minutes before serving. The tomatoes' juices will run, and the flavors will mingle. No more than an hour, though.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/06/13/dining/13COOKING_SALMON1/13COOKING_SALMON1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, seafood", "keywords": "habañero, salmon fillet, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 381, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "5 grams", "sodiumContent": "589 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large fresh ripe tomatoes, or 3 or 4 ripe plum tomatoes, cored and diced", "1/2 large white onion, peeled and minced", "1/4 habanero or jalapeño chili, stemmed, seeded and minced, or to taste", "1/2 cup roughly chopped cilantro or flat-leaf parsley leaves", "Juice of 1 or 2 limes, to taste", "Freshly ground pepper and salt to taste", "1 salmon fillet, about 1 1/2 pounds, preferably with skin on", "2 tablespoons neutral oil, like corn or canola"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or gas grill; fire should be moderately hot and grill rack about 4 inches from heat source. Or, heat oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop tomatoes and combine them in a bowl with onion, chili, cilantro, lime juice and some salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle fish with salt and pepper. If grilling, rub fish with a little oil as well; put it on grill, skin side down, and let it sit for 4 to 5 minutes, then turn once (don't worry if part of skin sticks to grill). Cook for about 3 minutes more, until medium-rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If roasting, heat a large nonstick skillet over high heat for a minute. Add oil and, a few seconds later, salmon, skin side up. Sear for a minute, then transfer to oven and roast until medium-rare, about 10 minutes. Allow to rest for a minute or so, then remove skin. Turn over and serve, passing salsa at the table."}]}