{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Pavlova", "description": "The particular joy of this dreamy dessert, which was named in honor of the Russian ballerina, is that the meringue base can be made in advance. Then to serve it, drizzle the strawberries with a little balsamic vinegar and vanilla (a combination that brings out the fullest essential flavor of the fruit), whip some cream and arrange it all on a plate. It’s magnificent, and deliriously easy.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2016/03/15/dining/15COOKING-STRAWBERRYPAVLOVA1/15COOKING-STRAWBERRYPAVLOVA1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "australian", "recipeCategory": "brunch, project", "keywords": "dessert, egg whites, heavy cream, strawberry, gluten-free, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 850}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 472, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "18 grams", "sodiumContent": "109 milligrams", "sugarContent": "47 grams", "transFatContent": null}, "recipeIngredient": ["4 egg whites", "Pinch of salt", "1 1/4 cups superfine sugar", "2 teaspoons cornstarch", "1 teaspoon white-wine vinegar", "A few drops vanilla extract", "1 pound strawberries, hulled and halved or quartered", "1/2 teaspoon high-quality vanilla extract", "1 teaspoon high-quality balsamic vinegar", "2 teaspoons superfine sugar", "2 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare meringue: heat oven to 350 degrees. Line a baking sheet with parchment paper, and draw a circle on the paper using an 8- or 9- inch cake pan as a guide. Flip the parchment over so the pencil marking is facing down (this ensures that the pencil won't transfer to the meringue). In bowl of an electric mixer, combine egg whites and salt. Begin beating at low speed, slowly increasing to high. Continue until satiny peaks begin to form; gradually beat in sugar a tablespoon at a time until meringue is stiff and shiny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle in cornstarch, white-wine vinegar and vanilla, and fold in gently. Mound onto parchment within circle, and shape into a disk, flattening top and smoothing sides. Place in oven, and immediately reduce heat to 300 degrees. Bake 1 hour 15 minutes. Turn off heat, and allow meringue to cool completely in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare topping: in a mixing bowl, combine strawberries, vanilla, balsamic vinegar and sugar. Cover with plastic wrap. Let sit at room temperature at least 15 minutes and up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, carefully peel off parchment and place meringue on a platter or cake stand. Gently crack the top with the back of a soup spoon to make a shallow nest for the whipped cream and berries. Whip cream until it is thick enough to hold peaks, and spoon it evenly over meringue. Cover cream with strawberries, allowing a small amount of their liquid to dribble onto cream. Serve immediately."}]}