{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Dagwood", "description": "This sandwich takes advantage of late-summer’s bounty, with a pile of vegetables set between two layers of focaccia. It takes about half an hour to prepare. You’ll glaze some sliced onions with garlic, lemon and olive oil, chop and sauté the vegetables you happen to have on hand, and then layer it all with slices of your best tomatoes, some cheese and chopped olives. A smear of mayonnaise helps stick the whole thing together.", "author": {"@type": "Person", "name": "Kay Rentschler"}, "image": "https://static01.nyt.com/images/2014/03/10/dining/dagwood-still/dagwood-still-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "lunch, quick, weekday", "keywords": "eggplant, focaccia, semisoft cheese, main course, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 759, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "15 grams", "proteinContent": "22 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1491 milligrams", "sugarContent": "19 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup olive oil (not extra virgin)", "4 very thin slices lemon", "2 garlic cloves, peeled", "1 medium white or yellow onion in 1/2-inch rings", "1 teaspoon sugar", "Salt", "Freshly ground black pepper", "1 tablespoon balsamic or red wine vinegar", "1 large red pepper, seeds and pith removed, in 1/2-inch rings", "2 Italian eggplants in 1/2-inch slices", "1/4 cup mayonnaise", "10 green olives, pitted and chopped", "1/2 teaspoon minced fresh thyme", "4 4-inch squares focaccia or similar flatbread, sliced in two horizontally", "1 large ripe tomato, sliced", "4 ounces semisoft cheese like Bel Paese, provolone, mozzarella, Muenster or young Gouda, thinly sliced", "8 large basil leaves", "4 leaves romaine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil in a 10-inch nonstick skillet over medium-low heat. Add lemon, garlic and onion but keep separate. Turn lemon and garlic frequently to soften; leave onion rings unturned. After about 3 minutes, transfer lemon and garlic to paper towels and set aside. Increase heat to medium-high, turn onions and cook until soft and golden. Sprinkle with sugar, salt and pepper. Add vinegar and glaze onions. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place peppers in same skillet in a single layer and coat with any remaining vinegar in skillet. Turn peppers, sprinkle with salt and pepper and cook until just beginning to soften. Transfer peppers to a separate plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe skillet with paper towel and return to high heat. Brush eggplant slices on both sides with remaining olive oil. Add to hot skillet in a single layer and cook, turning occasionally, until deep brown on both sides, 7 to 10 minutes. Sprinkle with salt and pepper, and transfer to paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While eggplant browns, chop reserved garlic and lemon, and stir it into mayonnaise along with olives and thyme. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To build sandwiches: Spread focaccia slices with mayonnaise. Layer onions, peppers, eggplant, tomato, cheese, basil and romaine in an order that pleases you. Cut and serve immediately."}]}