{"@context": "http://schema.org", "@type": "Recipe", "name": "Paula Gabriel's Persian Rice With Tah Dig Crust", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "9 servings", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "basmati rice, saffron, yogurt, gluten-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "recipeIngredient": ["3 cups basmati rice", "2 tablespoons salt", "3 tablespoons butter", "Large pinch saffron, pulverized using a mortar and pestle", "2 1/2 tablespoons yogurt", "1 tablespoon vegetable oil", "Sumac to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the rice in a large bowl and fill with water. Stir, and drain. Repeat 2 more times. Place the rice in a 4-quart pot and add enough water to cover the rice by 1 inch. Stir in the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place over high heat. Bring to a boil, reduce heat to medium and cook, uncovered, for 10 minutes. In a strainer, rinse rice completely under cold running water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt 1 tablespoon of the butter with the saffron and 3 tablespoons of water, in a small pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove 1 cup of the rice to a bowl and stir in the yogurt and 1/4 teaspoon of the saffron butter mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the remaining butter and oil in a 3- or 4-quart pot over medium low heat. When the butter is melted, add the yogurt rice and spread evenly on the bottom of the pot. Spoon in the rest of the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a rubber spatula, carefully push the rice away from the sides of the pot, scraping it up into a mound. In the center of the mound, pierce 3 vent holes about an inch apart, with a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining saffron-butter mixture over the rice and cover with a clean, dry dishcloth and the pot cover. Cook on medium low for 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dip the bottom of the pot in a tub of cold water. Spoon the rice into a serving bowl, leaving the crusty portions in the pot. Then with a metal spatula, scrape the crust out and place on top of the rice. And serve sprinkled with sumac."}], "link": "https://cooking.nytimes.com/recipes/9654-paula-gabriels-persian-rice-with-tah-dig-crust"}