{"@context": "http://schema.org", "@type": "Recipe", "name": "Confit Chicken Salad", "description": "", "author": {"@type": "Person", "name": "Geoffrey Zakarian"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "project, salads and dressings", "keywords": "appetizer, bacon, chicken thigh, extra virgin olive oil", "aggregateRating": null, "recipeIngredient": ["4 chicken thighs", "Salt and freshly ground black pepper", "1 shallot, sliced thin", "3 cloves garlic", "2 bay leaves", "Several sprigs fresh thyme", "3 1/2 to 4 1/2 cups extra virgin olive oil", "1/4 pound slab bacon, diced", "8 thin slices baguette, lightly toasted", "5 tablespoons red wine vinegar", "2 heads frisee, rinsed, dried, cored and torn in pieces", "1 bunch arugula or watercress, rinsed, dried and heavy stems removed", "1 tablespoon finely minced flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken in shallow dish. Season with salt and pepper and scatter shallots, 2 cloves garlic, bay leaves and thyme on top. Cover and refrigerate 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken, with seasonings, in saucepan that will hold it snugly in single layer. Pour in enough oil to cover completely. Heat, adjusting burner so oil simmers very gently. Cook 1 3/4 hours, skimming surface from time to time. Allow to cool, then refrigerate overnight. It can be refrigerated for a week or even a bit more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Saute bacon until lightly browned. Drain, reserving 2 teaspoons fat, and place on paper towel. Rub toast slices with remaining garlic clove and brush with a little olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat 6 tablespoons olive oil with vinegar and bacon fat. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place frisee and arugula or watercress in salad bowl and toss with dressing. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from refrigerator, and scrape off as much oil as possible. Heat a nonstick skillet and place chicken, skin side down, in it over medium heat. Saute until skin is browned, 2 to 3 minutes. Turn and saute other side 2 to 3 minutes. Remove chicken from pan and use small knife to remove bone. Slice chicken, place in salad bowl and toss gently with greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 slices toast on each of 4 plates. Mound chicken and greens in center. Scatter with bacon and parsley, and serve."}]}