{"@context": "http://schema.org", "@type": "Recipe", "name": "Swiss Chard Tart", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "1 10-inch tart", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, one pot", "keywords": "flour, swiss chard, yeast, main course", "aggregateRating": null, "recipeIngredient": ["1 1/4-ounce package active dry yeast", "1/2 teaspoon kosher salt", "1 large egg", "1 teaspoon canola oil, plus extra to oil 10-inch pastry ring", "1 1/4 cups flour, plus extra for rolling out dough", "1/2 pound Swiss or ruby chard leaves (reserve stems), washed, dried and roughly chopped (about 8 cups)", "1/4 cup rice, cooked 8 minutes until barely firm", "2 large eggs", "1 3 1/2-ounce button fresh, soft goat cheese", "1/4 pound prosciutto", "1/4 teaspoon kosher salt", "Freshly ground black pepper to taste", "1 large egg", "1 teaspoon milk or cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make dough, sprinkle yeast over 1/4 cup warm water and let sit for 5 minutes. There should be some bubbling action after a few minutes. If nothing happens, the yeast is old and should be discarded. Combine remaining ingredients for pastry in a small bowl. When ready, add the yeast-water mixture. Combine the two mixtures. Turn out on a flat surface, and knead, just until combined. If dough is too wet and sticky, add a little more flour. Form dough into a ball, return to bowl, cover with a kitchen towel and put in a warm place for 1 hour or until doubled in volume."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make filling. In a food processor, pulse all the ingredients for filling until well combined, scraping down the sides of the bowl once or twice. Mixture should not be a puree, but should have texture. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 20 minutes before cooking the tart, place rack in the center of oven. Heat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a 10-inch pastry ring. Place it on a baking sheet. Lightly oil the section of sheet enclosed by ring. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in half. Roll out bottom crust to a 12-inch circle, using extra flour as needed. Twirl dough onto the rolling pin, and set into the oiled ring. Tuck dough snugly into the ring. Leave the dough edges up along sides of ring. Lightly prick dough with a fork, so that it will not rise too much while cooking. Spread the filling evenly over the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll second half of dough into a 10-inch circle. Place circle on top of filling and smooth with fingers. Fold edges of first crust over second to seal in filling. Trim flap to about 1/4-inch width, and remove any extra dough. Pat down gently with a fork to make a firmer seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the glaze, beat egg with milk or cream (or water). Brush glaze over crust. Using the sharp tip of a knife, make 3 slashes in the crust to act as air vents. Cook for 40 minutes. Remove from oven, and gently slide tart off onto a flat plate. Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/9675-swiss-chard-tart"}