{"@context": "http://schema.org", "@type": "Recipe", "name": "Galette De Perouges", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT2H", "recipeYield": "about 6 servings", "recipeCuisine": "french", "recipeCategory": "pizza and calzones, project", "keywords": "butter, flour, yeast, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 477, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "20 grams", "sodiumContent": "64 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 teaspoon instant or rapid-rise yeast", "2 cups flour, plus more for sprinkling", "Pinch salt", "1/4 cup plus 1 tablespoon sugar", "1 stick cold unsalted butter, cut into chunks", "1 egg", "Zest of 1 lemon", "1 stick unsalted butter, softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine yeast, flour, salt, tablespoon of sugar, cold butter, egg and lemon zest in food processor. Turn machine on, let it run for a second until mixture is blended, and then let machine run while you add 1/4 cup water through feed tube, a little at a time, until mixture forms a ball and is slightly sticky to the touch. If it is dry, add another tablespoon or 2 of water, and process for another 10 seconds. (In the unlikely event that mixture is too sticky, add flour, a tablespoon at a time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough onto very lightly floured work surface, and knead by hand for a few seconds to form a smooth, round ball. Place in a bowl, covered with plastic wrap or damp cloth, and let rise in warm, draft-free area until dough just about doubles in size, or at least 1 hour. (You can also let dough rise more slowly, in refrigerator, for as long as 6 or 8 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to at least 500 degrees (600 is better, if your oven goes that high). Knead dough lightly, and place it on a very lightly floured surface; sprinkle it with a little more flour, and cover with plastic wrap or towel. Let it rest while oven heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat or roll out dough as thinly as possible to a diameter of 12 inches, using a little more flour if necessary. The process will be easier if you allow dough to rest occasionally between rollings. If you have a pizza stone in your oven, place dough on a floured peel, or long-handled board; if you do not, lay dough on lightly buttered baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread dough with softened butter, and sprinkle it with remaining sugar. Bake until crust is nicely crisp and sugar lightly caramelizes, about 10 minutes; if galette is browning unevenly, rotate it back to front about halfway through cooking time. Serve hot or at room temperature as a snack, or at room temperature with creme fraiche and cut-up ripe fruit."}]}