{"@context": "http://schema.org", "@type": "Recipe", "name": "Crescents of Melon on Fresh Ricotta", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "berries, melon, milk, dessert, gluten-free, summer", "aggregateRating": null, "recipeIngredient": ["2 cups blueberries, washed and sorted", "1 1/2 cups sugar", "2 cups raspberries", "7 1/2 cups fresh whole milk", "1/2 cup heavy cream", "1 cup yogurt", "1/2 cantaloupe, sliced into 16 crescents, rinds removed", "1/2 honeydew, sliced into 16 crescents, rinds removed", "1/2 Crenshaw, sliced into 16 crescents, rinds removed", "8 edible blossoms"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the syrups, puree the blueberries in a food processor or blender and put them in a small pot. Add half the sugar and cup water, bring to a boil, then simmer for 2 minutes. Let cool before running the syrup through a fine- mesh strainer. Discard the solids. Then repeat the same process with the raspberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ricotta, line a mesh sieve with a double-layered square of cheesecloth, with plenty to overlap the sieve. Meanwhile, combine the milk, cream and yogurt in a pot over high heat and bring to a boil. Reduce the heat and simmer until the mixture begins to curdle, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the milk is curdled, pour it into the cheesecloth and allow it to drain about 5 minutes. Gather up the four corners of the cheesecloth, tie a stick into it as if for a satchel and prop the stick on the edges of a bowl and allow it to drain until firm, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, assemble 8 plates. Paint half of each plate with the blueberry syrup and half with the raspberry syrup. Mound 1/4 cup of the ricotta on the center of each plate. Stack 6 alternating slices of melon together and place on the plate so that the inside of their crescent shape faces the cheese; then fan them slightly. Garnish with an edible blossom. Repeat with the remaining 7 servings."}], "link": "https://cooking.nytimes.com/recipes/9702-crescents-of-melon-on-fresh-ricotta"}