{"@context": "http://schema.org", "@type": "Recipe", "name": "Coriander Duck With Sweet-Potato Sauce", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "duck, parsnip, sweet potato, main course", "aggregateRating": null, "recipeIngredient": ["2 pounds (3 large) sweet potatoes, peeled", "1 5- to 6-pound duck (see note)", "Salt and freshly ground black pepper", "5 teaspoons grape-seed oil", "2 medium onions, diced", "1 rib celery, diced", "1 large carrot, peeled and diced", "8 cups low-sodium chicken or duck stock", "2 medium parsnips, peeled", "1 tablespoon coriander seeds", "Grated zest of 2 lemons", "1 Thai chili or other very small hot chili, very thinly sliced", "1 tablespoon fresh lemon juice", "1/8 ounce fresh ginger (about 1 tablespoon), sliced paper thin", "1 tablespoon chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a food processor, or by hand, finely chop the sweet potatoes. Transfer about a cup to a blender, add 1/2 cup water, and puree as finely as possible. Continue adding the potatoes until all are pureed. Place a fine-mesh strainer over a bowl, pour in the puree, and stir and press to extract as much liquid as possible. Discard the solids, and allow the liquid to sit for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the duck quarters with salt and pepper; refrigerate the breasts. Place a 14-inch nonstick or well-seasoned skillet over medium-high heat, and add 2 teaspoons of the oil. Sear the quarters until browned on all sides. Add the onions, celery and carrot, and stir until they have softened and are beginning to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock, and bring to boil. Reduce the heat to low. Simmer, partly covered, for 1 hour. Add the parsnips, and simmer until tender, about 1/2 hour more. Set the duck and parsnips aside on a plate. Place the fine-mesh strainer over a large bowl, and pour in the stock and remaining vegetables. Discard the solids. Return the stock to the skillet; over high heat, boil until it is reduced to 3/4 cup. Remove from the heat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small skillet over medium-low heat. Toast the coriander seeds, stirring, until fragrant, 30 to 60 seconds. Grind coarsely with mortar and pestle. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the sweet-potato liquid into a small pan, discarding the thick starch at the bottom of the bowl. Take the duck breasts out of the refrigerator, and allow them to reach room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Spray two baking sheets with nonstick spray. Rub the parsnips with 1 teaspoon of the oil, and place on one sheet. Cover them with the other baking sheet, sprayed side down. Bake until the parsnips are browned, 15 to 20 minutes. Set the parsnips aside to cool, but keep the oven at 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sweet-potato sauce: Place the pan of sweet-potato juice over low heat, and bring to a simmer. Add the lemon zest. Simmer, stirring occasionally, until the liquid has thickened; it should not taste starchy. Add the chili, lemon juice and ginger. Simmer 1 minute. Add the reduced stock, and salt and pepper to taste. Remove from heat; cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the duck breasts with salt and pepper. Pat the tops with the ground coriander seeds, and sprinkle the other side with the parsley. Place a large oven-proof skillet over medium-high heat, and add the remaining 2 teaspoons of oil and the duck breasts, parsley side down. Sear for about 15 seconds, then turn to sear the other side. Add the duck quarters, then put the skillet into the hot oven. Roast until breasts are medium-rare, about 3 minutes. Remove the skillet from the oven, cover lightly with foil, and allow the duck to rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, thinly slice the breasts, less than 1/8 inch thick, and halve parsnips lengthwise. Place a parsnip half on each of four plates. Fan the breast slices across the parsnip, and lean a duck quarter against the highest point. Drizzle with sauce."}]}