{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Scaloppine With Hazelnuts and Balsamic Vinegar", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "dry white wine, hazelnut, veal, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 423, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "26 grams", "saturatedFatContent": "9 grams", "sodiumContent": "432 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup hazelnuts", "4 tablespoons unsalted butter", "1 tablespoon vegetable oil", "1 1/2 pounds veal scaloppine, pounded very thin", "1 cup flour", "2/3 cup dry white wine", "Kosher salt and freshly ground black pepper", "1 tablespoon balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the hazelnuts in a small skillet and set it over high heat. Cook, shaking the pan frequently, until the nuts are lightly toasted. As soon as they are cool enough to handle, use your fingertips to squeeze most of their skins off. Transfer the nuts to a food processor or use a knife to coarsely chop them. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 3 tablespoons of the butter and the tablespoon of oil in a large skillet and set it over high heat. When hot, dip the scaloppine on both sides in the flour, shake off any excess and slip it into the skillet, adding only as many pieces as will fit loosely in the pan. Cook until lightly browned, about 1 to 2 minutes for each side. Transfer to a serving platter and repeat until all the scaloppine is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wine in the skillet and cook, scraping any browned bits from the bottom of the pan. Add the hazelnuts and continue to cook until the wine has evaporated. Stir in the remaining tablespoon of butter. Sprinkle the scaloppine with salt and pepper and add it to the pan, turning 2 or 3 times, until just warmed through. Remove the pan from the heat and pour in the balsamic vinegar. Return the scaloppine to the platter and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9712-veal-scaloppine-with-hazelnuts-and-balsamic-vinegar"}