{"@context": "http://schema.org", "@type": "Recipe", "name": "Fast Scallion Pancakes", "description": "This isn’t the dense scallion pancake you see served in Chinese restaurants, which is made with what amounts to bread dough. But this recipe is inspired by that pancake. Made with a simplified, scallion-laden batter, it is a fork-tender pancake reminiscent of a vegetable fritter. The flavor is great, and the preparation time is about 20 minutes, an improvement on the hours you’d need to let typical scallion pancake dough rise. They are good not only as a side dish, but also as a platform for stews and juicy roasts — place a couple on a plate and spoon the stew on top. And although I still associate them with Asian-flavor dishes, omitting the optional soy sauce makes them a perfect accompaniment to braised foods that use European seasonings. (If you omit the soy sauce, also feel free to use any vegetable oil, or even good olive oil.) The same formula can be used to make pancakes with other members of the onion family, especially shallots and spring onions.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/01/17/dining/17COOKING-SCALLION-PANCAKES2/17COOKING-SCALLION-PANCAKES2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "breakfast", "keywords": "eggs, flour, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 459}, "recipeIngredient": ["Salt and freshly ground black pepper", "4 bunches scallions or spring onions, about 1 pound", "1 egg", "1 teaspoon soy sauce", "1/2 cup flour", "Peanut, canola or olive oil as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of salted water to a boil while you trim the scallions. Roughly chop three bunches, and mince the fourth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the larger portion of scallions to the water, and cook about 5 minutes, or until tender. Drain, reserving about 1/2 cup of the cooking liquid. Puree the cooked scallions in a blender, adding just enough of the cooking liquid to allow the machine to do its work."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the puree with the egg and soy, then gently stir in the flour until blended. Add pepper to taste, then the reserved minced scallions. Film a nonstick or well-seasoned skillet with oil, and turn the heat to medium-high. Drop the batter into the pan by the tablespoon or quarter cup, and cook about 2 minutes to a side, or until lightly browned. If necessary, the pancakes can be kept warm in a 200-degree oven for about 30 minutes."}], "link": "https://cooking.nytimes.com/recipes/9726-fast-scallion-pancakes"}