{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Lobsters With Sea Parsley And New Potatoes", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "new england", "recipeCategory": "", "keywords": "lobster, new potatoes, sea parsley, main course", "aggregateRating": null, "recipeIngredient": ["5 cups (about 4 ounces) sea parsley", "2 lobsters, each 1 3/4 pounds", "1 1/4 pounds small new potatoes", "1 shallot, finely minced", "5 tablespoons cold unsalted butter, diced", "1 teaspoon fresh lemon juice", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1/2 inch of water in the bottom of a kettle fitted with a steamer rack. Cover the kettle, and bring it to a boil. Place parsley on the rack, and put lobsters on the parsley. Cover pot, and steam until lobsters are cooked through, 12 to 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place potatoes in a saucepan, and cover with cold salted water. Bring to a boil, lower heat, and simmer until they are just tender, 20 to 25 minutes. Remove from heat, drain, cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the lobsters are cooked, remove them from steamer with tongs, and place them on a platter. Remove the sea parsley from the steamer, and place it next to the lobsters. Measure out 1 1/2 cups of the liquid from the steamer, and place it in a small saucepan with the shallots. Place the pan over medium-high heat, and cook, uncovered, until only a tablespoon or two of liquid remains, about 10 minutes. Reduce heat as low as possible, and begin whisking the cold butter, a piece at a time, into the pan. Immediately remove the pan from the heat, stir in the lemon juice, and season the sauce to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss potatoes with 3 tablespoons of the butter sauce. Place remaining sauce in a small dipping bowl."}], "link": "https://cooking.nytimes.com/recipes/9729-steamed-lobsters-with-sea-parsley-and-new-potatoes"}