{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Roll", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT20M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, crab meat, pesto, smoked salmon, raw", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 111, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "198 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 very thin slices smoked salmon", "3/4 cup plus 2 tablespoons cooked crab meat", "2 1/2 tablespoons heavy cream", "Kosher salt", "Freshly ground black pepper", "2 1/2 teaspoons pesto (one with little cheese)", "1/4 cup olive oil", "2 tablespoons caviar, optional", "Chervil sprig or basil leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each salmon slice into a 2-by-4-inch rectangle, reserving trimmed edges for another use. Cover a baking sheet with plastic wrap. Lay the salmon out on the plastic wrap, and cover with another layer of plastic wrap. Chill in the refrigerator for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine crab meat and cream, mixing with a fork to break up the crab into fine shreds and to bind it lightly with the cream. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For each salmon roll, lay a rectangle of salmon in the center of a 12-by-6-inch square of plastic wrap. Evenly spread about 1 1/2 tablespoons of the crab mixture on the salmon. Begin rolling the salmon on its long side, lifting the plastic wrap to help form the salmon into a cigarette shape. Twist the ends of the plastic wrap tightly to make the cylinder compact, and use your hands to make it a uniform shape. Place rolls on a small baking sheet, and chill in the freezer for 1 hour. The rolls may be made and frozen up to 2 days in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the pesto and olive oil, and season to taste with salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "An hour before serving, remove salmon rolls from freezer. Remove plastic wrap, and cut the ends from each roll to make neat cylinders. Let warm to room temperature. To serve, lay a salmon roll in the center of each plate. Spoon a little caviar (if using) on top of each, and garnish with a chervil sprig or small basil leaf. Spoon a little pesto oil on the plate, and serve."}]}