{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Cake Roll", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Makes 8 to 10 servings", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "dessert, lemon, orange marmalade, low-fat, spring", "aggregateRating": null, "recipeIngredient": ["1 lemon roulade, rolled into a 10-inch-wide log, at room temperature or slightly cooled (<a href=\"http://cooking.nytimes.com/recipes/9807-lemon-roulade\">see recipe</a>)", "2/3 cup sweet orange marmalade (do not use bitter orange marmalade) or apricot preserve", "1 teaspoon lemon juice", "Powdered sugar", "Lemon filling, thoroughly cooled (<a href=\"http://cooking.nytimes.com/recipes/9806-lemon-filling\">see recipe</a>)", "1/4 cup heavy (whipping) cream", "Powdered sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To ready the cake roll: if lemon roulade has been refrigerated or frozen, set out to warm almost to room temperature. Combine marmalade and 1/2 tablespoon water in a small saucepan over medium-high heat. Simmer, stirring, for 1 1/2 minutes and remove from heat. Stir in lemon juice. Strain marmalade mixture through a medium-fine sieve and set aside until cooled and thickened but still spreadable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully unroll roulade on a large sheet of wax paper dusted with powdered sugar. Spread marmalade mixture evenly over cake surface using a spatula or large knife. Lightly cover with wax paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare lemon cream: In a mixing bowl with mixer set on high speed, beat cooled lemon filling until completely smooth. In another mixing bowl with mixer set on high speed, beat heavy cream until firm peaks form. Beat lemon filling into whipped cream until smoothly incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread roulade surface evenly with lemon cream, stopping about 1 inch from edges (to prevent filling from squeezing out during rolling). Roll up cake neatly, but not so tightly that filling squeezes out. Wrap tightly in wax paper, twisting ends of paper to keep cake from unrolling. Transfer to a tray or baking sheet and refrigerate for at least 4 hours and up to 48 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Trim ends of roll using a serrated knife. Dust length of cake roll with sifting of powdered sugar. Cut cake crosswise into slices using a sharp serrated knife."}]}