{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Roulade", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT50M", "recipeYield": "1 10-to-15-inch cake", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "dessert, egg whites, lemon zest, orange juice, low-fat, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 998, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "202 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "22 grams", "saturatedFatContent": "3 grams", "sodiumContent": "932 milligrams", "sugarContent": "115 grams", "transFatContent": null}, "recipeIngredient": ["Nonstick coating", "2 large egg yolks", "1/2 cup granulated sugar", "1/8 teaspoon salt", "2 1/4 teaspoons finely grated lemon zest", "1 1/4 teaspoons vanilla extract", "1/8 teaspoon almond extract", "1/4 cup orange juice", "1/2 cup cake flour (unsifted)", "1/4 cup cornstarch", "1 1/4 teaspoons baking powder", "3 large egg whites, completely free of yolk", "1 tablespoon powdered sugar (approximately)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Grease a 10- by 15-inch jellyroll pan. Line pan with wax paper or baking parchment, allowing paper to overhang pan ends slightly. Grease paper or spray with nonstick coating."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large mixing bowl, combine yolks with 1/4 cup of the sugar, salt and 1 tablespoon hot tap water. Beat on medium speed until foamy. Raise speed to high and beat 3 to 5 minutes or until mixture increases in volume and flows in thick ribbons from beaters. Beat in lemon zest, vanilla, almond extract and orange juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together flour, cornstarch and baking powder. With a rubber spatula, lightly fold into beaten eggs until partly mixed. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In grease-free mixing bowl, beat egg whites on medium speed until frothy. Raise speed to high. As soft peaks just begin to form, gradually add remaining sugar, about a tablespoon at a time, and beat until whites stand in firm but not dry peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a wire whisk, mix about 1/3 of whites into yolk mixture. Fold yolk mixture into remaining whites until ingredients are evenly incorporated but not overmixed. Spread batter evenly in prepared pan and quickly transfer to center oven rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 7 to 10 minutes, or until cake is slightly darker at edges and springs back when lightly pressed in center. Transfer pan to a wire rack. Drape a slightly damp tea towel over cake and let stand for five minutes. Remove towel. Loosen edges of cake with knife. Dust a long sheet of wax paper with powdered sugar. Lift cake and attached paper and lay, cake side down, on wax paper. Peel off attached paper and trim dry edges of cake. Cover cake with a fresh sheet of wax paper and turn again so that browned side is facing up. From short side, tightly roll up sponge cake and paper to form a log of even thickness. Secure log by folding ends of paper. Refrigerate for up to 2 days, or wrap airtight and freeze for up to 2 weeks."}], "link": "https://cooking.nytimes.com/recipes/9807-lemon-roulade"}