{"@context": "http://schema.org", "@type": "Recipe", "name": "Cialsons", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT45M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "eggs, flour, spinach, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 363, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "11 grams", "sodiumContent": "353 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 cups flour", "Salt", "3 eggs", "1/2 pound fresh spinach, tough stems removed, leaves washed thoroughly", "1/4 cup stale rye bread crumbs", "1/2 cup milk", "Pinch of cinnamon", "Pinch of ground cloves", "1 tablespoon chopped fresh thyme", "1 tablespoon chopped Italian parsley", "1 tablespoon juniper berries", "Freshly ground black pepper", "6 tablespoons butter, melted", "3/4 cup freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the flour in a mound on a board and sprinkle with salt. Make a well in the center. In a bowl, stir two eggs with one tablespoon of water. Pour that into the well and gradually work in the flour to make a stiff dough. If the dough doesn't hold together, sprinkle with an additional tablespoon of water. Knead until the dough is smooth and elastic, about five minutes. Cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a rolling boil. Add the spinach and cook just until wilted. Drain and squeeze dry, then finely chop the leaves. Place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the rye crumbs in the milk, then squeeze them dry. Add the crumbs to the spinach along with the remaining egg, the cinnamon, cloves, thyme and parsley. Grind the juniper berries in a mortar and pestle or a blender until smooth. Add to the spinach mixture, blend well and season with plenty of salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the dough on a lightly floured board, into a sheet about one-sixteenth-inch thick. (It helps to flip the dough over from time to time.) Cut into circles about two inches in diameter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place about one-half teaspoon of the spinach mixture just off center on each pasta round. Fold each in half to enclose the filling and press dough together firmly to seal completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring another large pot of salted water to a rolling boil and add the pasta. Cook until al dente, about three to six minutes, depending on the thickness of the dough. Drain the pasta and transfer to a serving platter. Drizzle with melted butter and sprinkle with Parmesan. Serve hot."}]}