{"@context": "http://schema.org", "@type": "Recipe", "name": "Fettuccine With Red Clam Sauce", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "fettuccine, hard-shell clams, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 6}, "recipeIngredient": ["About 36 to 40 little neck clams", "Coarse salt", "4 tablespoons olive oil", "1 onion, finely chopped", "2 cloves garlic, minced", "2 cups canned Italian plum tomatoes", "1 teaspoon Italian hot crushed peppers (or more to taste)", "1/2 cup chopped parsley", "1 pound fettucine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the clams in a bowl with cold water sprinkled with salt. Leave for an hour, or overnight. Rinse and scrub."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil in a heavy skillet. Add the clams and cook for three to four minutes, stirring so that all are exposed to heat. Discard any clams that do not open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a collander over a large bowl. Pour the clams with their juice into the collander. Drain, reserving the clam juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the skillet with a paper towel. Heat 2 tablespoons olive oil and add the onion and garlic. Cook until soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and the peppers to the onions and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring six quarts salted water to boil for the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the clams from their shells, reserving about eight to 10 clams for decoration. Drain the juice through one thickness of paper towel into a clean bowl. Wash out the other bowl, and drain the juice once again, through a paper towel into the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a cup of clam juice to the tomatoes. Bring to boil, stir and let simmer for a few minutes. Taste for seasonings. Salt will probably not be needed, but add a little freshly ground pepper. If the sauce is too thick, add more clam juice. Do not add too much or this sauce will be watery. (Reserve leftover clam juice for another dish.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the clams, the unopened clams and the parsley leaves to the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the pasta until al dente and drain. Place in a heated bowl. Stir the remaining tablespoon olive oil into the pasta to prevent it from sticking. Top with the sauce, decorate with the clams in the shells and serve."}]}