{"@context": "http://schema.org", "@type": "Recipe", "name": "Fethi Solak's Eggplant With Meat and Rice", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "turkish", "recipeCategory": "dinner, project", "keywords": "eggplant, ground lamb, long-grain rice, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 467, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "18 grams", "proteinContent": "15 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1327 milligrams", "sugarContent": "17 grams", "transFatContent": null}, "recipeIngredient": ["About 1/2 cup extra-virgin olive oil", "1 1/4 cups finely chopped yellow onion", "1 cup finely chopped sweet green pepper, preferably cubanelle or Italian long pepper", "1/2 pound lean ground lamb", "1 1/4 cups chopped red, ripe tomatoes (or canned Italian plum tomatoes, well drained)", "1 tablespoon dried mint", "1 tablespoon ground cumin", "1/2 tablespoon hot red-pepper flakes", "Salt and freshly ground black pepper, as desired", "1 cup cooked long-grain rice (about 1/2 cup uncooked rice)", "1/4 cup finely minced Italian parsley", "8 long, slender Italian eggplants, or 4 small regular eggplants", "3 plum tomatoes, thinly sliced", "1/3 cup grated Parmigiano-Reggiano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the stuffing, cook the chopped onion in 2 tablespoons of olive oil over medium-low heat. After about five minutes, when the onion starts to soften, add the chopped green peppers. Cook together for 10 to 15 minutes, or until the vegetables are soft but not browned. Remove the vegetables from the pan with the oil in which they cooked, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add ground lamb to the pan, and saute quickly, raising the heat and stirring constantly until the lamb is thoroughly browned. (If the lamb is especially lean, you may need to add a teaspoon or more of olive oil to the pan.) Scrape the lamb with its fat into a sieve to drain. Discard the fat and return the lamb to the pan, together with the chopped vegetables. Add the tomatoes, mint, cumin and red-pepper flakes to the pan and mix well. Cook, stirring occasionally, over medium-low heat until the tomatoes have released all their liquid and the sauce has thickened. Do not let the sauce dry out. Taste and adjust the seasonings, adding salt and freshly ground black pepper if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and stir in the rice and parsley, mixing well. Set aside until ready to use. (The stuffing may be prepared a day or more ahead of time and refrigerated until ready to use, but bring it back to room temperature before proceeding with the recipe.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Rinse the eggplants. If they are the smaller Italian variety, leave them whole, but prick them with a fork in half a dozen places. If using larger eggplants, cut in half lengthwise and score the cut surfaces in a crosscross pattern no more than half an inch deep. Be careful not to cut through the skin of the eggplants. Paint the cut surfaces with a little olive oil. Place the eggplants on a lightly oiled baking sheet (cut side up if you are using large ones), and bake them for about 30 to 40 minutes, or until the flesh is soft. Set aside until they are cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a table knife and spoon, gently cut a slit down one side of the whole eggplants so that they can be opened up and the flesh can be pushed to either side. (Do not cut them into halves.) If using halved eggplants, break up the cooked flesh with the tines of a table fork to make room for the stuffing. Be careful not to cut through the eggplant skin. Pile several heaping tablespoonfuls of stuffing in the center of each eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the eggplants have been stuffed, set them in a lightly oiled rectangular roasting pan. Raise the oven heat to 450 degrees. Place one or two thin slices of tomato on top of each eggplant and drizzle a teaspoon of olive oil over each. Sprinkle a little grated cheese on top of the tomato slices. Pour boiling water into the roasting pan to a depth of about one-half inch, place in the oven, and cook for 15 to 20 minutes, or until the tops are nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the eggplants aside until you are ready to serve them. For serving they should be warm or at room temperature, but not cold."}], "link": "https://cooking.nytimes.com/recipes/9838-fethi-solaks-eggplant-with-meat-and-rice"}