{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta For Cannelloni", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 sheets", "recipeCuisine": "italian", "recipeCategory": "project", "keywords": "all-purpose flour, eggs, salt, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 143, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "112 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups all purpose flour, more as needed", "Salt", "3 eggs", "Olive oil as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour and 1 tablespoon salt on a counter, making a well in the middle. Break eggs into well, and beat them with a fork, gradually incorporating a little flour. When mixture becomes too hard to stir with fork, use your hands. When all the flour has been mixed in, knead dough, pushing it against counter, and folding it repeatedly until it is quite stiff and not at all sticky. Sprinkle with a little reserved flour. Clean your hands. Cover dough with plastic wrap or a cloth, and let it rest for about a half-hour. You can refrigerate dough, wrapped in plastic, for up to 24 hours. Meanwhile, make fillings for cannelloni (see recipe)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to proceed, sprinkle counter with flour. Cut off about a third of dough. Wrap the rest in plastic or cloth while you work. Roll dough lightly in flour, using your hands to flatten it into a rectangle about the width of your pasta machine. Set machine to its thickest setting, and crank dough through. If it sticks, dust with more flour. Repeat. Set machine to its next thinnest setting, and push dough through, adding flour again if pasta sticks. Repeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to work down the settings on machine. If dough tears badly, bunch it together, and start again. Add flour as you need, but only in small amounts. Pass dough through machine's thinnest setting. (If pasta tears, stop at the second thinnest setting.) Flour pasta lightly, then cover, and set aside. Repeat with remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot of water to a boil, and salt it. Cut dough into 8 rectangles about 6 by 8 inches each. (You may have leftover dough.) Boil these sheets a couple at a time for about 2 minutes, or until tender. Reserve 1 cup of cooking liquid for cannelloni recipe. Remove sheets with a slotted spoon. Drop them into a bowl of ice water. Remove from ice water and drain. Spread on a baking sheet. Drizzle with oil to prevent sticking."}]}