{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Peppers", "description": "In this classic home cooking recipe from Jacques Pépin, green bell peppers are stuffed with a hearty combination of mushrooms, ground sausage, onion, zucchini and fresh bread crumbs, then baked for a little over an hour until the peppers are tender and the filling cooked through. They're not only easy to make, they are also endlessly adaptable. Don't have bread crumbs? Use orzo, rice, quinoa or practically any other cooked grain. Not a fan of zucchini? Add some diced tomato, eggplant or summer squash. Vegetarian? Leave out the sausage and toss in some cooked beans or grated cheese. Make it your own. Just remember to season and taste the filling as you go. If it tastes good outside of the pepper, it'll taste good inside, too.", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": "https://static01.nyt.com/images/2018/02/20/dining/20COOKING-STUFFED-PEPPERS/20COOKING-STUFFED-PEPPERS-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, sausages, vegetables", "keywords": "bell pepper, onion, pork sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 594, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "7 grams", "proteinContent": "25 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1096 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 large green bell peppers", "1 pound Italian sausage, either mild or spicy", "1/2 pound mushrooms, washed and chopped (about 3 1/2 cups)", "8 ounces fresh bread crumbs (about 4 cups)", "2 onions, peeled and coarsely chopped (about 2 cups)", "1 zucchini (6 ounces), cut into 1/4-inch cubes (about 1/2 cup)", "1/2 teaspoon kosher salt, plus more to taste", "1/2 teaspoon black pepper, plus more to taste", "1 1/2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Cut around the stem ends of the green peppers and remove a \"hat\" from each pepper with the stem in the center. Trim these hats at the base so they are about 1/2-inch thick and set them aside. Remove and discard seeds and trim the ribs of the peppers. Stand the peppers upright side by side in a gratin dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl combine the sausage, mushrooms, bread crumbs, onions, zucchini, salt and pepper and mix well. Stuff the peppers with this mixture and place the hats back on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the olive oil on top of the peppers and pour 1 cup of water around them. Place the peppers in the oven for 1 hour 15 minutes. Serve with the surrounding juice, salt and pepper."}]}