{"@context": "http://schema.org", "@type": "Recipe", "name": "Goat Cheese Gnocchi With Caramelized Onion And Thyme", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "goat cheese, onion, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 756, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "62 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "40 grams", "sodiumContent": "768 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound Highfield Dairy goat cheese or other creamy, tangy goat cheese, at room temperature", "2 large eggs", "Fine sea salt", "1/2 cup flour, plus additional as needed", "3 tablespoons butter", "2 onions, peeled and thinly sliced", "2/3 cup vegetable stock", "1/2 teaspoon fresh thyme leaves, or more as needed", "4 ounces Plugra or Echire butter or other high-butterfat butter", "2 cups clean, dry, baby spinach leaves, loosely packed", "2 ounces finely grated Parmigiano- Reggiano cheese", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine goat cheese, eggs and a generous pinch of salt. Beat with a stiff whisk until mixture is smooth. Begin by adding 1/2 cup of flour, and gently kneading in. Continue adding flour a tablespoon at a time, up to a full cup, until there is the first sign of a malleable nonsticky mass of dough. Do not add too much flour or overknead; dough should be soft, airy and very light. Cover dough, and refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While dough is being chilled, prepare caramelized onions. In a large skillet over medium-low heat, melt 3 tablespoons of butter. Add onions and stir until coated. Allow to cook gently, stirring occasionally, until onions are very soft and beginning to brown, about 20 minutes. Remove from heat, and set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of lightly salted water to a boil. Set aside a large bowl of ice water. On a lightly floured surface, roll out the dough into a rectangle 1/2 inch thick. Using a long knife, cut into 1/2-inch-by-1-inch pieces. To shape gnocchi, dust each piece with flour and roll on the back of a fork to make a rounded oblong lightly scored by the tines of the fork. Place on a floured tray, and continue until all dough is used. Boil gnocchi immediately until they are fluffy and firm, 2 to 3 minutes. Using a slotted spoon, transfer to the ice water bath. As soon as gnocchi are cool, drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large pan over medium-low heat, and add vegetable stock, thyme and gnocchi. Saut&#233; gently until hot, and add Plugra. When butter has melted, add spinach and Parmigiano-Reggiano. Season with salt and pepper to taste, and toss gently. Transfer to a large serving platter, and top with a mound of the reserved caramelized onions. Serve immediately."}]}