{"@context": "http://schema.org", "@type": "Recipe", "name": "Carol Field's Fava Puree With Wild Greens", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "broccoli rabe, chicory, fava beans, high fiber, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 157, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "360 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["8 ounces dried fava beans", "2 ribs celery, chopped", "1 medium onion, chopped", "5 teaspoons sea salt", "5 tablespoons extra-virgin olive oil", "12 ounces broccoli rabe, chicory, other wild greens, or cultivated chicory, washed and well trimmed", "1/3 to 1/2 cup water", "2 cloves garlic, finely minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the beans overnight in cold water to cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, drain and slip them out of their skins. If the skins cling too tightly, cook the beans in boiling water for 5 to 10 minutes; then drain and peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the peeled beans in a saucepan with the celery and onion, and add just enough water to cover. Bring to simmer over medium heat. Cook for 25 to 30 minutes, or until the beans are very soft, adding two teaspoons of salt after 15 minutes' cooking time. Check to be sure there is enough liquid; if the water has evaporated, add more. Drain the beans and puree them in a food processor with two tablespoons of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are using broccoli rabe, clean it by peeling off any thick skin covering the larger stems and cut it into two-inch pieces. Rinse the greens well. Bring the water to a boil, add the greens and the remaining salt, cover and cook until the greens are soft but not mushy, about 5 to 10 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the three remaining tablespoons of olive oil in a saute pan and slowly cook the garlic until it is just soft and barely golden; do not let it brown. Add the greens and swirl them well in the flavored oil. Serve on a platter, spooning the garlic-infused greens over or into the favas."}], "link": "https://cooking.nytimes.com/recipes/9881-carol-fields-fava-puree-with-wild-greens"}