{"@context": "http://schema.org", "@type": "Recipe", "name": "Blackberry-Lemon Tart With Champagne- Mint Granite", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "brunch, ice creams and sorbets", "keywords": "all-purpose flour, blackberry, lemon, dessert, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 695, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "97 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "12 grams", "proteinContent": "10 grams", "saturatedFatContent": "12 grams", "sodiumContent": "174 milligrams", "sugarContent": "74 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup water", "1 cup sugar", "2 cups lightly packed mint leaves and stems, coarsely chopped", "3 tablespoons fresh lemon juice", "1 bottle chilled Champagne or sparkling wine", "1/4 cup chopped fresh mint leaves", "1/2 cup blanched slivered almonds, lightly toasted", "2 1/2 tablespoons sugar", "3/4 cup all-purpose flour, plus additional for rolling", "1/2 teaspoon kosher salt", "6 tablespoons unsalted butter, cut into small pieces", "1 egg yolk", "1 tablespoon water", "1/4 teaspoon almond extract", "4 eggs", "1 1/4 cups plus 2 tablespoons sugar", "2 teaspoons grated lemon zest", "3/4 cup fresh lemon juice", "2 tablespoons unsalted butter", "1/2 cup heavy cream", "4 half-pints fresh blackberries", "Confectioners' sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the granite, combine the water, the sugar and the 2 cups of mint in a saucepan and bring to a boil. Lower heat and simmer 5 minutes. Remove from heat and let stand 15 minutes. Strain and let cool completely. Add the lemon juice, Champagne and remaining mint leaves and pour into a shallow, nonreactive dish. Freeze for several hours or overnight, until firm throughout, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the tart, pulse the almonds and sugar in a food processor until coarsely ground. Add the flour and salt, and pulse to combine. Add the butter, and pulse until the mixture resembles coarse meal. Whisk together the egg yolk, water and almond extract. Add to the flour mixture and process just until the mixture starts to come together. Press into a bowl, flatten into a disk, wrap in plastic and refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the eggs and 1 cup plus 2 tablespoons of sugar in a medium nonreactive saucepan and whisk until thickened and light in color. Whisk in the lemon zest and juice. Place over low heat and cook, whisking constantly, until thick, about 10 minutes; do not let the mixture come to a boil. Remove from heat and whisk in the butter. Let cool. Refrigerate until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Roll out the dough and fit into a 10-inch quiche dish. Line with foil and fill with pie weights or dried beans. Bake for 20 minutes. Remove the foil and weights and bake until the crust is lightly browned, about 5 minutes longer. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the cream until it holds firm peaks and fold it into the lemon mixture. Spoon into the tart shell and refrigerate for several hours. About 1 hour before serving, gently toss the blackberries with the 1/4 cup of sugar. Just before serving, drain the blackberries and arrange them over the filling. Sift a little confectioners' sugar over the top. Place a slice of the tart on each of 8 plates. Scrape the granite into balls with a spoon, place a ball on each plate and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9885-blackberry-lemon-tart-with-champagne-mint-granite"}