{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Chicken Stock", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H30M", "recipeYield": "About 2 quarts", "recipeCuisine": "chinese", "recipeCategory": "project, soups and stews", "keywords": "appetizer, chicken bones, ginger, scallion, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 68, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "86 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["3 to 3 1/2 pounds chicken bones, with some meat clinging to them, including necks and backs, chopped into plum-size pieces by a butcher or with a heavy cleaver", "3 to 4 quarter-size slices fresh ginger", "1 large or 2 thin scallions, cut into 3-inch lengths", "3 to 4 Sichuan peppercorns (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the bones with cool water and put in a heavy 6-quart non-aluminum stockpot. Add cold water to come within 1 inch of the top of the pot, then set the pot over high heat. Bring to a near boil, then reduce the heat to maintain a steady simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 5 to 10 minutes, when a thick foam has risen to the surface, use a large shallow spoon to skim off and discard the scum. Continue skimming for 4 to 5 minutes, when it no longer clusters thickly on the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly smash the ginger and scallion with the blunt side of a knife to release their juices. Add them to the stock with the peppercorns, if using, and reduce the heat to maintain a weak simmer, with bubbles rising lazily to the top of the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer undisturbed for 3 to 4 hours, or until the liquid is reduced by about half and is 1/2 to 1 inch below the bones. Do not stir the stock while it is simmering, and do not let it boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and let the pot sit for 30 minutes or more, so the impurities will coagulate on the surface or sink to the bottom. Line a strainer or colander with a triple layer of damp cheesecloth and set it securely over a large pot or bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push the thin, congealed surface grease gently to one side, then very gently ladle the stock into the strainer. Tilt the pot slowly as you ladle, and disturb the bones as little as possible. When you near the bottom of the pot, hold the bones in place with an overturned plate or a small pot lid, then pour the last of the clear liquid through the strainer. Discard the sediment-filled liquid and the ginger, scallion, peppercorns and bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate or briefly freeze the stock until the fat rises and hardens on the surface. Scrape off the fat. Divide the stock into convenient portions, and refrigerate it 4 to 5 days or store it indefinitely in the freezer."}], "link": "https://cooking.nytimes.com/recipes/9923-chinese-chicken-stock"}