{"@context": "http://schema.org", "@type": "Recipe", "name": "Original Chicken Cordon Bleu", "description": "This classic French chicken dish, adapted from Jane and Michael Stern’s book “American Gourmet,” more than lives up to its name (\"cordon bleu\" means “blue ribbon”). It's also far easier to make than you may think. A chicken breast is pounded thin (we've been known to cheat by using pretrimmed cutlets), then wrapped around a slice of smoked ham and a bit of Swiss cheese, and secured with toothpicks. The roulade is coated in egg and bread crumbs, then pan-fried until golden brown, and a simple white wine cream sauce finishes it off.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2016/11/01/dining/01COOKING-CHICKEN-CORDON-BLEU1/01CHICKEN-CORDON-BLEU1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "chicken breast, ham, Swiss cheese, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 261}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 537, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "1 gram", "proteinContent": "52 grams", "saturatedFatContent": "12 grams", "sodiumContent": "801 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large boneless and skinless chicken breast halves (about 1 1/2 pounds)", "4 thin slices smoked ham", "2 ounces Swiss cheese, cut into 4 equal \"fingers\"", "1/4 cup flour", "1/2 teaspoon salt", "1/4 teaspoon pepper", "1 large egg, beaten", "3/4 cup fresh bread crumbs", "1/4 cup unsalted butter", "3/4 cup plus 2 tablespoons chicken stock", "3/4 cup white wine, heavy cream or additional chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the chicken breasts between pieces of wax paper and use a mallet to pound them to 1/4 inch to 1/8 inch thick. Take care not to pound holes in the chicken. Layer each breast with the ham, then place a finger of cheese in the center. Roll up to completely enclose the ham and cheese and secure with toothpicks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the flour, salt and pepper. Lightly dredge the chicken in the seasoned flour, then dip in the egg and coat with bread crumbs. Place on a baking sheet and chill at least 15 minutes and up to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, heat the butter. Add the chicken and cook, turning carefully with tongs, until browned, about 8 to 10 minutes. Add 1/2 cup of the stock to the skillet, reduce the heat to medium-low, cover and simmer until the chicken is cooked through, 10 to 15 minutes. Move the chicken to a warm platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 tablespoons of stock to the skillet, raise the heat to high, and cook, stirring up browned bits clinging to the bottom, for 1 minute. Add the wine (or heavy cream or additional stock), lower the heat and simmer, uncovered, until the consistency of gravy, about 45 seconds. Pour over the chicken breasts and serve."}], "link": "https://cooking.nytimes.com/recipes/9935-original-chicken-cordon-bleu"}