{"@context": "http://schema.org", "@type": "Recipe", "name": "Toasted-Almond Poundcake With Strawberry-Rhubarb Compote", "description": "Poundcake is like brownies: a baker's challenge that sounds like child's play. The name itself is traditionally half the recipe – a pound each of butter, eggs, sugar and flour – but the technique is critical to producing a cake that is so tender it can stand alone but is still sturdy enough to hold up under a fruit compote, ice cream or sauce. This recipe, adapted from Joseph Murphy, a pastry chef at Gotham Bar and Grill, calls for melting the butter first, beating the eggs and sugar together until they are very thick, then whisking in the flours and the butter. Although the proportions are the same as for any other poundcake, the result is almost spongy, with a fine crumb.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/05/24/dining/24COOKING-TOASTED-POUNDCAKE-STRAW-RHUBARB2/24COOKING-TOASTED-POUNDCAKE-STRAW-RHUBARB2-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "almond flour, rhubarb, strawberry, dessert, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 676, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "6 grams", "proteinContent": "12 grams", "saturatedFatContent": "17 grams", "sodiumContent": "198 milligrams", "sugarContent": "51 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup (2 sticks) plus 1 tablespoon unsalted butter", "5 large eggs", "1 3/4 cups sugar, plus more to taste", "1 1/3 cups almond flour", "1 1/4 cups cake flour", "1/2 teaspoon salt", "1 teaspoon grated tangerine zest", "2 tablespoons sliced almonds", "2 pounds strawberries, hulled", "4 cups trimmed, sliced rhubarb"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Grease and flour a loaf pan. In a small saucepan, melt butter. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer fitted with whisk attachment, beat eggs and 1 cup sugar until thick and pale, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, sift together almond flour, cake flour and zest. Fold 1/3 of the flour mixture into eggs until thoroughly combined. Fold in rest of flour in 2 batches. Fold in all but 2 tablespoons of the melted butter. Scrape batter into pan, and sprinkle almonds on top. Brush remaining butter over almonds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cake until a tester inserted into the middle comes out clean, 40 to 45 minutes. If the top of the cake seems to be getting overly browned before the center is set, cover with foil and continue baking. Let cool on a rack before inverting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the compote. In a medium saucepan, combine 12 ounces of the strawberries, the rhubarb, 3/4 cup sugar and 1/4 cup water. Bring mixture to a simmer and cook, stirring occasionally, until fruit breaks down into a puree. Let mixture cool, then taste and add more sugar if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, place remaining strawberries in a large skillet, and sprinkle with sugar to taste. Cook strawberries over high heat until they release their juices and sugar dissolves. Serve slices of the poundcake surrounded by strawberry-rhubarb compote and topped with strawberries."}]}