{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Peach Mousse", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT6H30M", "recipeYield": "Eight to 12 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, gluten-free, raw, heavy cream, peach, unflavored gelatin", "aggregateRating": null, "recipeIngredient": ["2 envelopes plain gelatin", "1/4 cup brandy mixed with one-quarter cup water, or one-half cup water", "3 eggs, separated", "1 cup plus two tablespoons sugar", "1 1/4 pound ripe unblemished peaches, peeled, cut up and tossed with lemon juice to prevent them from discoloring", "1 1/2 cups heavy cream", "Fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soften gelatin in water mixed with brandy or in plain water in a small heatproof container such as a metal measuring cup. Dissolve gelatin by setting the container in a pan of simmering water. When the gelatin has dissolved, remove it from the heat but leave it sitting in the warm water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg yolks. Gradually beat in one cup of the sugar and continue beating until the mixture is thick and light."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Force peaches through a sieve or food mill or puree by machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine gelatin with a small amount of the pureed peaches, then mix with remaining peaches. Stir peaches into egg and sugar mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg whites until stiff. Whip cream with two tablespoons sugar. Fold egg whites, then whipped cream, into peach mixture lightly but thoroughly. Pour mixture into a six-cup souffle dish or serving bowl and chill at least six hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip remaining cream and pipe it on top of the mousse as a decoration. Garnish with mint leaves before serving."}], "link": "https://cooking.nytimes.com/recipes/9955-fresh-peach-mousse"}