{"@context": "http://schema.org", "@type": "Recipe", "name": "Mussel Soup in the Mediterranean Style", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "anchovy, mussels, white wine, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 340, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "27 grams", "saturatedFatContent": "2 grams", "sodiumContent": "847 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 quarts fresh mussels", "2 cups white wine", "1 large leek", "2 tablespoons, plus approximately 1/4 cup good-quality olive oil", "1 salted anchovy, or 4 canned anchovy filets", "3 cloves garlic", "1 bunch parsley, minced", "1/2 pound ripe red plum tomatoes, approximately", "1/4 teaspoon saffron threads, or 1 small hot red pepper", "Salt and freshly ground black pepper to taste", "6 thin slices crusty, country-style bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse mussels under running water, discarding any that are open. Place in a soup kettle with white wine. Bring to a fast boil over medium-high heat and steam until mussels open. Remove from heat and discard any mussels that refuse to open. Remove mussels from broth, being careful not to pick up sandy sediment. Strain the broth carefully, through a colander lined with cheesecloth, into a measuring cup. Add water to make 4 cups liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse out soup kettle. Clean and slice the leek thinly and saute it in 2 tablespoons of oil over gentle heat until leek has softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using salted anchovy, split it in half and rinse under running water to rid it of salt. Pull away the bones. Pat anchovy dry. Mash two garlic cloves and mince with anchovy and half the parsley. Add to leek and saute until garlic starts to turn golden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly chop tomatoes. Add to soup kettle with mussel broth and either saffron threads or hot pepper. Let simmer, partly covered, 10 minutes. Taste for seasoning, and add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While liquid is simmering, remove the empty half shell from each mussel, leaving only the shell half that has the mussel in it. Discard empty shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add mussels in shells to the simmering broth, and let warm to serving temperature. While broth is warming, toast the bread slices on both sides. When bread is toasted, cut remaining clove of garlic and rub over bread. Drizzle a little of the remaining olive oil over each slice. Place a bread slice in bottom of each soup bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, place a ladleful of mussels in each bowl on top of the sliced bread. Pour broth over, discarding hot pepper if used, sprinkle with minced parsley and serve immediately."}], "link": "https://cooking.nytimes.com/recipes/9957-mussel-soup-in-the-mediterranean-style"}