{"@context": "http://schema.org", "@type": "Recipe", "name": "Ba-Nam's Cha Gio", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "serve 4, 6 or 8 people", "recipeCuisine": "vietnamese", "recipeCategory": "dinner, project", "keywords": "banh trang rice papers, crab meat, ground pork, main course", "aggregateRating": null, "recipeIngredient": ["1/2 cup dried shrimp, if desired", "10 tree ear or black fungus mushrooms", "1 stick (approximately 2 ounces) bean thread or cellophane noodles", "1/2 pound cooked crabmeat", "1 pound lean pork, ground", "1 cup coarsely grated carrot, if desired", "3/4 cup chopped onion", "2 teaspoons finely minced garlic", "1/2 teaspoon ground black pepper", "1/2 teaspoon cornstarch if necessary", "1 package banh trang rice papers", "2 to 3 cups peanut or corn oil", "1 head Boston lettuce, washed and separated into leaves", "1 cucumber, unpeeled, sliced very thin", "1 medium carrot, coarsely grated", "1 bunch coriander", "1 bunch mint", "1 cup nuoc cham"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put dried shrimp in a small bowl and cover to a depth of 1 inch with warm water. Set aside to soak for 30 minutes. Do the same with the mushrooms and noodles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over and shred crabmeat, removing shell and cartilage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix crabmeat and pork together in a large bowl. Add carrot, onion, garlic and black pepper, mixing well with your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain shrimp, chop coarsely and add to pork mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain mushrooms well, slice thinly and add to pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain noodles, squeezing to remove all water. Chop into pieces no more than 1 inch in length and add to pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, mix everything together very well. Ba-Nam adds a little cornstarch if the mixture does not seem to adhere. When well mixed, set aside for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take a deep pie plate into which a rice paper will fit comfortably and fill it with hot water. Dip a rice paper in water to soften it and spread it gently on a clean dry surface such as a cutting board. Put about 3 tablespoons of pork mixture, roughly shaped like a fat cigar, on the edge of the rice paper nearest you. Flip that edge over pork, then fold sides of rice paper toward center over the stuffing. Roll up securely. The damp rice paper will adhere to itself. You should have a firm and compact roll. Set aside on a plate and proceed with the rest of the rice papers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The cha gio may be prepared ahead of time up to this point but if you are going to keep them longer than 15 minutes or so, cover the plate with a dampened towel and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange lettuce, cucumber and carrot attractively on a plate. Wash coriander and mint and remove thick stems. Arrange on the plate. Have a small saucer or bowl of nuoc cham at each place setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 cups of oil to the point that a bread cube browns quickly and rises to the surface. (A wok is preferable but a sauce pan with high sides will do. The oil should be at a depth of about 2 1/2 inches.) Add cha gio to hot oil, a few at a time, and fry until golden brown. Remove and drain on absorbent paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve cha gio on a bed of lettuce. (If they are large, cut into 2 or 3 pieces.) Pass vegetable plate separately. Each diner takes a lettuce leaf and rolls it around a cha gio, adding mint, coriander and so on as desired. Dip into nuoc cham before eating and in between bites."}]}