{"@context": "http://schema.org", "@type": "Recipe", "name": "Chef Huy's Banh Tap (Spiced pork on shrimp crackers)", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT30M", "recipeYield": "serve 4, 6 or 8 people", "recipeCuisine": "vietnamese", "recipeCategory": "project", "keywords": "appetizer, lean pork, lemongrass, prawn crackers", "aggregateRating": null, "recipeIngredient": ["1/2 pound lean pork, slightly frozen (for easier slicing)", "2 stalks lemon grass", "1 tablespoon sugar", "1 tablespoon nuoc mam", "1 tablespoon finely minced garlic", "5 tablespoons peanut oil", "1 dozen prawn crackers (kroepoek)", "2 cups peanut or corn oil for deep frying", "3 scallions, green and white parts, finely sliced (about 1/4 cup)", "3 tablespoons unsalted peanuts, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the pork as thinly as you can, cut each slice in half and place in a deep bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the rough outside husks off the lemon grass and chop the tender inside very finely. Add to pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sugar, nuoc mam, garlic and 2 tablespoons of oil to pork, mix well, cover and refrigerate for several hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat 2 cups of oil to the point that a bread cube browns quickly and rises to surface. Lower heat and drop in a prawn cracker. If the oil is hot enough (it should be just below the smoking point), the cracker will puff and swell and rise almost immediately to the surface. Remove and drain on absorbent paper. Proceed with rest of prawn crackers. The crackers must be removed as soon as they have fully expanded or they will curl up too tightly to spread the pork on them. This sounds complicated; in fact, it's a lot of fun."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok or frying pan, heat 2 tablespoons of oil and saute scallions over medium-low heat, stirring constantly until brown. Remove, drain on absorbent paper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon oil to pan. Raise heat and saute pork over high heat until brown. Remove, leaving behind as much oil as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange shrimp crackers on platter. Top each cracker with a few slices of spicy pork and garnish each cracker with browned scallions and chopped peanuts."}], "link": "https://cooking.nytimes.com/recipes/9980-chef-huys-banh-tap-spiced-pork-on-shrimp-crackers"}