{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana-Walnut Bread Pudding", "description": "This unapologetically rich special-occasion dessert is adapted from one served at the Blue Ribbon Bakery and Cafe, a working bakery in Greenwich Village known for its eclectic American cuisine. It counts four cups of heavy cream and 11 egg yolks among its list of ingredients, but we promise you won't regret the indulgence. In his 2003 article accompanying the recipe, Jonathan Reynolds said, “The banana-walnut bread pudding with <a href=\"https://cooking.nytimes.com/recipes/9995-banana-caramel-sauce\">banana caramel sauce</a> puts most bread puddings out of the game, and I've had roughly 10,000 bread puddings.” Did we mention that's it's a cinch to put together? It is, and it's perfect for a crowd. (Here are some ideas for <a href=\"https://cooking.nytimes.com/68861692/4464397-what-to-do-with-leftover-egg-whites\">what to make with all of those leftover egg whites.</a>)", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2017/01/30/dining/30COOKING-BREAD-PUDDING1-copy/30COOKING-BREAD-PUDDING1-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "brunch, custards and puddings", "keywords": "banana, firm white bread, walnut, white chocolate, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 79}, "recipeIngredient": ["4 cups heavy cream", "11 large egg yolks", "3/4 cup sugar", "A pinch of salt", "1 vanilla bean, split", "10 cups of 1-inch cubes white bread (preferably from 1 large baguette)", "2 cups 1/2-inch-thick banana slices", "3/4 cup chopped walnuts", "<a href=\"https://cooking.nytimes.com/recipes/9995-banana-caramel-sauce\">Banana caramel sauce</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the cream to a simmer. Meanwhile, whisk yolks, sugar and salt until the sugar dissolves. Scrape the vanilla-bean seeds into the yolks and toss the husk into the cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisking constantly, pour a small amount of hot cream into the yolk mixture, then whisk in the rest. Strain through a fine sieve and discard the vanilla-bean husk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bread, bananas and walnuts in a deep 9-inch-by-13-inch baking pan. Pour in enough cream mixture to cover the bread well (you may have a bit left over). Let sit for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Mix the bread pudding gently, then cover the pan with foil. Place in a larger pan, add enough hot water to come partway up the sides of the pan and bake until the pudding is set and a knife inserted comes out almost clean, about 1 1/2 hours. Serve with <a href=\"https://cooking.nytimes.com/recipes/9995-banana-caramel-sauce\">banana caramel sauce</a>."}], "link": "https://cooking.nytimes.com/recipes/9994-banana-walnut-bread-pudding"}